Repository: cairo-book/cairo-book
Catalog: po/*.po
Languages: es, id, ko, zh_cn

source: We know we want to define a method, so it will be within the `trait RectangleTrait` and `impl RectangleImpl of RectangleTrait` blocks. The method name will be `can_hold`, and it will take a snapshot of another `Rectangle` as a parameter. We can tell what the type of the parameter will be by looking at the code that calls the method: `rect1.can_hold(@rect2)` passes in `@rect2`, which is a snapshot to `rect2`, an instance of `Rectangle`. This makes sense because we only need to read `rect2` (rather than write, which would mean we’d need a mutable borrow), and we want `main` to retain ownership of `rect2` so we can use it again after calling the `can_hold` method. The return value of `can_hold` will be a Boolean, and the implementation will check whether the width and height of `self` are greater than the width and height of the other `Rectangle`, respectively. Let’s add the new `can_hold` method to the `trait` and `impl` blocks from Listing 4-13, shown in Listing 4-15.
es: Sabemos que queremos definir un método, así que estará dentro de los bloques `trait RectangleTrait` y `impl RectangleImpl of RectangleTrait`. El nombre del método será `can_hold`, y tomará una instantánea de otro `Rectangle` como parámetro. Podemos saber cuál será el tipo del parámetro mirando el código que llama al método: rect1.can_hold(@rect2)` pasa `@rect2`, que es una instantánea de `rect2`, una instancia de `Rectangle`. Esto tiene sentido porque sólo necesitamos leer `rect2` (en lugar de escribir, lo que significaría que necesitaríamos un préstamo mutable), y queremos que `main` conserve la propiedad de `rect2` para poder volver a usarla después de llamar al método `can_hold`. El valor de retorno de `can_hold` será un booleano y la implementación comprobará si la anchura y la altura de `self` son mayores que la anchura y la altura del otro `Rectangle`, respectivamente. Añadamos el nuevo método `can_hold` a los bloques `trait` e `impl` de Listado 4-13, mostrados en el Listado 4-15.

source: <span class="caption">Listing 4-15: Implementing the `can_hold` method on `Rectangle` that takes another `Rectangle` instance as a parameter</span>
es: <span class="caption">Listado 4-15: Implementación del método `can_hold` en `Rectangle` que toma otra instancia de `Rectangle` como parámetro</span>

source: When we run this code with the `main` function in Listing 4-14, we’ll get our desired output. Methods can take multiple parameters that we add to the signature after the `self` parameter, and those parameters work just like parameters in functions.
es: Cuando ejecutemos este código con la función `main` del Listado 4-14, obtendremos salida deseada. Los métodos pueden tomar múltiples parámetros que añadimos a la firma después del parámetro `self`, y esos parámetros funcionan igual que los parámetros en las funciones.

source: To call this function, we use the `::` syntax with the implementation name; `let square = RectangleImpl::square(10);` is an example. This function is namespaced by the implementation; the `::` syntax is used for both trait functions and namespaces created by modules. We’ll discuss modules in [Chapter 7][modules]<!-- ignore -->.
es: Para llamar a esta función, usamos la sintaxis `::` con el nombre de implementación; `let square = RectangleImpl::square(10);` es un ejemplo. Esta función está en el espacio de nombres de la implementación; la sintaxis `::` se utiliza tanto para las funciones de los traits como para los espacios de nombres creados por los módulos. Discutiremos los módulos en el [Capítulo 7][modules]<!-- ignore -->.

source: Each struct is allowed to have multiple `trait` and `impl` blocks. For example, Listing 5-15 is equivalent to the code shown in Listing 4-16, which has each method in its own `trait` and `impl` blocks.
es: Cada estructura puede tener múltiples bloques `trait` e `impl`. Por ejemplo, el Listado 5-15 es equivalente al código mostrado en el Listado 4-16, que tiene cada método en sus propios bloques `trait` e `impl`.

source: <span class="caption">Listing 4-16: Rewriting Listing 4-15 using multiple `impl` blocks</span>
es: <span class="caption">Listado 4-16: Reescribiendo el Listado 4-15 usando múltiples bloques `impl`</span>

source: There’s no reason to separate these methods into multiple `trait` and `impl` blocks here, but this is valid syntax. We’ll see a case in which multiple blocks are useful in [Chapter 7](ch07-00-generic-types-and-traits.md), where we discuss generic types and traits.
es: No hay razón para separar estos métodos en múltiples bloques `trait` e `impl` aquí, pero es una sintaxis válida. Veremos un caso en el que los bloques múltiples son útiles en el [Capítulo 7](ch07-00-generic-types-and-traits.md), donde hablamos de tipos genéricos y traits.

source: Unlike other languages like Rust, every variant has a type. In this example, we've defined an enum called `Direction` with four variants: `North`, `East`, `South`, and `West`. The naming convention is to use PascalCase for enum variants. Each variant represents a distinct value of the Direction type and is associated with a unit type `()`. One variant can be instantiated using this syntax:
es: A diferencia de otros lenguajes como Rust, cada variante tiene un tipo. En este ejemplo, hemos definido un enum llamado `Direction` con cuatro variantes: `North`, `East`, `South` y `West`. La convención de nomenclatura es utilizar PascalCase para las variantes del enum. Cada variante representa un valor distinto del tipo `Direction` y está asociada con un tipo unitario `()`. Una variante puede ser instanciada utilizando esta sintaxis:

source: It's easy to write code that acts differently depending on the variant of an enum instance, in this example to run specific code according to a Direction. You can learn more about it on [The Match Control Flow Construct page](ch05-02-the-match-control-flow-construct.md).
es: Es fácil escribir código que se comporte de manera diferente según la variante de una instancia de enum, en este ejemplo para ejecutar código específico según una dirección (`Direction`). Puedes obtener más información al respecto en la página [La construcción de flujo de control Match](ch05-02-the-match-control-flow-construct.md).

source: - `Quit` is the unit type - it has no data associated with it at all. - `Echo` is a single felt. - `Move` is a tuple of two u128 values.
es: - `Quit` no tiene datos asociados en absoluto. - `Echo` incluye un solo campo. - `Move` incluye dos valores u128.

source: <!-- TODO : update mention of chapter 18 (on patterns and matching chapter) in paragraph below -->
es: <!-- TODO : actualizar la mención del capítulo 18 (sobre patrones y concordancia) en el párrafo siguiente -->

source: Speaking of coins, let’s use them as an example using match! We can write a function that takes an unknown US coin and, in a similar way as the counting machine, determines which coin it is and returns its value in cents, as shown in Listing 5-3.
es: Hablando de monedas, ¡usemoslas como ejemplo con `match`! Podemos escribir una función que toma una moneda de EE. UU. desconocida y, de manera similar a la máquina de contar, determina qué moneda es y devuelve su valor en centavos, como se muestra en el Listado 5-3.

source: Listing 5-3: An enum and a match expression that has the variants of the enum as its patterns
es: Listado 5-3: Un enum y una expresión `match` que tiene las variantes del enum como sus patrones

source: We don’t typically use curly brackets if the match arm code is short, as it is in our example where each arm just returns a value. If you want to run multiple lines of code in a match arm, you must use curly brackets, with a comma following the arm. For example, the following code prints “Lucky penny!” every time the method is called with a `Coin::Penny(())`, but still returns the last value of the block, `1`:
es: Normalmente no usamos llaves si el código del brazo del `match` es corto, como en nuestro ejemplo donde cada brazo simplemente devuelve un valor. Si desea ejecutar varias líneas de código en un brazo del `match`, debe usar llaves, con una coma después del brazo. Por ejemplo, el siguiente código imprime "¡Moneda de la suerte!" cada vez que se llama al método con una `Coin::Penny(())`, pero aún devuelve el último valor del bloque, `1`:

source: As an example, let’s change one of our enum variants to hold data inside it. From 1999 through 2008, the United States minted quarters with different designs for each of the 50 states on one side. No other coins got state designs, so only quarters have this extra value. We can add this information to our `enum` by changing the `Quarter` variant to include a `UsState` value stored inside it, which we’ve done in Listing 5-4.
es: Como ejemplo, cambiemos una de nuestras variantes de enum para que contenga datos en su interior. Desde 1999 hasta 2008, la Casa de la Moneda de los Estados Unidos acuñó monedas de 25 centavos con diseños diferentes para cada uno de los 50 estados en un lado. Ninguna otra moneda tenía diseños estatales, por lo que solo los cuartos tienen este valor adicional. Podemos agregar esta información a nuestra `enum` cambiando la variante `Quarter` para incluir un valor `UsState` almacenado en su interior, lo cual hemos hecho en la Lista 5-4.

source: Listing 5-4: A `Coin` enum in which the `Quarter` variant also holds a `UsState` value
es: Listado 5-4: Un enum `Coin` en el que la variante `Quarter` también tiene un valor `UsState`

source: If we were to call `value_in_cents(Coin::Quarter(UsState::Alaska(())))`, `coin` would be `Coin::Quarter(UsState::Alaska())`. When we compare that value with each of the match arms, none of them match until we reach `Coin::Quarter(state)`. At that point, the binding for state will be the value `UsState::Alaska()`. We can then use that binding in the `PrintTrait`, thus getting the inner state value out of the `Coin` enum variant for `Quarter`.
es: Si llamáramos a `value_in_cents(Coin::Quarter(UsState::Alaska(())))`, `coin` sería `Coin::Quarter(UsState::Alaska())`. Cuando comparamos ese valor con cada uno de los brazos del `match`, ninguno coincide hasta que llegamos a `Coin::Quarter (state)`. En ese momento, la asignación para `state` será el valor `UsState::Alaska()`. Luego podemos usar esa asignación en el `PrintTrait`, obteniendo así el valor interno de estado fuera de la variante `Coin` para `Quarter`.

source: This function is very easy to write, thanks to match, and will look like Listing 5-5.
es: Esta función es muy fácil de escribir, gracias a `match`, y se verá como en el listado 5-5.

source: Listing 5-5: A function that uses a match expression on an `Option<u8>`
es: Listado 5-5: Una función que usa una expresión `match` en un `Option<u8>`

source: Now let’s consider the second call of `plus_one` in our main function, where `x` is `Option::None(())`. We enter the match and compare to the first arm:
es: Ahora consideremos la segunda llamada de `plus_one` en nuestra función principal, donde `x` es `Option::None(())`. Entramos en el `match` y comparamos con el primer brazo:

source: It matches! There’s no value to add to, so the program stops and returns the `Option::None(())` value on the right side of `=>`.
es: ¡Coincide! No hay valor al que agregar, por lo que el programa se detiene y devuelve el valor `Option::None(())` en el lado derecho de `=>`.

source: <!-- TODO : might need to link the end of this chapter to patterns and matching chapter -->
es: <!-- TODO: puede que necesitemos enlazar el final de este capítulo con el capítulo de patrones y coincidencias -->

source: The crate root is the `lib.cairo` source file that the Cairo compiler starts from and makes up the root module of your crate (we’ll explain modules in depth in the [“Defining Modules to Control Scope”](./ch06-02-defining-modules-to-control-scope.md) section).
es: La raíz del crate es el fichero fuente `lib.cairo` desde el que arranca el compilador de Cairo y constituye el módulo raíz de tu crate (explicaremos los módulos en profundidad en la sección ["Definición de módulos para controlar el alcance"](./ch06-02-defining-modules-to-control-scope.md) section).

source: - `src/` is the main directory where all the Cairo source files for the package will be stored. - `lib.cairo` is the default root module of the crate, which is also the main entry point of the package. By default, it is empty. - `Scarb.toml` is the package manifest file, which contains metadata and configuration options for the package, such as dependencies, package name, version, and authors. You can find documentation about it on the [scarb reference](https://docs.swmansion.com/scarb/docs/reference/manifest.html).
es: - `src/` es el directorio principal donde se almacenarán todos los archivos de origen de Cairo para el paquete. - `lib.cairo` es el módulo raíz predeterminado del crate, que también es el punto de entrada principal del paquete. Por defecto, está vacío. - `Scarb.toml` es el archivo de manifiesto del paquete, que contiene metadatos y opciones de configuración para el paquete, como dependencias, nombre del paquete, versión y autores. Puede encontrar documentación al respecto en la [referencia de Scarb](https://docs.swmansion.com/scarb/docs/reference/manifest.html).

source: - **Start from the crate root**: When compiling a crate, the compiler first looks in the crate root file (_src/lib.cairo_) for code to compile. - **Declaring modules**: In the crate root file, you can declare new modules; say, you declare a “garden” module with `mod garden;`. The compiler will look for the module’s code in these places: - Inline, within curly brackets that replace the semicolon following `mod garden;`. ```rust // crate root file (lib.cairo) mod garden { // code defining the garden module goes here } ``` - In the file _src/garden.cairo_ - **Declaring submodules**: In any file other than the crate root, you can declare submodules. For example, you might declare `mod vegetables;` in _src/garden.cairo_. The compiler will look for the submodule’s code within the directory named for the parent module in these places: - Inline, directly following `mod vegetables`, within curly brackets instead of the semicolon. ```rust // src/garden.cairo file mod vegetables { // code defining the vegetables submodule goes here } ``` - In the file _src/garden/vegetables.cairo_ - **Paths to code in modules**: Once a module is part of your crate, you can refer to code in that module from anywhere else in that same crate, using the path to the code. For example, an `Asparagus` type in the garden vegetables module would be found at `backyard::garden::vegetables::Asparagus`. - **The `use` keyword**: Within a scope, the `use` keyword creates shortcuts to items to reduce repetition of long paths. In any scope that can refer to `backyard::garden::vegetables::Asparagus`, you can create a shortcut with `use backyard::garden::vegetables::Asparagus;` and from then on you only need to write `Asparagus` to make use of that type in the scope.
es: - **Comience desde la raíz del crate**: Al compilar un crate, el compilador primero busca código para compilar en el archivo raíz del crate (_src/lib.cairo_). - **Declaración de módulos**: En el archivo raíz del crate, puede declarar nuevos módulos; digamos que declara un módulo "garden" con `mod garden;`. El compilador buscará el código del módulo en estos lugares: - En línea, dentro de llaves que reemplazan al punto y coma que sigue a `mod garden;`. ```rust // crate root file (lib.cairo) mod garden { // code defining the garden module goes here } ``` - En el archivo _src/garden.cairo_ - **Declarando submódulos**: En cualquier archivo que no sea la raíz del paquete, puede declarar submódulos. Por ejemplo, podría declarar `mod vegetables;` en el archivo _src/garden.cairo_. El compilador buscará el código del submódulo dentro del directorio nombrado por el módulo padre en estos lugares: - En línea, directamente después de `mod vegetables`, dentro de llaves en lugar del punto y coma. ```rust // src/garden.cairo file mod vegetables { // code defining the vegetables submodule goes here } ``` - En el archivo _src/garden/vegetables.cairo_ - **Rutas a código en módulos**: Una vez que un módulo forma parte de su paquete, puede hacer referencia al código de ese módulo desde cualquier otro lugar en ese mismo paquete, utilizando la ruta al código. Por ejemplo, un tipo `Asparagus` en el módulo de vegetales del jardín se encontraría en `backyard::garden::vegetables::Asparagus`. - **La palabra clave `use`**: Dentro de un alcance, la palabra clave `use` crea atajos a elementos para reducir la repetición de rutas largas. En cualquier alcance que pueda hacer referencia a `backyard::garden::vegetables::Asparagus`, puede crear un atajo con `use backyard::garden::vegetables::Asparagus;` y a partir de entonces solo necesita escribir `Asparagus` para usar ese tipo en el alcance.

source: > Note: You will notice here a `cairo_project.toml` file. > This is the configuration file for "vanilla" Cairo projects (i.e. not managed by Scarb), > which is required to run the `cairo-run .` command to run the code of the crate. > It is required until Scarb implements this feature. The content of the file is: > > ```toml > [crate_roots] > backyard = "src" > ``` > > and indicates that the crate named "backyard" is located in the `src` directory.
es: > Nota: Aquí se observa un archivo `cairo_project.toml`. > Este es el archivo de configuración para proyectos "vanilla" de Cairo (es decir, no > gestionados por Scarb), que se requiere para ejecutar el comando `cairo-run .` y > ejecutar el código del crate. > Es necesario hasta que Scarb implemente esta función. El contenido del archivo es: > > ```toml > [crate_roots] > backyard = "src" > ``` > > y indica que la caja llamada "backyard" se encuentra en el directorio `src`.

source: To structure our crate in this way, we can organize its functions into nested modules. Create a new package named `restaurant` by running `scarb new restaurant`; then enter the code in Listing 6-1 into _src/lib.cairo_ to define some modules and function signatures. Here’s the front of house section:
es: Para estructurar nuestro paquete de esta manera, podemos organizar sus funciones en módulos anidados. Cree un nuevo paquete llamado `restaurant` ejecutando el comando `scarb new restaurant`; luego ingrese el código en el Listado 6-1 en _src/lib.cairo_ para definir algunos módulos y firmas de funciones. Aquí está la sección de front of house:

source: <span class="caption">Listing 6-1: A `front_of_house` module containing other modules that then contain functions</span>
es: <span class="caption">Listado 6-1: Un módulo `front_of_house` que contiene otros módulos que a su vez contienen funciones</span>

source: Listing 6-2 shows the module tree for the structure in Listing 6-1.
es: El Listado 6-2 muestra el árbol de módulos para la estructura en el Listado 6-1.

source: <span class="caption">Listing 6-2: The module tree for the code in Listing 6-1</span>
es: <span class="caption">Listing 6-2: El árbol de módulos para el código en el Listado 6-1</span>

source: To illustrate this notion let's take back our example Listing 6-1 for the restaurant we used in the last chapter. We have a crate named `restaurant` in which we have a module named `front_of_house` that contains a module named `hosting`. The `hosting` module contains a function named `add_to_waitlist`. We want to call the `add_to_waitlist` function from the `eat_at_restaurant` function. We need to tell Cairo the path to the `add_to_waitlist` function so it can find it.
es: Para ilustrar esta noción, tomemos de nuevo nuestro ejemplo del restaurante que usamos en el último capítulo. Tenemos un crate llamado `restaurant` en el cual tenemos un módulo llamado `front_of_house` que contiene un módulo llamado `hosting`. El módulo `hosting` contiene una función llamada `add_to_waitlist`. Queremos llamar a la función `add_to_waitlist` desde la función `eat_at_restaurant`. Necesitamos decirle a Cairo el camino hacia la función `add_to_waitlist` para que pueda encontrarla.

source: <span class="caption">Listing 6-3: Calling the `add_to_waitlist` function using absolute and relative paths</span>
es: <span class="caption">Lista 6-3: Llamada a la función `add_to_waitlist` utilizando rutas absolutas y relativas</span>

source: <span class="caption">Listing 6-4: Calling a function using a relative path starting with super</span>
es: <span class="caption">Lista 6-4: Llamada a una función utilizando una ruta relativa que empieza por super</span>

source: In Listing 6-5, we bring the `restaurant::front_of_house::hosting` module into the scope of the `eat_at_restaurant` function so we only have to specify `hosting::add_to_waitlist` to call the `add_to_waitlist` function in `eat_at_restaurant`.
es: En el Listado 6-5, incluimos el módulo `restaurant::front_of_house::hosting` en el ámbito de la función de la función `eat_at_restaurant` para que sólo tengamos que especificar `hosting::add_to_waitlist` para llamar a la función `add_to_waitlist` de en `eat_at_restaurant`.

source: <span class="caption">Listing 6-5: Bringing a module into scope with `use`</span>
es: <span class="caption">Listado 6-5: Introducir un módulo en el ámbito con `use`</span>

source: Note that `use` only creates the shortcut for the particular scope in which the `use` occurs. Listing 6-6 moves the `eat_at_restaurant` function into a new child module named `customer`, which is then a different scope than the `use` statement, so the function body won’t compile:
es: Ten en cuenta que `use` sólo crea el acceso directo para el ámbito concreto en el que se produce el `use`. El listado 6-6 mueve la función `eat_at_restaurant` a un nuevo módulo hijo llamado módulo hijo llamado `customer`, que es un ámbito diferente al de la sentencia `use por lo que el cuerpo de la función no compilará:

source: <span class="caption">Listing 6-6: A `use` statement only applies in the scope it’s in</span>
es: <span class="caption">Listado 6-6: Una sentencia `use` sólo se aplica en el ámbito en el que se encuentra</span>

source: In Listing 6-5, you might have wondered why we specified `use restaurant::front_of_house::hosting` and then called `hosting::add_to_waitlist` in `eat_at_restaurant` rather than specifying the `use` path all the way out to the `add_to_waitlist` function to achieve the same result, as in Listing 6-7.
es: En el Listado 6-5, puede que te hayas preguntado por qué especificamos `use restaurant::front_of_house::hosting` y luego llamamos a `hosting::add_to_waitlist` en en `eat_at_restaurant` en lugar de especificar la ruta `use la función `add_to_waitlist` para conseguir el mismo resultado, como en el Listado 6-7.

source: <span class="caption">Listing 6-7: Bringing the `add_to_waitlist` function into scope with `use`, which is unidiomatic</span>
es: <span class="caption">Listado 6-7: Introduciendo la función `add_to_waitlist con `use`, que es poco idiomático</span>
