Repository: cairo-book/cairo-book
Catalog: po/*.po
Languages: es, id, ko, zh_cn

source: Structs let you create custom types that are meaningful for your domain. By using structs, you can keep associated pieces of data connected to each other and name each piece to make your code clear. In `trait` and `impl` blocks, you can define methods, which are functions associated to a type and let you specify the behavior that instances of your type have.
id: Struct memungkinkan Anda membuat jenis kustom yang memiliki makna untuk domain Anda. Dengan menggunakan struct, Anda dapat menjaga agar bagian-bagian data terkait tetap terhubung satu sama lain dan memberikan nama pada setiap bagian untuk menjadikan kode Anda lebih jelas. Dalam blok `trait` dan `impl`, Anda dapat mendefinisikan metode, yang merupakan fungsi yang terkait dengan suatu tipe dan memungkinkan Anda menentukan perilaku yang dimiliki instansi dari tipe Anda.
ko: 구조체를 사용하면 도메인에 의미 있는 사용자 정의 유형을 만들 수 있습니다. 구조체를 사용하면 연결된 데이터 조각을 유지하고 각 조각에 이름을 지어 코드를 명확하게 만들 수 있습니다. `trait` 및 `impl` 블록에서 메서드를 정의할 수 있으며 이는 유형에 연결된 함수이며 유형의 인스턴스가 가지는 동작을 지정할 수 있습니다.

source: But structs aren’t the only way you can create custom types: let’s turn to Cairo’s enum feature to add another tool to your toolbox.
id: Namun, struct bukan satu-satunya cara untuk membuat tipe kustom: mari beralih ke fitur enum Cairo untuk menambahkan alat lain ke dalam kotak alat Anda.
ko: 그러나 구조체만이 사용자 정의 타입을 만들 수 있는 유일한 방법은 아닙니다. 대신, Cairo의 enum 기능을 활용하여 도구 상자에 또 다른 도구를 추가해 봅시다.

source: In this chapter, we’ll look at _enumerations_, also referred to as _enums_. Enums allow you to define a type by enumerating its possible _variants_. First, we’ll define and use an enum to show how an enum can encode meaning along with data. Next, we’ll explore a particularly useful enum, called `Option`, which expresses that a value can be either something or nothing. Finally, we’ll look at how pattern matching in the `match` expression makes it easy to run different code for different values of an enum.
id: Dalam bab ini, kita akan melihat _enumerations_, juga disebut _enums_. Enums memungkinkan Anda mendefinisikan tipe dengan menghitung _variants_ yang mungkin. Pertama, kita akan mendefinisikan dan menggunakan sebuah enum untuk menunjukkan bagaimana enum dapat mengkodekan makna bersama dengan data. Selanjutnya, kita akan menjelajahi enum yang sangat berguna, yang disebut `Option`, yang menyatakan bahwa suatu nilai dapat menjadi sesuatu atau tidak. Akhirnya, kita akan melihat bagaimana pola pencocokan dalam ekspresi `match` membuatnya mudah untuk menjalankan kode yang berbeda untuk nilai-nilai enum yang berbeda.
ko: 이 장에서는 _열거형_ 또는 _enums_ 로도 불리는 것을 살펴볼 것입니다. Enums를 사용하면 가능한 _변형_ 을 나열하여 유형을 정의할 수 있습니다. 먼저, enum을 정의하고 사용하여 enum이 데이터와 함께 의미를 인코딩하는 방법을 보여줄 것입니다. 그 다음으로, `Option`이라는 특히 유용한 enum을 탐색하여 값이 무언가이거나 아무것도 아닐 수 있다는 것을 표현합니다. 마지막으로, `match` 표현식에서 패턴 매칭이 어떻게 enum의 다른 값에 대해 다른 코드를 실행하기 쉽게 만드는지 살펴볼 것입니다.

source: Enums, short for "enumerations," are a way to define a custom data type that consists of a fixed set of named values, called _variants_. Enums are useful for representing a collection of related values where each value is distinct and has a specific meaning.
es: Los Enums, abreviatura de "enumeraciones", son una forma de definir un tipo de datos personalizado que consiste en un conjunto fijo de valores nombrados, llamados _variantes_. Los enums son útiles para representar una colección de valores relacionados donde cada valor es distinto y tiene un significado específico.
id: Enum, singkatan dari "enumerations," adalah cara untuk mendefinisikan tipe data kustom yang terdiri dari set tetap dari nilai-nilai yang diberi nama, disebut _variants_. Enum berguna untuk merepresentasikan kumpulan nilai terkait di mana setiap nilai bersifat berbeda dan memiliki makna tertentu.
ko: 열거형은 "enumerations"의 줄임말로, 고정된 일련의 이름이 지정된 값으로 구성된 사용자 정의 데이터 유형을 정의하는 방법입니다. 열거형은 각 값이 구별되고 특정 의미를 가지는 관련 값의 컬렉션을 나타내는 데 유용합니다.
zh_cn: 本章介绍 "枚举"（enumerations），也被称作 enums，是一种自定义数据类型的方式，它由一组固定的命名值成员组成，称为 _variants_ 。枚举对于表示相关值的集合非常有用，其中每个值都是不同的，并且有特定的含义。

source: Enum Variants and Values
id: Enum Variants dan Values
ko: 열거형 변형 및 값들

source: Here's a simple example of an enum:
es: Aquí hay un ejemplo sencillo de un enum:
id: Berikut adalah contoh sederhana dari sebuah enum:
ko: 다음은 enum의 간단한 예제입니다.
zh_cn: 下面是一个枚举的简单例子：

source: In this example, we've defined an enum called `Direction` with four variants: `North`, `East`, `South`, and `West`. The naming convention is to use PascalCase for enum variants. Each variant represents a distinct value of the Direction type. In this particular example, variants don't have any associated value. One variant can be instantiated using this syntax:
id: Pada contoh ini, kita telah mendefinisikan sebuah enum yang disebut `Direction` dengan empat varian: `North`, `East`, `South`, dan `West`. Konvensi penamaan adalah menggunakan PascalCase untuk varian enum. Setiap varian mewakili nilai yang berbeda dari tipe Direction. Pada contoh ini, varian tidak memiliki nilai terkait. Satu varian dapat diinstansiasi menggunakan sintaks ini:
ko: 이 예시에서는 `Direction`이라는 enum을 정의했습니다. 이 enum은 `North`, `East`, `South`, `West` 네 가지 변형을 가지고 있습니다. 네이밍 규칙은 enum 변형에 대해 PascalCase를 사용하는 것입니다. 각 변형은 Direction 타입의 구별된 값 하나를 나타냅니다. 이 특정 예시에서는 변형에 연관된 값이 없습니다. 하나의 변형은 다음 구문을 사용하여 인스턴스화될 수 있습니다:
zh_cn: 在本例中，我们定义了一个名为 `Direction` 的枚举，它有四个变量：`North`, `East`, `South` 和 `West`。命名惯例是使用 PascalCase 来命名枚举变量。每个变量代表 Direction 类型的一个不同值。在本示例中，枚举成员没有任何关联值。使用此语法可以实例化一个变量：

source: It's easy to write code that acts differently depending on the variant of an enum instance, in this example to run specific code according to a Direction. You can learn more about it on [The Match Control Flow Construct page](ch06-02-the-match-control-flow-construct.md).
id: Mudah untuk menulis kode yang berbeda tergantung pada varian dari sebuah instansi enum, seperti pada contoh ini untuk menjalankan kode tertentu sesuai dengan suatu Arah. Anda dapat mempelajari lebih lanjut tentang hal ini di halaman [Konstruksi Alur Kontrol Match](ch06-02-the-match-control-flow-construct.md).
ko: 열거형 인스턴스의 변형에 따라 다르게 작동하는 코드를 작성하는 것은 쉽습니다. 이 예제에서는 Direction에 따라 특정 코드를 실행할 수 있습니다. [The Match Control Flow Construct 페이지](ch06-02-the-match-control-flow-construct.md)에서 더 자세히 알아볼 수 있습니다.
zh_cn: 我们可以很轻易的写出根据枚举的成员运行不同的流程的代码，在上面这个例子中，是根据方向来运行特定的代码。你可以在 [Match 控制流结构](ch06-02-the-match-control-flow-construct.md)页面上了解更多信息。

source: Enums Combined with Custom Types
id: Enums Kombinasi dengan Tipe Kustom
ko: 열거형과 사용자 정의 타입 결합

source: Enums can also be used to store more interesting data associated with each variant. For example:
es: Los enums también pueden ser utilizados para almacenar datos más interesantes asociados con cada variante. Por ejemplo:
id: Enum juga dapat digunakan untuk menyimpan data yang lebih menarik yang terkait dengan setiap varian. Sebagai contoh:
ko: 열거형은 각 변형과 관련된 더 흥미로운 데이터를 저장하는 데에도 사용될 수 있습니다. 예를 들어:
zh_cn: 枚举也可以用来存储与每个成员相关的更有趣的数据。比如说：

source: In this example, the `Message` enum has three variants: `Quit`, `Echo` and `Move`, all with different types:
es: En este ejemplo, el enum `Message` tiene tres variantes: `Quit`, `Echo` y `Move`, todas con tipos diferentes:
id: Pada contoh ini, enum `Message` memiliki tiga varian: `Quit`, `Echo`, dan `Move`, masing-masing dengan tipe yang berbeda:
ko: 이 예시에서 `Message` enum에는 세 가지 변형이 있습니다: `Quit`, `Echo` 및 `Move`, 각각 다른 타입을 가지고 있습니다:
zh_cn: 在这个例子中，`Message`枚举有三个成员：`Quit`、`Echo`和`Move`，都有不同的类型：

source: `Quit` doesn't have any associated value.
id: `Quit` tidak memiliki nilai terkait.
ko: `Quit`에는 관련 값이 없습니다.

source: `Echo` is a single felt.
id: `Echo` adalah satu felt.
ko: `Echo`는 한 장의 펠트입니다.

source: `Move` is a tuple of two u128 values.
id: `Move` adalah tuple dari dua nilai u128.
ko: `Move`은 두 개의 u128 값으로 이루어진 튜플입니다.

source: You could even use a Struct or another Enum you defined inside one of your Enum variants.
es: Incluso puedes usar una estructura o otro enum que hayas definido dentro de una de las variantes de tu enum.
id: Anda bahkan dapat menggunakan Struct atau Enum lain yang Anda tentukan di dalam salah satu varian Enum Anda.
ko: 하나의 Enum 변형 내부에 정의한 Struct나 다른 Enum을 사용할 수도 있습니다.
zh_cn: 你甚至可以在你的一个枚举成员中使用一个结构体或另一个你定义的枚举。

source: Trait Implementations for Enums
id: Implementasi Trait untuk Enums
ko: 열거형에 대한 특성 구현

source: In Cairo, you can define traits and implement them for your custom enums. This allows you to define methods and behaviors associated with the enum. Here's an example of defining a trait and implementing it for the previous `Message` enum:
es: En Cairo, puedes definir traits e implementarlos para tus enums personalizados. Esto te permite definir métodos y comportamientos asociados con el enum. Aquí hay un ejemplo de cómo definir un trait e implementarlo para el enum `Message` anterior:
id: Di Cairo, Anda dapat mendefinisikan trait dan mengimplementasikannya untuk enum kustom Anda. Ini memungkinkan Anda mendefinisikan metode dan perilaku yang terkait dengan enum tersebut. Berikut adalah contoh mendefinisikan trait dan mengimplementasikannya untuk enum `Message` sebelumnya:
ko: 카이로에서는 사용자 정의 열거형을 위해 특성을 정의하고 구현할 수 있습니다. 이를 통해 열거형과 관련된 메서드와 동작을 정의할 수 있습니다. 이전 `Message` 열거형을 위해 특성을 정의하고 구현하는 예시가 있습니다.
zh_cn: 在Cairo中，你可以为你的自定义枚举定义trait并实现它们。这允许你定义与枚举相关的方法和行为。下面是一个定义trait并为之前的 `Message` 枚举实现的例子：

source: "quitting"
ko: 그만두기

source: "echoing {}"
ko: "반복 {}"

source: "moving"
ko: 이동 중

source: In this example, we implemented the `Processing` trait for `Message`. Here is how it could be used to process a Quit message:
es: En este ejemplo, implementamos el trait `Processing` para `Message`. Así es cómo podría ser utilizado para procesar un mensaje Quit:
id: Pada contoh ini, kita mengimplementasikan trait `Processing` untuk `Message`. Berikut adalah cara penggunaannya untuk memproses pesan Quit:
ko: 이 예시에서는 `Message`에 대한 `Processing` 특성을 구현했습니다. 여기에는 Quit 메시지를 처리하는 방법이 나와 있습니다.
zh_cn: 在这个例子中，我们为`Message`实现了`Processing` trait。下面是如何用它来处理一条退出消息：

source: Running this code would print `quitting`.
es: Al ejecutar este código se imprimiría `quitting`.
id: Menjalankan kode ini akan mencetak `quitting`.
ko: 이 코드를 실행하면 `quitting`이 출력됩니다.
zh_cn: 运行这段代码会打印出 `quitting`。

source: The Option Enum and Its Advantages
id: Enum Option dan Keuntungannya
ko: 옵션 Enum 및 그 이점

source: The Option enum is a standard Cairo enum that represents the concept of an optional value. It has two variants: `Some: T` and `None: ()`. `Some: T ` indicates that there's a value of type `T`, while `None` represents the absence of a value.
es: El enum Option es un enum estándar en Cairo que representa el concepto de un valor opcional. Tiene dos variantes: `Some: T` y `None: ()`. `Some: T` indica que hay un valor de tipo `T`, mientras que `None` representa la ausencia de un valor.
id: Enum Option adalah enum standar dalam Cairo yang mewakili konsep nilai opsional. Ini memiliki dua varian: `Some: T` dan `None: ()`. `Some: T` menunjukkan bahwa ada nilai dengan tipe `T`, sementara `None` mewakili ketiadaan nilai.
ko: Option 열거형은 선택적인 값의 개념을 나타내는 표준 Cairo 열거형입니다. 두 가지 변형이 있습니다: `Some: T`와 `None: ()`. `Some: T`는 `T` 유형의 값이 있는 것을 나타내고, `None`은 값이 없음을 나타냅니다.
zh_cn: Option枚举是一个标准的Cairo枚举，表示一个可选值的概念。它有两个变量：`Some: T` 和 `None: ()`。`Some：T`表示有一个`T`类型的值，而`None`表示没有值。

source: The `Option` enum is helpful because it allows you to explicitly represent the possibility of a value being absent, making your code more expressive and easier to reason about. Using `Option` can also help prevent bugs caused by using uninitialized or unexpected `null` values.
es: El enum `Option` es útil porque te permite representar explícitamente la posibilidad de que un valor esté ausente, lo que hace que tu código sea más expresivo y fácil de entender. Usar `Option` también puede ayudar a prevenir errores causados por el uso de valores `null` no inicializados o inesperados.
id: Enum `Option` berguna karena memungkinkan Anda secara eksplisit mewakili kemungkinan nilai yang tidak ada, membuat kode Anda lebih ekspresif dan lebih mudah untuk dipahami. Penggunaan `Option` juga dapat membantu mencegah bug yang disebabkan oleh penggunaan nilai `null` yang tidak diinisialisasi atau tidak terduga.
ko: `Option` 열거형은 값이 없을 수 있는 가능성을 명시적으로 나타낼 수 있기 때문에 코드를 더 표현력 있고 이해하기 쉽게 만들어줍니다. `Option`을 사용하면 초기화되지 않거나 예기치 않은 `null` 값으로 인한 버그를 방지하는 데도 도움이 될 수 있습니다.
zh_cn: `Option` 枚举很有用，因为它允许你明确地表示一个值不存在的可能性，使你的代码更具表现力，更容易推理。使用 `Option` 也可以帮助防止因使用未初始化的或意外的 `null` 值而引起的错误。

source: To give you an example, here is a function which returns the index of the first element of an array with a given value, or None if the element is not present.
es: Para darte un ejemplo, aquí hay una función que devuelve el índice del primer elemento de un arreglo con un valor dado, o `None` si el elemento no está presente.
id: Sebagai contoh, berikut adalah sebuah fungsi yang mengembalikan indeks dari elemen pertama dalam sebuah array dengan nilai tertentu, atau None jika elemen tidak ada.
ko: 예를 들어, 주어진 값이 있는 배열의 첫 번째 요소의 인덱스를 반환하는 함수를 여기에 제시합니다. 만약 해당 요소가 없다면 None을 반환합니다.
zh_cn: 为了给你一个例子，这里有一个函数，它返回一个给定值的数组中第一个元素的索引，如果该元素不存在则返回None。

source: We are demonstrating two approaches for the above function:
es: Estamos demostrando dos enfoques para la función anterior:
id: Kami sedang mendemonstrasikan dua pendekatan untuk fungsi di atas:
ko: 우리는 위의 함수에 대해 두 가지 접근 방식을 보여주고 있습니다.
zh_cn: 我们为上述函数演示了两种方法：

source: Recursive Approach `find_value_recursive`
id: Pendekatan Rekursif `find_value_recursive`
ko: 재귀적 접근 `find_value_recursive`

source: Iterative Approach `find_value_iterative`
id: Pendekatan Iteratif `find_value_iterative`
ko: 반복적인 접근 `find_value_iterative`

source: Note: in the future it would be nice to replace this example by something simpler using a loop and without gas related code.
id: Catatan: di masa mendatang, akan bagus untuk menggantikan contoh ini dengan sesuatu yang lebih sederhana menggunakan perulangan dan tanpa kode terkait gas.
ko: 참고: 미래에는 루프를 사용하고 가스 관련 코드 없이 더 간단한 예제로 대체하는 것이 좋을 것입니다.

source: "found recursively at index {}"
ko: "인덱스 {}에서 재귀적으로 발견되었습니다"

source: "not found"
ko: "찾을 수 없음"

source: "found iteratively at index {}"
ko: "인덱스 {}에서 반복적으로 찾음"

source: Running this code would print `it worked`.
es: Al ejecutar este código se imprimiría `it worked`.
id: Menjalankan kode ini akan mencetak `it worked`.
ko: 이 코드를 실행하면 `작동했습니다`가 출력됩니다.
zh_cn: 运行这段代码会打印出 `it worked`。

source: Cairo has an extremely powerful control flow construct called `match` that allows you to compare a value against a series of patterns and then execute code based on which pattern matches. Patterns can be made up of literal values, variable names, wildcards, and many other things. The power of `match` comes from the expressiveness of the patterns and the fact that the compiler confirms that all possible cases are handled.
ko: 카이로에는 `match`라는 매우 강력한 제어 흐름 구조가 있습니다. 이를 사용하면 값과 일련의 패턴을 비교한 다음 일치하는 패턴에 따라 코드를 실행할 수 있습니다. 패턴은 리터럴 값, 변수 이름, 와일드카드 및 기타 여러 가지로 구성될 수 있습니다. `match`의 강점은 패턴의 표현력과 컴파일러가 모든 가능한 경우를 처리했음을 확인하는 점에 있습니다.

source: Think of a `match` expression as being like a coin-sorting machine: coins slide down a track with variously sized holes along it, and each coin falls through the first hole it encounters that it fits into. In the same way, values go through each pattern in a match, and at the first pattern the value “fits”, the value falls into the associated code block to be used during execution.
ko: `match` 표현식을 동전을 분류하는 기계와 같이 생각해보세요: 동전이 다양한 크기의 구멍이 있는 트랙을 따라 미끄러지고, 각 동전은 적합한 구멍을 처음으로 만나면 그 구멍으로 떨어집니다. 마찬가지로, 값들은 `match`의 각 패턴을 거치며, 값이 "적합"한 첫 번째 패턴에서 해당하는 코드 블록으로 떨어져 실행 중에 사용됩니다.

source: Speaking of coins, let’s use them as an example using `match`! We can write a function that takes an unknown US coin and, in a similar way as the counting machine, determines which coin it is and returns its value in cents, as shown in Listing 6-3.
ko: 동전에 대해 말씀드리면, `match`를 사용하는 예시로 사용해 봅시다! 우리는 알 수 없는 미국 동전을 받아들이고, 계수기와 비슷한 방식으로 어떤 동전인지 판별하고 센트 단위로 값을 반환하는 함수를 작성할 수 있습니다. (리스트 6-3에 표시된 대로)

source: Listing 6-3: An enum and a `match` expression that has the variants of the enum as its patterns
ko: 리스트 6-3: 열거형과 해당 패턴으로 사용하는 `match` 표현식

source: Let’s break down the `match` expression in the `value_in_cents` function. First we list the `match` keyword followed by an expression, which in this case is the value `coin`. This seems very similar to a conditional expression used with if, but there’s a big difference: with if, the condition needs to evaluate to a Boolean value, but here it can be any type. The type of `coin` in this example is the `Coin` enum that we defined on the first line.
ko: `value_in_cents` 함수의 `match` 표현식을 분해해 봅시다. 먼저 `match` 키워드를 나열한 후에 이번 경우에는 `coin` 값이 됩니다. 이는 if와 함께 사용되는 조건 표현식과 매우 유사해 보이지만, 큰 차이가 있습니다: if에서는 조건이 부울 값으로 평가되어야 하지만, 여기서는 어떤 유형이든 될 수 있습니다. 이 예제에서 `coin`의 유형은 첫 번째 줄에서 정의한 `Coin` 열거형입니다.

source: Next are the `match` arms. An arm has two parts: a pattern and some code. The first arm here has a pattern that is the value `Coin::Penny` and then the `=>` operator that separates the pattern and the code to run. The code in this case is just the value `1`. Each arm is separated from the next with a comma.
ko: 다음은 `match` 암입니다. 암에는 두 부분이 있습니다: 패턴과 코드입니다. 여기 첫 번째 암은 값 `Coin::Penny`인 패턴과 패턴과 코드를 구분하는 `=>` 연산자가 있습니다. 이 경우 코드는 단순히 값 `1`입니다. 각 암은 쉼표로 구분됩니다.

source: When the `match` expression executes, it compares the resultant value against the pattern of each arm, in the order they are given. If a pattern matches the value, the code associated with that pattern is executed. If that pattern doesn’t match the value, execution continues to the next arm, much as in a coin-sorting machine. We can have as many arms as we need: in the above example, our `match` has four arms.
ko: `match` 표현식이 실행될 때, 결과 값은 각 팔에 대한 패턴과 비교됩니다. 주어진 순서대로. 패턴이 값과 일치하면 해당 패턴과 관련된 코드가 실행됩니다. 그 패턴이 값과 일치하지 않으면 실행은 다음 팔로 계속됩니다. 동전 분류기와 마찬가지로 필요한 만큼 많은 팔을 가질 수 있습니다. 위 예제에서는 `match`가 네 개의 팔을 가지고 있습니다.

source: The code associated with each arm is an expression, and the resultant value of the expression in the matching arm is the value that gets returned for the entire match expression.
es: El código asociado con cada brazo es una expresión, y el valor resultante de la expresión en el brazo coincidente es el valor que se devuelve para toda la expresión match.
id: Kode yang terkait dengan setiap lengan adalah suatu ekspresi, dan nilai hasil dari ekspresi di lengan yang cocok adalah nilai yang dikembalikan untuk seluruh ekspresi match.
ko: 각 팔에 연결된 코드는 표현식이며, 일치하는 팔의 표현식의 결과 값은 전체 일치 표현식에 대한 반환 값이 됩니다.
zh_cn: 与每个 match 相关的代码是一个表达式，而 match 分支中表达式的结果值是整个 match 表达式被返回的值。

source: We don’t typically use curly brackets if the `match` arm code is short, as it is in our example where each arm just returns a value. If you want to run multiple lines of code in a `match` arm, you must use curly brackets, with a comma following the arm. For example, the following code prints “Lucky penny!” every time the method is called with a `Coin::Penny`, but still returns the last value of the block, `1`:
ko: 일반적으로 `match` 팔 코드가 짧을 경우 중괄호를 사용하지 않습니다. 예를 들어 각 팔이 값만 반환하는 예제에서와 같이요. `match` 팔에서 여러 줄의 코드를 실행하려면 각 팔 뒤에 쉼표를 붙여 중괄호를 사용해야 합니다. 예를 들어 다음 코드는 `Coin::Penny`로 호출될 때마다 "Lucky penny!"를 출력하지만 블록의 마지막 값인 `1`을 반환합니다:

source: "Lucky penny!"
ko: "행운의 페니!"

source: Patterns That Bind to Values
id: Pola yang Terikat pada Nilai
ko: 값에 바인딩되는 패턴

source: Another useful feature of `match` arms is that they can bind to the parts of the values that match the pattern. This is how we can extract values out of enum variants.
ko: `match` 팔에 대한 또 다른 유용한 기능은 패턴과 일치하는 값의 일부에 바인딩할 수 있다는 것입니다. 이것이 enum 변형에서 값을 추출하는 방법입니다.

source: As an example, let’s change one of our enum variants to hold data inside it. From 1999 through 2008, the United States minted quarters with different designs for each of the 50 states on one side. No other coins got state designs, so only quarters have this extra value. We can add this information to our `enum` by changing the `Quarter` variant to include a `UsState` value stored inside it, which we’ve done in Listing 6-4.
id: Sebagai contoh, mari ubah salah satu varian enum kita untuk menyimpan data di dalamnya. Dari tahun 1999 hingga 2008, Amerika Serikat mencetak koin seperempat dolar dengan desain yang berbeda untuk setiap dari 50 negara bagian di satu sisi. Tidak ada koin lain yang mendapatkan desain negara bagian, sehingga hanya koin seperempat dolar yang memiliki nilai tambahan ini. Kita dapat menambahkan informasi ini ke enum kita dengan mengubah varian `Quarter` untuk menyertakan nilai `UsState` yang disimpan di dalamnya, seperti yang kita lakukan pada Listing 6-4.
ko: 예를 들어, 우리의 enum 변형 중 하나를 내부에 데이터를 보유하도록 변경해 봅시다. 1999년부터 2008년까지 미국은 50개 주 각각에 대해 다른 디자인이 새겨진 쿼터를 조제했습니다. 다른 동전들은 주 디자인이 없었기 때문에, 쿼터만이 이 추가 가치를 가지고 있습니다. 우리는 `enum`에 이 정보를 추가할 수 있습니다. `Quarter` 변형을 변경하여 내부에 저장된 `UsState` 값을 포함시키는 방식으로, 우리는 Listing 6-4에서 수행한 것과 같이 할 수 있습니다.
zh_cn: 作为一个例子，让我们修改枚举的一个成员来存放数据。1999 年到 2008 年间，美国在 25 美分的硬币的一侧为 50 个州的每一个都印刷了不同的设计。其他的硬币都没有这种区分州的设计，所以只有这些 25 美分硬币有特殊的价值。我们可以通过改变 `Quarter` 变量，使其包含一个`UsState` 的值，从而将这个信息添加到我们的 `enum` 中，我们在示例6-4中已经这样做了。

source: // Debug so we can inspect the state in a minute
ko: // 조사를 위해 상태를 검사할 수 있도록 디버그합니다

source: Listing 6-4: A `Coin` enum in which the `Quarter` variant also holds a `UsState` value
id: Listing 6-4: Sebuah enum `Coin` di mana varian `Quarter` juga menyimpan nilai `UsState`
ko: 리스트 6-4: `Quarter` 변형이 `UsState` 값을 보유하는 `Coin` 열거형
zh_cn: 列表6-4: 一个 `Coin` 枚举，其中 `Quarter` 变量也持有一个 `UsState` 值

source: Let’s imagine that a friend is trying to collect all 50 state quarters. While we sort our loose change by coin type, we’ll also call out the name of the state associated with each quarter so that if it’s one our friend doesn’t have, they can add it to their collection.
es: Imaginemos que un amigo está tratando de recolectar todas las 50 monedas de cuarto de estado. Mientras clasificamos nuestro cambio suelto por tipo de moneda, también llamaremos el nombre del estado asociado con cada cuarto para que si es uno que nuestro amigo no tiene, puedan agregarlo a su colección.
id: Mari bayangkan bahwa seorang teman mencoba mengumpulkan semua 50 koin seperempat dolar dari setiap negara bagian. Saat kita menyortir koin receh berdasarkan jenis koin, kita juga akan menyebutkan nama negara bagian yang terkait dengan setiap koin seperempat dolar, sehingga jika itu adalah salah satu yang belum dimiliki oleh teman kita, mereka dapat menambahkannya ke koleksinya.
ko: 친구가 50개의 주 쿼터를 모으려고 노력하고 있다고 상상해 봅시다. 우리가 동전 종류별로 잔돈을 정리하는 동안, 각 쿼터와 연관된 주 이름을 외쳐서, 만약 우리 친구가 갖고 있지 않은 쿼터라면 그들이 컬렉션에 추가할 수 있도록 도와줍시다.
zh_cn: 想象一下我们的一个朋友尝试收集所有 50 个州的 25 美分硬币。在根据硬币类型分类零钱的同时，也可以报告出每个 25 美分硬币所对应的州名称，这样如果我们的朋友没有的话，他可以将其加入收藏。

source: In the `match` expression for this code, we add a variable called `state` to the pattern that matches values of the variant `Coin::Quarter`. When a `Coin::Quarter` matches, the `state` variable will bind to the value of that quarter’s state. Then we can use `state` in the code for that arm, like so:
ko: 이 코드의 `match` 표현식에서는 `Coin::Quarter` 변형값과 일치하는 패턴에 `state`라는 변수를 추가합니다. `Coin::Quarter`가 일치하면 `state` 변수가 해당 쿼터의 상태 값에 바인딩됩니다. 그런 다음 해당 arm의 코드에서 `state`를 사용할 수 있습니다.

source: "State quarter from {:?}!"
ko: "{:?}에서 온 주 쿼터!"

source: Because `state` is an `UsState` enum which implements the `Debug` trait, we can print `state` value with `println!` macro.
ko: `state`는 `Debug` 트레이트를 구현한 `UsState` enum이기 때문에 `println!` 매크로로 `state` 값을 출력할 수 있습니다.
