Repository: cairo-book/cairo-book
Catalog: po/*.po
Languages: es, id, ko, zh_cn

source: Next, place the code that was in the curly brackets into a new file named _src/front_of_house.cairo_, as shown in Listing 7-13. The compiler knows to look in this file because it came across the module declaration in the crate root with the name `front_of_house`.
id: Selanjutnya, letakkan kode yang ada di dalam kurung kurawal ke dalam file baru yang diberi nama _src/front_of_house.cairo_, seperti yang ditunjukkan pada Listing 7-13. Kompiler akan mencari file ini karena menemui deklarasi modul di file akar krate dengan nama `front_of_house`.
ko: 다음으로, 중괄호 안에 있던 코드를 새 파일에 _src/front_of_house.cairo_ 라는 이름으로 넣어주세요. 이는 7-13 목록에 나와 있는 것처럼 하면 됩니다. 컴파일러는 `front_of_house`라는 이름을 가진 크레이트 루트에서 모듈 선언을 만나 파일을 찾을 수 있습니다.

source: Filename: src/front_of_house.cairo
ko: 파일 이름: src/front_of_house.cairo

source: Listing 7-13: Definitions inside the `front_of_house` module in _src/front_of_house.cairo_
id: Listing 7-13: Definisi di dalam modul `front_of_house` di _src/front_of_house.cairo_
ko: 리스팅 7-13: _src/front_of_house.cairo_ 파일 내 `front_of_house` 모듈 안의 정의

source: Note that you only need to load a file using a `mod` declaration _once_ in your module tree. Once the compiler knows the file is part of the project (and knows where in the module tree the code resides because of where you’ve put the `mod` statement), other files in your project should refer to the loaded file’s code using a path to where it was declared, as covered in the [“Paths for Referring to an Item in the Module Tree”](ch06-03-paths-for-referring-to-an-item-in-the-module-tree.html)
id: Perhatikan bahwa Anda hanya perlu memuat sebuah file menggunakan deklarasi `mod` _sekali_ dalam pohon modul Anda. Begitu kompiler tahu bahwa file tersebut merupakan bagian dari proyek (dan mengetahui di mana dalam pohon modul kode tersebut berada karena di mana Anda menempatkan pernyataan `mod`), file-file lain dalam proyek Anda seharusnya merujuk pada kode file yang dimuat menggunakan path ke tempat di mana itu dideklarasikan, sebagaimana dijelaskan dalam bagian [“Paths for Referring to an Item in the Module Tree”](ch06-03-paths-for-referring-to-an-item-in-the-module-tree.html)
ko: 주의하세요. 모듈 트리에서 `mod` 선언을 사용하여 파일을 _한 번_ 만로드해야합니다. 컴파일러가 파일이 프로젝트의 일부임을 알고 있고 (그리고 `mod` 문을 넣은 위치 때문에 코드가 있는 모듈 트리의 위치를 알고 있음), 프로젝트의 다른 파일은 로드된 파일의 코드를 선언된 위치로 가는 경로를 사용하여 참조해야합니다. [“모듈 트리에서 항목을 참조하는 경로”](ch06-03-paths-for-referring-to-an-item-in-the-module-tree.html)에서 다루었습니다.

source: section. In other words, `mod` is _not_ an “include” operation that you may have seen in other programming languages.
id: bagian. Dengan kata lain, `mod` _bukanlah_ operasi "include" seperti yang mungkin Anda temui dalam bahasa pemrograman lain.
ko: 다른 말로, `mod`는 다른 프로그래밍 언어에서 볼 수 있는 "포함" 연산이 아닙니다.

source: Next, we’ll extract the `hosting` module to its own file. The process is a bit different because `hosting` is a child module of `front_of_house`, not of the root module. We’ll place the file for `hosting` in a new directory that will be named for its ancestors in the module tree, in this case _src/front_of_house/_.
id: Selanjutnya, kita akan mengekstrak modul `hosting` ke dalam file terpisah. Proses ini agak berbeda karena `hosting` adalah modul anak dari `front_of_house`, bukan dari modul akar. Kita akan menempatkan file untuk `hosting` dalam direktori baru yang akan dinamai sesuai dengan leluhurnya dalam pohon modul, dalam hal ini _src/front_of_house/_.
ko: 다음으로, `hosting` 모듈을 별도의 파일로 추출할 것입니다. 이 과정은 `hosting`이 루트 모듈이 아닌 `front_of_house`의 하위 모듈이기 때문에 약간 다릅니다. 우리는 `hosting`을 모듈 트리의 조상에 따라 명명된 새 디렉토리에 배치할 것입니다. 이 경우에는 _src/front_of_house/_ 로 이름 지어진 디렉토리에 `hosting` 파일을 배치할 것입니다.

source: To start moving `hosting`, we change _src/front_of_house.cairo_ to contain only the declaration of the `hosting` module:
id: Untuk memulai proses memindahkan `hosting`, kita mengubah _src/front_of_house.cairo_ sehingga hanya berisi deklarasi modul `hosting`:
ko: `hosting`를 시작하려면 _src/front_of_house.cairo_ 를 `hosting` 모듈의 선언만 포함하도록 변경합니다.

source: Then we create a _src/front_of_house_ directory and a file _hosting.cairo_ to contain the definitions made in the `hosting` module:
id: Kemudian, kita membuat direktori _src/front_of_house_ dan sebuah file _hosting.cairo_ untuk berisi definisi yang dibuat di dalam modul `hosting`:
ko: 그럼 _src/front_of_house_ 디렉토리를 만들고 `hosting` 모듈에서 만든 정의를 담은 _hosting.cairo_ 파일을 생성합니다.

source: Filename: src/front_of_house/hosting.cairo
ko: 파일 이름: src/front_of_house/hosting.cairo

source: If we instead put _hosting.cairo_ in the _src_ directory, the compiler would expect the _hosting.cairo_ code to be in a `hosting` module declared in the crate root, and not declared as a child of the `front_of_house` module. The compiler’s rules for which files to check for which modules’ code means the directories and files more closely match the module tree.
id: Jika kita memindahkan _hosting.cairo_ ke dalam direktori _src_, kompiler akan mengharapkan kode _hosting.cairo_ berada dalam modul `hosting` yang dideklarasikan di akar krate, dan bukan dideklarasikan sebagai anak modul dari modul `front_of_house`. Aturan kompiler untuk mengecek file mana yang harus diperiksa untuk kode modul mana membuat direktori dan file lebih sesuai dengan pohon modul.
ko: 만약 대신 _hosting.cairo_ 를 _src_ 디렉토리에 넣는다면, 컴파일러는 _hosting.cairo_ 코드가 크레이트 루트에서 선언된 `hosting` 모듈에 있어야 하며 `front_of_house` 모듈의 하위로 선언되어서는 안 된다고 예상할 것입니다. 컴파일러가 어떤 모듈의 코드를 어떤 파일에서 확인해야 하는지에 대한 규칙은 디렉토리와 파일이 모듈 트리와 더 밀접하게 일치하도록 합니다.

source: We’ve moved each module’s code to a separate file, and the module tree remains the same. The function calls in `eat_at_restaurant` will work without any modification, even though the definitions live in different files. This technique lets you move modules to new files as they grow in size.
id: Kami telah memindahkan kode setiap modul ke file terpisah, dan pohon modul tetap sama. Panggilan fungsi dalam `eat_at_restaurant` akan berfungsi tanpa modifikasi apa pun, meskipun definisinya berada di file yang berbeda. Teknik ini memungkinkan Anda memindahkan modul ke file baru ketika ukurannya berkembang.
ko: 우리는 각 모듈의 코드를 별도의 파일로 옮겼고, 모듈 트리는 그대로 유지되었습니다. `eat_at_restaurant`에서의 함수 호출은 수정 없이 작동할 것이며, 정의는 다른 파일에 존재하더라도 문제 없이 작동합니다. 이 기술을 사용하면 모듈이 커지면 새 파일로 모듈을 이동할 수 있습니다.

source: Note that the `use restaurant::front_of_house::hosting` statement in _src/lib.cairo_ also hasn’t changed, nor does `use` have any impact on what files are compiled as part of the crate. The `mod` keyword declares modules, and Cairo looks in a file with the same name as the module for the code that goes into that module.
id: Perlu dicatat bahwa pernyataan `use restaurant::front_of_house::hosting` di _src/lib.cairo_ juga tidak berubah, dan `use` tidak memiliki dampak pada file mana yang dikompilasi sebagai bagian dari krate. Kata kunci `mod` mendeklarasikan modul, dan Cairo mencari kode yang masuk ke dalam modul itu dalam sebuah file dengan nama yang sama dengan modul tersebut.
ko: _src/lib.cairo_ 파일의 `use restaurant::front_of_house::hosting` 문장도 변경되지 않았습니다. `use`는 크레이트의 일부로 컴파일되는 파일에 영향을 미치지 않습니다. `mod` 키워드는 모듈을 선언하며, Cairo는 모듈 이름과 동일한 이름을 가진 파일에서 해당 모듈에 들어가는 코드를 찾습니다.

source: Cairo lets you split a package into multiple crates and a crate into modules so you can refer to items defined in one module from another module. You can do this by specifying absolute or relative paths. These paths can be brought into scope with a `use` statement so you can use a shorter path for multiple uses of the item in that scope. Module code is public by default.
id: Cairo memungkinkan Anda membagi paket menjadi beberapa krate dan sebuah krate menjadi modul sehingga Anda dapat merujuk ke item yang didefinisikan di satu modul dari modul lainnya. Anda dapat melakukannya dengan menentukan path absolute atau relative. Path ini dapat dimasukkan ke dalam cakupan dengan pernyataan `use` sehingga Anda dapat menggunakan path yang lebih pendek untuk beberapa penggunaan item dalam cakupan tersebut. Kode modul bersifat publik secara default.
ko: 카이로는 패키지를 여러 개의 크레이트로 분할하고 크레이트를 모듈로 분할할 수 있어서 한 모듈에서 정의된 항목을 다른 모듈에서 참조할 수 있습니다. 이를 절대 경로 또는 상대 경로를 지정하여 수행할 수 있습니다. 이러한 경로는 `use` 문으로 스코프 내에서 항목을 여러 번 사용할 때 더 짧은 경로를 사용할 수 있도록 가져올 수 있습니다. 모듈 코드는 기본적으로 공개(public)입니다.

source: Generic Types and Traits
id: Generic Types dan Traits
ko: 일반 유형 및 특성

source: Every programming language has tools for effectively handling the duplication of concepts. In Cairo, one such tool is generics: abstract stand-ins for concrete types or other properties. We can express the behavior of generics or how they relate to other generics without knowing what will be in their place when compiling and running the code.
id: Setiap bahasa pemrograman memiliki alat untuk menangani duplikasi konsep secara efektif. Dalam Cairo, salah satu alat tersebut adalah generics: pengganti abstrak untuk tipe konkret atau properti lainnya. Kita dapat mengekspresikan perilaku generics atau bagaimana mereka berhubungan dengan generics lain tanpa mengetahui apa yang akan menggantikan mereka saat mengompilasi dan menjalankan kode.
ko: 모든 프로그래밍 언어에는 개념의 중복을 효과적으로 처리하는 도구가 있습니다. 카이로에서는 이러한 도구 중 하나가 제네릭입니다: 구체적인 유형이나 다른 속성을 대신하는 추상적인 대리인들입니다. 우리는 컴파일하고 코드를 실행할 때 그 자리에 무엇이 올지 모르는 제네릭의 동작이나 다른 제네릭과의 관련을 표현할 수 있습니다.
zh_cn: 每一个编程语言都有高效处理重复概念的工具。在 Cairo 中其工具之一就是 泛型（generics）。泛型是具体类型或其他属性的抽象替代。我们可以表达泛型的属性，比如他们的行为或如何与其他泛型相关联，而不需要在编写和编译代码时知道他们在这里实际上代表什么。

source: Functions, structs, enums and traits can incorporate generic types as part of their definition instead of a concrete type like `u32` or `ContractAddress`.
id: Fungsi, struktur, enumerasi, dan trait dapat menggabungkan tipe generik sebagai bagian dari definisi mereka, bukan tipe konkret seperti `u32` atau `ContractAddress`.
ko: 함수, 구조체, 열거형 및 트레이트는 `u32` 또는 `ContractAddress`와 같은 구체적인 유형 대신에 정의의 일부로 제네릭 유형을 포함할 수 있습니다.
zh_cn: 函数、结构体、枚举和trait可以将泛型作为其定义的一部分，而不是像`u32`或`ContractAddress`这样的具体类型。

source: Generics allow us to replace specific types with a placeholder that represents multiple types to remove code duplication.
es: Los genéricos nos permiten reemplazar tipos específicos con un marcador de posición que representa múltiples tipos para eliminar la duplicación de código.
id: Generics memungkinkan kita untuk mengganti tipe tertentu dengan suatu tempat penampung yang mewakili beberapa tipe untuk menghilangkan duplikasi kode.
ko: 제네릭을 사용하면 특정 유형을 대체하여 여러 유형을 나타내는 자리 표시자로 코드 중복을 제거할 수 있습니다.
zh_cn: 泛型允许我们用一个代表多种类型的占位符来替换特定的类型，以消除代码的重复。

source: For each concrete type that replaces a generic type the compiler creates a new definition, reducing development time for the programmer, but code duplication at compile level still exists. This may be of importance if you are writing Starknet contracts and using a generic for multiple types which will cause contract size to increment.
es: Para cada tipo concreto que reemplaza a un tipo genérico, el compilador crea una nueva definición, reduciendo el tiempo de desarrollo para el programador, pero la duplicación de código a nivel de compilación todavía existe. Esto puede ser importante si estás escribiendo contratos Starknet y usando un genérico para múltiples tipos que hará que el tamaño del contrato aumente.
id: Untuk setiap tipe konkret yang menggantikan tipe generik, kompiler membuat definisi baru, mengurangi waktu pengembangan bagi pemrogram, tetapi duplikasi kode pada tingkat kompilasi masih ada. Ini dapat menjadi penting jika Anda menulis kontrak Starknet dan menggunakan generic untuk beberapa tipe yang akan menyebabkan peningkatan ukuran kontrak.
ko: 각각의 일반 타입을 대체하는 구체적인 타입마다 컴파일러는 새로운 정의를 생성하며, 이는 프로그래머의 개발 시간을 줄이지만 컴파일 레벨에서 코드 중복이 여전히 존재합니다. 이는 Starknet 계약을 작성하고 여러 타입에 대해 일반 타입을 사용하는 경우 계약 크기가 증가할 수 있기 때문에 중요할 수 있습니다.
zh_cn: 对于每一个取代泛型的具体类型，编译器都会创建一个新的定义，从而减少程序员的开发时间，但在编译层面上的代码重复仍然存在。如果你正在编写Starknet合约，并为多个类型使用一个泛型，这将导致合约大小的增加，这可能是很重要的。

source: Then you’ll learn how to use traits to define behavior in a generic way. You can combine traits with generic types to constrain a generic type to accept only those types that have a particular behavior, as opposed to just any type.
es: Luego aprenderás cómo usar traits para definir comportamientos de manera genérica. Puedes combinar traits con tipos genéricos para restringir un tipo genérico para que acepte solo aquellos tipos que tienen un comportamiento particular, en lugar de cualquier tipo.
id: Selanjutnya, Anda akan belajar bagaimana menggunakan trait untuk mendefinisikan perilaku secara generik. Anda dapat menggabungkan trait dengan tipe generik untuk membatasi tipe generik agar hanya menerima tipe-tipe yang memiliki perilaku tertentu, bukan hanya tipe apa pun.
ko: 그럼 특성을 사용하여 행동을 일반적인 방식으로 정의하는 방법을 배우게 됩니다. 특성을 일반 타입과 결합하여 특정 행동을 가진 타입만 허용하도록 제네릭 타입을 제한할 수 있습니다. 그냥 어떤 타입이든 허용하는 것과는 달리 특정 행동을 가진 타입만 허용하도록 할 수 있습니다.
zh_cn: 之后你将学习 trait，这是一个定义泛型行为的方法。trait 可以与泛型结合来将泛型限制为只接受拥有特定行为的类型，而不是任意类型。

source: We use generics to create definitions for item declarations, such as structs and functions, which we can then use with many different concrete data types. In Cairo we can use generics when defining functions, structs, enums, traits, implementations and methods! In this chapter we are going to take a look at how to effectively use generic types with all of them.
es: Usamos genéricos para crear definiciones de elementos, como estructuras y funciones, que luego podemos utilizar con muchos tipos de datos concretos diferentes. En Cairo podemos usar genéricos al definir funciones, structs, enums, traits, implementaciones y métodos. En este capítulo vamos a ver cómo utilizar de manera efectiva los tipos genéricos con todos ellos.
id: Kita menggunakan generics untuk membuat definisi untuk deklarasi item, seperti structs dan functions, yang kemudian dapat kita gunakan dengan banyak tipe data konkret yang berbeda. Di Cairo, kita dapat menggunakan generics saat mendefinisikan functions, structs, enums, traits, implementations, dan methods! Pada bab ini, kita akan melihat bagaimana cara menggunakan tipe generik secara efektif dengan semuanya itu.
ko: 우리는 제네릭을 사용하여 구조체 및 함수와 같은 항목 선언을 위한 정의를 만들고, 그런 다음 여러 가지 다른 구체적인 데이터 유형과 함께 사용할 수 있습니다. 카이로에서는 함수, 구조체, 열거형, 트레이트, 구현 및 메서드를 정의할 때 제네릭을 사용할 수 있습니다! 이 장에서는 이러한 모든 것들과 효과적으로 제네릭 유형을 사용하는 방법을 살펴볼 것입니다.
zh_cn: 我们可以使用泛型为像函数签名或结构体这样的项创建定义，这样它们就可以用于多种不同的具体数据类型。在Cairo中，我们可以在定义函数、结构、枚举、trait、实现和方法时使用泛型！在本章中，我们将看看在这些被提到的领域中如何有效地使用泛型。

source: When defining a function that uses generics, we place the generics in the function signature, where we would usually specify the data types of the parameter and return value. For example, imagine we want to create a function which given two `Array` of items, will return the largest one. If we need to perform this operation for lists of different types, then we would have to redefine the function each time. Luckily we can implement the function once using generics and move on to other tasks.
es: Cuando definimos una función que utiliza genéricos, colocamos los genéricos en la firma de la función, donde normalmente especificaríamos los tipos de datos del parámetro y del valor de retorno. Por ejemplo, imaginemos que queremos crear una función que, dados dos `Array` de elementos, devuelva el mayor de ellos. Si necesitamos realizar esta operación para listas de distintos tipos, tendríamos que redefinir la función cada vez. Por suerte podemos implementar la función una vez usando genéricos y pasar a otras tareas.
id: Saat mendefinisikan sebuah fungsi yang menggunakan generics, kita menempatkan generics dalam tanda tangan fungsi, di mana kita biasanya akan menentukan tipe data dari parameter dan nilai kembalian. Sebagai contoh, bayangkan kita ingin membuat sebuah fungsi yang, diberikan dua `Array` item, akan mengembalikan yang terbesar. Jika kita perlu melakukan operasi ini untuk daftar berbagai jenis, maka kita harus mendefinisikan ulang fungsi tersebut setiap kali. Untungnya, kita dapat mengimplementasikan fungsi ini sekali menggunakan generics dan melanjutkan ke tugas-tugas lainnya.
ko: 제네릭을 사용하는 함수를 정의할 때, 일반적으로 매개변수와 반환 값의 데이터 유형을 지정하는 곳에 제네릭을 배치합니다. 예를 들어, 두 개의 항목 'Array'를 제공하면 더 큰 항목을 반환하는 함수를 만들고 싶다고 가정해보십시오. 서로 다른 유형의 목록에 대해 이 작업을 수행해야 한다면 매번 함수를 재정의해야 합니다. 다행히도 우리는 한 번의 제네릭을 사용하여 함수를 구현하고 다른 작업으로 넘어갈 수 있습니다.
zh_cn: 当定义一个使用泛型的函数时，本来在函数签名中指定参数和返回值的类型的地方，会改用泛型来表示。例如，假设我们想创建一个函数，给定两个 `Array` 项，函数将返回最大的一个。如果我们需要对不同类型的列表进行这种操作，那么我们就必须每次都重新定义这个函数。幸运的是，我们可以使用泛型来实现这个函数，然后继续完成其他任务。

source: // Specify generic type T between the angulars
ko: // 각괄호 사이에 일반 유형 T를 지정합니다.

source: // There is no need to specify the concrete type of T because // it is inferred by the compiler
ko: // 컴파일러에 의해 추론되기 때문에 T의 구체적인 유형을 지정할 필요가 없습니다.

source: The `largest_list` function compares two lists of the same type and returns the one with more elements and drops the other. If you compile the previous code, you will notice that it will fail with an error saying that there are no traits defined for dropping an array of a generic type. This happens because the compiler has no way to guarantee that an `Array<T>` is droppable when executing the `main` function. In order to drop an array of `T`, the compiler must first know how to drop `T`. This can be fixed by specifying in the function signature of `largest_list` that `T` must implement the drop trait. The correct function definition of `largest_list` is as follows:
es: La función `largest_list` compara dos listas del mismo tipo y devuelve la que tiene más elementos y elimina la otra. Si compilas el código anterior, notarás que fallará con un error diciendo que no hay traits definidos para soltar un array de un tipo genérico. Esto ocurre porque el compilador no tiene forma de garantizar que un `Array<T>` es soltable al ejecutar la función `main`. Para poder soltar un array de `T`, el compilador debe saber primero como soltar `T`. Esto puede solucionarse especificando en la firma de la función `largest_list` que `T` debe implementar el rasgo drop. La definición correcta de la función `largest_list` es la siguiente:
id: Fungsi `largest_list` membandingkan dua daftar dengan tipe yang sama dan mengembalikan yang memiliki lebih banyak elemen sementara yang lain dihapus. Jika Anda mengompilasi kode sebelumnya, Anda akan melihat bahwa akan gagal dengan pesan kesalahan yang menyatakan bahwa tidak ada trait yang didefinisikan untuk menghapus sebuah array dari tipe generik. Hal ini terjadi karena kompiler tidak memiliki cara untuk menjamin bahwa sebuah `Array<T>` dapat dihapus saat menjalankan fungsi `main`. Untuk menghapus sebuah array dari `T`, kompiler harus pertama-tama tahu bagaimana cara menghapus `T`. Ini dapat diperbaiki dengan menentukan dalam tanda tangan fungsi `largest_list` bahwa `T` harus mengimplementasikan trait drop. Definisi fungsi `largest_list` yang benar adalah sebagai berikut:
ko: `largest_list` 함수는 동일한 유형의 두 목록을 비교하고 요소가 더 많은 것을 반환하고 다른 것을 삭제합니다. 이전 코드를 컴파일하면, 일반 유형의 배열을 삭제하는 데 정의된 특성이 없다는 오류가 발생하여 실패한다는 것을 알 수 있습니다. 이는 컴파일러가 `main` 함수를 실행할 때 `Array<T>`가 삭제 가능하다는 것을 보장할 방법이 없기 때문에 발생합니다. `T`의 배열을 삭제하려면 컴파일러가 먼저 `T`를 삭제하는 방법을 알아야 합니다. 이는 `largest_list` 함수의 함수 서명에서 `T`가 삭제 특성을 구현해야 한다고 지정하여 수정할 수 있습니다. `largest_list`의 올바른 함수 정의는 다음과 같습니다:
zh_cn: 名为`largest_list`函数比较了两个相同类型的列表，返回具有更多元素的那一个，并丢弃另一个。如果你编译前面的代码，你会注意到它会出错，说没有为丢弃一个泛型的数组定义trait。这是因为编译器没有办法保证在执行`main`函数时，`Array<T>`是可以丢弃的。为了丢弃一个`T`的数组，编译器必须首先知道如何丢弃`T`。可以通过在`largest_list`的函数签名中规定`T`必须实现drop trait来解决这个问题。`largest_list`的正确函数定义如下：

source: The new `largest_list` function includes in its definition the requirement that whatever generic type is placed there, it must be droppable. The `main` function remains unchanged, the compiler is smart enough to deduce which concrete type is being used and if it implements the `Drop` trait.
id: Fungsi `largest_list` yang baru memasukkan dalam definisinya persyaratan bahwa tipe generik apa pun yang ditempatkan di sana, harus dapat dihapus. Fungsi `main` tetap tidak berubah, kompiler cukup cerdas untuk menyimpulkan tipe konkret apa yang digunakan dan apakah itu mengimplementasikan trait `Drop`.
ko: 새로운 `largest_list` 함수에는 제네릭 타입이 무엇이든 드롭 가능해야 한다는 요구 사항이 포함되어 있습니다. `main` 함수는 변경되지 않았으며, 컴파일러는 사용되는 구체적인 타입이 무엇이며 `Drop` 트레이트를 구현했는지를 추론하는 데 충분히 똑똑합니다.
zh_cn: 新的`largest_list`函数在其定义中包含了一个要求，即无论什么泛型被放在那里，它都必须是可丢弃的。`main`函数保持不变，编译器足够聪明，可以得出正在使用的具体类型以及它是否实现了`Drop`这个trait。

source: Constraints for Generic Types
id: Kendala untuk Generic Types
ko: 일반 유형에 대한 제약 조건

source: When defining generic types, it is useful to have information about them. Knowing which traits a generic type implements allow us to use them more effectively in a functions logic at the cost of constraining the generic types that can be used with the function. We saw an example of this previously by adding the `TDrop` implementation as part of the generic arguments of `largest_list`. While `TDrop` was added to satisfy the compiler's requirements, we can also add constraints to benefit our function logic.
id: Saat mendefinisikan tipe generik, penting untuk memiliki informasi tentang mereka. Mengetahui trait mana yang diimplementasikan oleh tipe generik memungkinkan kita menggunakan mereka dengan lebih efektif dalam logika fungsi dengan biaya membatasi tipe generik yang dapat digunakan dengan fungsi tersebut. Kami melihat contoh ini sebelumnya dengan menambahkan implementasi `TDrop` sebagai bagian dari argumen generik dari `largest_list`. Sementara `TDrop` ditambahkan untuk memenuhi persyaratan kompiler, kita juga dapat menambahkan kendala untuk mendukung logika fungsi kita.
ko: 일반 유형을 정의할 때, 그들에 대한 정보를 가지고 있는 것이 유용합니다. 일반 유형이 구현하는 특성을 알면 함수 논리에서 더 효과적으로 사용할 수 있지만, 함수와 함께 사용할 수 있는 일반 유형을 제한하는 비용이 발생합니다. 이전에 `largest_list`의 일반 인수로 `TDrop` 구현을 추가함으로써 이에 대한 예를 볼 수 있었습니다. `TDrop`은 컴파일러의 요구 사항을 충족시키기 위해 추가되었지만, 함수 논리에 이점을 얻기 위해 제약 조건을 추가할 수도 있습니다.
zh_cn: 在定义泛型的时候，掌握关于它们的信息是很有用的。知道一个泛型实现了哪些trait，可以让我们在函数逻辑中更有效地使用它们，代价是限制了可以与函数一起使用的泛型。我们之前看到了一个例子，就是将`TDrop`的实现作为`largest_list`的泛型参数的一部分。虽然 `TDrop`是为了满足编译器的要求而添加的，但我们也可以添加一些约束条件以有利于我们的函数逻辑。

source: Imagine that we want, given a list of elements of some generic type `T`, to find the smallest element among them. Initially, we know that for an element of type `T` to be comparable, it must implement the `PartialOrd` trait. The resulting function would be:
id: Bayangkan bahwa kita ingin, diberikan sebuah daftar elemen dari suatu tipe generik `T`, untuk menemukan elemen terkecil di antara mereka. Awalnya, kita tahu bahwa untuk sebuah elemen tipe `T` agar dapat dibandingkan, ia harus mengimplementasikan trait `PartialOrd`. Fungsi yang dihasilkan akan menjadi:
ko: 일반적인 유형 `T`의 요소 목록이 주어졌을 때, 그 중에서 가장 작은 요소를 찾고 싶다고 상상해보십시오. 처음에는 유형 `T`의 요소가 비교 가능하려면 `PartialOrd` 트레이트를 구현해야 한다는 것을 알고 있습니다. 결과 함수는 다음과 같을 것입니다:
zh_cn: 想象一下，我们想，给定一个通用类型`T`的元素列表，找到其中最小的元素。首先，我们知道要使一个`T`类型的元素具有可比性，它必须实现`PartialOrd`这个trait。由此产生的函数将是：

source: // Given a list of T get the smallest one. // The PartialOrd trait implements comparison operations for T
ko: // T 목록이 주어지면 가장 작은 값을 가져옵니다. // PartialOrd 트레이트는 T에 대한 비교 연산을 구현합니다.

source: // This represents the smallest element through the iteration // Notice that we use the desnap (*) operator
ko: // 이는 반복을 통해 가장 작은 요소를 나타냅니다 // desnap (*) 연산자를 사용한다는 점에 유의하세요

source: // The index we will use to move through the list
ko: // 우리가 목록을 통해 이동하는 데 사용할 인덱스

source: // Iterate through the whole list storing the smallest
ko: 전체 목록을 반복하면서 가장 작은 값을 저장합니다.

source: // We need to specify that we are passing a snapshot of `list` as an argument
ko: 우리는 `list`의 스냅샷을 인수로 전달하고 있다는 것을 명시해야 합니다.
