Repository: cairo-book/cairo-book
Catalog: po/*.po
Languages: es, id, ko, zh_cn

source: This system call includes the message parameters as part of the proof’s output and exposes these parameters to the `StarknetCore` contract on L1 once the state update, including the transaction, is received.
ko: 이 시스템 호출은 증명의 출력의 일부로 메시지 매개변수를 포함하며, 상태 업데이트 및 트랜잭션을 포함한 후에 이러한 매개변수를 L1의 `StarknetCore` 계약에 노출합니다.

source: For more information, see Starknet’s [messaging mechanism](https://docs.starknet.io/documentation/architecture_and_concepts/Network_Architecture/messaging-mechanism/).
ko: 더 많은 정보를 원하시면 Starknet의 [메시징 메커니즘](https://docs.starknet.io/documentation/architecture_and_concepts/Network_Architecture/messaging-mechanism/)을 참조하세요.

source: _`to_address`_: The recipient’s L1 address.
ko: _`to_address`_: 수신자의 L1 주소.

source: _`payload`_: The array containing the message payload.
ko: `payload`: 메시지 페이로드를 포함하는 배열입니다.

source: The following example sends a message whose content is `(1,2)` to the L1 contract whose address is `3423542542364363`.
ko: 다음 예제는 내용이 `(1,2)`인 메시지를 주소가 `3423542542364363`인 L1 계약에 보냅니다.

source: [syscalls.cairo](https://github.com/starkware-libs/cairo/blob/cca08c898f0eb3e58797674f20994df0ba641983/corelib/src/starknet/syscalls.cairo#L51)
ko: [syscalls.cairo](https://github.com/starkware-libs/cairo/blob/cca08c898f0eb3e58797674f20994df0ba641983/corelib/src/starknet/syscalls.cairo#L51) [syscalls.cairo](https://github.com/starkware-libs/cairo/blob/cca08c898f0eb3e58797674f20994df0ba641983/corelib/src/starknet/syscalls.cairo#L51)

source: Once `replace_class` is called, the class of the calling contract (i.e. the contract whose address is returned by `get_contract_address` at the time the syscall is called) will be replaced by the class whose hash is given by the class_hash argument.
ko: `replace_class`가 호출되면 호출된 계약의 클래스(즉, syscall이 호출될 때 `get_contract_address`에 의해 반환된 주소를 가진 계약)은 class_hash 인수로 주어진 해시에 의해 지정된 클래스로 대체됩니다.

source: After calling `replace_class`, the code currently executing from the old class will finish running.
ko: `replace_class`를 호출한 후에는, 이전 클래스에서 현재 실행 중인 코드가 완료될 것입니다.

source: The new class will be used from the next transaction onwards or if the contract is called via the `call_contract` syscall in the same transaction (after the replacement).
ko: 새로운 클래스는 다음 거래부터 사용되거나 계약이 `call_contract` 시스템 호출을 통해 동일한 거래에서 호출될 때(대체 후) 사용됩니다.

source: _`class_hash`_: The hash of the class you want to use as a replacement.
ko: _`class_hash`_: 교체로 사용하려는 클래스의 해시입니다.

source: `storage_read`
ko: `저장소_읽기`

source: Gets the value of a key in the storage of the calling contract.
ko: 호출된 계약의 저장소에서 키의 값을 가져옵니다.

source: This system call provides direct access to any possible key in storage, in contrast with `var.read()`, which enables you to read storage variables that are defined explicitly in the contract.
ko: 이 시스템 호출은 `var.read()`와 대조적으로 저장소에 있는 모든 가능한 키에 직접 액세스할 수 있습니다. `var.read()`는 계약에서 명시적으로 정의된 저장소 변수를 읽을 수 있도록 합니다.

source: For information on accessing storage by using the storage variables, see [storage variables](https://docs.starknet.io/documentation/architecture_and_concepts/Smart_Contracts/contract-storage/#storage_variables).
ko: 저장 변수를 사용하여 저장소에 액세스하는 방법에 대한 정보는 [저장 변수](https://docs.starknet.io/documentation/architecture_and_concepts/Smart_Contracts/contract-storage/#storage_variables)를 참조하십시오.

source: _`address_domain`_: The domain of the key, used to separate between different data availability modes. This separation is used in Starknet to offer different data availability modes. Currently, only the onchain mode (where all updates go to L1), indicated by domain `0`, is supported. Other address domains which will be introduced in the future will behave differently in terms of publication (in particular, they will not be posted on L1, creating a tradeoff between cost and security).
ko: _address_domain_: 키의 도메인은 서로 다른 데이터 가용성 모드를 구분하는 데 사용됩니다. 이 분리는 Starknet에서 서로 다른 데이터 가용성 모드를 제공하는 데 사용됩니다. 현재는 도메인 `0`으로 표시된 온체인 모드(모든 업데이트가 L1로 이동하는 모드)만 지원됩니다. 향후 도입될 다른 주소 도메인은 게시 방식에서 다르게 작동하며(특히, L1에 게시되지 않으므로 비용과 보안 사이의 균형을 유지합니다).

source: _`address`_: The requested storage address.
ko: _`주소`_: 요청된 저장 주소.

source: The value of the key, of type `SyscallResult<felt252>`.
ko: 키의 값은 `SyscallResult<felt252>` 유형입니다.

source: [syscalls.cairo](https://github.com/starkware-libs/cairo/blob/cca08c898f0eb3e58797674f20994df0ba641983/corelib/src/starknet/syscalls.cairo#L60)
ko: [syscalls.cairo](https://github.com/starkware-libs/cairo/blob/cca08c898f0eb3e58797674f20994df0ba641983/corelib/src/starknet/syscalls.cairo#L60) [syscalls.cairo](https://github.com/starkware-libs/cairo/blob/cca08c898f0eb3e58797674f20994df0ba641983/corelib/src/starknet/syscalls.cairo#L60)

source: `storage_write`
ko: `저장소_쓰기`

source: Sets the value of a key in the storage of the calling contract.
ko: 호출하는 계약의 저장소에 있는 키의 값을 설정합니다.

source: This system call provides direct access to any possible key in storage, in contrast with `var.write()`, which enables you to write to storage variables that are defined explicitly in the contract.
ko: 이 시스템 호출은 저장소의 가능한 모든 키에 직접 액세스할 수 있도록 제공하며, 명시적으로 계약에서 정의된 저장소 변수에 쓸 수 있게 하는 `var.write()`와 대조적입니다.

source: _`value`_: The value to write to the key.
ko: _`value`_: 키에 쓸 값.

source: Contract Dispatchers, Library Dispachers and system calls
es: Despachadores de contratos, despachadores de librerías y llamadas del sistema
id: Pengirim Kontrak, Pengirim Pustaka, dan pemanggilan sistem
zh_cn: 合约调度器、库调度器和系统调用

source: L1 <> L2 Messaging
zh_cn: L1 <> L2 间信息传递

source: # The Cairo Programming Language
es: El Lenguaje de Programación Cairo
zh_cn: # Cairo编程语言

source: by the Cairo Community and its [contributors](https://github.com/cairo-book/cairo-book.github.io). Special thanks to [Starkware](https://starkware.co/) through [OnlyDust](https://www.onlydust.xyz/), and [Voyager](https://voyager.online/) for supporting the creation of this book.
es: creado por la Comunidad Cairo y sus [colaboradores](https://github.com/cairo-book/cairo-book.github.io). Un agradecimiento especial a [Starkware](https://starkware.co/) a través de [OnlyDust](https://www.onlydust.xyz/), y [Voyager](https://voyager.online/) por apoyar la creación de este libro.
id: dari Komunitas Cairo dan [kontributornya](https://github.com/cairo-book/cairo-book.github.io). Terima kasih khusus kepada [Starkware](https://starkware.co/) melalui [OnlyDust](https://www.onlydust.xyz/), dan [Voyager](https://voyager.online/) atas dukungannya dalam pembuatan buku ini.
zh_cn: 由Cairo社区和它的[贡献者们](https://github.com/cairo-book/cairo-book.github.io)创作。特别感谢[Starkware](https://starkware.co/)通过[OnlyDust](https://www.onlydust.xyz/)和[Voyager](https://voyager.online/)支持这本书的创作。 中文版由[StarknetAstro](https://starknet-astro.super.site/)翻译。

source: This version of the text assumes you’re using the [Cairo Compiler](https://github.com/starkware-libs/cairo) [version 2.2.0](https://github.com/starkware-libs/cairo/releases). See the “Installation” section of Chapter 1 to install or update Cairo.
id: Versi teks ini diasumsikan Anda menggunakan [Compiler Cairo](https://github.com/starkware-libs/cairo) [versi 2.2.0](https://github.com/starkware-libs/cairo/releases). Lihat bagian "Instalasi" dari Bab 1 untuk menginstal atau memperbarui Cairo.
zh_cn: 本版本假设你使用的是 Cairo v2.2.0，请参阅第一章的 "安装 "部分来安装或更新 Cairo。

source: # Foreword
es: # Prólogo
zh_cn: # 前言

source: — The Cairo community
es: — La comunidad de Cairo
zh_cn: — Cairo社区

source: # Introduction
es: # Introducción
zh_cn: # 介绍

source: ## What is Cairo?
es: ## ¿Qué es Cairo?
zh_cn: ## 什么是Cairo？

source: Cairo is a programming language designed for a virtual CPU of the same name. The unique aspect of this processor is that it was not created for the physical constraints of our world but for cryptographic ones, making it capable of efficiently proving the execution of any program running on it. This means that you can perform time consuming operations on a machine you don't trust, and check the result very quickly on a cheaper machine. While Cairo 0 used to be directly compiled to CASM, the Cairo CPU assembly, Cairo 1 is a more high level language. It first compiles to Sierra, an intermediate representation of Cairo which will compile later down to a safe subset of CASM. The point of Sierra is to ensure your CASM will always be provable, even when the computation fails.
es: Cairo es un lenguaje de programación diseñado para una CPU virtual del mismo nombre. El aspecto único de este procesador es que no fue creado para las restricciones físicas de nuestro mundo, sino para las criptográficas, lo que lo hace capaz de probar eficientemente la ejecución de cualquier programa que se ejecute en él. Esto significa que puedes realizar operaciones que consumen mucho tiempo en una máquina en la que no confías, y comprobar el resultado muy rápidamente en una máquina más barata. Mientras que Cairo 0 solía compilarse directamente a CASM, el ensamblador de CPU de Cairo, Cairo 1 es un lenguaje de más alto nivel. Primero compila a Sierra, una representación intermedia de Cairo que compilará más tarde a un subconjunto seguro de CASM. El objetivo de Sierra es garantizar que tu CASM sea siempre demostrable, incluso cuando falle el cálculo.
zh_cn: Cairo是一种为同名的虚拟CPU设计的编程语言。这种虚拟处理器的独特之处在于，它不是为我们世界的物理法则而创造的，而是为密码学法则而创造的，这使得它能够有效地证明在其上运行的任何程序。这意味着你可以在一台你不信任的机器上进行耗时的操作，而在一台更便宜的机器上非常迅速地检查结果。 虽然Cairo 0曾经直接编译成CASM，即Cairo CPU汇编，但Cairo 1是一种更高级的语言。它首先编译到Cairo的一个中间表示，Sierra，接着会编译成CASM的一个安全子集。Sierra的意义在于确保你的CASM总是可以证明的，即使计算失败。

source: ## What can you do with it?
es: ## ¿Qué puedes hacer con Cairo?
zh_cn: ## 你能用它做什么？

source: ## What are the differences with other programming languages?
es: ## ¿Cuáles son las diferencias con otros lenguajes de programación?
zh_cn: ## 与其他编程语言有什么区别？

source: - When executed by the prover, it is similar to any other language. Because Cairo is virtualized, and because the operations were not specifically designed for maximum efficiency, this can lead to some performance overhead but it is not the most relevant part to optimize. - When the generated proof is verified by a verifier, it is a bit different. This has to be as cheap as possible since it could potentially be verified on many very small machines. Fortunately verifying is faster than computing and Cairo has some unique advantages to improve it even more. A notable one is non-determinism. This is a topic you will cover in more detail later in this book, but the idea is that you can theoretically use a different algorithm for verifying than for computing. Currently, writing custom non-deterministic code is not supported for the developers, but the standard library leverages non-determinism for improved performance. For example sorting an array in Cairo costs the same price as copying it. Because the verifier doesn't sort the array, it just checks that it is sorted, which is cheaper.
es: - Cuando es ejecutado por el probador (prover), es similar a cualquier otro lenguaje. Debido a que Cairo es virtualizado y las operaciones no fueron diseñadas específicamente para obtener la máxima eficiencia, esto puede generar cierta sobrecarga de rendimiento, pero no es la parte más relevante para optimizar. - Sin embargo, cuando la prueba generada es verificada por un verificador, es un poco diferente. Esto debe ser lo más económico posible, ya que potencialmente podría ser verificado en muchas máquinas muy pequeñas. Afortunadamente, la verificación es más rápida que el cálculo y Cairo tiene algunas ventajas únicas para mejorar aún más este proceso. Una notable es la no determinación. Este es un tema que se tratará con más detalle más adelante en este libro, pero la idea es que teóricamente puedes usar un algoritmo diferente para verificar que para calcular. Actualmente, no se admite la escritura de código no determinista personalizado para los desarrolladores, pero la biblioteca estándar aprovecha la no determinación para mejorar el rendimiento. Por ejemplo, ordenar un arreglo en Cairo tiene el mismo costo que copiarlo. Debido a que el verificador no ordena el arreglo, solo verifica que esté ordenado, lo cual es más barato.
zh_cn: - 当被证明器（prover）执行时，它与其他的编程语言类似。因为Cairo是虚拟化的，而且其操作并未设计为效率最大化，因此可能会导致一些额外性能开销，但这并不是最需要优化的部分。 - 当生成的证明被验证器验证时，情况就有点不同了。这一步必须是尽可能的少消耗计算资源，因为它有可能需要在许多非常慢的机器上进行验证。幸运的是，验证比计算更快，而且Cairo有一些独特的优势，可以进一步提高验证速度。一个值得注意的是非确定性，这是一个将在本书后面详细介绍的话题。其设计理念是，理论上你无需在计算时和验证时使用同一种算法（译注：即在验证时你可以使用比生成证明时更快的算法来减少时间消耗）。目前开发者还不能编写自定义的非确定性代码，但标准库利用非确定性来提高性能。例如，在Cairo中对一个数组进行排序的成本与复制它的成本相同，这是因为验证器只是检查它是否被排序而不是真的对数组进行排序，所以可以减少计算资源消耗。

source: ## References
es: ## Referencias
zh_cn: ## 参考文献

source: - Cairo CPU Architecture: <https://eprint.iacr.org/2021/1063> - Cairo, Sierra and Casm: <https://medium.com/nethermind-eth/under-the-hood-of-cairo-1-0-exploring-sierra-7f32808421f5> - State of non determinism: <https://twitter.com/PapiniShahar/status/1638203716535713798>
es: - Arquitectura del CPU de Cairo: <https://eprint.iacr.org/2021/1063> - Cairo, Sierra y Casm: <https://medium.com/nethermind-eth/under-the-hood-of-cairo-1-0-exploring-sierra-7f32808421f5> - Estado no determinista: <https://twitter.com/PapiniShahar/status/1638203716535713798>
zh_cn: - Cairo CPU架构：<https://eprint.iacr.org/2021/1063> - Cairo, Sierra and Casm：<https://medium.com/nethermind-eth/under-the-hood-of-cairo-1-0-exploring-sierra-7f32808421f5> - 非确定性的状态：<https://twitter.com/PapiniShahar/status/1638203716535713798>

source: # Getting Started
zh_cn: # 入门

source: # Installation
es: # Instalación
zh_cn: # 安装

source: ## Installing Scarb
es: ## Instalando Scarb
zh_cn: ## 安装Scarb

source: ### Requirements
es: ### Requisitos
zh_cn: ### 要求

source: ### Installation
es: ### Instalación
zh_cn: ### 安装

source: To install Scarb, please refer to the [installation instructions](https://docs.swmansion.com/scarb/download). We strongly recommend that you install Scarb [via asdf](https://docs.swmansion.com/scarb/download.html#install-via-asdf), a CLI tool that can manage multiple language runtime versions on a per-project basis. This will ensure that the version of Scarb you use to work on a project always matches the one defined in the project settings, avoiding problems lead to version mismatch. Otherwise, you can simply run the following command in your terminal, and follow the onscreen instructions. This will install the latest stable release of Scarb.
zh_cn: 要安装 Scarb，请参阅 [安装说明](https://docs.swmansion.com/scarb/download)。我们强烈建议您通过 [asdf](https://docs.swmansion.com/scarb/download.html#install-via-asdf) 来安装Scarb 。 这一个 CLI 工具，可以按项目管理多个语言运行时版本。 这将确保您用于处理项目的 Scarb 版本始终与项目设置中定义的版本匹配，从而避免导致版本不匹配的问题。 否则，您只需在终端中运行以下命令，然后按照屏幕上的说明进行操作即可。这将安装 Scarb 的最新稳定版本。

source: - Verify installation by running the following command in new terminal session, it should print both Scarb and Cairo language versions, e.g: ```bash $ scarb --version scarb 2.3.0-rc1 (58cc88efb 2023-08-23) cairo: 2.2.0 (https://crates.io/crates/cairo-lang-compiler/2.2.0) sierra: 1.3.0 ```
zh_cn: - 在新的终端Session里输入以下命令来验证是否安装成功, 终端应该同时打印出Scarb 和 Cairo 的版本号, 比如: ```bash $ scarb --version scarb 2.4.0 (58cc88efb 2023-08-23) cairo: 2.2.0 (https://crates.io/crates/cairo-lang-compiler/2.2.0) sierra: 1.3.0 ```

source: ## Installing the VSCode extension
zh_cn: ## 安装 VSCode 扩展

source: Cairo has a VSCode extension that provides syntax highlighting, code completion, and other useful features. You can install it from the [VSCode Marketplace](https://marketplace.visualstudio.com/items?itemName=starkware.cairo1). Once installed, go into the extension settings, and make sure to tick the `Enable Language Server` and `Enable Scarb` options.
zh_cn: Cairo 有一个 VSCode 扩展，它提供了语法突出显示、代码完成和其他有用的功能。您可以从 [VSCode Marketplace](https://marketplace.visualstudio.com/items?itemName=starkware.cairo1)安装它。 安装后，进入扩展设置，并确保勾选`Enable Language Server` 和`Enable Scarb`选项。

source: Now that you’ve installed Cairo through Scarb, it’s time to write your first Cairo program. It’s traditional when learning a new language to write a little program that prints the text `Hello, world!` to the screen, so we’ll do the same here!
zh_cn: 现在你已经通过Scarb安装了Cairo，是时候编写你的第一个Cairo程序了。 在学习一门新语言时，传统的做法是写一个小程序 将文字`Hello, world!`打印到屏幕上，所以我们在这里也要这样做!

source: > Note: This book assumes basic familiarity with the command line. Cairo makes > no specific demands about your editing or tooling or where your code lives, so > if you prefer to use an integrated development environment (IDE) instead of > the command line, feel free to use your favorite IDE. The Cairo team has developed > a VSCode extension for the Cairo language that you can use to get the features from > the language server and code highlighting. See [Appendix D][devtools] > for more details.
es: > Nota: Este libro asume una familiaridad básica con la línea de comandos. Cairo no hace > ninguna demanda específica sobre su edición o herramientas o donde vive su código, así que si prefiere usar un entorno de desarrollo integrado (IDE) en lugar de la línea de comandos, > siéntase libre de usar su IDE favorito. > la línea de comandos, siéntase libre de usar su IDE favorito. El equipo de Cairo ha desarrollado > una extensión VSCode para el lenguaje Cairo que puedes usar para obtener las características de > el servidor de lenguajes y el resaltado de código. Ver [Apéndice D][devtools] > para más detalles.
zh_cn: > 注意：本书假定对你命令行有基本的了解。Cairo对 > 对你用什么编辑代码或使用什么开发工具或把你的代码放在哪没有特殊要求，所以 > 如果你喜欢使用集成开发环境（IDE）而不是 > 命令行，你完全可以使用你喜欢的IDE。Cairo团队已经开发了 > Cairo语言的VSCode扩展，你可以用它来获得来自 > 语言服务器和代码高亮。参见[附录D][devtools]来获取更多细节。

source: ### Creating a Project Directory
es: ### Creando un Directorio de Proyecto
zh_cn: ### 创建一个项目目录

source: You’ll start by making a directory to store your Cairo code. It doesn’t matter to Cairo where your code lives, but for the exercises and projects in this book, we suggest making a _cairo_projects_ directory in your home directory and keeping all your projects there.
es: Empezarás creando un directorio para almacenar tu código de Cairo. A Cairo no le importa a Cairo dónde vive tu código, pero para los ejercicios y proyectos de este libro, sugerimos hacer un directorio _cairo_projects_ en su directorio home y mantener todos tus proyectos allí.
zh_cn: 你首先要做一个目录来存储你的Cairo代码。对于Cairo来说，你的代码放在哪里并不重要。 但对于本书中的练习和项目来说，我们建议在你的主目录下建立一个 _cairo_projects_ 目录，并将你的所有项目存放在这里。

source: Open a terminal and enter the following commands to make a _cairo_projects_ directory and a directory for the “Hello, world!” project within the _cairo_projects_ directory.
es: Abre un terminal e introduce los siguientes comandos para crear un directorio _cairo_projects_. y un directorio para el proyecto "¡Hola, mundo!" dentro del directorio _cairo_projects_.
zh_cn: 打开一个终端，输入以下命令，建立一个 _cairo_projects_ 目录 并在 _cairo_projects_ 目录下为 "Hello, world!"项目建立一个目录。

source: > Note: From now on, for each example shown in the book, we assume that > you will be working from a Scarb project directory. If you are not using Scarb, and try to run the examples from a different directory, you might need to adjust the commands accordingly or create a Scarb project.
zh_cn: > 注意：从现在起，对于书中显示的每个示例，我们都假定 > 你都是在 Scarb 项目目录中进行编码。如果您没有使用 Scarb，并试图从其他目录运行示例，可能需要相应调整命令或创建一个 Scarb 项目。

source: ### Creating a Project with Scarb
es: ### Creando un Proyecto con Scarb
zh_cn: ### 用Scarb创建一个项目

source: Navigate to your projects directory (or wherever you decided to store your code). Then run the following:
id: Masuk ke direktori proyek Anda (atau di mana pun Anda memutuskan untuk menyimpan kode Anda). Kemudian jalankan perintah berikut:
zh_cn: 导航到你的项目目录（或你决定放代码的地方）。然后运行以下命令：

source: Go into the `hello_world` directory with the command `cd hello_world`. You’ll see that Scarb has generated two files and one directory for us: a `Scarb.toml` file and a src directory with a `lib.cairo` file inside.
id: Masuk ke direktori `hello_world` dengan perintah cd `hello_world`. Anda akan melihat bahwa Scarb telah menghasilkan dua file dan satu direktori untuk kita: sebuah file `Scarb.toml` dan sebuah direktori src dengan file lib.cairo di dalamnya.
zh_cn: 用`cd hello_world`命令进入`hello_world`目录。你会看到Scarb已经为我们生成了两个文件和一个目录：一个`Scarb.toml`文件和一个src目录，里面有一个`lib.cairo`文件。

source: > Note: Git is a common version control system. You can stop using version control system by using the `--vcs` flag. > Run `scarb new -help` to see the available options.
es: > Nota: Git es un sistema de control de versiones común. Puede dejar de usar el sistema de control de versiones > usando la bandera `--vcs`. > Ejecute `scarb new -help` para ver las opciones disponibles.
zh_cn: > 注意：Git是一个常见的版本控制系统。你可以通过使用`--vcs`标志停止使用版本控制系统。 > 运行`scarb new -help`以查看可用选项。

source: <span class="filename">Filename: Scarb.toml</span>
zh_cn: <span class="filename">文件名：Scarb.toml</span>

source: <span class="caption">Listing 1-2: Contents of Scarb.toml generated by `scarb new`</span>
zh_cn: <span class="caption">示例1-2：由`scarb new`生成的Scarb.toml的内容</span>

source: The next two lines set the configuration information Scarb needs to compile your program: the name and the version of Scarb to use.
es: Las siguientes dos líneas establecen la información de configuración que Scarb necesita para compilar su programa: el nombre y la versión de Scarb a utilizar.
id: Dua baris berikutnya menetapkan informasi konfigurasi yang diperlukan Scarb untuk mengompilasi program Anda: nama dan versi Scarb yang akan digunakan.
zh_cn: 接下来的两行设置了Scarb在编译你的程序时需要的配置信息：名称和要使用的Scarb版本。

source: > Note: If you're building contracts for Starknet, you will need to add the `starknet` dependency as mentioned in the [Scarb documentation](https://docs.swmansion.com/scarb/docs/extensions/starknet/starknet-package.html).
zh_cn: > 注意：如果你要为Starknet构建合约，你需要添加[Scarb文档](https://docs.swmansion.com/scarb/docs/extensions/starknet/starknet-package.html)中提到的`starknet`依赖关系。

source: The other file created by Scarb is `src/lib.cairo`, let's delete all the content and put in the following content, we will explain the reason later.
es: El otro archivo creado por Scarb es `src/lib.cairo`, borremos todo el contenido y pongamos el siguiente contenido, explicaremos la razón más adelante.
id: File lain yang dibuat oleh Scarb adalah `src/lib.cairo`, mari kita hapus semua konten dan masukkan konten berikut, kami akan menjelaskan alasannya nanti.
zh_cn: Scarb创建的另一个文件是`src/lib.cairo`，让我们删除其中所有的内容，放入以下内容，我们将在后面解释原因。

source: Then create a new file called `src/hello_world.cairo` and put the following code in it:
id: Kemudian buat file baru bernama `src/hello_world.cairo` dan masukkan yang berikut ini kode di dalamnya:
zh_cn: 然后创建一个名为`src/hello_world.cairo`的新文件，并将以下代码放入其中：

source: <span class="filename">Filename: src/hello_world.cairo</span>
zh_cn: <span class="filename">文件名： src/hello_world.cairo</span>

source: We have just created a file called `lib.cairo`, which contains a module declaration referencing another module named `hello_world`, as well as the file `hello_world.cairo`, containing the implementation details of the `hello_world` module.
id: Kita baru saja membuat file bernama `lib.cairo`, yang berisi moduldeklarasi yang mereferensikan modul lain bernama `hello_world`, serta file `hello_world.cairo`, berisi detail implementasi Modul `hello_world`.
zh_cn: 我们刚刚创建了一个名为`lib.cairo`的文件，其中包含一个模块声明，引用了另一个名为 `hello_world`的模块，以及包含 `hello_world`模块的实现细节的文件`hello_world.cairo`。

source: Scarb requires your source files to be located within the `src` directory.
id: Scarb mengharuskan file sumber Anda ditempatkan di dalam direktori `src`.
zh_cn: Scarb要求你的源文件位于src目录中。
