Repository: cairo-book/cairo-book
Catalog: po/*.po
Languages: es, id, ko, zh_cn

source: Here we demonstrate the implementation of a `struct A` that derives the Store trait. This `struct A` is subsequently used as a storage variable in the contract.
zh_cn: 在这里，我们演示了一个派生了Store trait的`struct A`的实现。这个 `struct A`随后被用作合约中的存储变量。

source: ## PartialOrd and Ord for Ordering Comparisons
es: ## PartialOrd y Ord para Ordenar Comparaciones
zh_cn: ## 用于排序比较的PartialOrd和Ord

source: The `PartialOrd` trait allows for comparison between instances of a type for ordering, thereby enabling the <, <=, >, and >= operators.
zh_cn: `PartialOrd`trait允许在一个类型的实例之间进行排序比较，从而使得我们可以使用 <、<=、> 和 >= 操作符。

source: ## Appendix D - Useful Development Tools
es: ## Apéndice D - Herramientas de Desarrollo Útiles
zh_cn: ## 附录D - 实用开发工具

source: In this appendix, we talk about some useful development tools that the Cairo project provides. We’ll look at automatic formatting, quick ways to apply warning fixes, a linter, and integrating with IDEs.
es: En este apéndice, hablamos de algunas herramientas de desarrollo útiles que el proyecto Cairo proporciona. Veremos el formateo automático, formas rápidas de aplicar correcciones de advertencias, un linter, y la integración con IDEs.
zh_cn: 在本附录中，我们将提到由Cairo项目提供的一些有用的开发工具。 我们将看看自动格式化、快速应用警告修正，linter，以及与IDE的整合。

source: ### Automatic Formatting with `scarb fmt`
zh_cn: ### 用`scarb fmt`自动格式化

source: Scarb projects can be formatted using the `scarb fmt` command. If you're using the cairo binaries directly, you can run `cairo-format` instead. Many collaborative projects use `scarb fmt` to prevent arguments about which style to use when writing Cairo: everyone formats their code using the tool.
zh_cn: Scarb 项目可以使用 `scarb fmt` 命令进行格式化。 如果直接使用 cairo 二进制文件，可以运行 `cairo-format` 代替。 在大多多人合作项目里，每个成员都会使用`scarb fmt` 以防止在编写Cairo时争论使用哪种代码风格。

source: ### IDE Integration Using `cairo-language-server`
es: ### Integración del IDE Usando `cairo-language-server`
zh_cn: ### 使用`cairo-language-server`的IDE集成

source: To help IDE integration, the Cairo community recommends using the [`cairo-language-server`][cairo-language-server]<!-- ignore -->. This tool is a set of compiler-centric utilities that speaks the [Language Server Protocol][lsp]<!-- ignore -->, which is a specification for IDEs and programming languages to communicate with each other. Different clients can use `cairo-language-server`, such as [the Cairo extension for Visual Studio Code][vscode-cairo].
es: Para ayudar con la integración del IDE, la comunidad de Cairo recomienda el uso de [`cairo-language-server`][cairo-language-server]<!-- ignore -->. Esta herramienta es un conjunto de utilidades centradas en el compilador que utiliza el [Protocolo del Servidor de Lenguaje][lsp]<!-- ignore --> que es una especificación para que los IDE y los lenguajes de programación se comuniquen entre sí. Diferentes clientes pueden utilizar `cairo-language-server`, como la extensión [de Cairo extensión para Visual Studio Code][vscode-cairo].
zh_cn: 为了帮助IDE整合，Cairo社区建议使用 [`cairo-language-server`][cairo-language-server]<!-- ignore -->。这是 [Language Server Protocol][lsp]<!-- ignore -->的一套以编译器为中心的实用工具。 它是用于IDE和编程语言互相通信的规范。不同的客户端都可以使用`cairo-language-server`，例如 [Visual Studio Code的Cairo扩展][vscode-cairo]。

source: Visit the `vscode-cairo` [page][vscode-cairo]<!-- ignore --> to install it on VSCode. You will get abilities such as autocompletion, jump to definition, and inline errors.
zh_cn: 请访问 `vscode-cairo` [page][vscode-cairo]<!-- 忽略 --> 将其安装到 VSCode 上。您将获得自动完成、跳转到 定义和内联错误等功能。

source: > Note: If you have Scarb installed, it should work out of the box with the Cairo VSCode extension, without a manual installation of the language server.
zh_cn: > 注意：如果你已安装 Scarb，则无需手动安装语言服务器，即可使用Cairo VSCode 扩展。

source: ## Appendix E - Common Types & Traits and the Cairo Prelude
zh_cn: ## 附录 E - 编写合约所需最常见的类型 和Trait以及Cairo Prelude

source: The Cairo prelude is a collection of commonly used modules, functions, data types, and traits that are automatically brought into scope of every module in a Cairo crate without needing explicit import statements. Cairo's prelude provides the basic building blocks developers need to start Cairo programs and writing smart contracts.
zh_cn: Cairo预设是一个常用模块、函数、数据类型和特性的集合，它们会自动引入到Cairo crate中每个模块的作用域中，无需显式的导入语句。Cairo的预设提供了开发者开始编写Cairo程序和智能合约所需的基本构建块。

source: The core library prelude is defined in the [lib.cairo](https://github.com/starkware-libs/cairo/blob/v2.2.0/corelib/src/lib.cairo) file of the corelib crate and contains Cairo's primitive data types, traits, operators, and utility functions. This includes: Data types - felts, bools, arrays, dicts, etc. Traits - behaviors for arithmetic, comparison, serialization Operators - arithmetic, logical, bitwise Utility functions - helpers for arrays, maps, boxing, etc. The core library prelude delivers the fundamental programming constructs and operations needed for basic Cairo programs, without requiring the explicit import of elements. Since the core library prelude is automatically imported, its contents are available for use in any Cairo crate without explicit imports. This prevents repetition and provides a better devX. This is what allows you to use `ArrayTrait::append()` or the `Default` trait without bringing them explicitly into scope.
zh_cn: 核心库预设定义在 corelib crate 的[lib.cairo](https://github.com/starkware-libs/cairo/blob/v2.2.0/corelib/src/lib.cairo)文件中，包含了Cairo的基本数据类型、traits、操作符和实用函数。其中包括： - 数据类型：felts、bools、arrays、dicts等。 - Traits：用于算术、比较、序列化的行为。 - 操作符：算术、逻辑、位运算符。 - 实用函数：用于数组、映射、包装等的辅助函数。 核心库预设提供了基本的Cairo程序所需的基本编程构造和操作，无需显式导入元素。由于核心库预设被自动导入，其内容可在任何Cairo crate中使用，无需显式导入。这避免了重复工作，提供了更好的开发体验。这就是为什么你可以在不显式引入的情况下使用 `ArrayTrait::append()` 或 `Default` 特性的原因。

source: ### List of common types and traits
zh_cn: ### 常见类型和trait列表

source: The following section provides a brief overview of commonly used types and traits when developing Cairo programs. Most of these are included in the prelude and not required to be imported explicitly - but not all of them.
zh_cn: 以下部分简要概述了在开发Cairo程序时常用的类型和特性。大多数这些都包含在预设中，无需显式导入 - 但并非全部。

source: | Import | Path | Usage | | ------------------------- | ----------------------------------------------------- | -------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------- | | `OptionTrait` | `core::option::OptionTrait` | `OptionTrait<T>` defines a set of methods required to manipulate optional value. | | `ResultTrait` | `core::result::ResultTrait` | `ResultTrait<T, E>` Type for Starknet contract address, a value in the range [0, 2 \*\* 251). | | `ContractAddress` | `starknet::ContractAddress` | `ContractAddress` is a type to represent the smart contract address | | `ContractAddressZeroable` | `starknet::contract_address::ContractAddressZeroable` | `ContractAddressZeroable` is the implementation of the trait `Zeroable` for the `ContractAddress` type. It is required to check whether a value of `t:ContractAddress` is zero or not. | | `contract_address_const` | `starknet::contract_address_const` | The `contract_address_const!` it's a function that allows instantiating constant contract address values. | | `Into` | `traits::Into;` | `Into<T>` is a trait used for conversion between types. If there is an implementation of Into<T,S> for the types T and S, you can convert T into S. | | `TryInto` | `traits::TryInto;` | `TryInto<T>` is a trait used for conversion between types.If there is an implementation of TryInto<T,S> for the types T and S, you can convert T into S. | | `get_caller_address` | `starknet::get_caller_address` | `get_caller_address()` is a function that returns the address of the caller of the contract. It can be used to identify the caller of a contract function. | | `get_contract_address` | `starknet::info::get_contract_address` | `get_contract_address()` is a function that returns the address of the current contract. It can be used to obtain the address of the contract being executed. |
zh_cn: | Import | Path | Usage | | ------------------------- | ----------------------------------------------------- | -------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------- | | `OptionTrait` | `core::option::OptionTrait` | `OptionTrait<T>` 定义了一组操作可选值所需的方法. | | `ResultTrait` | `core::result::ResultTrait` | `ResultTrait<T, E>` 是用于表示Starknet合约地址的类型，其取值范围为[0, 2 \*\* 251). | | `ContractAddress` | `starknet::ContractAddress` | `ContractAddress` 是一种用于表示智能合约地址的类型 | | `ContractAddressZeroable` | `starknet::contract_address::ContractAddressZeroable` | `ContractAddressZeroable` 是对 `ContractAddress` 类型实现的`Zeroable` trait。它用于检查`t:ContractAddress` 的值是否为零。| | `contract_address_const` | `starknet::contract_address_const` | `contract_address_const!` 是一个函数，允许实例化常量合约地址值。 | | `Into` | `traits::Into;` | `Into<T>` 是用于类型转换的 trait。如果对类型T和S存在Into<T,S>的实现，那么可以将T转换为S | | `TryInto` | `traits::TryInto;` | `TryInto<T>` 是用于类型转换的 trait。如果对类型T和S存在TryInto<T,S>的实现，那么可以将T转换为S. | | `get_caller_address` | `starknet::get_caller_address` | `get_caller_address()` 是一个函数，用于返回调用合约的地址。它可以用于识别合约函数的调用者 | | `get_contract_address` | `starknet::info::get_contract_address` | `get_contract_address()` 是一个函数，用于返回当前合约的地址。它可以用于获取正在执行的合约的地址. |

source: This is not an exhaustive list, but it covers some of the commonly used types and traits in contract development. For more details, refer to the official documentation and explore the available libraries and frameworks.
zh_cn: 这并不是一个详尽的列表，但它涵盖了合约开发中一些常用的类型和trait。关于更多的细节，请参考官方文档并参考可用的库以及框架。

source: # Appendix F: Installing the Cairo binaries
zh_cn: # 附录 F：安装Cairo二进制文件

source: ### Prerequisites
es: ### Requisitos previos
zh_cn: ### 先决条件

source: ## Installing Cairo with a Script ([Installer](https://github.com/franalgaba/cairo-installer) by [Fran](https://github.com/franalgaba))
es: ## Instalando Cairo con un Script ([Instalador](https://github.com/franalgaba/cairo-installer) por [Fran](https://github.com/franalgaba))
zh_cn: ## 用脚本安装Cairo（[Installer](https://github.com/franalgaba/cairo-installer) by [Fran](https://github.com/franalgaba))

source: ### Install
es: ### Instalación
zh_cn: ### 安装

source: If you wish to install a specific release of Cairo rather than the latest head, set the `CAIRO_GIT_TAG` environment variable (e.g. `export CAIRO_GIT_TAG=v2.2.0`).
id: Jika Anda ingin menginstal rilis tertentu dari Cairo bukan yang terbaru, atur variabel lingkungan `CAIRO_GIT_TAG` (contoh: `export CAIRO_GIT_TAG=v2.2.0`).
zh_cn: 如果你想安装一个特定的Cairo版本，而不是最新版本，可以设置`CAIRO_GIT_TAG`环境变量（比如执行 `export CAIRO_GIT_TAG=v2.2.0` 来设置）。

source: ### Update
es: ### Actualización
zh_cn: ### 更新

source: ### Uninstall
es: ### Desinstalación
zh_cn: ### 卸载

source: ### Set up your shell environment for Cairo
es: ### Configure su entorno shell para Cairo
zh_cn: ### 为Cairo设置你的shell环境

source: - Define environment variable `CAIRO_ROOT` to point to the path where Cairo will store its data. `$HOME/.cairo` is the default. If you installed Cairo via Git checkout, we recommend to set it to the same location as where you cloned it. - Add the `cairo-*` executables to your `PATH` if it's not already there
es: - Define la variable de entorno `CAIRO_ROOT` para apuntar a la ruta donde Cairo almacenará sus datos. Por defecto es `$HOME/.cairo`. Si instaló Cairo a través de Git checkout, recomendamos la misma ubicación donde lo clonaste. - Añade los ejecutables de `cairo-*` a tu `PATH` si no están ya allí
zh_cn: - 定义环境变量`CAIRO_ROOT`，以指向Cairo存储自身数据的路径。默认为`$HOME/.cairo`。 如果你通过Git checkout安装Cairo，我们建议把它设置到与你Git clone它相同的位置。 - 将`cairo-*`可执行文件添加到你的`PATH`中，如果还没被自动添加的话

source: - For **bash**: Stock Bash startup files vary widely between distributions in which of them source which, under what circumstances, in what order and what additional configuration they perform. As such, the most reliable way to get Cairo in all environments is to append Cairo configuration commands to both `.bashrc` (for interactive shells) and the profile file that Bash would use (for login shells). First, add the commands to `~/.bashrc` by running the following in your terminal: ```bash echo 'export CAIRO_ROOT="$HOME/.cairo"' >> ~/.bashrc echo 'command -v cairo-compile >/dev/null || export PATH="$CAIRO_ROOT/target/release:$PATH"' >> ~/.bashrc ``` Then, if you have `~/.profile`, `~/.bash_profile` or `~/.bash_login`, add the commands there as well. If you have none of these, add them to `~/.profile`. - to add to `~/.profile`: ```bash echo 'export CAIRO_ROOT="$HOME/.cairo"' >> ~/.profile echo 'command -v cairo-compile >/dev/null || export PATH="$CAIRO_ROOT/target/release:$PATH"' >> ~/.profile ``` - to add to `~/.bash_profile`: ```bash echo 'export CAIRO_ROOT="$HOME/.cairo"' >> ~/.bash_profile echo 'command -v cairo-compile >/dev/null || export PATH="$CAIRO_ROOT/target/release:$PATH"' >> ~/.bash_profile ``` - For **Zsh**: ```zsh echo 'export CAIRO_ROOT="$HOME/.cairo"' >> ~/.zshrc echo 'command -v cairo-compile >/dev/null || export PATH="$CAIRO_ROOT/target/release:$PATH"' >> ~/.zshrc ``` If you wish to get Cairo in non-interactive login shells as well, also add the commands to `~/.zprofile` or `~/.zlogin`. - For **Fish shell**: If you have Fish 3.2.0 or newer, execute this interactively: ```fish set -Ux CAIRO_ROOT $HOME/.cairo fish_add_path $CAIRO_ROOT/target/release ``` Otherwise, execute the snippet below: ```fish set -Ux CAIRO_ROOT $HOME/.cairo set -U fish_user_paths $CAIRO_ROOT/target/release $fish_user_paths ```
es: - Para **bash**: Los archivos de inicio de Bash predeterminados varían ampliamente entre las distribuciones , en cuanto a la fuente de ellos, las circunstancias, el orden y la configuración adicional que realizan. Como tal, la forma más confiable de obtener Cairo en todos los entornos es agregar los comandos de configuración de Cairo tanto en `.bashrc` (para shells interactivos) como en el archivo de perfil que Bash utilizaría (para shells de inicio de sesión). En primer lugar, agrega los comandos a `~/.bashrc` ejecutando lo siguiente en tu terminal: ~~~ bash echo 'export CAIRO_ROOT="$HOME/.cairo"' >> ~/.bashrc echo 'command -v cairo-compile >/dev/null || export PATH="$CAIRO_ROOT/target/release:$PATH"' >> ~/.bashrc ~~~ Entonces, si tiene `~/.profile`, `~/.bash_profile` o `~/.bash_login`, añada también allí los comandos. Si no tienes ninguno de estos, añádelos a `~/.profile`. * Para añadir a `~/.profile`: ~~~ bash echo 'export CAIRO_ROOT="$HOME/.cairo"' >> ~/.profile echo 'command -v cairo-compile >/dev/null || export PATH="$CAIRO_ROOT/target/release:$PATH"' >> ~/.profile ~~~ * Para añadir a `~/.bash_profile`: ~~~ bash echo 'export CAIRO_ROOT="$HOME/.cairo"' >> ~/.bash_profile echo 'command -v cairo-compile >/dev/null || export PATH="$CAIRO_ROOT/target/release:$PATH"' >> ~/.bash_profile ~~~ - Para **Zsh**: ~~~ zsh echo 'export CAIRO_ROOT="$HOME/.cairo"' >> ~/.zshrc echo 'command -v cairo-compile >/dev/null || export PATH="$CAIRO_ROOT/target/release:$PATH"' >> ~/.zshrc ~~~ Si también desea obtener Cairo en shells de inicio de sesión no interactivos, añada también los comandos a `~/.zprofile` or `~/.zlogin`. - Para **Fish shell**: Si tiene Fish 3.2.0 o posterior, ejecútelo interactivamente: ~~~ fish set -Ux CAIRO_ROOT $HOME/.cairo fish_add_path $CAIRO_ROOT/target/release ~~~ De lo contrario, ejecute el siguiente fragmento: ~~~ fish set -Ux CAIRO_ROOT $HOME/.cairo set -U fish_user_paths $CAIRO_ROOT/target/release $fish_user_paths ~~~
zh_cn: - 对于**bash** ： 各个发行版间的 Stock Bash 的启动文件在什么情况下调用什么样的文件，以什么顺序执行，并进行哪些额外的配置都存在很大的差异 因此，在所有环境中获得 Cairo 的最可靠方法是将 Cairo 配置命令附加到`.bashrc`（用于交互式shell）和Bash将使用的配置文件中。（用于登录shell）。 首先，通过在终端运行以下命令，将这些命令添加到`~/.bashrc`中： ```bash echo 'export CAIRO_ROOT="$HOME/.cairo"' >> ~/.bashrc echo 'command -v cairo-compile >/dev/null || export PATH="$CAIRO_ROOT/target/release:$PATH"' >> ~/.bashrc ``` 然后，如果你有 `~/.profile`、`~/.bash_profile`或`~/.bash_login`，也将这些命令添加到它们所对应的文件中。如果没有这些文件，则添加到 `~/.profile`中。 - 添加到 `~/.profile` 中： ```bash echo ‘export CAIRO_ROOT=“$HOME/.cairo”’ >> ~/.profile echo ‘command -v cairo-compile >/dev/null || export PATH=“$CAIRO_ROOT/target/release:$PATH”’ >> ~/.profile ``` - 添加到`~/.bash_profile`： ```bash echo 'export CAIRO_ROOT="$HOME/.cairo"' >> ~/.bash_profile echo 'command -v cairo-compile >/dev/null || export PATH="$CAIRO_ROOT/target/release:$PATH"' >> ~/.bash_profile ``` - 对于**Zsh**： ```zsh echo 'export CAIRO_ROOT="$HOME/.cairo"' >> ~/.zshrc echo 'command -v cairo-compile >/dev/null || export PATH="$CAIRO_ROOT/target/release:$PATH"' >> ~/.zshrc ``` 如果你希望在非交互式登录shell中也能得到Cairo，也可以将这些命令添加到`~/.zprofile`或`~/.zlogin`。 - 对于**Fish shell**： 如果你有Fish 3.2.0或更新版本，请以交互方式执行： ```fish set -Ux CAIRO_ROOT $HOME/.cairo fish_add_path $CAIRO_ROOT/target/release ``` 否则，执行下面的片段： ```fish set -Ux CAIRO_ROOT $HOME/.cairo set -U fish_user_paths $CAIRO_ROOT/target/release $fish_user_paths ```

source: In MacOS, you might also want to install [Fig](https://fig.io/) which provides alternative shell completions for many command line tools with an IDE-like popup interface in the terminal window. (Note that their completions are independent from Cairo's codebase so they might be slightly out of sync for bleeding-edge interface changes.)
es: En MacOS, es posible que también desee instalar [Fig](https://fig.io/) que proporciona complementos de shell alternativos para muchas herramientas de línea de comandos con una interfaz emergente similar a IDE en la ventana de terminal. (Tenga en cuenta que sus complementos son independientes del código base de Cairo por lo que pueden estar ligeramente desincronizadas para cambios de interfaz de última generación).
zh_cn: 在 MacOS 中，你可能还想安装[Fig](https://fig.io/)。它为许多命令行工具提供了替 代性的 shell 补全功能，并在终端窗口有一个类似于 IDE 的弹出式界面。(注意，他们 的命令补全功能与Cairo的代码库无关，所以他们有可能有点跟不上Cairo命令行界面的更新）。

source: ### Restart your shell
es: ### Reinicie su shell
zh_cn: ### 重新启动你的shell

source: ## Installing Cairo Manually ([Guide](https://github.com/auditless/cairo-template) by [Abdel](https://github.com/abdelhamidbakhta))
es: ## Instalando Cairo Manualmente ([Guía](https://github.com/auditless/cairo-template) por [Abdel](https://github.com/abdelhamidbakhta))
zh_cn: ## 手动安装Cairo([指南](https://github.com/auditless/cairo-template)由[Abdel](https://github.com/abdelhamidbakhta)提供)

source: ### Step 1: Install Cairo 1.0
es: ### Paso 1: Instalar Cairo 1.0
zh_cn: ### 第1步：安装Cairo 1.0

source: Now that your Cairo compiler is in a cloned repository, all you will need to do is pull the latest changes and rebuild as follows:
es: Ahora que tu compilador Cairo está en un repositorio clonado, todo lo que necesitas hacer es extraer los últimos cambios y reconstruir como sigue:
zh_cn: 现在你的Cairo编译器已经在一个克隆的仓库里了，你所需要做的是拉取最新的修改， 并按如下方式重新编译：

source: ### Step 2: Add Cairo 1.0 executables to your path
es: ### Paso 2: Añade los ejecutables de Cairo 1.0 a tu ruta
zh_cn: ### 第二步：将Cairo 1.0的可执行文件添加到你的路径中

source: ### Step 3: Setup Language Server
es: ### Paso 3: Configurar el servidor de idiomas
zh_cn: ### 第三步：设置语言服务器

source: #### VS Code Extension
es: #### Extensión VS Code
zh_cn: #### VS代码扩展

source: - If you have the previous Cairo 0 extension installed, you can disable/uninstall it. - Install the Cairo 1 extension for proper syntax highlighting and code navigation. You can find the link to the extension [here](https://marketplace.visualstudio.com/items?itemName=starkware.cairo1&ssr=false), or just search for "Cairo 1.0" in the VS Code marketplace. - The extension will work out of the box once you will have [Scarb](./ch01-03-hello-scarb.md) installed.
es: - Si tienes instalada la extensión anterior de Cairo 0, puedes desactivarla/desinstalarla. - Instala la extensión de Cairo 1 para tener resaltado de sintaxis y navegación de código adecuados. Puedes encontrar el enlace a la extensión [aquí](https://marketplace.visualstudio.com/items?itemName=starkware.cairo1&ssr=false), o simplemente busca "Cairo 1.0" en el marketplace de VS Code. - La extensión funcionará automáticamente una vez que tengas instalado [Scarb](./ch01-03-hello-scarb.md).
zh_cn: - 如果你安装了以前的Cairo 0扩展，你���以禁用/卸载它。 - 安装Cairo 1扩展以获得正确的语法高亮和代码导航。你可以通过这个链接下载扩展[here](https://marketplace.visualstudio.com/items?itemName=starkware.cairo1&ssr=false)，或者直接在VS Code市场上搜索 "Cairo 1.0"。 - 一旦你安装了[Scarb](./ch01-03-hello-scarb.md)，该扩展就可以立即工作了。

source: #### Cairo Language Server without Scarb
es: #### Servidor de Lenguaje con Scarb
zh_cn: #### Cairo语言服务器(不使用Scarb时)

source: If you don't want to depend on Scarb, you can still use the Cairo Language Server with the compiler binary. From [Step 1](#installing-cairo-with-a-script-installer-by-fran), the `cairo-language-server` binary should be built and executing this command will copy its path into your clipboard.
es: Si no deseas depender de Scarb, aún puedes usar el Cairo Language Server con el binario del compilador. A partir del [Paso 1](#installing-cairo-with-a-script-installer-by-fran), el binario `cairo-language-server` debería haber sido construido y ejecutar este comando copiará su ruta en tu portapapeles.
zh_cn: 如果你不想依赖Scarb，你仍然可以通过编译的二进制文件使用Cairo语言服务器。 在[Step 1](#installing-cairo-with-a-script-installer-by-fran) 中，`cairo-language-server`二进制文件应该已经编译完成，执行这个命令将复制其路径到你的剪贴板。

source: Cairo is a programming language designed for a virtual CPU of the same name. The unique aspect of this processor is that it was not created for the physical constraints of our world but for cryptographic ones, making it capable of efficiently proving the execution of any program running on it. This means that you can perform time consuming operations on a machine you don't trust, and check the result very quickly on a cheaper machine. While Cairo 0 used to be directly compiled to CASM, the Cairo CPU assembly, Cairo 1 is a more high level language. It first compiles to Sierra, an intermediate representation of Cairo which will compile later down to a safe subset of CASM. The point of Sierra is to ensure your CASM will always be provable, even when the computation fails.
id: Cairo adalah bahasa pemrograman yang dirancang untuk CPU virtual dengan nama yang sama. Aspek unik dari prosesor ini adalah bahwa prosesor ini tidak diciptakan untuk batasan fisik dunia kita tetapi untuk batasan kriptografis, sehingga mampu membuktikan secara efisien eksekusi dari setiap program yang berjalan di atasnya. Ini berarti Anda dapat melakukan operasi yang membutuhkan waktu lama pada mesin yang tidak Anda percayai, dan memeriksa hasilnya dengan cepat pada mesin yang lebih murah. Sementara Cairo 0 dahulu dikompilasi langsung ke CASM, yaitu bahasa rakitan CPU Cairo, Cairo 1 adalah bahasa yang lebih tinggi levelnya. Pertama-tama, ia dikompilasi ke Sierra, representasi perantara Cairo yang kemudian akan dikompilasi menjadi subset aman dari CASM. Tujuan dari Sierra adalah memastikan bahwa CASM Anda akan selalu bisa dibuktikan, bahkan ketika komputasi gagal.
