Repository: cairo-book/cairo-book
Catalog: po/*.po
Languages: es, id, ko, zh_cn

source: We are creating a trait `WalletMixTrait<T1, U1>` with the `mixup<T2, U2>` methods which given an instance of `Wallet<T1, U1>` and `Wallet<T2, U2>` creates a new `Wallet<T1, U2>`. As `mixup` signature specify, both `self` and `other` are getting dropped at the end of the function, which is the reason for this code not to compile. If you have been following from the start until now you would know that we must add a requirement for all the generic types specifying that they will implement the `Drop` trait in order for the compiler to know how to drop instances of `Wallet<T, U>`. The updated implementation is as follow:
es: Estamos creando un trait `WalletMixTrait<T1, U1>` con el método `mixup<T2, U2>` que, dada una instancia de `Wallet<T1, U1>` y `Wallet<T2, U2>`, crea un nuevo `Wallet<T1, U2>`. Como especifica la firma de `mixup`, tanto `self` como `other` se están eliminando al final de la función, lo que hace que este código no se compile. Si has estado siguiendo desde el principio hasta ahora, sabrás que debemos agregar un requisito para todos los tipos genéricos especificando que implementarán el trait `Drop` para que el compilador sepa cómo eliminar las instancias de `Wallet<T, U>`. La implementación actualizada es la siguiente:
id: Kami membuat trait `WalletMixTrait<T1, U1>` dengan metode `mixup<T2, U2>` yang, dengan memberikan instans dari `Wallet<T1, U1>` dan `Wallet<T2, U2>`, membuat `Wallet<T1, U2>` baru. Seperti yang dijelaskan dalam tanda tangan `mixup`, baik `self` maupun `other` akan dibuang (dropped) pada akhir fungsi, itulah sebabnya kode ini tidak dapat dikompilasi. Jika Anda telah mengikuti dari awal hingga sekarang, Anda akan tahu bahwa kita harus menambahkan persyaratan untuk semua tipe generik dengan menentukan bahwa mereka akan mengimplementasikan trait `Drop` agar kompiler tahu cara membuang (drop) instans `Wallet<T, U>`. Implementasi yang diperbarui adalah sebagai berikut:
ko: 우리는 `mixup<T2, U2>` 메소드를 가지고 있는 `WalletMixTrait<T1, U1>` 특성을 생성하고, `Wallet<T1, U1>` 및 `Wallet<T2, U2>`의 인스턴스를 제공하면 새로운 `Wallet<T1, U2>`를 생성합니다. `mixup` 시그니처에서 명시된대로, `self`와 `other` 모두 함수의 끝에서 삭제되므로 이 코드가 컴파일되지 않는 이유입니다. 처음부터 지금까지 따라오셨다면, 모든 제네릭 타입에 대한 요구사항을 추가해야 한다는 것을 알고 계실 것입니다. 이 요구사항은 컴파일러가 `Wallet<T, U>`의 인스턴스를 삭제하는 방법을 알 수 있도록 `Drop` 특성을 구현할 것을 명시합니다. 업데이트된 구현은 다음과 같습니다:
zh_cn: 我们正在创建一个trait`WalletMixTrait<T1, U1>`，其中有`mixup<T2, U2>`方法，给定一个`Wallet<T1, U1>`和`Wallet<T2, U2>`的实例，创建一个新的`Wallet<T1, U2>`。正如`mixup`签名所指定的，`self`和`other`都在函数的结尾处被丢弃，这就是这段代码不能编译的原因。如果你从开始到现在都跟上了课程，你会知道我们必须为所有的泛型添加一个`Drop` trait的实现，以便编译器知道如何丢弃`Wallet<T, U>`的实例。更新后的实现如下：

source: We add the requirements for `T1` and `U1` to be droppable on `WalletMixImpl` declaration. Then we do the same for `T2` and `U2`, this time as part of `mixup` signature. We can now try the `mixup` function:
es: Sí, agregamos los requisitos para que `T1` y `U1` sean droppables en la declaración de `WalletMixImpl`. Luego hacemos lo mismo para `T2` y `U2`, esta vez como parte de la firma de `mixup`. Ahora podemos probar la función `mixup`:
id: Kami menambahkan persyaratan agar `T1` dan `U1` dapat di-drop pada deklarasi `WalletMixImpl`. Selanjutnya, kami melakukan hal yang sama untuk `T2` dan `U2`, kali ini sebagai bagian dari tanda tangan `mixup`. Sekarang kita dapat mencoba fungsi `mixup`:
ko: 우리는 `WalletMixImpl` 선언에서 `T1`과 `U1`이 삭제 가능하도록 요구 사항을 추가합니다. 그런 다음 `T2`와 `U2`에 대해 동일한 작업을 수행하며, 이번에는 `mixup` 서명의 일부로 수행합니다. 이제 `mixup` 함수를 시도할 수 있습니다.
zh_cn: 我们在 `WalletMixImpl`"的声明中添加了 `T1`和 `U1`的可丢弃trait。然后我们对`T2`和`U2`做同样的处理，这次是作为`mixup`签名的一部分。现在我们可以尝试使用`mixup` 函数了：

source: We first create two instances: one of `Wallet<bool, u128>` and the other of `Wallet<felt252, u8>`. Then, we call `mixup` and create a new `Wallet<bool, u8>` instance.
es: Primero creamos dos instancias: una de `Wallet<bool, u128>` y la otra de `Wallet<felt252, u8>`. Luego, llamamos a `mixup` y creamos una nueva instancia de `Wallet<bool, u8>`.
id: Pertama, kita membuat dua instans: satu dari `Wallet<bool, u128>` dan yang lain dari `Wallet<felt252, u8>`. Kemudian, kita memanggil `mixup` dan membuat instans baru `Wallet<bool, u8>`.
ko: 먼저 `Wallet<bool, u128>`와 `Wallet<felt252, u8>`의 두 인스턴스를 생성합니다. 그런 다음 `mixup`을 호출하여 새로운 `Wallet<bool, u8>` 인스턴스를 생성합니다.
zh_cn: 我们首先创建两个实例：一个是 `Wallet<bool, u128>`，另一个是`Wallet<felt252, u8>`。然后，我们调用`mixup`并创建一个新的`Wallet<bool, u8>`实例。

source: A trait defines a set of methods that can be implemented by a type. These methods can be called on instances of the type when this trait is implemented. A trait combined with a generic type defines functionality a particular type has and can share with other types. We can use traits to define shared behavior in an abstract way. We can use _trait bounds_ to specify that a generic type can be any type that has certain behavior.
ko: 특성은 유형에서 구현할 수 있는 메서드 집합을 정의합니다. 이러한 메서드는 이 특성이 구현된 경우 유형의 인스턴스에서 호출할 수 있습니다. 일반 유형과 결합된 특성은 특정 유형이 가지고 있는 기능을 정의하고 다른 유형과 공유할 수 있습니다. 우리는 특성을 사용하여 추상적인 방식으로 공유 동작을 정의할 수 있습니다. 일반 유형이 특정 동작을 가진 유형일 수 있음을 지정하기 위해 _특성 바운드_ 를 사용할 수 있습니다.

source: Note: Traits are similar to a feature often called interfaces in other languages, although with some differences.
ko: 참고: 특성은 다른 언어에서 종종 인터페이스라고 불리는 기능과 유사하지만 일부 차이가 있습니다.

source: While traits can be written to not accept generic types, they are most useful when used with generic types. We already covered generics in the [previous chapter](./ch08-01-generic-data-types.md), and we will use them in this chapter to demonstrate how traits can be used to define shared behavior for generic types.
ko: 특성은 일반 유형을 수용하지 않도록 작성될 수 있지만, 일반 유형과 함께 사용될 때 가장 유용합니다. 이미 [이전 장](./ch08-01-generic-data-types.md)에서 일반화에 대해 다루었으며, 이 장에서는 일반 유형에 대한 공유 동작을 정의하는 데 특성이 어떻게 사용될 수 있는지를 보여줄 것입니다.

source: Defining a Trait
id: Mendefinisikan Sebuah Trait
ko: 특성 정의

source: A type’s behavior consists of the methods we can call on that type. Different types share the same behavior if we can call the same methods on all of those types. Trait definitions are a way to group method signatures together to define a set of behaviors necessary to accomplish some purpose.
ko: 유형의 동작은 해당 유형에서 호출할 수 있는 메서드로 구성됩니다. 서로 다른 유형은 모두 동일한 메서드를 호출할 수 있다면 동일한 동작을 공유합니다. 트레이트 정의는 어떤 목적을 달성하기 위해 필요한 동작 집합을 정의하기 위해 메서드 시그니처를 그룹화하는 방법입니다.

source: For example, let’s say we have a struct `NewsArticle` that holds a news story in a particular location. We can define a trait `Summary` that describes the behavior of something that can summarize the `NewsArticle` type.
ko: 예를 들어, 특정 위치에 뉴스 이야기를 담고 있는 `NewsArticle` 구조체가 있다고 가정해 봅시다. 우리는 `NewsArticle` 유형을 요약할 수 있는 것의 동작을 설명하는 `Summary` 트레이트를 정의할 수 있습니다.

source: Here, we declare a trait using the trait keyword and then the trait’s name, which is `Summary` in this case.
ko: 여기서는 `Summary`인 특성 이름을 사용하여 특성을 선언합니다.

source: Inside the curly brackets, we declare the method signatures that describe the behaviors of the types that implement this trait, which in this case is `fn summarize(self: @NewsArticle) -> ByteArray`. After the method signature, instead of providing an implementation within curly brackets, we use a semicolon.
ko: 중괄호 안에는 이 특성을 구현하는 유형의 동작을 설명하는 메서드 시그니처를 선언합니다. 이 경우에는 `fn summarize(self: @NewsArticle) -> ByteArray`입니다. 메서드 시그니처 뒤에 중괄호 내에서 구현을 제공하는 대신 세미콜론을 사용합니다.

source: Note: the `ByteArray` type is the type used to represent Strings in Cairo.
ko: 참고: `ByteArray` 타입은 카이로에서 문자열을 표현하는 데 사용되는 타입입니다.

source: As the trait is not generic, the `self` parameter is not generic either and is of type `@NewsArticle`. This means that the `summarize` method can only be called on instances of `NewsArticle`.
ko: 특성이 일반적이 아니기 때문에 `self` 매개변수도 일반적이 아니며 `@NewsArticle` 유형입니다. 이는 `summarize` 메서드가 `NewsArticle`의 인스턴스에서만 호출될 수 있다는 것을 의미합니다.

source: Now, consider that we want to make a media aggregator library crate named `aggregator` that can display summaries of data that might be stored in a `NewsArticle` or `Tweet` instance. To do this, we need a summary from each type, and we’ll request that summary by calling a summarize method on an instance. By defining the `Summary` trait on generic type `T`, we can implement the `summarize` method on any type we want to be able to summarize.
ko: 지금, 우리는 `NewsArticle` 또는 `Tweet` 인스턴스에 저장될 수 있는 데이터의 요약을 표시할 수 있는 미디어 집계 라이브러리 크레이트인 `aggregator`를 만들고 싶다고 가정해 봅시다. 이를 위해, 우리는 각 유형에서 요약을 필요로 하며, 인스턴스에서 `summarize` 메서드를 호출하여 해당 요약을 요청할 것입니다. 일반 유형 `T`에 `Summary` 트레이트를 정의함으로써, 우리는 요약을 할 수 있는 유형에 대해 `summarize` 메서드를 구현할 수 있습니다.

source: "{} by {} ({})"
ko: "{} by {} ({})" would be translated to "({})에 의해 {}" in Korean.

source: "Cairo has become the most popular language for developers"
ko: "카이로는 개발자들 사이에서 가장 인기 있는 언어가 되었습니다."

source: "Worldwide"
ko: "전 세계적으로"

source: "Cairo Digger"
ko: "카이로 디거"

source: "Cairo is a new programming language for zero-knowledge proofs"
ko: "카이로는 제로 지식 증명을 위한 새로운 프로그래밍 언어입니다."

source: "EliBenSasson"
ko: "일라이벤사손"

source: "Crypto is full of short-term maximizing projects. \n @Starknet and @StarkWareLtd are about long-term vision maximization."
ko: "암호화폐는 단기 이익을 극대화하는 프로젝트들로 가득합니다. @Starknet과 @StarkWareLtd는 장기 비전을 극대화하는 데 관심이 있습니다."

source: // Tweet instantiation
ko: // 트윗 인스턴스화

source: "New article available! {}"
ko: "새로운 기사가 이용 가능합니다! {}"

source: "1 new tweet: {}"
ko: "1개의 새로운 트윗: {}"

source: A `Summary` trait that consists of the behavior provided by a `summarize` method
ko: `summarize` 메서드에서 제공되는 동작으로 구성된 `Summary` 트레잇

source: Each generic type implementing this trait must provide its own custom behavior for the body of the method. The compiler will enforce that any type that has the Summary trait will have the method summarize defined with this signature exactly.
ko: 이 특성을 구현하는 각 일반 유형은 메서드의 본문에 대한 고유한 사용자 지정 동작을 제공해야 합니다. 컴파일러는 Summary 특성을 가진 모든 유형이 이 시그니처로 정확히 정의된 summarize 메서드를 가져야 함을 강제할 것입니다.

source: A trait can have multiple methods in its body: the method signatures are listed one per line and each line ends in a semicolon.
ko: 한 특성은 본문에 여러 메서드를 가질 수 있습니다: 메서드 시그니처는 한 줄에 하나씩 나열되며 각 줄은 세미콜론으로 끝납니다.

source: Implementing a Trait on a type
ko: 유형에 특성을 구현하기

source: Now that we’ve defined the desired signatures of the `Summary` trait’s methods, we can implement it on the types in our media aggregator. The next code snippet shows an implementation of the `Summary` trait on the `NewsArticle` struct that uses the headline, the author, and the location to create the return value of `summarize`. For the `Tweet` struct, we define `summarize` as the username followed by the entire text of the tweet, assuming that tweet content is already limited to 280 characters.
ko: 이제 `Summary` 트레이트의 메서드들의 원하는 시그니처를 정의했으므로, 미디어 집계기의 타입들에 이를 구현할 수 있습니다. 다음 코드 스니펫은 `NewsArticle` 구조체에 대한 `Summary` 트레이트의 구현을 보여줍니다. 이 구현은 헤드라인, 작성자, 그리고 위치를 사용하여 `summarize`의 반환 값을 생성합니다. `Tweet` 구조체의 경우, 트윗 내용이 이미 280자로 제한되어 있다고 가정하고, `summarize`를 사용자 이름 뒤에 트윗의 전체 텍스트로 정의합니다.

source: Implementing a trait on a type is similar to implementing regular methods. The difference is that after `impl`, we put a name for the implementation, then use the `of` keyword, and then specify the name of the trait we are writing the implementation for. If the implementation is for a generic type, we place the generic type name in the angle brackets after the trait name.
ko: 타입에 특성을 구현하는 것은 일반 메서드를 구현하는 것과 유사합니다. 차이점은 `impl` 다음에 구현에 대한 이름을 넣고, `of` 키워드를 사용한 다음, 구현을 작성하는 특성의 이름을 지정한다는 것입니다. 구현이 제네릭 타입을 위한 것인 경우, 특성 이름 뒤의 꺽쇠 괄호에 제네릭 타입 이름을 넣습니다.

source: Within the `impl` block, we put the method signatures that the trait definition has defined. Instead of adding a semicolon after each signature, we use curly brackets and fill in the method body with the specific behavior that we want the methods of the trait to have for the particular type.
ko: `impl` 블록 내부에는 트레이트 정의가 정의한 메소드 시그니처를 넣습니다. 각 시그니처 뒤에 세미콜론을 추가하는 대신 중괄호를 사용하고, 트레이트의 메소드가 특정 타입에 대해 가져야 하는 특정 동작을 메소드 본문에 채웁니다.

source: Now that the library has implemented the `Summary` trait on `NewsArticle` and `Tweet`, users of the crate can call the trait methods on instances of `NewsArticle` and `Tweet` in the same way we call regular methods. The only difference is that the user must bring the trait into scope as well as the types. Here’s an example of how a crate could use our `aggregator` crate:
ko: 이제 라이브러리는 `NewsArticle`와 `Tweet`에 `Summary` 트레이트를 구현했으므로, 크레이트 사용자는 `NewsArticle`와 `Tweet`의 인스턴스에서 트레이트 메서드를 호출할 수 있습니다. 일반 메서드를 호출하는 방식과 동일합니다. 유일한 차이점은 사용자가 트레이트와 타입을 스코프에 가져와야 한다는 것입니다. 다음은 크레이트가 우리의 `aggregator` 크레이트를 사용하는 방법의 예시입니다:

source: This code prints the following:
ko: 이 코드는 다음을 출력합니다:

source: Other crates that depend on the `aggregator` crate can also bring the `Summary` trait into scope to implement `Summary` on their own types.
ko: `aggregator` 크레이트에 의존하는 다른 크레이트들도 자신의 타입에 `Summary` 트레이트를 구현하기 위해 `Summary` 트레이트를 스코프에 가져올 수 있습니다.

source: Implementing a trait, without writing its declaration.
id: Mengimplementasikan sebuah trait tanpa menuliskan deklarasinya.
ko: 선언을 작성하지 않고 특성을 구현하는 것.

source: You can write implementations directly without defining the corresponding trait. This is made possible by using the `#[generate_trait]` attribute within the implementation, which will make the compiler generate the trait corresponding to the implementation automatically. Remember to add `Trait` as a suffix to your trait name, as the compiler will create the trait by adding a `Trait` suffix to the implementation name.
id: Anda dapat menulis implementasi secara langsung tanpa mendefinisikan trait yang sesuai. Ini dimungkinkan dengan menggunakan atribut `#[generate_trait]` dalam implementasi, yang akan membuat kompiler secara otomatis menghasilkan trait yang sesuai dengan implementasi tersebut. Ingatlah untuk menambahkan `Trait` sebagai sufiks pada nama trait Anda, karena kompiler akan membuat trait dengan menambahkan sufiks `Trait` pada nama implementasi.
ko: 해당 특성을 정의하지 않고 직접 구현을 작성할 수 있습니다. 이는 구현 내에서 `#[generate_trait]` 속성을 사용하여 가능해집니다. 이 속성을 사용하면 컴파일러가 구현에 해당하는 특성을 자동으로 생성합니다. 특성 이름에 `Trait`를 접미사로 추가하는 것을 기억해야 합니다. 컴파일러는 구현 이름에 `Trait` 접미사를 추가하여 특성을 생성합니다.
zh_cn: 你可以直接编写实现而不需要定义相应的trait。这可以通过在实现上使用 `#[generate_trait]`属性来实现，它将使编译器自动生成与实现相对应的trait。记住在你的 trait 的名称后添加 `Trait` 作为后缀，因为编译器会通过在实现名称后添加 `Trait` 后缀来创建 trait。

source: In the aforementioned code, there is no need to manually define the trait. The compiler will automatically handle its definition, dynamically generating and updating it as new functions are introduced.
id: Dalam kode tersebut, tidak perlu mendefinisikan trait secara manual. Kompiler akan menangani definisinya secara otomatis, menghasilkan dan memperbarui trait secara dinamis ketika fungsi-fungsi baru diperkenalkan.
ko: 상기 코드에서는 특성을 수동으로 정의할 필요가 없습니다. 컴파일러가 자동으로 그 정의를 처리하며, 새로운 함수가 도입될 때 동적으로 생성하고 업데이트합니다.
zh_cn: 在上述代码中，无需手动定义trait。编译器将自动处理它的定义，在引入新函数时动态生成和更新它。

source: Managing and using external trait implementations
id: Mengelola dan Menggunakan Implementasi Trait Eksternal
ko: 외부 특성 구현을 관리하고 사용하기

source: To use traits methods, you need to make sure the correct traits/implementation(s) are imported. In the code above we imported `PrintTrait` from `debug` with `use core::debug::PrintTrait;` to use the `print()` methods on supported types. All traits included in the prelude don't need to be explicitly imported and are freely accessible.
ko: 특성 메서드를 사용하려면 올바른 특성/구현이 가져와져야 합니다. 위의 코드에서는 `use core::debug::PrintTrait;`를 사용하여 `debug`에서 `PrintTrait`를 가져왔습니다. 지원되는 유형에 대한 `print()` 메서드를 사용하기 위해서입니다. 프렐루드에 포함된 모든 특성은 명시적으로 가져올 필요가 없으며 자유롭게 접근할 수 있습니다.

source: In some cases you might need to import not only the trait but also the implementation if they are declared in separate modules. If `CircleGeometry` was in a separate module/file `circle` then to use `boundary` on `circ: Circle`, we'd need to import `CircleGeometry` in addition to `ShapeGeometry`.
id: Dalam beberapa kasus, Anda mungkin perlu mengimpor tidak hanya trait tetapi juga implementasinya jika mereka dideklarasikan dalam modul terpisah. Jika `CircleGeometry` berada dalam modul/berkas terpisah `circle`, maka untuk menggunakan `boundary` pada `circ: Circle`, kita perlu mengimpor `CircleGeometry` selain dari `ShapeGeometry`.
ko: 일부 경우에는 트레이트 뿐만 아니라 구현도 가져와야 할 수도 있습니다. 그러나 그들이 별도의 모듈에 선언된 경우입니다. `CircleGeometry`가 별도의 모듈/파일 `circle`에 있었다면 `circ: Circle`에서 `boundary`를 사용하려면 `ShapeGeometry`뿐만 아니라 `CircleGeometry`도 가져와야 합니다.

source: If the code was organized into modules like this, where the implementation of a trait was defined in a different module than the trait itself, explicitly importing the relevant implementation is required.
id: Jika kode diorganisir ke dalam modul seperti ini, di mana implementasi dari sebuah trait didefinisikan dalam modul yang berbeda dari trait itu sendiri, mengimpor implementasi yang relevan secara eksplisit diperlukan.
ko: 만약 코드가 이와 같이 모듈로 구성되어 있다면, 특성의 구현이 특성 자체와 다른 모듈에 정의된 경우, 관련 구현을 명시적으로 가져와야 합니다.
zh_cn: 如果代码被组织成类似这样的模块，其中trait的实现被定义在与trait本身不同的模块中时，则需要显式导入相关的实现。

source: // struct Circle { ... } and struct Rectangle { ... }
ko: // 구조체 Circle { ... }와 구조체 Rectangle { ... }

source: // Could be in a different file
ko: 다른 파일에 있을 수 있습니다

source: // Fails with this error // Method `area` not found on... Did you import the correct trait and impl?
ko: // 이 오류로 실패합니다 // `area` 메소드를 찾을 수 없습니다... 올바른 트레이트와 구현체를 가져왔는지 확인했습니까?

source: To make it work, in addition to,
es: Para hacer que funcione, además de,
id: Agar dapat berfungsi, selain itu,
ko: 작동하도록 만들려면, 추가로,
zh_cn: 为了使其发挥作用，除此之外、

source: you will need to import `CircleGeometry` explicitly. Note that you do not need to import `RectangleGeometry`, as it is defined in the same module as the imported trait, and thus is automatically resolved.
id: anda perlu mengimpor `CircleGeometry` secara eksplisit. Perhatikan bahwa Anda tidak perlu mengimpor `RectangleGeometry`, karena itu didefinisikan dalam modul yang sama dengan trait yang diimpor, dan oleh karena itu secara otomatis teratasi.
ko: `CircleGeometry`를 명시적으로 import해야 합니다. `RectangleGeometry`를 import할 필요는 없습니다. 왜냐하면 import된 trait와 동일한 모듈에 정의되어 있으므로 자동으로 해결됩니다.
zh_cn: 您需要明确地导入 `CircleGeometry`。请注意，您不需要导入 `RectangleGeometry`，因为它与导入的 trait 定义在同一个模块中，因此会自动解析。

source: The Anatomy of a Test Function
id: Anatomi dari Fungsi Pengujian
ko: 시험 함수의 해부학

source: Tests are Cairo functions that verify that the non-test code is functioning in the expected manner. The bodies of test functions typically perform these three actions:
es: Las pruebas son funciones en Cairo que verifican que el código no relacionado con las pruebas está funcionando de la manera esperada. Los cuerpos de las funciones de prueba típicamente realizan estas tres acciones:
id: Pengujian adalah fungsi-fungsi Cairo yang memverifikasi bahwa kode non-pengujian berfungsi dengan cara yang diharapkan. Tubuh fungsi pengujian biasanya melakukan tiga tindakan ini:
ko: 테스트는 비테스트 코드가 예상한 대로 작동하는지 확인하는 카이로 함수입니다. 테스트 함수의 본문은 일반적으로 다음 세 가지 작업을 수행합니다:
zh_cn: 测试是Cairo函数，用于验证非测试代码是否以预期方式运行。测试函数的主体通常执行这三个动作：

source: Set up any needed data or state.
id: Menyiapkan data atau keadaan yang diperlukan.
ko: 필요한 데이터나 상태를 설정하세요.

source: Run the code you want to test.
id: Menjalankan kode yang ingin diuji.
ko: 테스트하고 싶은 코드를 실행하세요.

source: Assert the results are what you expect.
id: Memeriksa bahwa hasilnya sesuai dengan yang diharapkan.
ko: 결과가 예상한 대로라고 주장하세요.

source: Let’s look at the features Cairo provides specifically for writing tests that take these actions, which include the `test` attribute, the `assert!` macro, and the `should_panic` attribute.
ko: 이러한 작업을 수행하는 테스트를 작성하기 위해 Cairo가 제공하는 기능을 살펴보겠습니다. 이 기능에는 `test` 속성, `assert!` 매크로, 그리고 `should_panic` 속성이 포함됩니다.

source: At its simplest, a test in Cairo is a function that’s annotated with the `test` attribute. Attributes are metadata about pieces of Cairo code; one example is the derive attribute we used with structs in Chapter 5. To change a function into a test function, add `#[test]` on the line before `fn`. When you run your tests with the `scarb cairo-test` command, Scarb runs Cairo's test runner binary that runs the annotated functions and reports on whether each test function passes or fails.
id: Pada dasarnya, sebuah pengujian di Cairo adalah sebuah fungsi yang diannotasikan dengan atribut `test`. Atribut adalah metadata tentang bagian-bagian kode Cairo; salah satu contohnya adalah atribut derive yang kita gunakan dengan struct di Bab 5. Untuk mengubah sebuah fungsi menjadi fungsi pengujian, tambahkan `#[test]` pada baris sebelum `fn`. Ketika Anda menjalankan pengujian dengan perintah `scarb cairo-test`, Scarb menjalankan binary pengujian Cairo yang menjalankan fungsi-fungsi yang diannotasikan dan melaporkan apakah setiap fungsi pengujian lulus atau gagal.
ko: 가장 간단히 말해서, 카이로의 테스트는 `test` 속성으로 주석 처리된 함수입니다. 속성은 카이로 코드 조각에 대한 메타데이터이며, 예를 들어 5장에서 구조체와 함께 사용한 derive 속성이 있습니다. 함수를 테스트 함수로 변경하려면 `fn` 앞 줄에 `#[test]`를 추가하십시오. `scarb cairo-test` 명령으로 테스트를 실행하면, Scarb는 카이로의 테스트 러너 이진 파일을 실행하여 주석 처리된 함수를 실행하고 각 테스트 함수가 통과했는지 실패했는지 보고합니다.
zh_cn: 最简单的Cairo中的测试是一个带有`test`属性注释的函数。属性是关于Cairo代码片段的元数据；一个例子是我们在第5章中对结构体使用的derive属性。要把一个函数变成测试函数，在 `fn`前的一行加上 `#[test]`。当你用`cairo-test`命令运行你的测试时，Cairo会建立一个测试运行器的二进制文件，运行被标注了的函数，并报告每个测试函数的通过或失败。

source: Let's create a new project called `adder` that will add two numbers using Scarb with the command `scarb new adder`:
es: Creemos un nuevo proyecto llamado `adder` que sumará dos números usando Scarb con el comando `scarb new adder`:
id: Mari kita buat proyek baru yang disebut `adder` yang akan menambahkan dua angka menggunakan Scarb dengan perintah `scarb new adder`:
ko: `scarb new adder` 명령을 사용하여 두 숫자를 더하는 `adder`라는 새 프로젝트를 만들어 보겠습니다.
zh_cn: 让我们创建一个名为 `adder`的将两个数字相加的新项目，用`scarb new adder`”命令：

source: In _lib.cairo_, let's remove the existing content and add a first test, as shown in Listing 9-1.
id: Di dalam _lib.cairo_, mari hapus konten yang ada dan tambahkan pengujian pertama, seperti yang ditunjukkan pada Listing 9-1.
ko: _lib.cairo_ 에서 기존 내용을 제거하고 제시된 9-1 목록에 표시된대로 첫 번째 테스트를 추가합시다.
zh_cn: 在 _lib.cairo_ 中，让我们添加第一个测试，如示例9-1所示。

source: "result is not 4"
ko: 결과는 4가 아닙니다.

source: Listing 9-1: A test module and function
id: Listing 9-1: Sebuah modul pengujian dan fungsi
ko: 리스트 9-1: 테스트 모듈과 함수

source: For now, let’s ignore the top two lines and focus on the function. Note the `#[test]` annotation: this attribute indicates this is a test function, so the test runner knows to treat this function as a test. We might also have non-test functions in the tests module to help set up common scenarios or perform common operations, so we always need to indicate which functions are tests.
es: Por ahora, ignoraremos las dos primeras líneas y nos centraremos en la función. Observa la anotación `#[test]`: este atributo indica que esta es una función de prueba, por lo que el runner de pruebas sabe que debe tratar esta función como una prueba. También podríamos tener funciones que no son de prueba en el módulo de pruebas para ayudar a configurar escenarios comunes o realizar operaciones comunes, por lo que siempre debemos indicar qué funciones son pruebas.
id: Untuk saat ini, mari abaikan dua baris teratas dan fokus pada fungsi. Perhatikan anotasi `#[test]`: atribut ini menunjukkan bahwa ini adalah fungsi pengujian, sehingga runner pengujian tahu untuk memperlakukan fungsi ini sebagai pengujian. Kita mungkin juga memiliki fungsi non-pengujian dalam modul pengujian untuk membantu menyiapkan skenario umum atau melakukan operasi umum, sehingga kita selalu perlu menunjukkan fungsi mana yang merupakan pengujian.
ko: 지금은 상위 두 줄을 무시하고 함수에 집중합시다. `#[test]` 주석을 주목하세요. 이 속성은 이것이 테스트 함수임을 나타내며, 따라서 테스트 실행기는 이 함수를 테스트로 처리해야 함을 알 수 있습니다. 우리는 또한 테스트 모듈에 테스트가 아닌 함수를 가질 수 있으며, 이는 공통 시나리오를 설정하거나 공통 작업을 수행하는 데 도움이 될 수 있습니다. 따라서 어떤 함수가 테스트인지 항상 표시해야 합니다.
zh_cn: 现在，让我们忽略最上面的两行，专注于这个函数。注意`#[test]`标注：这个属性表明这是一个测试函数，所以测试运行器知道要把这个函数当作一个测试。我们可能在测试模块中也有非测试函数，以帮助设置常见的场景或执行常见的操作，所以我们总是需要指出哪些函数是测试的。
