Repository: cairo-book/cairo-book
Catalog: po/*.po
Languages: es, id, ko, zh_cn

source: Scarb supports smart contract development for Starknet. To enable this functionality, you'll need to make some configurations in your `Scarb.toml` file (see [Installation](./ch01-01-installation.md) for how to install Scarb). You have to add the `starknet` dependency and add a `[[target.starknet-contract]]` section to enable contract compilation.
zh_cn: Scarb支持Starknet的智能合约开发。要启用此功能，您需要在 `Scarb.toml` 文件中进行一些配置（有关如何安装Scarb，请参阅[安装](./ch01-01-installation.md)）。 你需要添加 `starknet` 依赖项，并添加一个 `[[target.starknet-contract]]` 部分以启用合约编译。

source: # Introduction to smart-contracts
es: # Introducción a los smart-contracts
zh_cn: # 智能合约简介

source: This chapter will give you a high level introduction to what smart-contracts are, what are they used for and why would blockchain developers use Cairo and Starknet. If you are already familiar with blockchain programming, feel free to skip this chapter. The last part might still be interesting though.
es: Este capítulo te dará una introducción de alto nivel a lo que son los contratos inteligentes, para qué se usan y por qué los desarrolladores de blockchain usan Cairo y Starknet. Si ya estás familiarizado con la programación de cadenas de bloques, puedes saltarte este capítulo. Sin embargo, la última parte puede seguir siendo interesante.
zh_cn: 本章是一个关于什么是智能合约，它们有什么用途，以及为什么区块链开发者会使用Cairo和Starknet的高度简介。 如果你已经熟悉了区块链编程，可以跳过这一章。不过最后一部分应该还是有点意思的。

source: ## Smart-contracts
zh_cn: ## 智能合约

source: ## Use cases
es: ## Casos de uso
zh_cn: ## 使用案例

source: #### Tokenization
es: #### Tokenización
zh_cn: #### 代币化

source: #### Voting
es: #### Votación
zh_cn: #### 投票

source: #### Royalties
zh_cn: #### 特许权使用费（版税）

source: #### Decentralized identities DIDs
es: #### Identidades descentralizadas DID
zh_cn: #### 去中心化身份 DIDs

source: <br/> <br/> As Ethereum continues to mature, we can expect the use cases and applications of smart contracts to expand further, bringing about exciting new opportunities and reshaping traditional systems for the better.
es: <br/> <br/> A medida que Ethereum siga madurando, podemos esperar que los casos de uso y las aplicaciones de los contratos inteligentes se amplíen aún más, dando lugar a nuevas e interesantes oportunidades y remodelando los sistemas tradicionales para mejor.
zh_cn: <br/> <br/> 随着以太坊的不断成熟，我们可以预期智能合约的用例和应用将进一步扩大，带来令人兴奋的新机会，并会更好地重塑传统系统。

source: ## The rise of Starknet and Cairo
es: ## El auge de Starknet y Cairo
zh_cn: ## Starknet和Cairo语言的崛起

source: > Starknet's architecture is thoroughly described in the [Starknet Book](https://book.starknet.io/chapter_4/index.html), which is a great resource to learn more about the Starknet network.
zh_cn: > Starknet的架构在[Starknet Book](https://book.starknet.io/chapter_4/index.html)中有详细描述，是了解Starknet的重要资源。

source: > Learn more about Account Abstraction in the [Starknet Book](https://book.starknet.io/chapter_5/index.html).
zh_cn: > 在[Starknet Book](https://book.starknet.io/chapter_5/index.html)中了解更多关于账户抽象的信息。

source: ## Cairo programs and Starknet contracts: what is the difference?
zh_cn: ## Cairo程序和Starknet合约：有何区别？

source: Starknet contracts are a special superset of Cairo programs, so the concepts previously learned in this book are still applicable to write Starknet contracts. As you may have already noticed, a Cairo program must always have a function `main` that serves as the entry point for this program:
zh_cn: Starknet合约是Cairo程序的一个特殊子集，所以之前在本书中学到的概念仍然适用于编写Starknet合约。 你可能已经注意到，一个Cairo程序必须始终有一个函数`main`，作为这个程序的入口：

source: # A simple contract
zh_cn: # 一个简单的合约

source: ## Anatomy of a simple Starknet Contract
zh_cn: ## 一个简单Starknet合约剖析

source: <span class="caption">Listing 99-1: A simple storage contract</span>
zh_cn: <span class="caption">示例99-1：一个简单的存储合约</span>

source: > Note: Starknet contracts are defined within [modules](./ch07-02-defining-modules-to-control-scope.md).
zh_cn: > 注意：Starknet合约是在模块（[modules](./ch07-02-defining-modules-to-control-scope.md)）中被定义的。

source: ### What is this contract?
zh_cn: ## 这是什么合约？

source: In this example, the `Storage` struct declares a storage variable called `stored_data` of type `u128` (unsigned integer of 128 bits). You can think of it as a single slot in a database that you can query and alter by calling functions of the code that manages the database. The contract defines and exposes publicly the functions `set` and `get` that can be used to modify or retrieve the value of that variable.
zh_cn: 在这个例子中，`Storage` 结构声明了一个名为 `stored_data` 的存储变量，类型为`u128`（128位无符号整数）。 你可以将它想象成数据库中的一个单独槽位，通过调用管理数据库的代码的函数来查询和修改它。 该合约定义并公开了 `set` 和 `get` 函数，用于修改或检索该变量的值。

source: ### The Interface: the contract's blueprint
zh_cn: ### 接口：合约的蓝图

source: <span class="caption">Listing 99-1-bis: A wrong implementation of the interface of the contract. This does not compile.</span>
zh_cn: <span class="caption">示例 99-1-bis: 合约接口的错误实现。无法编译。</span>

source: ### Public functions are defined in an implementation block
zh_cn: #### 在实现里定义public函数

source: - In the context of Starknet, a _public function_ is a function that is exposed to the outside world. In the example above, `set` and `get` are public functions. A public function can be called by anyone, and can be called from outside the contract, or from within the contract. In the example above, `set` and `get` are public functions. - What we call an _external_ function is a public function that is invoked through a transaction and that can mutate the state of the contract. `set` is an external function. - A _view_ function is a public function that can be called from outside the contract, but that cannot mutate the state of the contract. `get` is a view function.
zh_cn: - 在Starknet中，_public function_ （公共函数）是一个对外公开的函数。在上面的例子中，`set`和`get`是公共函数。公有函数可以被任何人调用，可以从合约外部调用，也可以从合约内部调用。在上面的示例中，`set`和`get`是公共函数。 - 我们所说的 _external_ 函数是通过交易唤起的公共函数，它可以改变合约的状态。`set`就是一个外部函数。 - 一个 _view_ 函数是一个公共函数，它可以从合约外部调用，但不能改变合约的状态。`get`是一个视图函数。

source: Since the contract interface is defined as the `ISimpleStorage` trait, in order to match the interface, the external functions of the contract must be defined in an implementation of this trait — which allows us to make sure that the implementation of the contract matches its interface.
zh_cn: 由于合约接口被定义为`ISimpleStorage`trait，为了匹配接口，合约的外部函数必须在这个trait的实现中定义--这使我们能够确保合约的实现与其接口相匹配。

source: However, simply defining the functions in the implementation is not enough. The implementation block must be annotated with the `#[external(v0)]` attribute. This attribute exposes the functions defined in this implementation to the outside world — forget to add it and your functions will not be callable from the outside. All functions defined in a block marked as `#[external(v0)]` are consequently _public functions_.
id: Namun, hanya mendefinisikan fungsi-fungsi dalam implementasi saja tidak cukup. Blok implementasi harus diberi anotasi atribut `#[external(v0)]`. Atribut ini mengekspos fungsi-fungsi yang didefinisikan dalam implementasi ini ke dunia luar — lupakan untuk menambahkannya dan fungsi-fungsi Anda tidak dapat dipanggil dari luar. Semua fungsi yang didefinisikan dalam blok yang ditandai sebagai `#[external(v0)]` oleh karena itu menjadi _fungsi publik_.
zh_cn: 然而，仅仅在实现中定义函数是不够的。实现块必须标注上`#[external(v0)]`属性。如果忘记添加该属性，您的函数将无法从外部调用。所有在标记为 `#[external(v0)]`的代码块中定义的函数都是 _public functions_ 。

source: When writing the implementation of the interface, the generic parameter corresponding to the `self` argument in the trait must be `ContractState`. The `ContractState` type is generated by the compiler, and gives access to the storage variables defined in the `Storage` struct. Additionally, `ContractState` gives us the ability to emit events. The name `ContractState` is not surprising, as it’s a representation of the contract’s state, which is what we think of `self` in the contract interface trait.
zh_cn: 当编写接口的实现时，在trait中对应于`self`参数的泛型参数必须是`ContractState`。`ContractState`类型由编译器生成，它提供了对定义在 "`Storage`结构中的存储变量的访问。 此外，`ContractState`还提供了emit事件的能力。不要对`ContractState` 这个名字感到奇怪，因为它是合约状态的表示，也就是我们在合约接口trait中认为的 `self`。

source: ### Modifying the contract's state
zh_cn: ### 修改合约状态

source: As you can notice, all functions that need to access the state of the contract are defined under the implementation of a trait that has a `TContractState` generic parameter, and take a `self: ContractState` parameter. This allows us to explicitly pass the `self: ContractState` parameter to the function, allowing access the storage variables of the contract. To access a storage variable of the current contract, you add the `self` prefix to the storage variable name, which allows you to use the `read` and `write` methods to either read or write the value of the storage variable.
zh_cn: 正如你所注意到的，所有需要访问合约状态的函数都被定义在一个有`TContractState`泛型参数的trait的实现下，并接受一个`self：ContractState`参数。 这允许我们显式地将 `self：ContractState`参数给函数，允许访问合约的存储变量。 要访问当前合约的存储变量，可以在存储变量名后添加 `self` 前缀，这样就可以使用 `read` 和 `write` 方法读取或写入存储变量的值。

source: <span class="caption">Using `self` and the `write` method to modify the value of a storage variable</span>
zh_cn: <span class="caption">使用 `self` 和 `write` 方法修改存储变量的值</span>

source: > Note: if the contract state is passed as a snapshot instead of `ref`, attempting to modify will result in a compilation error.
zh_cn: > 注意：如果合约状态是作为snapshot而不是`ref`传递的，尝试修改它将导致编译错误。

source: # A deeper dive into contracts
zh_cn: # 深入了解合约

source: - How do I define internal/private functions? - How can I emit events? How can I index them? - Where should I define functions that do not need to access the contract's state? - Is there a way to reduce the boilerplate? - How can I store more complex data types?
zh_cn: - 如何定义内部/私有函数？ - 如何发出事件？如何索引事件？ - 我应该在哪里定义不需要访问合约状态的函数？ - 有办法减少冗余的模式代码吗？ - 如何存储更复杂的数据类型？

source: <span class="caption">Listing 99-1bis: Our reference contract for this chapter</span>
zh_cn: <span class="caption">示例 99-1bis：本章的参考合约</span>

source: # Contract Storage
zh_cn: # 合约存储

source: <span class="caption">A Storage Struct</span>
zh_cn: <span class="caption">存储用结构体</span>

source: The storage struct is a [struct](./ch05-00-using-structs-to-structure-related-data.md) like any other, except that it **must** be annotated with `#[storage]`. This annotation tells the compiler to generate the required code to interact with the blockchain state, and allows you to read and write data from and to storage. Moreover, this allows you to define storage mappings using the `LegacyMap` type.
zh_cn: Storage[结构体](./ch05-00-using-structs-to-structure-related-data.md) 与其他结构体一样， 只是它 **必须** 带有 `#[storage]` 注解。这个注解告诉编译器生成与区块链状态交互所需的代码，并允许您从存储中读取和写入数据。此外，这还允许您使用 `LegacyMap` 类型定义存储映射。

source: ## Storage Addresses
zh_cn: ## 存储地址

source: - If the variable is a single value (not a mapping), the address is the `sn_keccak` hash of the ASCII encoding of the variable's name. `sn_keccak` is Starknet's version of the Keccak256 hash function, whose output is truncated to 250 bits. - If the variable is a [mapping](#storing-mappings), the address of the value at key `k_1,...,k_n` is `h(...h(h(sn_keccak(variable_name),k_1),k_2),...,k_n)` where ℎ is the Pedersen hash and the final value is taken `mod (2^251) − 256`. - If it is a mapping to complex values (e.g., tuples or structs), then this complex value lies in a continuous segment starting from the address calculated in the previous point. Note that 256 field elements is the current limitation on the maximal size of a complex storage value.
zh_cn: - 如果变量是单个值（不是映射），则地址是变量名 ASCII 编码的 `sn_keccak` 哈希值。`sn_keccak`_是 Starknet 的 Keccak256 哈希函数版本，其输出被截断为 250 位。 - 如果变量是[映射](#storing-mappings),，则键为 `k_1,...,k_n` 的值的地址是 `h(...h(h(sn_keccak(variable_name),k_1),k_2),...,k_n)`，其中 ℎ 是 Pedersen 哈希，最终值取 `mod (2^251) − 256`。 - 如果它是映射到复杂值（例如，元组或结构），则此复杂值位于从上一点计算的地址开始的连续段中。请注意，256 个域元素是当前复杂存储值最大大小的限制。

source: ## Interacting with Storage Variables
zh_cn: ## 与存储变量交互

source: Variables stored in the storage struct can be accessed and modified using the `read` and `write` functions, and you can get their address in storage using the `addr` function. These functions are automatically generated by the compiler for each storage variable.
id: Variabel yang disimpan dalam struktur penyimpanan dapat diakses dan dimodifikasi menggunakan fungsi `read` dan `write`, dan Anda dapat mendapatkan alamatnya di penyimpanan menggunakan fungsi `addr`. Fungsi-fungsi ini secara otomatis dihasilkan oleh kompiler untuk setiap variabel penyimpanan.
zh_cn: 存储在存储结构中的变量可以使用 `read` 和 `write` 函数进行访问和修改，还可以使用 `addr` 函数获取它们在存储中的地址。这些函数由编译器为每个存储变量自动生成。

source: <span class="caption">Calling the `read` function on the `owner` variable</span>
zh_cn: <span class="caption">调用 `owner` 变量上的 `read` 函数</span>

source: <span class="caption">Calling the `read` function on the `names` variable</span>
zh_cn: <span class=“caption”>调用`names` 变量上的`read` 函数</span>

source: <span class="caption">Calling the `write` function on the `owner` variable</span>
zh_cn: <span class="caption">调用`owner` 变量上的`write` 函数</span>

source: <span class="caption">Calling the `write` function on the `names` variable</span>
zh_cn: <span class="caption">调用 `names` 变量上的 `write` 函数</span>

source: ## Storing custom types
zh_cn: ## 存储自定义结构体

source: ### Structs storage layout
zh_cn: ### 结构体的存储布局

source: On Starknet, structs are stored in storage as a sequence of primitive types. The elements of the struct are stored in the same order as they are defined in the struct definition. The first element of the struct is stored at the base address of the struct, which is computed as specified in [Storage Addresses](#storage-addresses) and can be obtained by calling `var.address()`, and subsequent elements are stored at addresses contiguous to the first element. For example, the storage layout for the `owner` variable of type `Person` will result in the following layout:
zh_cn: 在 Starknet 上，结构会被存储为基本类型序列。结构的元素按照结构定义中的顺序进行存储。结构的第一个元素存储在结构的基地址，该地址根据 [存储地址](#storage-addresses) 中的说明计算，可以通过调用 `var.address()` 获取，后面的元素则存储在与第一个元素相邻的地址。 例如，类型为 `Person` 的 `owner` 变量的存储布局将如下所示：

source: ### Enums storage layout
zh_cn: ### 枚举的存储布局

source: When you store an enum variant, what you're essentially storing is the variant's index and an eventual associated values. This index starts at 0 for the first variant of your enum and increments by 1 for each subsequent variant. If your variant has an associated value, it's stored starting from the address immediately following the base address. For example, suppose we have the `RegistrationType` enum with the `finite` variant, which carries an associated limit date. The storage layout would look like this:
zh_cn: 当您存储一个枚举变体时，您实际上存储的是变体的索引和最终的关联值。这个索引从您的枚举的第一个变体开始为 0，并为每个后续变体增加 1。 如果您的变体具有关联值，它会从基地址之后的第一个地址开始存储。 例如，假设我们有一个带有 `finite` 变体的 `RegistrationType` 枚举，该变体带有关联的截止日期。存储布局将如下所示：

source: ## Storage mappings
zh_cn: ## 存储映射

source: Storage mappings are similar to hash tables in that they allow mapping keys to values. However, unlike a typical hash table, the key data itself is not stored - only its hash is used to look up the associated value in the contract's storage. Mappings do not have a concept of length or whether a key/value pair is set. The only way to remove a mapping is to set its value to the default zero value.
zh_cn: 存储映射类似于哈希表，它们允许将键映射到值。但是，与典型的哈希表不同，不存储键数据本身 - 仅使用其哈希码在合约的存储中查找关联的值。 映射没有长度概念，也没有键/值对是否设置的概念。删除映射的唯一方法是将其值设置为默认的零值。

source: Mappings are only used to compute the location of data in the storage of a contract given certain keys. They are thus **only allowed as storage variables**. They cannot be used as parameters or return parameters of contract functions, and cannot be used as types inside structs.
zh_cn: 映射只用于根据某些键计算合约存储中数据的位置。因此，它们只能作为存储变量使用。它们不能用作合约函数的参数或返回值参数，也不能用作结构体内的类型。

source: To declare a mapping, use the `LegacyMap` type enclosed in angle brackets `<>`, specifying the key and value types.
zh_cn: 要声明一个映射，请使用尖括号 `<>` 包围的 `LegacyMap`类型，指定键和值类型。

source: You can also create more complex mappings with multiple keys. You can find one in Listing 99-2bis like the popular `allowances` storage variable in the ERC20 Standard which maps an `owner` and an allowed `spender` to its `allowance` amount using multiple keys passed inside a tuple:
id: Anda juga dapat membuat pemetaan yang lebih kompleks dengan beberapa kunci. Anda dapat menemukan contohnya di Listing 99-2bis seperti variabel penyimpanan `allowances` pada Standar ERC20 yang populer, yang memetakan `pemilik` dan `spender` yang diizinkan ke jumlah `izin` menggunakan beberapa kunci yang dilewatkan dalam sebuah tuple:
zh_cn: 你还可以创建具有多个键的更复杂的映射。在示例 99-2bis 中可以找到一个示例，就像ERC20标准中的流行的 `allowances` 存储变量一样，它使用多个键将 `owner` 和允许的 `spender` 映射到其 `allowance` 金额，这些键被传递到一个元组中：

source: <span class="caption">Listing 99-2bis: Storing mappings</span>
zh_cn: <span class="caption">示例99-2bis：存储映射</span>

source: The address in storage of a variable stored in a mapping is computed according to the description in the [Storage Addresses](#storage-addresses) section. If the key of a mapping is a struct, each element of the struct constitutes a key. Moreover, the struct should implement the `Hash` trait, which can be derived with the `#[derive(Hash)]` attribute. For example, if you have struct with two fields, the address will be `h(h(sn_keccak(variable_name),k_1),k_2)` - where `k_1` and `k_2` are the values of the two fields of the struct.
zh_cn: 存储在映射中的变量的存储地址根据 [存储地址](#storage-addresses) 部分的描述进行计算。 如果映射的键是一个结构体，则结构体的每个元素都构成一个键。此外，结构体应该实现 `Hash` trait，可以使用 `#[derive(Hash)]` 属性派生。例如，如果您的结构体有两个字段，则地址将是 `h(h(sn_keccak(variable_name),k_1),k_2)` - 其中 `k_1` 和 `k_2` 是结构体这两个字段的值。

source: ## Contract Functions
zh_cn: ## 合约函数

source: ### 1. Constructors
es: ### 1. Constructores
zh_cn: ### 1.构造器（Constructors）

source: 1. Your contract can't have more than one constructor. 2. Your constructor function must be named `constructor`. 3. It must be annotated with the `#[constructor]` attribute.
zh_cn: 1.您的合约不能有一个以上的构造函数。 2.您的构造函数必须命名为 `constructor`。 3.它必须使用 `#[constructor]` 属性标注。

source: ### 2. Public functions
zh_cn: ### 2.公共函数

source: As stated previously, public functions are accessible from outside of the contract. They must be defined inside an implementation block annotated with the `#[external(v0)]` attribute. This attribute only affects the visibility (public vs private/internal), but it doesn't inform us on the ability of these functions to modify the state of the contract.
id: Seperti yang disebutkan sebelumnya, fungsi publik dapat diakses dari luar kontrak. Mereka harus didefinisikan di dalam blok implementasi yang diberi atribut `#[external(v0)]`. Atribut ini hanya memengaruhi visibilitas (publik vs privat/internal), tetapi tidak memberikan informasi tentang kemampuan fungsi-fungsi ini untuk memodifikasi status kontrak.
zh_cn: 如前所述，公有函数可以从合约外部访问。它们必须定义在带有`#[external(v0)]`属性注解的实现块中。这个属性只影响可见性（public 或 private/internal），但并不影响这些函数修改合约状态的能力。

source: #### External functions
zh_cn: ### 外部函数

source: External functions are functions that can modify the state of a contract. They are public and can be called by any other contract or externally. External functions are _public_ functions where the `self: ContractState` is passed as reference with the `ref` keyword, allowing you to modify the state of the contract.
zh_cn: 外部函数是可以修改合约状态的函数。它们是公共的，可以被任何其他合约或外部调用。 外部函数是 _public_ 函数，其中的 `self：ContractState` 以引用的形式通过关键字 `ref` 传递，使得你可以修改合约的状态。

source: #### View functions
zh_cn: ### 视图函数

source: View functions are read-only functions allowing you to access data from the contract while ensuring that the state of the contract is not modified. They can be called by other contracts or externally. View functions are _public_ functions where the `self: ContractState` is passed as snapshot, preventing you from modifying the state of the contract.
zh_cn: 视图函数是只读函数，允许你访问合约中的数据，同时确保合约的状态不会被修改。它们可以被其他合约或外部调用。 视图函数是 _public_ 函数，其中 `self.ContractState` 被作为快照传入，这会防止你修改合约的状态。

source: > **Note:** It's important to note that both external and view functions are public. To create an internal function in a contract, you will need to define it outside of the implementation block annotated with the `#[external(v0)]` attribute.
zh_cn: > **注意：** 外部函数和视图函数都是公共函数，这一点很重要。要在合约中创建内部函数，您需要在使用 `#[external(v0)]`属性标注的实现块之外定义它。

source: ### 3. Private functions
zh_cn: ### 3.私有函数

source: Functions that are not defined in a block annotated with the `#[external(v0)]` attribute are private functions (also called internal functions). They can only be called from within the contract.
id: Fungsi-fungsi yang tidak didefinisikan dalam blok yang diberi atribut `#[external(v0)]` adalah fungsi pribadi (juga disebut fungsi internal). Mereka hanya dapat dipanggil dari dalam kontrak itu sendiri.
zh_cn: 未在注有`#[external(v0)]`属性的代码块中定义的函数是私有函数（也称为内部函数）。它们只能在合约内部调用。

source: > Wait, what is this `#[generate_trait]` attribute? Where is the trait definition for this implementation? Well, the `#[generate_trait]` attribute is a special attribute that tells the compiler to generate a trait definition for the implementation block. This allows you to get rid of the boilerplate code of defining a trait and implementing it for the implementation block. We will see more about this in the [next section](./ch99-01-03-04-reducing-boilerplate.md).
zh_cn: > 等等，这个`#[generate_trait]`属性是什么？这个实现的trait定义在哪里？嗯，`#[generate_trait]`属性是一个特殊的属性，它告诉编译器为实现块生成一个trait定义。这允许你摆脱为实现块定义trait和实现trait的模板代码。我们将在[下一节](./ch99-01-03-04-reducing-boilerplate.md)中看到更多关于这方面的内容。

source: At this point, you might still be wondering if all of this is really necessary if you don't need to access the contract's state in your function (for example, a helper/library function). As a matter of fact, you can also define internal functions outside of implementation blocks. The only reason why we _need_ to define functions inside impl blocks is if we want to access the contract's state.
id: Pada titik ini, Anda mungkin masih bertanya-tanya apakah semua ini benar-benar diperlukan jika Anda tidak perlu mengakses status kontrak dalam fungsi Anda (misalnya, fungsi bantu/perpustakaan). Sebenarnya, Anda juga dapat mendefinisikan fungsi internal di luar blok implementasi. Satu-satunya alasan mengapa kita _harus_ mendefinisikan fungsi di dalam blok impl adalah jika kita ingin mengakses status kontrak.
zh_cn: 说到这里，您可能还在想，如果您不需要在您的函数（例如，辅助函数/库函数）中访问合约的状态，所有这些是否真的有必要。事实上，您也可以在实现块之外定义内部函数。我们 _需要_ 在实现块内部定义函数的唯一原因是我们想要访问合约的状态。

source: ## Events
es: ## Eventos
zh_cn: ## 事件

source: Events are custom data structures that are emitted by smart contracts during execution. They provide a way for smart contracts to communicate with the external world by logging information about specific occurrences in a contract.
es: Los eventos son estructuras de datos personalizadas que emiten los contratos inteligentes durante su ejecución. Proporcionan una manera para que los contratos inteligentes se comuniquen con el mundo externo mediante el registro de información sobre sucesos específicos en un contrato.
zh_cn: 事件是定制的数据结构，由智能合约在执行期间发出。 它们为智能合约提供了一种与外部世界沟通的方式，即记录合约中所发生的特定事情的信息。

source: ### Defining events
es: ### Definición de eventos
zh_cn: ### 界定事件

source: The `#[derive(starknet::Event)]` attribute causes the compiler to generate an implementation for the above trait, instantiated with the Event type, which in our example is the following enum:
zh_cn: 属性 `#[derive(starknet::Event)]`会使得编译器为上述trait生成一个实现、 在我们的例子中，它是下面的枚举：
