Repository: cairo-book/cairo-book
Catalog: po/*.po
Languages: es, id, ko, zh_cn

source: "Balance is not 100"
ko: "균형은 100이 아닙니다."

source: "Balance is not 200"
ko: "밸런스는 200이 아닙니다."

source: We can create a new instance of `Felt252Dict<u64>` by using the `default` method of the `Default` trait and add two individuals, each one with their own balance, using the `insert` method. Finally, we check the balance of our users with the `get` method. These methods are defined in the `Felt252DictTrait` trait in the core library.
ko: `Default` 트레이트의 `default` 메서드를 사용하여 `Felt252Dict<u64>`의 새 인스턴스를 생성하고, `insert` 메서드를 사용하여 각각 자신의 잔액을 가진 두 명의 개인을 추가할 수 있습니다. 마지막으로, `get` 메서드를 사용하여 사용자의 잔액을 확인할 수 있습니다. 이러한 메서드들은 코어 라이브러리의 `Felt252DictTrait` 트레이트에 정의되어 있습니다.

source: Throughout the book we have talked about how Cairo's memory is immutable, meaning you can only write to a memory cell once but the `Felt252Dict<T>` type represents a way to overcome this obstacle. We will explain how this is implemented later on in [Dictionaries Underneath](#dictionaries-underneath).
id: Sepanjang buku ini, kita telah membicarakan tentang bagaimana memori dalam Cairo bersifat tidak dapat diubah (immutable), yang berarti Anda hanya dapat menuliskan nilai ke sebuah sel memori sekali saja, tetapi tipe `Felt252Dict<T>` mewakili cara untuk mengatasi hambatan ini. Kami akan menjelaskan bagaimana ini diimplementasikan lebih lanjut pada bagian [Dictionaries Underneath](#dictionaries-underneath).
ko: 이 책 전체를 통해 우리는 카이로의 메모리가 불변이라는 것에 대해 이야기했습니다. 즉, 메모리 셀에 한 번만 쓸 수 있지만 `Felt252Dict<T>` 유형은 이 장애물을 극복하는 방법을 나타냅니다. 나중에 [Dictionaries Underneath](#dictionaries-underneath)에서 이것이 어떻게 구현되는지 설명하겠습니다.
zh_cn: 在整本书中，我们都在说Cairo的内存是不可变的，这意味着你只能向一个内存单元写入一次，但是 `Felt252Dict<T>` 类型代表了一种克服这一障碍的方法。我们将在后面的[深入Cairo的字典](#dictionaries-underneath)中解释如何实现。

source: Building upon our previous example, let us show a code example where the balance of the same user changes:
id: Mengembangkan dari contoh sebelumnya, mari tunjukkan contoh kode di mana saldo dari pengguna yang sama berubah:
ko: 이전 예제를 바탕으로, 동일한 사용자의 잔액이 변경되는 코드 예제를 보여드리겠습니다.
zh_cn: 在前面示例的基础上，让我们展示一个同一用户的余额产生变化的代码示例：

source: // Insert Alex with 100 balance
ko: // Alex를 100 잔고로 삽입합니다.

source: // Check that Alex has indeed 100 associated with him
ko: // 알렉스가 실제로 100이 연결되어 있는지 확인하세요.

source: "Alex balance is not 100"
ko: "알렉스의 잔고는 100이 아닙니다."

source: // Insert Alex again, this time with 200 balance
ko: // Alex를 다시 삽입하고, 이번에는 잔액이 200입니다.

source: // Check the new balance is correct
ko: // 새 잔고가 올바른지 확인하세요.

source: "Alex balance is not 200"
ko: "알렉스의 잔고는 200이 아닙니다."

source: Notice how in this example we added the 'Alex' individual twice, each time using a different balance and each time that we checked for its balance it had the last value inserted! `Felt252Dict<T>` effectively allows us to "rewrite" the stored value for any given key.
ko: 이 예시에서 'Alex' 개인을 두 번 추가했음에 유의하십시오. 각각 다른 잔고를 사용하고 각각 잔고를 확인할 때마다 마지막 값이 삽입되었습니다! `Felt252Dict<T>`는 우리에게 주어진 키에 대한 저장된 값을 "재작성"할 수 있게 해줍니다.

source: Before heading on and explaining how dictionaries are implemented it is worth mentioning that once you instantiate a `Felt252Dict<T>`, behind the scenes all keys have their associated values initialized as zero. This means that if for example, you tried to get the balance of an inexistent user you will get 0 instead of an error or an undefined value. This also means there is no way to delete data from a dictionary. Something to take into account when incorporating this structure into your code.
id: Sebelum melanjutkan dan menjelaskan bagaimana kamus diimplementasikan, penting untuk disebutkan bahwa begitu Anda membuat sebuah `Felt252Dict<T>`, di balik layar semua kunci memiliki nilai terkait mereka diinisialisasi sebagai nol. Ini berarti bahwa jika misalnya, Anda mencoba untuk mendapatkan saldo dari pengguna yang tidak ada, Anda akan mendapatkan nilai 0 daripada sebuah kesalahan atau nilai yang tidak terdefinisi. Ini juga berarti bahwa tidak ada cara untuk menghapus data dari sebuah kamus. Hal yang perlu diperhatikan ketika menggabungkan struktur ini ke dalam kode Anda.
ko: 사전이 어떻게 구현되는지 설명하기 전에, `Felt252Dict<T>`를 인스턴스화하면 모든 키에 연결된 값이 0으로 초기화된다는 것을 언급할 가치가 있다. 예를 들어, 존재하지 않는 사용자의 잔액을 가져오려고 하면 오류나 정의되지 않은 값 대신 0을 얻게 된다는 것을 의미한다. 또한, 이는 사전에서 데이터를 삭제할 수 있는 방법이 없다는 것을 의미한다. 이 구조를 코드에 통합할 때 고려해야 할 사항이다.
zh_cn: 在继续解释字典是如何实现的之前，值得一提的是，一旦你实例化了一个 `Felt252Dict<T>`，其所有的键值都将被初始化为0。这意味着，例如，如果你试图获取一个不存在的用户的余额，你将得到0，而不是一个错误或未定义的值。这也意味着无法从字典中删除数据。在代码中使用这歌结构纳时你需要考虑到这一点。

source: Until this point, we have seen all the basic features of `Felt252Dict<T>` and how it mimics the same behavior as the corresponding data structures in any other language, that is, externally of course. Cairo is at its core a non-deterministic Turing-complete programming language, very different from any other popular language in existence, which as a consequence means that dictionaries are implemented very differently as well!
id: Hingga saat ini, kita telah melihat semua fitur dasar dari `Felt252Dict<T>` dan bagaimana ia meniru perilaku yang sama seperti struktur data yang sesuai dalam bahasa pemrograman lainnya, yaitu, secara eksternal tentunya. Cairo pada intinya adalah bahasa pemrograman yang non-deterministik dan lengkap secara Turing, sangat berbeda dari bahasa lain yang populer saat ini, yang sebagai konsekuensinya berarti bahwa kamus diimplementasikan dengan cara yang sangat berbeda juga!
ko: 이 시점까지, 우리는 `Felt252Dict<T>`의 모든 기본 기능과 해당 데이터 구조와 동일한 동작을 모방하는 방법을 보았습니다. 다른 어떤 언어에서도, 외부적으로는 물론입니다. 카이로는 본질적으로 결정론적이지 않은 튜링 완전 프로그래밍 언어로, 존재하는 다른 인기있는 언어와 매우 다르며, 그 결과로 사전도 매우 다르게 구현됩니다!
zh_cn: 到此为止，我们已经了解了 `Felt252Dict<T>` 的所有基本特性，以及它是如何在外部表现上模仿其他语言中相应数据结构的。Cairo的核心是一种非确定的图灵完备的编程语言，与其他任何流行的语言都有很大的不同，这意味着字典的实现也有很大的不同！

source: In the following sections, we are going to give some insights about `Felt252Dict<T>` inner mechanisms and the compromises that were taken to make them work. After that, we are going to take a look at how to use dictionaries with other data structures as well as use the `entry` method as another way to interact with them.
id: Pada bagian-bagian berikutnya, kami akan memberikan beberapa wawasan tentang mekanisme internal `Felt252Dict<T>` dan kompromi yang diambil untuk membuatnya berfungsi. Setelah itu, kita akan melihat bagaimana menggunakan kamus dengan struktur data lain serta menggunakan metode `entry` sebagai cara lain untuk berinteraksi dengan mereka.
ko: 다음 섹션에서는 `Felt252Dict<T>` 내부 메커니즘에 대한 통찰력과 그들이 작동하도록하기 위해 취해진 타협에 대해 알아보겠습니다. 그 후에는 다른 데이터 구조와 함께 사전을 사용하는 방법과 `entry` 메서드를 사용하여 상호 작용하는 또 다른 방법을 살펴볼 것입니다.
zh_cn: 在下面的章节中，我们将深入介绍 `Felt252Dict<T>` 的内部机制以及为使其正常工作而做出的妥协。之后，我们将介绍如何将字典与其他数据结构一起使用，以及使用`entry`方法作为与字典交互的另一种方式。

source: Dictionaries Underneath
id: Dasar dari Kamus
ko: 사전 아래

source: One of the constraints of Cairo's non-deterministic design is that its memory system is immutable, so in order to simulate mutability, the language implements `Felt252Dict<T>` as a list of entries. Each of the entries represents a time when a dictionary was accessed for reading/updating/writing purposes. An entry has three fields:
id: Salah satu batasan dari desain non-deterministik Cairo adalah sistem memorinya yang tidak dapat diubah, sehingga untuk mensimulasikan keberlangsungan, bahasa ini mengimplementasikan `Felt252Dict<T>` sebagai daftar entri. Setiap entri mewakili waktu ketika sebuah kamus diakses untuk tujuan membaca/memperbarui/menulis. Sebuah entri memiliki tiga bidang:
ko: 카이로의 비결정적 디자인의 제약 중 하나는 그 메모리 시스템이 변경할 수 없다는 것입니다. 그래서 가변성을 시뮬레이션하기 위해 언어는 `Felt252Dict<T>`를 항목 목록으로 구현합니다. 각 항목은 사전이 읽기/업데이트/쓰기 목적으로 액세스된 시간을 나타냅니다. 항목은 세 개의 필드를 가지고 있습니다.
zh_cn: Cairo的非确定性设计的限制之一是它的内存系统是不可变的，因此为了模拟可变性，语言将`Felt252Dict<T>`实现为一个条目(entry)列表。每个条目代表了字典被读取/更新/写入的时间。一个条目有三个字段：

source: A `key` field that identifies the key for this key-value pair of the dictionary.
ko: 이것은 딕셔너리의 키-값 쌍의 키를 식별하는 `key` 필드입니다.

source: A `previous_value` field that indicates which previous value was held at `key`.
id: Bidang `previous_value` yang menunjukkan nilai sebelumnya yang dipegang oleh `key`.
ko: `key`에서 이전 값이 저장되어 있던 `previous_value` 필드입니다.

source: A `new_value` field that indicates the new value that is held at `key`.
id: Bidang `new_value` yang menunjukkan nilai baru yang dipegang oleh `key`.
ko: `key`에 보유된 새 값을 나타내는 `new_value` 필드입니다.

source: If we try implementing `Felt252Dict<T>` using high-level structures we would internally define it as `Array<Entry<T>>` where each `Entry<T>` has information about what key-value pair it represents and the previous and new values it holds. The definition of `Entry<T>` would be:
id: Jika kita mencoba mengimplementasikan `Felt252Dict<T>` menggunakan struktur tingkat tinggi, kita akan mendefinisikannya secara internal sebagai `Array<Entry<T>>` di mana setiap `Entry<T>` memiliki informasi tentang pasangan kunci-nilai yang direpresentasikannya dan nilai-nilai sebelumnya dan baru yang dipegangnya. Definisi dari `Entry<T>` akan menjadi:
ko: 만약 우리가 고수준 구조를 사용하여 `Felt252Dict<T>`를 구현하려고 한다면 내부적으로는 각 `Entry<T>`가 어떤 키-값 쌍을 나타내는지와 이전 값 및 새 값에 대한 정보를 가지고 있는 `Array<Entry<T>>`로 정의될 것입니다. `Entry<T>`의 정의는 다음과 같을 것입니다:
zh_cn: 如果我们尝试使用高级结构来实现 `Felt252Dict<T>`，我们将在内部把它定义为 `Array<Entry<T>>` 其中每个 `Entry<T>` 都有关于它代表的键值对的信息，以及它持有的前一个值和新值。`Entry<T>` 的定义如下：

source: For each time we interact with a `Felt252Dict<T>`, a new `Entry<T>` will be registered:
ko: 각각의 `Felt252Dict<T>`와 상호 작용할 때마다 새로운 `Entry<T>`가 등록됩니다.

source: A `get` would register an entry where there is no change in state, and previous and new values are stored with the same value.
id: Sebuah `get` akan mendaftarkan sebuah entri di mana tidak ada perubahan dalam keadaan, dan nilai-nilai sebelumnya dan baru disimpan dengan nilai yang sama.
ko: `get`는 상태 변화가 없는 경우에 항목을 등록하며, 이전 값과 새 값이 동일한 값으로 저장됩니다.

source: An `insert` would register a new `Entry<T>` where the `new_value` would be the element being inserted, and the `previous_value` the last element inserted before this. In case it is the first entry for a certain key, then the previous value will be zero.
id: Sebuah `insert` akan mendaftarkan sebuah `Entry<T>` baru dimana `new_value` akan menjadi elemen yang sedang dimasukkan, dan `previous_value` akan menjadi elemen terakhir yang dimasukkan sebelum ini. Jika ini adalah entri pertama untuk sebuah kunci tertentu, maka nilai sebelumnya akan menjadi nol.
ko: `insert`는 `new_value`가 삽입되는 요소가 되고, `previous_value`는 이전에 삽입된 마지막 요소가 될 새로운 `Entry<T>`를 등록합니다. 특정 키에 대한 첫 번째 항목인 경우, 이전 값은 0이 됩니다.

source: The use of this entry list shows how there isn't any rewriting, just the creation of new memory cells per `Felt252Dict<T>` interaction. Let's show an example of this using the `balances` dictionary from the previous section and inserting the users 'Alex' and 'Maria':
id: Penggunaan daftar entri ini menunjukkan bahwa tidak ada penulisan ulang (rewriting), hanya penciptaan sel memori baru setiap kali ada interaksi dengan `Felt252Dict<T>`. Mari tunjukkan contohnya dengan menggunakan kamus `balances` dari bagian sebelumnya dan memasukkan pengguna 'Alex' dan 'Maria':
ko: 이 항목 목록의 사용은 다시 쓰기가 없고 `Felt252Dict<T>` 상호 작용당 새로운 메모리 셀이 생성되는 방식을 보여줍니다. 이전 섹션의 `balances` 사전을 사용하여 'Alex'와 'Maria' 사용자를 삽입하는 예시를 보여드립시다:
zh_cn: 条目列表的使用展示了这里没有任何值的覆盖，只是在每次`Felt252Dict<T>`交互中创建新的存储单元。让我们使用上一节中的 `balances` 字典并插入用户 'Alex' 和 'Maria' 来展示一个例子：

source: These instructions would then produce the following list of entries:
id: Instruksi-instruksi ini kemudian akan menghasilkan daftar entri berikut:
ko: 이 지침에 따라 다음과 같은 항목 목록이 생성됩니다:
zh_cn: 这些指令将产生以下条目列表：

source: key
ko: 열쇠

source: previous
ko: 이전

source: new
ko: 새로운

source: Alex
ko: 알렉스

source: Maria
ko: 마리아

source: Notice that since 'Alex' was inserted twice, it appears twice and the `previous` and `current` values are set properly. Also reading from 'Maria' registered an entry with no change from previous to current values.
id: Perhatikan bahwa karena 'Alex' dimasukkan dua kali, ia muncul dua kali dan nilai `sebelumnya` dan `saat ini` diatur dengan benar. Juga membaca dari 'Maria' mendaftarkan sebuah entri tanpa perubahan dari nilai sebelumnya ke nilai saat ini.
ko: 'Alex'가 두 번 삽입되었기 때문에 두 번 나타나며 `이전` 및 `현재` 값이 올바르게 설정되었음을 주목하세요. 또한 'Maria'에서 읽은 것은 이전 값에서 현재 값으로 변경이 없는 항목을 등록했습니다.
zh_cn: 注意，由于'Alex'被插入了两次，所以它出现了两次，并且'previous'和'current'值被正确的设置。从'Maria'中读取的数据也是一个条目，从前值到现值没有发生变化。

source: This approach to implementing `Felt252Dict<T>` means that for each read/write operation, there is a scan for the whole entry list in search of the last entry with the same `key`. Once the entry has been found, its `new_value` is extracted and used on the new entry to be added as the `previous_value`. This means that interacting with `Felt252Dict<T>` has a worst-case time complexity of `O(n)` where `n` is the number of entries in the list.
id: Pendekatan ini dalam mengimplementasikan `Felt252Dict<T>` berarti bahwa untuk setiap operasi baca/tulis, terjadi pemindaian pada seluruh daftar entri untuk mencari entri terakhir dengan `kunci` yang sama. Setelah entri ditemukan, `nilai_baru`-nya diekstrak dan digunakan pada entri baru yang akan ditambahkan sebagai `nilai_sebelumnya`. Hal ini berarti berinteraksi dengan `Felt252Dict<T>` memiliki kompleksitas waktu kasus terburuk `O(n)` di mana `n` adalah jumlah entri dalam daftar.
ko: `Felt252Dict<T>`를 구현하는 이 방법은 각 읽기/쓰기 작업마다, 동일한 `key`를 가진 마지막 항목을 찾기 위해 전체 항목 목록을 스캔합니다. 항목을 찾으면, `new_value`가 추출되어 새 항목의 `previous_value`로 사용됩니다. 이는 `Felt252Dict<T>`와 상호 작용하는 데 최악의 경우 시간 복잡도가 `O(n)`인 것을 의미합니다. 여기서 `n`은 목록의 항목 수입니다.
zh_cn: 这种实现 `Felt252Dict<T>` 的方法意味着每一次读/写操作，都要扫描整个条目列表，寻找最后一个具有相同 `key`的条目。一旦条目被找到，它的`new_value`就会被提取出来，并作为`previous_value`添加到新的条目中。这意味着与 `Felt252Dict<T>` 交互的最坏情况下的时间复杂度为 `O(n)`，其中 `n` 是列表中的条目数。

source: If you pour some thought into alternate ways of implementing `Felt252Dict<T>` you'd surely find them, probably even ditching completely the need for a `previous_value` field, nonetheless, since Cairo is not your normal language this won't work. One of the purposes of Cairo is, with the STARK proof system, to generate proofs of computational integrity. This means that you need to verify that program execution is correct and inside the boundaries of Cairo restrictions. One of those boundary checks consists of "dictionary squashing" and that requires information on both previous and new values for every entry.
id: Jika Anda memikirkan alternatif cara untuk mengimplementasikan `Felt252Dict<T>`, mungkin Anda akan menemukannya, bahkan mungkin benar-benar menghilangkan kebutuhan akan bidang `nilai_sebelumnya`. Namun, karena Cairo bukanlah bahasa yang biasa, hal ini tidak akan berhasil. Salah satu tujuan dari Cairo adalah, dengan sistem bukti STARK, untuk menghasilkan bukti integritas komputasi. Ini berarti Anda perlu memverifikasi bahwa eksekusi program adalah benar dan berada dalam batasan-batasan Cairo. Salah satu pemeriksaan batasan tersebut terdiri dari "dictionary squashing" dan hal itu membutuhkan informasi tentang nilai sebelumnya dan nilai baru untuk setiap entri.
ko: `Felt252Dict<T>`를 구현하는 대안적인 방법에 대해 고민해 보면, 아마도 `previous_value` 필드가 필요 없어져서 완전히 버려질 수도 있을 것입니다. 그러나 카이로는 일반적인 언어가 아니기 때문에 이 방법은 작동하지 않을 것입니다. 카이로의 목적 중 하나는 STARK 증명 시스템을 사용하여 계산 무결성의 증명을 생성하는 것입니다. 이는 프로그램 실행이 올바르고 카이로 제한 내에서 수행되었음을 확인해야 한다는 것을 의미합니다. 이러한 경계 검사 중 하나는 "사전 압축"이며, 이를 위해서는 각 항목의 이전 값과 새 값에 대한 정보가 필요합니다.

source: Squashing Dictionaries
id: Merenggut Kamus
ko: 사전 압축하기

source: To verify that the proof generated by a Cairo program execution that used a `Felt252Dict<T>` is correct, we need to check that there wasn't any illegal tampering with the dictionary. This is done through a method called `squash_dict` that reviews each entry of the entry list and checks that access to the dictionary remains coherent throughout the execution.
ko: Cairo 프로그램 실행 중 `Felt252Dict<T>`를 사용한 증명이 올바른지 확인하려면, 사전에 부정한 개입이 없었는지 확인해야 합니다. 이는 `squash_dict`라는 메서드를 통해 수행되며, 각 항목을 검토하고 실행 중에 사전에 대한 접근이 일관되게 유지되는지 확인합니다.

source: The process of squashing is as follows: given all entries with certain key `k`, taken in the same order as they were inserted, verify that the ith entry `new_value` is equal to the ith + 1 entry `previous_value`.
id: Proses merenggut (squashing) dilakukan sebagai berikut: diberikan semua entri dengan kunci tertentu `k`, diambil dalam urutan yang sama seperti saat mereka dimasukkan, verifikasi bahwa nilai `new_value` entri ke-i sama dengan nilai `previous_value` entri ke-(i+1).
ko: 압축 과정은 다음과 같습니다: 특정 키 `k`를 가진 모든 항목을 삽입된 순서대로 가져와서, i번째 항목 `new_value`가 i+1번째 항목 `previous_value`와 동일한지 확인합니다.
zh_cn: 压缩过程如下：给定所有具有特定键`k`的条目，按照它们被插入的相同顺序，验证第i个条目`new_value`是否等于第i+1个条目`previous_value`。

source: For example, given the following entry list:
id: Sebagai contoh, diberikan daftar entri berikut:
ko: 예를 들어, 다음과 같은 항목 목록이 주어졌을 때:
zh_cn: 例如，给定以下条目列表：

source: Charles
ko: 찰스

source: After squashing, the entry list would be reduced to:
id: Setelah proses merenggut (squashing), daftar entri akan berkurang menjadi:
ko: 스쿼싱 후, 참가 목록은 다음과 같이 줄어들 것입니다:
zh_cn: 压缩后，条目列表将缩减为：

source: In case of a change on any of the values of the first table, squashing would have failed during runtime.
id: Dalam kasus perubahan pada salah satu nilai dari tabel pertama, proses merenggut (squashing) akan gagal selama runtime.
ko: 첫 번째 테이블의 값 중 하나가 변경된 경우, 실행 중에 스쿼싱이 실패했을 것입니다.
zh_cn: 如果第一张表中的任何值发生变化，则在运行期间压缩将会失败。

source: Dictionary Destruction
id: Penghancuran Kamus
ko: 사전 파괴

source: If you run the examples from [Basic Use of Dictionaries](#basic-use-of-dictionaries), you'd notice that there was never a call to squash dictionary, but the program compiled successfully nonetheless. What happened behind the scene was that squash was called automatically via the `Felt252Dict<T>` implementation of the `Destruct<T>` trait. This call occurred just before the `balance` dictionary went out of scope.
ko: 만약 [사전의 기본 사용](#basic-use-of-dictionaries) 예제를 실행한다면, squash 사전을 호출한 적이 없음에도 불구하고 프로그램은 성공적으로 컴파일되었음을 알 수 있습니다. 실제로는 `Destruct<T>` 트레이트의 `Felt252Dict<T>` 구현을 통해 squash가 자동으로 호출되었습니다. 이 호출은 `balance` 사전이 스코프를 벗어나기 직전에 발생했습니다.

source: The `Destruct<T>` trait represents another way of removing instances out of scope apart from `Drop<T>`. The main difference between these two is that `Drop<T>` is treated as a no-op operation, meaning it does not generate new CASM while `Destruct<T>` does not have this restriction. The only type which actively uses the `Destruct<T>` trait is `Felt252Dict<T>`, for every other type `Destruct<T>` and `Drop<T>` are synonyms. You can read more about these traits in [Drop and Destruct](/appendix-03-derivable-traits.md#drop-and-destruct).
id: Trait `Destruct<T>` merupakan cara lain untuk menghapus instansi dari cakupan selain dari `Drop<T>`. Perbedaan utama antara keduanya adalah bahwa `Drop<T>` dianggap sebagai operasi no-op, yang berarti tidak menghasilkan CASM (Cairo Assembly) baru sedangkan `Destruct<T>` tidak memiliki batasan ini. Hanya tipe yang secara aktif menggunakan trait `Destruct<T>` adalah `Felt252Dict<T>`, untuk setiap tipe lain `Destruct<T>` dan `Drop<T>` adalah sinonim. Anda dapat membaca lebih lanjut tentang trait-trait ini dalam [Drop and Destruct](/appendix-03-derivable-traits.md#drop-and-destruct).
ko: `Destruct<T>` 트레이트는 `Drop<T>` 외에도 인스턴스를 범위에서 제거하는 또 다른 방법을 나타냅니다. 이 두 가지의 주요 차이점은 `Drop<T>`가 no-op 작업으로 처리된다는 것이며, 이는 새로운 CASM을 생성하지 않는다는 의미이며, `Destruct<T>`는 이러한 제한이 없다는 것입니다. `Destruct<T>` 트레이트를 활성적으로 사용하는 유일한 유형은 `Felt252Dict<T>`이며, 다른 모든 유형에 대해 `Destruct<T>`와 `Drop<T>`는 동의어입니다. 이러한 트레이트에 대해 더 읽을 수 있습니다. [Drop and Destruct](/appendix-03-derivable-traits.md#drop-and-destruct).
zh_cn: 除 `Drop<T>` 之外，`Destruct<T>` trait代表了另一种将实例移出作用域的方法。这两者之间的主要区别在于 `Drop<T>` 被视为一个 no-op 操作，这意味着它不会产生新的 CASM，而 `Destruct<T>` 没有这个限制。唯一主动使用`Destruct<T>`特性的类型是`Felt252Dict<T>`，对于其他类型`Destruct<T>`和`Drop<T>`是同义词。你可以在[Drop and Destruct](/appendix-03-derivable-traits.md#drop and-destruct)中阅读更多关于这些trait的信息。

source: Later in [Dictionaries as Struct Members](#dictionaries-as-struct-members), we will have a hands-on example where we implement the `Destruct<T>` trait for a custom type.
id: Nanti dalam bagian [Dictionaries as Struct Members](#dictionaries-as-struct-members), kita akan memiliki contoh praktis di mana kita akan mengimplementasikan trait `Destruct<T>` untuk sebuah tipe kustom.
ko: 나중에 [Dictionaries as Struct Members](#dictionaries-as-struct-members)에서는 사용자 정의 타입에 대해 `Destruct<T>` 트레이트를 구현하는 실습 예제가 있을 것입니다.
zh_cn: 在 [Dictionaries as Struct Members](#dictionaries-as-struct-members)后面，我们将有一个实践示例，我们将为自定义类型实现 `Destruct<T>` trait。

source: More Dictionaries
ko: 더 많은 사전

source: Up to this point, we have given a comprehensive overview of the functionality of `Felt252Dict<T>` as well as how and why it is implemented in a certain way. If you haven't understood all of it, don't worry because in this section we will have some more examples using dictionaries.
id: Hingga saat ini, kami telah memberikan gambaran menyeluruh tentang fungsionalitas `Felt252Dict<T>` serta bagaimana dan mengapa ia diimplementasikan dengan cara tertentu. Jika Anda belum memahami semuanya, jangan khawatir karena dalam bagian ini kami akan memberikan beberapa contoh lebih lanjut menggunakan kamus.
ko: 지금까지 `Felt252Dict<T>`의 기능에 대한 포괄적인 개요와 특정 방식으로 구현된 이유에 대해 설명해 왔습니다. 모두 이해하지 못했다면 걱정하지 마세요. 이 섹션에서는 사전을 사용한 몇 가지 더 많은 예제를 살펴볼 것입니다.
zh_cn: 到此为止，我们已经全面地介绍了`Felt252Dict<T>`的功能，以及它是如何和为什么以某种方式实现的。如果您还没有完全理解，请不要担心，因为在本节中我们将提供更多使用字典的示例。

source: We will start by explaining the `entry` method which is part of a dictionary basic functionality included in `Felt252DictTrait<T>` which we didn't mention at the beginning. Soon after, we will see examples of how `Felt252Dict<T>` [interacts](#dictionaries-of-types-not-supported-natively) with other complex types such as `Array<T>` and how to [implement](#dictionaries-as-struct-members) a struct with a dictionary as a member.
ko: 우리는 먼저 `Felt252DictTrait<T>`에 포함된 사전 기본 기능 중 하나인 `entry` 메소드를 설명하여 시작할 것입니다. 이는 우리가 처음에 언급하지 않았던 것입니다. 곧 그 다음에는 `Felt252Dict<T>`가 다른 복잡한 유형들과 상호 작용하는 예제들과 `Array<T>`와 같은 유형들과 어떻게 구현하는지에 대한 예제를 볼 것입니다. 또한 사전을 멤버로 가지는 구조체를 [구현](#dictionaries-as-struct-members)하는 방법도 살펴볼 것입니다.

source: Entry and Finalize
id: Entry dan Finalize
ko: 등록 및 완료

source: In the [Dictionaries Underneath](#dictionaries-underneath) section, we explained how `Felt252Dict<T>` internally worked. It was a list of entries for each time the dictionary was accessed in any manner. It would first find the last entry given a certain `key` and then update it accordingly to whatever operation it was executing. The Cairo language gives us the tools to replicate this ourselves through the `entry` and `finalize` methods.
id: Pada bagian [Dictionaries Underneath](#dictionaries-underneath), kami menjelaskan bagaimana `Felt252Dict<T>` bekerja secara internal. Ini adalah daftar entri untuk setiap kali kamus diakses dalam berbagai cara. Pertama, ia akan mencari entri terakhir berdasarkan suatu `kunci` tertentu, kemudian memperbarui sesuai dengan operasi apa pun yang sedang dieksekusi. Bahasa Cairo memberikan alat kepada kita untuk mereplikasi hal ini sendiri melalui metode `entry` dan `finalize`.
ko: [Dictionaries Underneath](#dictionaries-underneath) 섹션에서는 `Felt252Dict<T>`가 내부적으로 어떻게 작동하는지 설명했습니다. 이는 사전이 어떠한 방식으로든 액세스될 때마다 항목 목록이었습니다. 특정 `key`가 주어졌을 때 먼저 마지막 항목을 찾은 다음 해당 작업이 실행되는 대로 업데이트했습니다. Cairo 언어는 `entry` 및 `finalize` 메서드를 통해 우리에게 이를 직접 복제할 수 있는 도구를 제공합니다.
zh_cn: 在 [Dictionaries Underneath](#dictionaries-underneath) 部分，我们解释了 `Felt252Dict<T>` 内部是如何工作的。它是每次以任何方式访问字典时的条目列表。它会首先找到给定`key`的最后一个条目，然后根据执行的操作更新它。Cairo语言通过`entry`和`finalize`方法为我们提供了复制这种方式的工具。
