Repository: cairo-book/cairo-book
Catalog: po/*.po
Languages: es, id, ko, zh_cn

source: In the match expression for this code, we add a variable called `state` to the pattern that matches values of the variant `Coin::Quarter`. When a `Coin::Quarter` matches, the `state` variable will bind to the value of that quarter’s state. Then we can use `state` in the code for that arm, like so:
es: En la expresión `match` de este código, agregamos una variable llamada `state` al patrón que coincide con los valores de la variante `Coin::Quarter`. Cuando se hace una coincidencia de `Coin::Quarter`, la variable `state` se vinculará al valor del estado de ese cuarto. Luego podemos usar `state` en el código para ese brazo, así:
id: Dalam ekspresi match untuk kode ini, kita menambahkan variabel yang disebut `state` ke dalam pola yang cocok dengan nilai dari varian `Coin::Quarter`. Ketika `Coin::Quarter` cocok, variabel `state` akan terikat pada nilai negara bagian koin tersebut. Kemudian kita dapat menggunakan `state` dalam kode untuk lengan tersebut, seperti berikut:
zh_cn: 在这段代码的match表达式中，我们在模式中添加了一个叫做 `state` 的变量，用来匹配变量 `Coin::Quarter` 的值。当 `Coin::Quarter` 匹配时，`state` 变量将与该季度的状态值绑定。然后我们可以在该分支的代码中使用 `state`，像这样：

source: To print the value of a variant of an enum in Cairo, we need to add an implementation for the `print` function for the `debug::PrintTrait`:
es: Para imprimir el valor de una variante de un enum en Cairo, necesitamos agregar una implementación para la función `print` de `debug::PrintTrait`:
id: Untuk mencetak nilai dari suatu varian enum di Cairo, kita perlu menambahkan implementasi untuk fungsi `print` pada `debug::PrintTrait`:
zh_cn: 为了在 Cairo 打印一个枚举的变量的值，我们需要为`debug::PrintTrait` 添加一个 `print` 函数的实现：

source: If we were to call `value_in_cents(Coin::Quarter(UsState::Alaska))`, `coin` would be `Coin::Quarter(UsState::Alaska)`. When we compare that value with each of the match arms, none of them match until we reach `Coin::Quarter(state)`. At that point, the binding for state will be the value `UsState::Alaska`. We can then use that binding in the `PrintTrait`, thus getting the inner state value out of the `Coin` enum variant for `Quarter`.
id: Jika kita memanggil `value_in_cents(Coin::Quarter(UsState::Alaska))`, `coin` akan menjadi `Coin::Quarter(UsState::Alaska)`. Ketika kita membandingkan nilai tersebut dengan setiap lengan match, tidak ada yang cocok sampai kita mencapai `Coin::Quarter(state)`. Pada titik tersebut, pengikatan untuk state akan menjadi nilai `UsState::Alaska`. Kita kemudian dapat menggunakan pengikatan tersebut dalam `PrintTrait`, sehingga mendapatkan nilai dalam varian enum `Coin` untuk `Quarter`.
zh_cn: 如果我们调用 `value_in_cents(Coin::quarter(UsState::Alaska))`，`coin` 将是 `Coin::quarter(UsState::Alaska)`。当我们将该值与每个匹配臂进行比较时，没有一个匹配，直到我们到达 `Coin::Quarter(state)`。在这一点上，state 的绑定将是 `UsState::Alaska` 的值。然后我们可以在 `PrintTrait` 中使用该绑定，从而从 `Coin` 枚举变量中获得 `Quarter` 的内部状态值。

source: ## Matching with Options
es: ## Coincidencia Con Opciones
zh_cn: ## 匹配 Option<T>

source: In the previous section, we wanted to get the inner `T` value out of the `Some` case when using `Option<T>`; we can also handle `Option<T>` using `match`, as we did with the `Coin` enum! Instead of comparing coins, we’ll compare the variants of `Option<T>`, but the way the `match` expression works remains the same. You can use Options by importing the `option::OptionTrait` trait.
es: En la sección anterior, queríamos obtener el valor interno `T` fuera del caso `Some` al usar `Option<T>`; ¡también podemos manejar `Option<T>` usando `match`, como lo hicimos con el `enum` `Coin`! En lugar de comparar monedas, compararemos las variantes de `Option<T>`, pero la forma en que funciona la expresión `match` sigue siendo la misma. Puedes usar opciones importando el trait `option::OptionTrait`.
id: Pada bagian sebelumnya, kita ingin mendapatkan nilai dalam `T` dari kasus `Some` saat menggunakan `Option<T>`; kita juga dapat menangani `Option<T>` menggunakan `match`, seperti yang kita lakukan dengan enum `Coin`! Alih-alih membandingkan koin, kita akan membandingkan variasi dari `Option<T>`, tetapi cara kerja ekspresi `match` tetap sama. Anda dapat menggunakan Options dengan mengimpor trait `option::OptionTrait`.
zh_cn: 在上一节中，我们想在使用 `Option<T>` 时从 `Some` 情况下得到内部的 `T` 值；我们也可以使用`match` 来处理 `Option<T>`，就像我们对 `Coin` 枚举所做的那样! 只不过这回比较的不再是硬币，而是比较 `Option<T>` 的成员，但 `match` 表达式的工作方式保持不变。你可以通过导入 `option::OptionTrait` trait来使用Option。

source: This function is very easy to write, thanks to match, and will look like Listing 6-5.
id: Fungsi ini sangat mudah ditulis, berkat penggunaan match, dan akan terlihat seperti pada Listing 6-5.
zh_cn: 这个函数非常容易编写，这要归功于 match，它看起来像示例6-5。

source: <span class="caption">Listing 6-5: A function that uses a match expression on an `Option<u8>`</span>
zh_cn: 示例6-5：一个在`Option<u8>`上使用匹配表达式的函数

source: Note that your arms must respect the same order as the enum defined in the `OptionTrait` of the core Cairo lib.
es: Tenga en cuenta que los brazos (`arms`) deben respetar el mismo orden que el enum definido en `OptionTrait` de la librería central de Cairo.
id: Perlu diingat bahwa bagian-bagian (arms) Anda harus mengikuti urutan yang sama seperti enum yang didefinisikan dalam `OptionTrait` dari pustaka inti Cairo.
zh_cn: 注意，你的分支顺序与核心Cairo库的`OptionTrait`中定义的枚举顺序必须相同。

source: Let’s examine the first execution of `plus_one` in more detail. When we call `plus_one(five)`, the variable `x` in the body of `plus_one` will have the value `Some(5)`. We then compare that against each match arm:
es: Examinemos más detalladamente la primera ejecución de `plus_one`. Cuando llamamos a `plus_one(five)`, la variable `x` en el cuerpo de `plus_one` tendrá el valor `Some(5)`. Luego comparamos eso con cada rama del `match`:
id: Mari kita telaah secara lebih detail eksekusi pertama dari `plus_one`. Ketika kita memanggil `plus_one(five)`, variabel `x` dalam tubuh `plus_one` akan memiliki nilai `Some(5)`. Kemudian kita membandingkannya dengan setiap bagian dalam `match`:
zh_cn: 让我们更详细地看一下 `plus_one` 的第一次执行。当我们调用 `plus_one(five)` 时，`plus_one` 函数体中的变量 `x` 的值是 `Some(5)`。然后我们将其与每个匹配分支进行比较：

source: Does `Option::Some(5)` value match the pattern `Option::Some(val)`? It does! We have the same variant. The `val` binds to the value contained in `Option::Some`, so `val` takes the value `5`. The code in the match arm is then executed, so we add `1` to the value of `val` and create a new `Option::Some` value with our total `6` inside. Because the first arm matched, no other arms are compared.
es: ¿El valor `Option::Some(5)` coincide con el patrón `Option::Some(val)`? ¡Sí lo hace! Tenemos la misma variante. El `val` se enlaza al valor contenido en `Option::Some`, por lo que `val` toma el valor `5`. Luego se ejecuta el código en el brazo del `match`, por lo que sumamos `1` al valor de `val` y creamos un nuevo valor `Option::Some` con nuestro total `6` en su interior. Debido a que el primer brazo coincide, no se comparan los demás brazos.
id: Apakah nilai `Option::Some(5)` cocok dengan pola `Option::Some(val)`? Ya, cocok! Kita memiliki varian yang sama. `val` diikat ke nilai yang terkandung dalam `Option::Some`, sehingga `val` mengambil nilai `5`. Kode dalam bagian match kemudian dieksekusi, sehingga kita menambahkan `1` ke nilai `val` dan membuat nilai `Option::Some` baru dengan total `6` di dalamnya. Karena bagian pertama cocok, tidak ada bagian lain yang dibandingkan.
zh_cn: `Option::Some(5)` 和`Option::Some(val)`匹配吗？当然匹配！它们是相同的成员。`val` 与 `Option::Some` 中包含的值绑定，所以 `val` 取值为 `5` 。接着匹配分支的代码被执行，所以我们在 `val` 的值上加上 `1`，并创建一个新的 `Option::Some` 值，里面有我们的和 `6` 。因为第一个分支就匹配到了，其他的分支将不再进行比较。

source: Now let’s consider the second call of `plus_one` in our main function, where `x` is `Option::None`. We enter the match and compare to the first arm:
id: Sekarang mari kita pertimbangkan panggilan kedua dari `plus_one` dalam fungsi utama kita, di mana `x` adalah `Option::None`. Kita masuk ke dalam match dan membandingkannya dengan bagian pertama:
zh_cn: 现在让我们考虑在我们的主函数中对 `plus_one` 的第二次调用，其中 `x` 是`Option::None`。我们进入匹配，并与第一个分支进行比较：

source: It matches! There’s no value to add to, so the program stops and returns the `Option::None` value on the right side of `=>`.
id: Cocok! Tidak ada nilai yang dapat ditambahkan, jadi program berhenti dan mengembalikan nilai `Option::None` pada sisi kanan dari `=>`.
zh_cn: 它是匹配的!没有值可以添加，所以程序停止，并返回 `=>` 右边的 `Option::None` 值。

source: ## Matches Are Exhaustive
es: ## Los Matches Son Exhaustivos
zh_cn: ## 匹配是穷尽的

source: There’s one other aspect of match we need to discuss: the arms’ patterns must cover all possibilities. Consider this version of our `plus_one` function, which has a bug and won’t compile:
es: Hay otro aspecto de los matches que necesitamos discutir: los patrones de los brazos deben cubrir todas las posibilidades. Considera esta versión de nuestra función `plus_one`, que tiene un error y no se compilará:
id: Ada satu aspek lain dari match yang perlu kita bahas: pola-pola dari setiap bagian harus mencakup semua kemungkinan. Pertimbangkan versi fungsi `plus_one` kita yang ini, yang memiliki bug dan tidak akan dapat dikompilasi:
zh_cn: 还有另一方面需要讨论：这些分支必须覆盖了所有的可能性。考虑一下 `plus_one` 函数的这个版本，它有一个 bug 并不能编译：

source: ## Match 0 and the \_ Placeholder
es: ## Match 0 y el Comodín \_
zh_cn: ## Match 0 与 \_ 占位符

source: Using enums, we can also take special actions for a few particular values, but for all other values take one default action. Currently only `0` and the `_`operator are supported.
es: Usando enums, también podemos tomar acciones especiales para algunos valores particulares, pero para todos los demás valores tomar una acción predeterminada. Actualmente solo se admiten `0` y el operador `_`.
id: Dengan menggunakan enum, kita juga dapat melakukan tindakan khusus untuk beberapa nilai tertentu, namun untuk semua nilai lainnya, kita lakukan satu tindakan default. Saat ini, hanya `0` dan operator `_` yang didukung.
zh_cn: 使用枚举，我们也可以对一些特定的值采取特殊的操作，但对所有其他的值采取一个默认的操作。目前只支持 `0` 和 `_` 操作符。

source: Imagine we’re implementing a game where, you get a random number between 0 and 7. If you have 0, you win. For all other values you lose. Here's a match that implements that logic, with the number hardcoded rather than a random value.
es: Imaginemos que estamos implementando un juego en el que obtienes un número aleatorio entre 0 y 7. Si tienes 0, ganas. Para todos los demás valores, pierdes. Aquí hay un `match` que implementa esa lógica, con el número codificado en lugar de ser un valor aleatorio.
id: Bayangkan kita sedang mengimplementasikan sebuah permainan di mana Anda mendapatkan angka acak antara 0 dan 7. Jika Anda mendapatkan 0, Anda menang. Untuk semua nilai lainnya, Anda kalah. Berikut adalah pola match yang mengimplementasikan logika tersebut, dengan angka yang ditentukan secara manual daripada nilai acak.
zh_cn: 想象一下，我们正在实现一个游戏，你会获得一个 0 到 7 之间的随机数字。如果你有 0，你就赢了。若是任何其他的值，你就输了。这里有一个实现该逻辑的 match，数字是硬编码的，而不是随机值。

source: The first arm, the pattern is the literal values 0. For the last arm that covers every other possible value, the pattern is the character `_`. This code compiles, even though we haven’t listed all the possible values a `felt252` can have, because the last pattern will match all values not specifically listed. This catch-all pattern meets the requirement that `match` must be exhaustive. Note that we have to put the catch-all arm last because the patterns are evaluated in order. If we put the catch-all arm earlier, the other arms would never run, so Cairo will warn us if we add arms after a catch-all!
es: Para el primer brazo, el patrón es el valor literal 0. Para el último brazo, que cubre todos los demás valores posibles, el patrón es el carácter `_`. Este código compila, aunque no hayamos enumerado todos los valores posibles que puede tener `felt252`, porque el último patrón coincidirá con todos los valores no enumerados específicamente. Este patrón catch-all cumple el requisito de que `match` debe ser exhaustivo. Tenga en cuenta que tenemos que poner la rama catch-all en último lugar porque los patrones se evalúan en orden. Si pusiéramos el brazo catch-all antes, los otros brazos nunca se ejecutarían, ¡así que Cairo nos avisará si añadimos brazos después de un catch-all!
id: Bagian pertama, polanya adalah nilai literal 0. Untuk bagian terakhir yang mencakup setiap nilai lain yang mungkin, polanya adalah karakter `_`. Kode ini dikompilasi, meskipun kita tidak mencantumkan semua nilai yang mungkin dimiliki oleh `felt252`, karena pola terakhir akan cocok dengan semua nilai yang tidak secara khusus terdaftar. Pola penangkapan ini memenuhi persyaratan bahwa `match` harus lengkap. Perlu dicatat bahwa kita harus menempatkan bagian penangkapan terakhir terakhir karena pola dievaluasi berurutan. Jika kita menempatkan bagian penangkapan terakhir lebih awal, bagian lainnya tidak akan pernah dieksekusi, sehingga Cairo akan memberi peringatan jika kita menambahkan bagian setelah bagian penangkapan terakhir!
zh_cn: 第一条分支，模式是字面值 0。对于涵盖了所有其他可能的值的最后一条分支，其模式是字符 `_`。尽管我们没有列出 `felt252` 可能具有的所有值，但这段代码仍然可以编译，因为最后一个模式将匹配所有没有特别列出的值。这个通配模式满足了 `match` 必须被穷尽的要求。请注意，我们必须把通配分支放在最后，因为模式是按顺序评估的。如果我们把通配分支放在前面，其他的分支就不会运行，所以如果我们在通配分支之后添加分支，Cairo 会警告我们!

source: # Managing Cairo Projects with Packages, Crates and Modules
es: # Gestión de proyectos Cairo con Paquetes, Crates y Módulos
zh_cn: # 使用包、Crate 和模块管理Cairo项目

source: As you write large programs, organizing your code will become increasingly important. By grouping related functionality and separating code with distinct features, you’ll clarify where to find code that implements a particular feature and where to go to change how a feature works.
es: A medida que escriba programas grandes, la organización de su código se volverá cada vez más importante. Al agrupar funcionalidades relacionadas y separar el código con características distintas, aclarará dónde encontrar el código que implementa una característica en particular y dónde ir para cambiar cómo funciona una característica.
zh_cn: 当你编写大型程序时，组织你的代码将变得越来越重要。 通过对相关的功能进行分组，并将具有不同功能的代码分开，你就可以清楚地知道在哪里可以找到实现某一特定的代码，以及到哪里去改变一个功能的工作方式。

source: The programs we’ve written so far have been in one module in one file. As a project grows, you should organize code by splitting it into multiple modules and then multiple files. As a package grows, you can extract parts into separate crates that become external dependencies. This chapter covers all these techniques.
es: Los programas que hemos escrito hasta ahora han estado en un módulo en un archivo. A medida que proyecto crece, debe organizar el código dividiéndolo en varios módulos y luego en varios archivos. A medida que un paquete crece, puede extraer partes en cajas separadas que se convierten en dependencias externas. Este capítulo cubre todas estas técnicas.
zh_cn: 到目前为止，我们所写的程序都是在一个文件中的一个模块中。 伴随着项目的增长，你应该通过将代码分解为多个模块和多个文件来组织代码。 伴随着包的增长，你可以将包中的部分代码提取出来，做成独立的 crate，这些 crate 则作为外部依赖项。 本章将会涵盖所有这些概念。

source: We’ll also discuss encapsulating implementation details, which lets you reuse code at a higher level: once you’ve implemented an operation, other code can call your code without having to know how the implementation works.
es: También discutiremos la encapsulación de detalles de implementación, lo que le permite reutilizar el código a un nivel superior: una vez que ha implementado una operación, otro código puede llamar a su código sin tener que saber cómo funciona la implementación.
zh_cn: 我们也会讨论封装来实现细节，这可以使你更高级地重用代码：你实现了一个操作后，其他的代码可以通过该代码的公共接口来进行调用，而不需要知道它是如何实现的。

source: A related concept is scope: the nested context in which code is written has a set of names that are defined as “in scope.” When reading, writing, and compiling code, programmers and compilers need to know whether a particular name at a particular spot refers to a variable, function, struct, enum, module, constant, or other item and what that item means. You can create scopes and change which names are in or out of scope. You can’t have two items with the same name in the same scope.
es: Un concepto relacionado es el ámbito: el contexto anidado en el que se escribe el código tiene un conjunto de nombres que se definen como "en ámbito". Al leer, escribir y compilar código, los programadores y compiladores deben saber si un nombre particular en un lugar particular se refiere a una variable, función, estructura, enumeración, módulo, constante u otro elemento y qué significa ese elemento. Puede crear ámbitos y cambiar qué nombres están dentro o fuera de ámbito. No puede tener dos elementos con el mismo nombre en el mismo ámbito.
zh_cn: 这里有一个需要说明的概念 “作用域（scope）”：代码所在的嵌套上下文有一组定义为 “in scope” 的名称。当阅读、编写和编译代码时，程序员和编译器需要知道特定位置的特定名称是否引用了变量、函数、结构体、枚举、模块、常量或者其他有意义的项。你可以创建作用域，以及改变哪些名称在作用域内还是作用域外。同一个作用域内不能拥有两个相同名称的项。

source: Cairo has a number of features that allow you to manage your code’s organization. These features, sometimes collectively referred to as the _module system_, include:
es: Cairo tiene varias características que le permiten gestionar la organización de su código. Estas características, a veces denominadas colectivamente el _sistema de módulos_, incluyen:
zh_cn: Cairo有许多功能可以让你管理代码的组织。这些功能。这有时被称为 “模块系统（the module system）”，包括：

source: - **Packages:** A Scarb feature that lets you build, test, and share crates - **Crates:** A tree of modules that corresponds to a single compilation unit. It has a root directory, and a root module defined at the file `lib.cairo` under this directory. - **Modules** and **use:** Let you control the organization and scope of items. - **Paths:** A way of naming an item, such as a struct, function, or module
es: - **Paquetes:** Una característica de Scarb que le permite construir, probar y compartir Crates. - **Crates:** Un árbol de módulos que corresponde a una única unidad de compilación. Tiene un directorio raíz y un módulo raíz definido en el archivo `lib.cairo` bajo este directorio. - **Módulos** y **use:** le permiten controlar la organización y el ámbito de los elementos. - **Rutas:** una forma de nombrar un elemento, como una estructura, función o módulo
zh_cn: - **Packages:** Scarb的一个功能，可以让你建立、测试和分享crates。 - **Crates:** 一个模块的树形结构，对应于一个单一的编译单元。 它有一个根目录，并在该目录下的`lib.cairo`文件中定义了一个根模块。 - **Modules** 和 **use:** 允许你控制组织结构和作用域。 - **Paths:** 一个命名例如结构体、函数或模块等项的方式

source: In this chapter, we’ll cover all these features, discuss how they interact, and explain how to use them to manage scope. By the end, you should have a solid understanding of the module system and be able to work with scopes like a pro!
es: En este capítulo, cubriremos todas estas características, discutiremos cómo interactúan, y cómo utilizarlas para gestionar el alcance. Al final, ¡Deberías tener una sólida comprensión del sistema de módulos y serás capaz de trabajar con ámbitos como un profesional!
zh_cn: 在这一章中，我们将介绍所有这些特性，讨论它们如何相互作用，以及解释如何使用它们来管理作用域。到最后，你应该对模块系统有一个扎实的理解，并且能够像专家一样使用作用域了！

source: # Packages and Crates
es: # Paquetes y Crates
zh_cn: # 包和 Crate

source: ## What is a crate?
es: ## ¿Qué es un Crate?
zh_cn: ## 什么是crate？

source: ## What is the crate root?
es: ## ¿Qué es la Raíz del Crate?
zh_cn: ## 什么是crate root？

source: ## What is a package?
es: ## ¿Qué es un Paquete?
zh_cn: ## 什么是包？

source: ## Creating a Package with Scarb
es: ## Creación de un Paquete con Scarb
zh_cn: ## 用Scarb创建一个包

source: - `src/` is the main directory where all the Cairo source files for the package will be stored. - `lib.cairo` is the default root module of the crate, which is also the main entry point of the package. - `Scarb.toml` is the package manifest file, which contains metadata and configuration options for the package, such as dependencies, package name, version, and authors. You can find documentation about it on the [scarb reference](https://docs.swmansion.com/scarb/docs/reference/manifest.html).
zh_cn: - `src/`是主目录，包的所有Cairo源代码文件将存放在这里。 - `lib.cairo`是crate的默认根模块，也是包的主要入口点。 - `Scarb.toml`是包示例文件，它包含包的元数据和配置选项，如依赖关系、包名称、版本和作者。你可以在[scarb reference](https://docs.swmansion.com/scarb/docs/reference/manifest.html)上找到关于它的文档。

source: ## Defining Modules to Control Scope
es: ## Definición de Módulos para Controlar el Ámbito
zh_cn: ## 定义模块以控制作用域

source: In this section, we’ll talk about modules and other parts of the module system, namely _paths_ that allow you to name items and the `use` keyword that brings a path into scope.
es: En esta sección, hablaremos sobre los módulos y otras partes del sistema de módulos, como las _rutas_ que le permiten nombrar elementos y la palabra clave `use` que introduce una ruta en el ámbito.
zh_cn: 在本节，我们将讨论模块和其它一些关于模块系统的部分，如允许你命名项的 路径（_paths_）；用来将路径引入作用域的`use`关键字。

source: First, we’re going to start with a list of rules for easy reference when you’re organizing your code in the future. Then we’ll explain each of the rules in detail.
es: Primero, vamos a comenzar con una lista de reglas para su fácil referencia cuando esté organizando su código en el futuro. Luego explicaremos cada una de las reglas en detalle.
zh_cn: 首先，我们将从一系列的规则开始，在你未来组织代码的时候，这些规则可被用作简单的参考。接下来我们将会详细的解释每条规则。

source: ### Modules Cheat Sheet
es: ### Hoja de Trucos de Módulos
zh_cn: ### 模块小抄

source: Here we provide a quick reference on how modules, paths and the `use` keyword work in the compiler, and how most developers organize their code. We’ll be going through examples of each of these rules throughout this chapter, but this is a great place to refer to as a reminder of how modules work. You can create a new Scarb project with `scarb new backyard` to follow along.
es: Aquí ofrecemos una referencia rápida sobre cómo funcionan los módulos, las rutas y la palabra clave use y cómo la mayoría de los desarrolladores organizan su código. código. Veremos ejemplos de cada una de estas reglas a lo largo de este capítulo, pero este es un buen lugar para recordar cómo funcionan los módulos. funcionan. Puede crear un nuevo proyecto Scarb con `scarb new backyard` para seguirlo.
zh_cn: 这里我们提供一个简单的参考，用来解释模块、路径、 `use`关键词如何在编译器中工作，以及大部分开发者如何组织他们的代码。我们将在本章节中举例说明每条规则，不过这是一个解释模块工作方式的良好参考。你可以用`scarb new backyard`创建一个新的Scarb项目来跟随。
