Repository: cairo-book/cairo-book
Catalog: po/*.po
Languages: es, id, ko, zh_cn

source: To convert a snapshot back into a regular value, you can use the `desnap` operator `*`, which serves as the opposite of the `@` operator: the snapshot value is copied to a new variable.
id: Untuk mengonversi sebuah snapshot kembali menjadi nilai regular, Anda dapat menggunakan operator `desnap` `*`, yang berfungsi sebagai kebalikan dari operator `@`: nilai snapshot akan disalin ke variabel baru.
zh_cn: 要将快照转换回常规值，可以使用 `desnap` 操作符 `*`，它的作用与 `@`操作符相反：快照值被复制到一个新变量中。

source: It's important to note that during this conversion process, the value it points to is copied into a new variable. This enables multiple uses of the underlying value without concerns about ownership transfers. This also means that the value pointed to by the snapshot must be copyable (which is not the case for Arrays, as they don't implement `Copy`).
id: Penting untuk dicatat bahwa selama proses konversi ini, nilai yang ditunjuknya disalin ke dalam variabel baru. Ini memungkinkan penggunaan ganda dari nilai dasar tanpa kekhawatiran tentang transfer kepemilikan. Ini juga berarti bahwa nilai yang ditunjuk oleh snapshot harus dapat disalin (copyable) (yang bukan merupakan kasus untuk Arrays, karena mereka tidak mengimplementasikan `Copy`).
zh_cn: 值得注意的是，在这个转换过程中，它所指向的值会被复制到一个新变量中。这样就可以多次使用底层值，而不必担心所有权转移。这也意味着快照指向的值必须是可复制的（而数组则不然，因为它们没有实现 `Copy`）。

source: But, what happens if we try to modify something we’re passing as snapshot? Try the code in Listing 4-6. Spoiler alert: it doesn’t work!
zh_cn: 但是，如果我们试图修改我们作为快照传递的东西会发生什么？试试下面的代码 示例4-6。剧透一下：它不起作用!

source: <span class="caption">Listing 4-6: Attempting to modify a snapshot value</span>
zh_cn: <span class="caption">示例4-6：试图修改一个快照值</span>

source: ### Mutable References
es: ### Referencias Mutables
zh_cn: ### 可变引用

source: We can achieve the behavior we want in Listing 4-6 by using a _mutable reference_ instead of a snapshot. Mutable references are actually mutable values passed to a function that are implicitly returned at the end of the function, returning ownership to the calling context. By doing so, they allow you to mutate the value passed while keeping ownership of it by returning it automatically at the end of the execution. In Cairo, a parameter can be passed as _mutable reference_ using the `ref` modifier.
zh_cn: 在示例4-6中，我们也可以通过使用 _mutable reference_ 而不是快照来实现我们想要的行为。可变引用实际上是传递给函数的可变值，在函数结束时被隐式返回，将所有权返回给调用的上下文。通过这样做，它们允许你对传递的值进行改变，同时通过在执行结束时自动返回来保持对它的所有权。 在Cairo中，一个参数可以使用`ref`修饰符作为 _mutable reference_ 传递。

source: > **Note**: In Cairo, a parameter can only be passed as _mutable reference_ using the `ref` modifier if the variable is declared as mutable with `mut`.
es: > **Nota**: En Cairo, un parámetro solo se puede pasar como _referencia mutable_ utilizando el modificador `ref` si la variable se declara como mutable con `mut`.
zh_cn: > **注意**：在Cairo中，只有在变量用`mut`声明为可变的情况下，才能使用`ref`修饰符将参数作为可变的引用传递。

source: In Listing 4-7, we use a mutable reference to modify the value of the `height` and `width` fields of the `Rectangle` instance in the `flip` function.
id: Pada Listing 4-7, kita menggunakan mutable reference untuk memodifikasi nilai dari bidang `height` dan `width` dari instance `Rectangle` dalam fungsi `flip`.
zh_cn: 在示例4-7中，我们使用一个可变的引用来修改`Rectangle`实例在`flip`函数中的`height`和`width`字段的值。

source: <span class="caption">Listing 4-7: Use of a mutable reference to modify a value</span>
zh_cn: <span class="caption">示例 4-7：使用一个可变的引用来修改一个值</span>

source: ### Small recap
es: ### Pequeño resumen
zh_cn: ### 小结

source: Let’s recap what we’ve discussed about ownership, snapshots, and references:
es: Como resumen, lo que hemos discutido acerca de ownership, snapshots y las referencias es:
id: Mari kita tinjau kembali apa yang telah kita bahas tentang kepemilikan, snapshot, dan referensi:
zh_cn: 让我们回顾一下我们已经讨论过的关于所有权、快照和引用的内容：

source: - At any given time, a variable can only have one owner. - You can pass a variable by-value, by-snapshot, or by-reference to a function. - If you pass-by-value, ownership of the variable is transferred to the function. - If you want to keep ownership of the variable and know that your function won’t mutate it, you can pass it as a snapshot with `@`. - If you want to keep ownership of the variable and know that your function will mutate it, you can pass it as a mutable reference with `ref`.
es: - En un momento dado, una variable solo puede tener un propietario. - Puedes pasar una variable por valor, por instantánea o por referencia a una función. - Si pasas una variable por valor, la propiedad de la variable se transfiere a la función. - Si quieres mantener la propiedad de la variable y sabes que tu función no la va a modificar, puedes pasarla como instantánea con `@`. - Si quieres mantener la propiedad de la variable y sabes que tu función la modificará, puedes pasarla como referencia mutable con `ref`.
zh_cn: - 在任何时候，一个变量只能有一个所有者。 - 你可以将一个变量以值的方式、以快照的方式、或以引用的方式传递给一个函数。 - 如果你按值传递，变量的所有权就会转移到函数中。 - 如果你想保留变量的所有权，并且知道你的函数不会改变它，你可以用`@`把它作为一个快照传递。 - 如果你想保留变量的所有权，并且知道你的函数会改变它，你可以用`ref`把它作为一个可改变的引用来传递。

source: # Using Structs to Structure Related Data
es: # Usando structs para estructurar datos relacionados
zh_cn: # 使用结构体组织相关联的数据

source: We’ll demonstrate how to define and instantiate structs. We’ll discuss how to define associated functions, especially the kind of associated functions called methods, to specify behavior associated with a struct type. Structs and enums (discussed in the next chapter) are the building blocks for creating new types in your program’s domain to take full advantage of Cairo's compile-time type checking.
es: Demostraremos cómo definir e instanciar structs. Discutiremos cómo definir funciones asociadas, especialmente el tipo de funciones asociadas llamadas métodos, para especificar el comportamiento asociado con un tipo de struct. Los structs y los enums (discutidos en el Capítulo 6) son los bloques de construcción para crear nuevos tipos en el dominio de tu programa para aprovechar al máximo la verificación de tipos en tiempo de compilación de Cairo.
id: Kami akan menunjukkan bagaimana mendefinisikan dan menginisialisasi struct. Kami akan membahas bagaimana mendefinisikan fungsi terkait, terutama jenis fungsi terkait yang disebut metode, untuk menentukan perilaku yang terkait dengan tipe struct. Struct dan enum (dibahas dalam bab berikutnya) adalah blok bangunan untuk membuat tipe baru dalam domain program Anda untuk memanfaatkan penuh pemeriksaan tipe pada waktu kompilasi Cairo.
zh_cn: 我们还将演示如何定义和实例化结构体，并讨论如何定义关联函数，特别是被称为 _方法_ 的关联函数，以指定与结构体类型相关的行为。你可以在程序中基于结构体和枚举（enum）（将在下一章讨论）创建新类型，以充分利用 Cairo 的编译时类型检查。

source: # Defining and Instantiating Structs
es: # Definiendo e Instanciando una Estructura
zh_cn: # 结构体的定义和实例化

source: <span class="caption">Listing 5-1: A `User` struct definition</span>
zh_cn: <span class="caption">示例5-1：一个 `User` 结构定义</span>

source: To use a struct after we’ve defined it, we create an _instance_ of that struct by specifying concrete values for each of the fields. We create an instance by stating the name of the struct and then add curly brackets containing _key: value_ pairs, where the keys are the names of the fields and the values are the data we want to store in those fields. We don’t have to specify the fields in the same order in which we declared them in the struct. In other words, the struct definition is like a general template for the type, and instances fill in that template with particular data to create values of the type.
es: Para usar una estructura después de haberla definido, creamos una instancia de esa estructura especificando valores concretos para cada uno de los campos. Creamos una instancia indicando el nombre de la estructura y luego agregamos corchetes que contienen pares de *clave: valor*, donde las claves son los nombres de los campos y los valores son los datos que queremos almacenar en esos campos. No tenemos que especificar los campos en el mismo orden en que los declaramos en la estructura. En otras palabras, la definición de una estructura es como una plantilla general para el tipo y las instancias completan esa plantilla con datos particulares para crear valores del tipo.
zh_cn: 一旦定义了结构体后，为了使用它，通过为每个字段指定具体值来创建这个结构体的 *实例*。 我们创建一个实例需要以结构体的名字开头，接着在大括号中使用 `key: value` 键 - 值对的形式提供字段，其中 key 是字段的名字，value 是需要存储在字段中的数据值。实例中字段的顺序不需要和它们在结构体中声明的顺序一致。换句话说，结构体的定义就像一个类型的通用模板，而实例则会在这个模板中放入特定数据来创建这个类型的值。

source: For example, we can declare a particular user as shown in Listing 5-2.
id: Sebagai contoh, kita dapat mendeklarasikan seorang pengguna tertentu seperti yang ditunjukkan pada Listing 5-2.
zh_cn: 例如，我们可以如示例5-2所示声明一个特定的用户。

source: <span class="caption">Listing 5-2: Creating an instance of the `User` struct</span>
zh_cn: <span class="caption">示例5-2：创建一个`User`结构的实例</span>

source: To get a specific value from a struct, we use dot notation. For example, to access this user’s email address, we use `user1.email`. If the instance is mutable, we can change a value by using the dot notation and assigning into a particular field. Listing 5-3 shows how to change the value in the `email` field of a mutable `User` instance.
id: Untuk mendapatkan nilai spesifik dari sebuah struct, kita menggunakan notasi titik (dot notation). Sebagai contoh, untuk mengakses alamat email dari pengguna ini, kita gunakan `user1.email`. Jika instance tersebut mutable, kita dapat mengubah sebuah nilai dengan menggunakan notasi titik dan melakukan assignment ke dalam sebuah field tertentu. Listing 5-3 menunjukkan bagaimana mengubah nilai dalam field `email` dari sebuah instance mutable `User`.
zh_cn: 为了从结构体中获取某个特定的值，可以使用点号。举个例子，想要用户的邮箱地址，可以用 `user1.email`。如果结构体的实例是可变的，我们可以使用点号并为对应的字段赋值。示例 5-3 展示了如何改变一个可变的 `User` 实例中 `email` 字段的值。

source: <span class="caption">Listing 5-3: Changing the value in the email field of a `User` instance</span>
zh_cn: <span class="caption">示例5-3：改变`User`实例的电子邮件字段中的值</span>

source: <span class="caption">Listing 5-4: A `build_user` function that takes an email and username and returns a `User` instance</span>
zh_cn: <span class="caption">示例5-4：一个`build_user`函数，接收电子邮件和用户名，并返回一个`User`实例</span>

source: ## Using the Field Init Shorthand
es: ## Usando la Abreviatura Field Init
zh_cn: ## 使用字段初始化简写语法

source: <span class="caption">Listing 5-5: A `build_user` function that uses field init shorthand because the `username` and `email` parameters have the same name as struct fields</span>
zh_cn: <span class="caption">示例5-5: `build_user`函数使用了字段初始化简写语法，因为`username`和`email`参数与结构体字段同名，</span>

source: # An Example Program Using Structs
es: # Un Programa de Ejemplo Usando Estructuras
zh_cn: # 结构体示例程序

source: <span class="caption">Listing 5-6: Calculating the area of a rectangle specified by separate width and height variables</span>
zh_cn: <span class="caption">示例5-6：通过分别指定长方形的宽和高的变量来计算长方形面积</span>

source: The `area` function is supposed to calculate the area of one rectangle, but the function we wrote has two parameters, and it’s not clear anywhere in our program that the parameters are related. It would be more readable and more manageable to group width and height together. We’ve already discussed one way we might do that in [Chapter 2](ch02-02-data-types.html#the-tuple-type): using tuples.
id: Fungsi `area` seharusnya menghitung luas dari satu persegi panjang, tetapi fungsi yang kita tulis memiliki dua parameter, dan tidak jelas di mana pun dalam program kita bahwa parameter-parameter tersebut saling terkait. Lebih mudah dibaca dan lebih mudah dikelola jika kita mengelompokkan lebar dan tinggi bersama-sama. Kita telah membahas satu cara untuk melakukannya pada [Bab 2](ch02-02-data-types.html#the-tuple-type): menggunakan tuple.
zh_cn: `area`函数应该是计算一个矩形的面积，但是我们写的函数有两个参数，而且在我们的程序中没有任何地方明确说明这些参数的关系。如果把宽度和高度放在一起，会更有可读性，也更容易管理。我们已经在[第二章](ch02-02-data-types.html#the-tuple-type)中讨论了一种我们可以做到的方法：使用元组。

source: ## Refactoring with Tuples
es: ## Reescribiendo con Tuplas
zh_cn: ## 使用元组重构

source: <span class="caption">Listing 5-7: Specifying the width and height of the rectangle with a tuple</span>
zh_cn: <span class="caption">示例5-7：用一个元组指定矩形的宽度和高度</span>

source: ## Refactoring with Structs: Adding More Meaning
es: ## Reescribiendo con `struct`: Agrega Más Significado
zh_cn: ## 使用结构体重构：赋予更多意义

source: <span class="caption">Listing 5-8: Defining a `Rectangle` struct</span>
zh_cn: <span class="caption">示例 5-8：定义一个`Rectangle`结构</span>

source: ## Adding Useful Functionality with Trait
es: ## Agregando Funcionalidades Útiles con Trait
zh_cn: ## 用Trait增加实用功能

source: It’d be useful to be able to print an instance of `Rectangle` while we’re debugging our program and see the values for all its fields. Listing 5-9 tries using the `print` as we have used in previous chapters. This won’t work.
id: Akan berguna jika kita dapat mencetak sebuah instance dari `Rectangle` saat kita melakukan debugging pada program kita dan melihat nilai-nilai untuk semua fieldnya. Listing 5-9 mencoba menggunakan `print` seperti yang telah kita gunakan pada bab-bab sebelumnya. Ini tidak akan berhasil.
zh_cn: 在调试程序时打印出 `Rectangle` 实例来查看其所有字段的值非常有用。示例 5-9 像前面章节那样尝试使用 `print`。但这并不管用。

source: <span class="caption">Listing 5-9: Attempting to print a `Rectangle` instance</span>
zh_cn: <span class="caption">示例 5-9：试图打印一个 `Rectangle`实例</span>

source: The `print` trait is implemented for many data types, but not for the `Rectangle` struct. We can fix this by implementing the `PrintTrait` trait on `Rectangle` as shown in Listing 5-10. To learn more about traits, see [Traits in Cairo](ch08-02-traits-in-cairo.md).
zh_cn: 许多数据类型都实现了 `print` trait，但 `Rectangle` 结构没有。我们可以通过在`Rectangle`上实现`PrintTrait` trait来解决这个问题，如示例5-10所示。 要了解更多关于traits的信息，请参阅[Traits in Cairo](ch08-02-traits-in-cairo.md)。

source: <span class="caption">Listing 5-10: Implementing the `PrintTrait` trait on `Rectangle`</span>
zh_cn: <span class="caption">示例5-10：在`Rectangle`上实现`PrintTrait` trait</span>

source: ## Method Syntax
es: ## Sintaxis De Métodos
zh_cn: ## 方法语法(Method Syntax)

source: _Methods_ are similar to functions: we declare them with the `fn` keyword and a name, they can have parameters and a return value, and they contain some code that’s run when the method is called from somewhere else. Unlike functions, methods are defined within the context of a type and their first parameter is always `self`, which represents the instance of the type the method is being called on. For those familiar with Rust, Cairo's approach might be confusing, as methods cannot be defined directly on types. Instead, you must define a trait and an implementation associated with the type for which the method is intended.
es: Los métodos son similares a las funciones: los declaramos con la palabra clave `fn` y un nombre, pueden tener parámetros, retornar un valor, y contener código que se ejecuta cuando el método es llamado desde otro lugar. A diferencia de las funciones, los métodos se definen dentro del contexto de un tipo y su primer parámetro siempre es `self`, que representa la instancia del tipo al que se llama el método. Para aquellos familiarizados con Rust, el enfoque de Cairo puede resultar confuso, ya que los métodos no se pueden definir directamente en los tipos. En su lugar, debe definir un `trait` y una implementación asociados con el tipo para el que está destinado el método.
zh_cn: _方法_（method）与函数类似：它们使用 `fn` 关键字和名称声明，可以拥有参数和返回值，同时包含在某处调用该方法时会执行的代码。不过方法与函数是不同的，因为它们在结构体的上下文中被定义，并且它们第一个参数总是 `self`，它代表调用该方法的结构体实例。 对于那些熟悉Rust的人来说，Cairo的方法可能会令人困惑，因为方法不能被直接定义在类型上。 相反，你必须定义一个trait和一个与该方法所在类型相关的实现。

source: ### Defining Methods
es: ### Definición de Détodos
zh_cn: ### 定义方法

source: Let’s change the `area` function that has a `Rectangle` instance as a parameter and instead make an `area` method defined on the `RectangleTrait` trait, as shown in Listing 5-13.
zh_cn: 让我们把前面实现的获取一个 `Rectangle` 实例作为参数的 `area` 函数， 改写成一个定义于 `RectangleTrait` trait 上的 `area` 方法，如示例5-13所示。

source: <span class="caption">Listing 5-13: Defining an `area` method to use on the `Rectangle` </span>
zh_cn: <span class="caption">示例5-13：定义一个用在`Rectangle` 上的 `area` 方法 </span>

source: To define the function within the context of `Rectangle`, we start by defining a `trait` block with the signature of the method that we want to implement. Traits are not linked to a specific type; only the `self` parameter of the method defines which type it can be used with. Then, we define an `impl` (implementation) block for `RectangleTrait`, that defines the behavior of the methods implemented. Everything within this `impl` block will be associated with the type of the `self` parameter of the method called. While it is technically possible to define methods for multiple types within the same `impl` block, it is not a recommended practice, as it can lead to confusion. We recommend that the type of the `self` parameter stays consistent within the same `impl` block. Then we move the `area` function within the `impl` curly brackets and change the first (and in this case, only) parameter to be `self` in the signature and everywhere within the body. In `main`, where we called the `area` function and passed `rect1` as an argument, we can instead use the _method syntax_ to call the `area` method on our `Rectangle` instance. The method syntax goes after an instance: we add a dot followed by the method name, parentheses, and any arguments.
es: Para definir la función en el contexto de `Rectangle`, empezamos definiendo un bloque `trait` con la firma del método que queremos implementar. Los traits no están vinculados a sólo el parámetro `self` del método define con qué tipo se puede utilizar. puede utilizar. A continuación, definimos un bloque `impl` (implementación) para `RectangleTrait`, que define el comportamiento de los métodos implementados. Todo dentro de este bloque `impl` será asociado con el tipo del parámetro `self` del método llamado. Aunque técnicamente es posible definir métodos para múltiples tipos dentro del mismo bloque `impl`, no es una una práctica recomendada, ya que puede dar lugar a confusión. Recomendamos que el tipo del parámetro `self sea consistente dentro del mismo bloque `impl`. Entonces movemos la función `area` dentro de las llaves `impl` y cambiamos el primer (y en este caso, único) parámetro para que sea `self` en la firma y en todo el cuerpo. En donde llamamos a la función `area` y pasamos `rect1` como argumento, podemos usar la sintaxis _method_ para llamar al método `area` en nuestra instancia `Rectangle`. de nuestro `Rectángulo`. La sintaxis de método va después de una instancia: añadimos un punto seguido de el nombre del método, los paréntesis y los argumentos.
zh_cn: 为了使函数定义于 `Rectangle` 的上下文中，我们开始了一个 `trait` 块，其中包含我们想要实现的方法的签名。 Traits 并不与一个特定的类型所链接；只有方法的 `self` 参数定义了它可以用于哪种类型。然后，我们为 `RectangleTrait` 定义一个 `impl`（实现）块，它定义了实现的方法的行为。 这个 `impl` 块中的所有内容都将与被调用方法的 `self` 参数的类型相关。虽然在技术上可以在同一个 `impl` 块中定义多种类型的方法，但这并不是一个值得推荐的做法。 因为它可能会导致混乱。我们建议`self`参数的类型在同一个 `impl` 块中保持一致。 然后我们将`area`函数移到`impl`大括号内，并在签名和正文的所有地方将第一个（在本例中是唯一的）参数改为`self`。在`main`中，我们调用`area`函数并传递`rect1`作为参数、 我们可以使用 _method syntax_ 在我们的`Rectangle`实例上调用`area`方法。 方法语法是：在一个实例的后面，加上一个点号，后跟方法名、圆括号以及任何参数。

source: Methods must have a parameter named `self` of the type they will be applied to for their first parameter. Note that we used the `@` snapshot operator in front of the `Rectangle` type in the function signature. By doing so, we indicate that this method takes an immutable snapshot of the `Rectangle` instance, which is automatically created by the compiler when passing the instance to the method. Methods can take ownership of `self`, use `self` with snapshots as we’ve done here, or use a mutable reference to `self` using the `ref self: T` syntax.
es: Los métodos deben tener un parámetro llamado `self` del tipo al que se aplicarán como primer parámetro. Observa que hemos utilizado el operador de instantánea `@` delante del tipo `Rectangle` en la firma de la función. Al hacerlo, indicamos que este método toma una instantánea inmutable de la instancia `Rectangle`, que es automáticamente por el compilador al pasar la instancia al método. Los métodos pueden tomar posesión de `self`, usar `self` con instantáneas como hemos hecho aquí, o usar una referencia mutable a `self usando la sintaxis `ref self: T`.
zh_cn: 方法必须有一个名为 `self` 的类型参数作为它们将要应用的类型的第一个参数。请注意，我们在函数签名中在 `Rectangle` 类型前面使用了 `@` 快照运算符。这样做，我们表示此方法获取 `Rectangle` 实例的不可变快照，编译器在将实例传递给该方法时会自动创建。方法可以获取 `self` 实例的所有权，像我们在这里所做的那样使用快照的 `self`，或使用 `ref self: T` 语法使用 `self` 的可变引用。

source: We chose `self: @Rectangle` here for the same reason we used `@Rectangle` in the function version: we don’t want to take ownership, and we just want to read the data in the struct, not write to it. If we wanted to change the instance that we’ve called the method on as part of what the method does, we’d use `ref self: Rectangle` as the first parameter. Having a method that takes ownership of the instance by using just `self` as the first parameter is rare; this technique is usually used when the method transforms `self` into something else and you want to prevent the caller from using the original instance after the transformation.
es: Elegimos `self: @Rectangle` por la misma razón que usamos `@Rectangle` en la función versión: no queremos tomar posesión, y solo queremos leer los datos en la estructura, no escribir en ella. Si quisiéramos cambiar la instancia que hemos llamado al método como parte de lo que hace el método, usaríamos `ref self: Rectangle` como el primer parámetro. Tener un método que tome posesión de la instancia por usar solo `self` como primer parámetro es raro; esta técnica suele ser usada cuando el método transforma `self` en otra cosa y desea evitar que la persona que llama use la instancia original después de la transformación.
zh_cn: 我们在这里选择 `self: @Rectangle` 与函数版本中使用 `@Rectangle` 的原因相同：我们不想要所有权，只是想读取结构体中的数据，而不是对它进行写入。如果我们想要作为方法的一部分更改调用方法的实例，我们将使用 `ref self: Rectangle` 作为第一个参数。通过仅使用 `self` 作为第一个参数来使方法获取实例的所有权是很少见的；这种技术通常用在当方法将 `self` 转换成别的实例的时候，这时我们想要防止调用者在转换之后使用原始的实例。

source: Observe the use of the desnap operator `*` within the area method when accessing the struct's members. This is necessary because the struct is passed as a snapshot, and all of its field values are of type `@T`, requiring them to be desnapped in order to manipulate them.
es: Observe el uso del operador *desnap* `*` dentro del método *area* cuando accede a los miembros de la estructura. Esto es necesario porque la estructura se pasa como una *snapshot* y todos sus valores de campo son del tipo `@T`, requiriendo que sean *desnapped* para poder manipularlos.
zh_cn: 在访问结构体的成员时，请注意在区域方法中使用 _desnap_ 操作符`*`。 这是必要的，因为该结构是以快照形式传递的，其所有字段值都是`@T`类型、 需要对它们进行解快照，以便对其进行操作。
