Repository: cairo-book/cairo-book
Catalog: po/*.po
Languages: es, id, ko, zh_cn

source: If we were to call `value_in_cents(Coin::Quarter(UsState::Alaska))`, `coin` would be `Coin::Quarter(UsState::Alaska)`. When we compare that value with each of the match arms, none of them match until we reach `Coin::Quarter(state)`. At that point, the binding for `state` will be the value `UsState::Alaska`. We can then use that binding in `println!` macro, thus getting the inner state value out of the Coin enum variant for Quarter.
ko: 만약 `value_in_cents(Coin::Quarter(UsState::Alaska))`를 호출한다면, `coin`은 `Coin::Quarter(UsState::Alaska)`가 될 것입니다. 해당 값을 각 match arm과 비교할 때, `Coin::Quarter(state)`에 도달할 때까지 일치하는 것이 없습니다. 그 순간에, `state`에 대한 바인딩은 `UsState::Alaska`의 값이 될 것입니다. 이후에는 `println!` 매크로에서 해당 바인딩을 사용하여, Quarter에 대한 Coin enum 변형의 내부 상태 값을 가져올 수 있습니다.

source: Matching with `Option<T>`
ko: `Option<T>`과 일치하는 것

source: In the previous section, we wanted to get the inner `T` value out of the `Some` case when using `Option<T>`; we can also handle `Option<T>` using `match`, as we did with the `Coin` enum! Instead of comparing coins, we’ll compare the variants of `Option<T>`, but the way the `match` expression works remains the same.
ko: 이전 섹션에서는 `Option<T>`를 사용할 때 `Some` 케이스에서 내부 `T` 값을 가져오고 싶었습니다. `Coin` enum과 같이 `match`를 사용하여 `Option<T>`를 처리할 수도 있습니다! 동전을 비교하는 대신 `Option<T>`의 변형을 비교할 것이지만, `match` 표현식이 작동하는 방식은 동일합니다.

source: Let’s say we want to write a function that takes an `Option<u8>` and, if there’s a value inside, adds `1` to that value. If there isn’t a value inside, the function should return the `None` value and not attempt to perform any operations.
es: Digamos que queremos escribir una función que tome una `Opción<u8>` y, si hay un valor dentro, añada `1` a ese valor. Si no hay ningún valor dentro, la función debería devolver el valor `None` y no intentar realizar ninguna operación.
id: Mari kita tulis sebuah fungsi yang mengambil `Option<u8>` dan, jika ada nilai di dalamnya, menambahkan `1` ke nilai tersebut. Jika tidak ada nilai di dalamnya, fungsi tersebut harus mengembalikan nilai `None` dan tidak mencoba melakukan operasi apapun.
ko: 우리가 `Option<u8>`를 가져와서, 그 안에 값이 있으면 그 값에 `1`을 더하는 함수를 작성하고 싶다고 가정해 봅시다. 값이 없으면 함수는 `None` 값을 반환하고 어떤 작업도 수행하지 않아야 합니다.
zh_cn: 假设我们想写一个函数，接收一个 `Option<u8>`，如果里面有一个值，就把 `1` 加到这个值上。如果里面没有一个值，这个函数应该返回 `None` 值，并且不试图执行任何操作。

source: This function is very easy to write, thanks to `match`, and will look like Listing 6-5.
ko: 이 함수는 `match` 덕분에 매우 쉽게 작성할 수 있으며, 6-5 목록과 같이 보일 것입니다.

source: Listing 6-5: A function that uses a `match` expression on an `Option<u8>`
ko: 리스트 6-5: `Option<u8>`에서 `match` 표현식을 사용하는 함수

source: Let’s examine the first execution of `plus_one` in more detail. When we call `plus_one(five)`, the variable `x` in the body of `plus_one` will have the value `Some(5)`. We then compare that against each `match` arm:
ko: `plus_one`의 첫 번째 실행을 더 자세히 살펴봅시다. `plus_one(five)`를 호출하면 `plus_one`의 본문에서 변수 `x`는 `Some(5)`의 값을 가질 것입니다. 그런 다음 각 `match` 팔에 대해 비교합니다:

source: Does `Option::Some(5)` value match the pattern `Option::Some(val)`? It does! We have the same variant. The `val` binds to the value contained in `Option::Some`, so `val` takes the value `5`. The code in the `match` arm is then executed, so we add `1` to the value of `val` and create a new `Option::Some` value with our total `6` inside. Because the first arm matched, no other arms are compared.
ko: `Option::Some(5)` 값이 `Option::Some(val)` 패턴과 일치합니까? 그렇습니다! 우리는 동일한 변형을 갖고 있습니다. `val`은 `Option::Some`에 포함된 값에 바인딩되므로 `val`은 값 `5`를 가집니다. 그런 다음 `match` 팔에있는 코드가 실행되어 `val`의 값에 `1`을 추가하고 총 `6`이 내부에있는 새로운 `Option::Some` 값을 만듭니다. 첫 번째 팔이 일치했기 때문에 다른 팔은 비교되지 않습니다.

source: Now let’s consider the second call of `plus_one` in our main function, where `x` is `Option::None`. We enter the `match` and compare to the first arm:
ko: 이제 `plus_one`의 두 번째 호출을 고려해 봅시다. 여기서 `x`는 `Option::None`입니다. 우리는 `match`에 들어가서 첫 번째 팔과 비교합니다:

source: The `Option::Some(val)` value doesn’t match the pattern `Option::None`, so we continue to the next arm:
es: El valor `Option::Some(5_u8)` no coincide con el patrón `Option::None`, así que continuamos con el siguiente brazo:
id: Nilai `Option::Some(val)` tidak cocok dengan pola `Option::None`, jadi kita lanjutkan ke bagian selanjutnya:
ko: `Option::Some(val)` 값은 `Option::None` 패턴과 일치하지 않으므로 다음 팔로 이동합니다:
zh_cn: `Option::Some(val)` 的值不匹配 `Option::None` ，所以我们继续到下一个分支：

source: It matches! There’s no value to add to, so the matching construct ends and returns the `Option::None` value on the right side of `=>`.
ko: 일치합니다! 추가할 값이 없으므로 일치하는 구조가 끝나고 `=>` 오른쪽에 `Option::None` 값을 반환합니다.

source: Combining `match` and enums is useful in many situations. You’ll see this pattern a lot in Cairo code: `match` against an enum, bind a variable to the data inside, and then execute code based on it. It’s a bit tricky at first, but once you get used to it, you’ll wish you had it in all languages. It’s consistently a user favorite.
es: Combinar `match` y enumeraciones es útil en muchas situaciones. Verás este patrón mucho en el código de Cairo: `match` contra una enumeración, enlaza una variable con los datos internos y luego ejecuta código basado en ella. Es un poco complicado al principio, pero una vez que te acostumbras, desearás tenerlo en todos los lenguajes. Es consistentemente favorito de los usuarios.
id: Kombinasi `match` dan enum berguna dalam banyak situasi. Anda akan sering melihat pola ini dalam kode Cairo: `match` terhadap sebuah enum, mengikat variabel pada data di dalamnya, dan kemudian menjalankan kode berdasarkan data tersebut. Awalnya mungkin sedikit membingungkan, tetapi setelah Anda terbiasa, Anda akan berharap memiliki fitur ini dalam semua bahasa pemrograman. Ini secara konsisten menjadi favorit pengguna.
ko: `match`와 열거형을 결합하는 것은 많은 상황에서 유용합니다. Cairo 코드에서 이 패턴을 자주 볼 수 있습니다: 열거형에 대해 `match`를 수행하고, 데이터 내부에 변수를 바인딩한 다음 그에 기반하여 코드를 실행합니다. 처음에는 조금 까다롭지만, 익숙해지면 모든 언어에서 이것을 가지고 싶어할 것입니다. 사용자들이 일관되게 좋아하는 기능입니다.
zh_cn: 将 `match` 与枚举相结合在很多场景中都是有用的。你会在 Cairo 代码中看到很多这样的模式：`match` 一个枚举，绑定其中的值到一个变量，接着根据其值执行代码。这在一开始有点复杂，不过一旦习惯了，你会希望所有语言都拥有它！这一直是用户的最爱。

source: Matches Are Exhaustive
ko: 경기는 지치게 해요.

source: There’s one other aspect of `match` we need to discuss: the arms’ patterns must cover all possibilities. Consider this version of our `plus_one` function, which has a bug and won’t compile:
ko: 우리가 논의해야 할 `match`의 또 다른 측면이 있습니다: arms의 패턴은 모든 가능성을 포함해야 합니다. 컴파일되지 않는 버그가 있는 `plus_one` 함수 버전을 고려해보세요.

source: We didn’t handle the `None` case, so this code will cause a bug. Luckily, it’s a bug Cairo knows how to catch. If we try to compile this code, we’ll get this error:
ko: 우리는 `None` 케이스를 처리하지 않았기 때문에 이 코드는 버그를 발생시킬 것입니다. 다행히, Cairo가 잡을 수 있는 버그입니다. 이 코드를 컴파일하려고 하면 다음 오류가 발생할 것입니다:

source: Cairo knows that we didn’t cover every possible case, and even knows which pattern we forgot! Matches in Cairo are exhaustive: we must exhaust every last possibility in order for the code to be valid. Especially in the case of `Option<T>`, when Cairo prevents us from forgetting to explicitly handle the `None` case, it protects us from assuming that we have a value when we might have null, thus making the billion-dollar mistake discussed earlier impossible.
es: Cairo sabe que no cubrimos todos los casos posibles, ¡e incluso sabe qué patrón olvidamos! Los matches en Cairo son exhaustivos: debemos cubrir todas las posibilidades para que el código sea válido. Especialmente en el caso de `Option<T>`, cuando Cairo nos impide olvidar manejar explícitamente el caso `None`, nos protege de asumir que tenemos un valor cuando podríamos tener nulo, lo que hace imposible el error de mil millones de dólares discutido anteriormente.
id: Cairo mengetahui bahwa kita tidak mencakup setiap kemungkinan, dan bahkan tahu pola mana yang terlupakan! Pertandingan dalam Cairo adalah eksaustif: kita harus mengeksplorasi setiap kemungkinan terakhir agar kode menjadi valid. Terutama dalam kasus `Option<T>`, ketika Cairo mencegah kita untuk lupa menangani secara eksplisit kasus `None`, itu melindungi kita dari asumsi bahwa kita memiliki sebuah nilai ketika sebenarnya mungkin null, sehingga membuat kesalahan miliaran dolar yang telah dibahas sebelumnya menjadi tidak mungkin terjadi.
ko: 카이로는 우리가 모든 가능한 경우를 다 다루지 않았음을 알고 있고, 우리가 빠뜨린 패턴까지도 알고 있습니다! 카이로에서의 매치는 철저합니다: 코드가 유효하게 되려면 가능한 모든 가능성을 다 고려해야 합니다. 특히 `Option<T>`의 경우에는, 카이로가 우리가 `None` 케이스를 명시적으로 처리하지 않게 잊지 않도록 막아줌으로써, 우리가 값이 있는 것으로 가정하고 null이 될 수도 있는 경우를 방지하여, 앞서 논의한 10억 달러의 실수를 불가능하게 만들어줍니다.
zh_cn: Rust 知道我们没有覆盖所有可能的情况甚至知道哪些模式被忘记了！Cairo 中的匹配是 穷尽的（exhaustive）：必须穷举到最后的可能性来使代码有效。特别的在这个 `Option<T>` 的例子中，Cairo 防止我们忘记明确的处理 None 的情况，这让我们免于假设拥有一个实际上为空的值，从而使之前提到的价值亿万的错误不可能发生。

source: Catch-all with the `_` Placeholder
ko: `_` 플레이스홀더를 사용한 캐치-올

source: Using enums, we can also take special actions for a few particular values, but for all other values take one default action. `_` is a special pattern that matches any value and does not bind to that value. You can use it by simply adding a new arm with `_` as the pattern for the last arm of the `match` expression.
ko: 열거형을 사용하면 몇 가지 특정 값에 대해 특별한 작업을 수행할 수도 있지만 다른 모든 값에 대해서는 기본 작업을 수행할 수 있습니다. `_`는 어떤 값과도 일치하며 해당 값에 바인딩되지 않는 특별한 패턴입니다. `match` 표현식의 마지막 arm으로 `_`를 패턴으로 사용하여 간단히 새로운 arm을 추가할 수 있습니다.

source: Imagine we have a vending machine that only accepts Dime coins. We want to have a function that process inserted coins and returns `true` only if the coin is accepted.
ko: 우리가 다임 동전만 받는 자동판매기가 있다고 상상해보세요. 우리는 삽입된 동전을 처리하고 동전이 받아들여지는 경우에만 `true`를 반환하는 함수를 가지고 싶습니다.

source: Here's a `vending_machine_accept` function that implements this logic:
ko: 다음은이 논리를 구현하는 `vending_machine_accept` 함수입니다:

source: This example also meets the exhaustiveness requirement because we’re explicitly ignoring all other values in the last arm; we haven’t forgotten anything.
ko: 이 예제는 마지막 분기에서 다른 모든 값들을 명시적으로 무시하기 때문에 완전성 요구 사항을 충족합니다; 우리는 아무 것도 잊지 않았습니다.

source: There's no catch-all pattern in Cairo that allows you to use the value of the pattern.
ko: 카이로에는 패턴의 값을 사용할 수 있는 모든 패턴이 없습니다.

source: Multiple Patterns with the `|` operator
ko: `|` 연산자를 사용한 여러 패턴

source: In `match` expressions, you can match multiple patterns using the `|` syntax, which is the pattern _or_ operator.
ko: `match` 표현식에서는 `|` 구문을 사용하여 여러 패턴을 매칭할 수 있습니다. 이는 패턴 _또는_ 연산자입니다.

source: For example, in the following code we modified the `vending_machine_accept` function to accept both `Dime` and `Quarter` coins in a single arm:
ko: 예를 들어, 다음 코드에서는 `vending_machine_accept` 함수를 수정하여 `Dime`과 `Quarter` 동전을 한 팔에 동시에 받아들일 수 있도록 했습니다.

source: Matching Tuples
ko: 튜플 매칭

source: It is possible to match tuples. Let's introduce a new `DayType` enum:
ko: 튜플을 매칭하는 것이 가능합니다. 새로운 `DayType` 열거형을 소개해보겠습니다:

source: Now, let's suppose that our vending machine accepts any coin on weekdays, but only accepts quarters and dimes on weekends and holidays. We can modify the `vending_machine_accept` function to accept a tuple of a `Coin` and a `Weekday` and return `true` only if the given coin is accepted on the specified day:
ko: 이제, 자판기가 주중에는 모든 동전을 받지만 주말과 공휴일에는 25센트와 10센트 동전만 받는다고 가정해 봅시다. `vending_machine_accept` 함수를 수정하여 `Coin`과 `Weekday`의 튜플을 받아 지정된 날짜에 주어진 동전이 받아들여지는 경우에만 `true`를 반환하도록 할 수 있습니다:

source: Matching `felt252` and integer variables
ko: `felt252`와 정수 변수를 매칭하기

source: You can also match `felt252` and integer variables. This is useful when you want to match against a range of values. However there are some restrictions:
ko: `felt252`와 정수 변수도 일치시킬 수 있습니다. 값 범위와 일치시키고 싶을 때 유용합니다. 그러나 일부 제한 사항이 있습니다.

source: Only integers that fit into a single `felt252` are supported (i.e. `u256` is not supported).
ko: 단일 `felt252`에 맞는 정수만 지원됩니다 (`u256`은 지원되지 않습니다).

source: The first arm must be 0.
ko: 첫 번째 팔은 0이어야 합니다.

source: Each arm must cover a sequential segment, contiguously with other arms.
ko: 각 팔은 다른 팔과 연속적으로 이어져야 하는 일련의 세그먼트를 커버해야 합니다.

source: Imagine we’re implementing a game where you roll a six-sided die to get a number between 0 and 5. If you have 0, 1 or 2 you win. If you have 3, you can roll again. For all other values you lose.
ko: 0부터 5 사이의 숫자를 얻기 위해 여섯 면 주사위를 굴리는 게임을 구현 중이라고 상상해보세요. 0, 1 또는 2가 나오면 이기는 것입니다. 3이 나오면 다시 굴릴 수 있습니다. 그 외의 모든 값에서는 패배합니다.

source: Here's a match that implements that logic:
ko: 이것은 그 논리를 구현하는 매치입니다.

source: "you won!"
ko: "당신이 이겼어요!"

source: "you can roll again!"
ko: "다시 굴릴 수 있어요!"

source: "you lost..."
ko: "당신은 졌어요..."

source: These restrictions are planned to be relaxed in future versions of Cairo.
ko: 이러한 제한 사항은 향후 카이로의 버전에서 완화될 예정입니다.

source: As you write large programs, organizing your code will become increasingly important. By grouping related functionality and separating code with distinct features, you’ll clarify where to find code that implements a particular feature and where to go to change how a feature works.
id: Saat Anda menulis program-program yang besar, mengatur kode akan menjadi semakin penting. Dengan mengelompokkan fungsionalitas terkait dan memisahkan kode dengan fitur-fitur yang berbeda, Anda akan menjelaskan di mana menemukan kode yang mengimplementasikan fitur tertentu dan tempat untuk mengubah cara kerja suatu fitur.
ko: 대규모 프로그램을 작성할수록 코드를 조직하는 것이 점점 중요해집니다. 관련 기능을 그룹화하고 구별되는 기능으로 코드를 분리함으로써, 특정 기능을 구현하는 코드를 찾을 수 있는 위치와 기능이 작동하는 방식을 변경할 위치를 명확히 할 수 있습니다.

source: The programs we’ve written so far have been in one module in one file. As a project grows, you should organize code by splitting it into multiple modules and then multiple files. As a package grows, you can extract parts into separate crates that become external dependencies. This chapter covers all these techniques.
id: Program-program yang telah kita tulis sejauh ini berada dalam satu modul di satu file. Saat sebuah proyek berkembang, Anda sebaiknya mengatur kode dengan membaginya menjadi beberapa modul dan kemudian beberapa file. Saat sebuah paket berkembang, Anda dapat mengekstrak bagian-bagiannya menjadi crate terpisah yang menjadi dependensi eksternal. Bab ini membahas semua teknik tersebut.
ko: 지금까지 작성한 프로그램은 하나의 모듈에 하나의 파일에 있었습니다. 프로젝트가 커질수록 코드를 여러 모듈로 분할하고 그 다음 여러 파일로 분할하는 것이 좋습니다. 패키지가 커지면 일부를 별도의 크레이트로 추출하여 외부 종속성이 되도록 할 수 있습니다. 이 장에서는 이러한 모든 기술을 다룹니다.

source: We’ll also discuss encapsulating implementation details, which lets you reuse code at a higher level: once you’ve implemented an operation, other code can call your code without having to know how the implementation works.
id: Kita juga akan membahas cara menyembunyikan detail implementasi, yang memungkinkan Anda untuk menggunakan ulang kode pada level yang lebih tinggi: setelah Anda mengimplementasikan suatu operasi, kode lain dapat memanggil kode Anda tanpa harus tahu bagaimana implementasinya bekerja.
ko: 우리는 또한 구현 세부 정보를 캡슐화하는 것에 대해 논의할 것입니다. 이를 통해 코드를 더 높은 수준에서 재사용할 수 있습니다. 한 번 작업을 구현한 후에는 다른 코드가 구현 방식을 알 필요 없이 코드를 호출할 수 있습니다.

source: A related concept is scope: the nested context in which code is written has a set of names that are defined as “in scope.” When reading, writing, and compiling code, programmers and compilers need to know whether a particular name at a particular spot refers to a variable, function, struct, enum, module, constant, or other item and what that item means. You can create scopes and change which names are in or out of scope. You can’t have two items with the same name in the same scope.
id: Konsep terkait adalah cakupan (scope): konteks bertingkat di mana kode ditulis memiliki serangkaian nama yang didefinisikan sebagai "dalam cakupan". Saat membaca, menulis, dan mengompilasi kode, para programmer dan kompilator perlu mengetahui apakah suatu nama tertentu pada suatu tempat tertentu merujuk pada variabel, fungsi, struktur data, enum, modul, konstanta, atau item lainnya dan apa makna dari item tersebut. Anda dapat membuat cakupan dan mengubah nama-nama mana yang berada dalam atau di luar cakupan. Anda tidak dapat memiliki dua item dengan nama yang sama dalam cakupan yang sama.
ko: 관련 개념 중 하나는 범위(scope)입니다: 코드가 작성된 중첩된 컨텍스트에는 "범위 내에 정의된 이름"이라는 것이 있습니다. 코드를 읽고 쓰고 컴파일할 때 프로그래머와 컴파일러는 특정 위치의 특정 이름이 변수, 함수, 구조체, 열거형, 모듈, 상수 또는 다른 항목을 가리키는지, 그 항목이 무엇을 의미하는지를 알아야 합니다. 범위를 생성하고 범위 내에 있는 이름을 변경할 수 있습니다. 동일한 범위 내에 동일한 이름을 가진 항목을 두 개 가질 수 없습니다.

source: Cairo has a number of features that allow you to manage your code’s organization. These features, sometimes collectively referred to as the _module system_, include:
id: Cairo memiliki sejumlah fitur yang memungkinkan Anda mengelola organisasi kode Anda. Fitur-fitur ini, kadang disebut secara kolektif sebagai _sistem modul_, meliputi:
ko: 카이로에는 코드 조직을 관리할 수 있는 여러 기능이 있습니다. 이러한 기능은 때로 _모듈 시스템_ 이라고도 불립니다.

source: **Packages:** A Scarb feature that lets you build, test, and share crates
id: **Packages:** Fitur Scarb yang memungkinkan Anda membangun, menguji, dan berbagi crate
ko: **패키지:** 크레이트를 빌드, 테스트 및 공유할 수 있는 Scarb 기능

source: **Crates:** A tree of modules that corresponds to a single compilation unit. It has a root directory, and a root module defined at the file `lib.cairo` under this directory.
id: **Crates:** Sebuah pohon modul yang sesuai dengan satu unit kompilasi. Ini memiliki direktori root, dan modul root yang didefinisikan pada file `lib.cairo` di bawah direktori ini.
ko: **크레이트:** 단일 컴파일 단위에 해당하는 모듈 트리입니다. 루트 디렉토리와 이 디렉토리 아래의 `lib.cairo` 파일에 정의된 루트 모듈이 있습니다.

source: **Modules** and **use:** Let you control the organization and scope of items.
id: **Modules** dan **use:** Memungkinkan Anda mengendalikan organisasi dan cakupan dari item-item.
ko: **모듈** 및 **사용:** 항목의 구성 및 범위를 제어할 수 있게 합니다.

source: **Paths:** A way of naming an item, such as a struct, function, or module
id: **Path:** Cara untuk memberi nama pada sebuah item, seperti struktur, fungsi, atau modul
ko: **경로:** 구조체, 함수 또는 모듈과 같은 항목의 이름을 지정하는 방법

source: In this chapter, we’ll cover all these features, discuss how they interact, and explain how to use them to manage scope. By the end, you should have a solid understanding of the module system and be able to work with scopes like a pro!
id: Dalam bab ini, kita akan membahas semua fitur tersebut, membahas interaksinya, dan menjelaskan cara menggunakannya untuk mengelola cakupan. Pada akhirnya, Anda seharusnya memiliki pemahaman yang kuat tentang sistem modul dan mampu bekerja dengan cakupan seperti seorang profesional!
ko: 이 장에서는 이러한 기능을 모두 다루고, 그들이 어떻게 상호 작용하는지 논의하며, 범위를 관리하는 방법을 설명할 것입니다. 끝날 때쯤에는 모듈 시스템에 대한 튼튼한 이해를 가지고 있고, 전문가처럼 범위를 다룰 수 있을 것입니다!

source: What is a crate?
ko: 크레이트란 무엇인가요?

source: A crate is the smallest amount of code that the Cairo compiler considers at a time. Even if you run `cairo-compile` rather than `scarb build` and pass a single source code file, the compiler considers that file to be a crate. Crates can contain modules, and the modules may be defined in other files that get compiled with the crate, as will be discussed in the subsequent sections.
es: Un crate es la cantidad más pequeña de código que el compilador de Cairo considera a la vez. Incluso si ejecuta `cairo-compile` en lugar de `scarb build` y pasa un solo archivo de código fuente, el compilador considera que ese archivo es un crate. Los crates pueden contener módulos, y los módulos pueden estar definidos en otros archivos que se compilan junto con el crate, como se discutirá en las secciones siguientes.
id: Sebuah crate adalah jumlah kode terkecil yang dipertimbangkan oleh kompiler Cairo pada satu waktu. Meskipun Anda menjalankan `cairo-compile` daripada `scarb build` dan melewati satu file kode sumber, kompiler menganggap file tersebut sebagai sebuah crate. Crate dapat berisi modul-modul, dan modul-modul tersebut mungkin didefinisikan dalam file lain yang dikompilasi bersama dengan crate, seperti yang akan dibahas dalam bagian-bagian berikutnya.
ko: 크레이트는 카이로 컴파일러가 한 번에 고려하는 코드의 가장 작은 양입니다. `scarb build` 대신 `cairo-compile`을 실행하고 단일 소스 코드 파일을 전달하더라도 컴파일러는 해당 파일을 크레이트로 간주합니다. 크레이트에는 모듈을 포함할 수 있으며, 모듈은 크레이트와 함께 컴파일되는 다른 파일에서 정의될 수 있습니다. 이에 대해 후속 섹션에서 논의될 것입니다.
zh_cn: Crate是Cairo在编译时最小的代码单位。即使你运行 `cairo-compile` 而不是 `scarb build` 并传递一个源代码文件，编译器还是会将那个文件认作一个 crate。Crate可以包含模块，这些模块可以在其他文件中定义，并与Crate一起被编译，这将在后面的章节中讨论。

source: What is the crate root?
ko: 크레이트 루트란 무엇인가요?

source: The crate root is the `lib.cairo` source file that the Cairo compiler starts from and makes up the root module of your crate (we’ll explain modules in depth in the [“Defining Modules to Control Scope”](./ch07-02-defining-modules-to-control-scope.md) section).
id: Crate root adalah file sumber `lib.cairo` yang digunakan oleh kompiler Cairo sebagai awal dan menjadi modul root dari crate Anda (kami akan menjelaskan modul secara mendalam dalam bagian [“Defining Modules to Control Scope”](./ch07-02-defining-modules-to-control-scope.md)).
ko: 크레이트 루트는 Cairo 컴파일러가 시작하는 `lib.cairo` 소스 파일이며, 크레이트의 루트 모듈을 구성합니다 (우리는 [“범위 제어를 위한 모듈 정의”](./ch07-02-defining-modules-to-control-scope.md) 섹션에서 모듈을 자세히 설명할 것입니다).
zh_cn: Crate root根是`lib.cairo`源文件，Cairo编译器从该文件开始，并构成你的crate的根模块（我们将在[“定义模块来控制作用域”](./ch07-02-defining-modules-to-control-scope.md)部分深入解释模块）。

source: What is a package?
ko: 패키지란 무엇인가요?

source: A cairo package is a bundle of one or more crates with a Scarb.toml file that describes how to build those crates. This enables the splitting of code into smaller, reusable parts and facilitates more structured dependency management.
es: Un paquete de Cairo es un conjunto de uno o más crates con un archivo Scarb.toml que describe cómo construir esos crates. Esto permite la división del código en partes más pequeñas y reutilizables, y facilita la gestión de dependencias más estructurada.
ko: 카이로 패키지는 하나 이상의 크레이트를 번들로 포장한 것으로, Scarb 톰톰 파일이 포함되어 있어 이 크레이트들을 어떻게 빌드할지 설명합니다. 이를 통해 코드를 더 작고 재사용 가능한 부분으로 분할하고, 보다 구조화된 의존성 관리를 용이하게 합니다.
zh_cn: 一个cairo包是一个由一个或多个crate组成的集合，其中的Scarb.toml文件描述如何构建这些板块。这使得代码被分割成更小的、可重复使用的部分，并有利于更有条理的依赖管理。

source: Creating a Package with Scarb
id: Membuat Package dengan Scarb
ko: Scarb와 함께 패키지 만들기

source: You can create a new Cairo package using the scarb command-line tool. To create a new package, run the following command:
es: Puede crear un nuevo paquete de Cairo utilizando la herramienta de línea de comandos scarb. Para crear un nuevo paquete, ejecute el siguiente comando:
id: Anda dapat membuat package Cairo baru menggunakan perangkat baris perintah scarb. Untuk membuat paket baru, jalankan perintah berikut:
ko: scarb 명령 줄 도구를 사용하여 새 Cairo 패키지를 만들 수 있습니다. 새 패키지를 만들려면 다음 명령을 실행하십시오:
zh_cn: 你可以使用scarb命令行工具创建一个新的Cairo包。要创建一个新的软件包，运行以下命令：

source: This command will generate a new package directory named `my_package` with the following structure:
es: Este comando generará un nuevo directorio de paquete llamado my_crate con la siguiente estructura:
id: Perintah ini akan menghasilkan sebuah direktori package baru yang bernama `my_package` dengan struktur sebagai berikut:
ko: 이 명령은 다음 구조로 `my_package`라는 새 패키지 디렉토리를 생성합니다:
zh_cn: 该命令将生成一个名为`my_package`的新软件包目录，其结构如下：

source: `src/` is the main directory where all the Cairo source files for the package will be stored.
id: `src/` adalah direktori utama di mana semua berkas sumber Cairo untuk paket akan disimpan.
ko: `src/`는 패키지의 모든 카이로 소스 파일이 저장될 주요 디렉토리입니다.

source: `lib.cairo` is the default root module of the crate, which is also the main entry point of the package.
id: `lib.cairo` adalah modul root default dari crate, yang juga merupakan titik masuk utama dari paket.
ko: `lib.cairo`는 크레이트의 기본 루트 모듈이며, 또한 패키지의 주 진입점입니다.
