Repository: cairo-book/cairo-book
Catalog: po/*.po
Languages: es, id, ko, zh_cn

source: In this case, we try to pass the same array instance `arr` by value to the functions `foo` and `bar`, which means that the parameter used in both function calls is the same instance of the array. If you append a value to the array in `foo`, and then try to append another value to the same array in `bar`, what would happen is that you would attempt to try to write to the same memory cell twice, which is not allowed in Cairo. To prevent this, the ownership of the `arr` variable moves from the `main` function to the `foo` function. When trying to call `bar` with `arr` as a parameter, the ownership of `arr` was already moved to the first call. The ownership system thus prevents us from using the same instance of `arr` in `foo`.
es: En este caso, intentamos pasar la misma instancia de matriz `arr` por valor a las funciones `foo` y `bar`, lo que significa que el parámetro utilizado en ambas llamadas de función es la misma instancia de la matriz. Si agrega un valor a la matriz e n `foo` y luego intenta agregar otro valor a la misma matriz en `bar`, lo que sucederá es que intentará escribir en la misma celda de memoria dos veces, lo que no está permitido en Cairo. Para evitar esto, la propiedad de la variable `arr` se mueve de la función `main` a la función `foo`. Cuando se intenta llamar a `bar` con `arr` como parámetro, la propiedad de `arr` ya se movió a la primera llamada. El sistema de propiedad nos impide usar la misma instancia de `arr` en `foo`.
zh_cn: 在这种情况下，我们试图将同一个数组实例`arr`通过值传递给函数`foo`和`bar`，这意味着两个函数调用的参数都是同一个数组实例。 如果你在`foo`中向数组添加一个值，然后再在`bar`中向数组添加一个值，会发生什么呢？ 你会试图向同一个内存单元写两次，这在Cairo中是不允许的。 为了防止这种情况，`arr`变量的所有权从`main`函数转移到`foo`函数。当试图以`arr`为参数调用`bar`时，`arr`的所有权早已再第一次调用时被转移。 所有权系统阻止了我们在`foo`中使用相同的`arr`实例。

source: Running the code above will result in a compile-time error:
es: Ejecutar el código anterior resultará en un error en tiempo de compilación:
id: Menjalankan kode di atas akan menghasilkan kesalahan pada waktu kompilasi:
zh_cn: 运行上面的代码将导致一个编译时错误：

source: ### The `Copy` Trait
es: ### El Trait `Copy`
zh_cn: ### `Copy` Trait

source: If a type implements the `Copy` trait, passing it to a function will not move the ownership of the value to the function called, but will instead pass a copy of the value. You can implement the `Copy` trait on your type by adding the `#[derive(Copy)]` annotation to your type definition. However, Cairo won't allow a type to be annotated with Copy if the type itself or any of its components don't implement the Copy trait. While Arrays and Dictionaries can't be copied, custom types that don't contain either of them can be.
es: Si un tipo implementa el trait `Copy`, pasar su valor a una función no moverá la propiedad del valor a la función llamada, sino que pasará una copia del valor. Puedes implementar el trait `Copy` en tu tipo agregando la anotación `#[derive(Copy)]` a la definición de tu tipo. Sin embargo, Cairo no permitirá que un tipo sea anotado con `Copy` si el tipo en sí mismo o cualquiera de sus componentes no implementan el trait `Copy`. Mientras que los Arrays y Diccionarios no pueden ser copiados, los tipos personalizados que no los contienen sí pueden serlo.
zh_cn: 如果一个类型实现了`Copy`Trait，把它传递给一个函数将不会把值的所有权转移给被调用的函数，而是传递一个值的副本。 你可以通过在你的类型定义中添加`#[derive(Copy)]`标注来实现`Copy` Trait。然而，如果一个类型本身或其任何组件没有实现Copy Trait，Cairo将不允许该类型被标注为Copy。 虽然数组和字典不能被复制，但不包含它们的自定义类型可以被复制。

source: In this example, we can pass `p1` twice to the foo function because the `Point` type implements the `Copy` trait. This means that when we pass `p1` to `foo`, we are actually passing a copy of `p1`, and the ownership of `p1` remains with the main function. If you remove the `Copy` trait derivation from the `Point` type, you will get a compile-time error when trying to compile the code.
es: En este ejemplo, podemos pasar `p1` dos veces a la función `foo` porque el tipo `Point` implementa el trait `Copy`. Esto significa que cuando pasamos `p1` a `foo`, en realidad estamos pasando una copia de `p1`, y la propiedad de `p1` permanece en la función principal. Si eliminamos la derivación del trait `Copy` del tipo `Point`, obtendremos un error en tiempo de compilación al intentar compilar el código.
zh_cn: 在这个例子中，我们可以向foo函数传递两次`p1`，因为`Point`类型实现了`Copy`trait。这意味着当我们把`p1`传递给`foo`时，我们实际上是在传递`p1`的副本，而`p1`的所有权仍然属于主函数。 如果你从`Point`类型中删除`Copy`trait的派生，当你试图编译代码时，你会得到一个编译时错误。

source: ### The `Drop` Trait
es: ### El Trait `Drop`
zh_cn: ### `Drop` Trait

source: You may have noticed that the `Point` type in the previous example also implements the `Drop` trait. In Cairo, a value cannot go out of scope unless it has been previously moved. For example, the following code will not compile, because the struct `A` is not moved before it goes out of scope:
es: Es posible que hayas notado que el tipo `Point` en el ejemplo anterior también implementa el trait `Drop`. En Cairo, un valor no puede salir del ámbito a menos que se haya movido previamente. Por ejemplo, el siguiente código no se compilará porque la estructura `A` no se mueve antes de que salga del ámbito:
zh_cn: 你可能已经注意到，前面例子中的`Point`类型也实现了`Drop` trait。在Cairo中，一个值不能超出其作用域，除非它之前被移动过。 例如，下面的代码将无法编译，因为结构体`A`在超出作用域之前没有被移动：

source: This is to ensure the soundness of Cairo programs. Soundness refers to the fact that if a statement during the execution of the program is false, no cheating prover can convince an honest verifier that it is true. In our case, we want to ensure the consistency of consecutive dictionary key updates during program execution, which is only checked when the dictionaries are `squashed` - which moves the ownership of the dictionary to the `squash` method, thus allowing the dictionary to go out of scope. Unsquashed dictionaries are dangerous, as a malicious prover could prove the correctness of inconsistent updates.
es: Con ello se pretende garantizar la solidez de los programas de Cairo. La solidez se refiere al hecho de que si una durante la ejecución del programa es falsa, ningún probador tramposo puede convencer a un verificador honesto de que es verdadera. verificador honesto de que es verdadera. En nuestro caso, queremos garantizar la coherencia de actualizaciones consecutivas de las claves del diccionario durante la ejecución del programa, que sólo se comprueba cuando los diccionarios son `squashed` - que mueve la propiedad del diccionario al método `squash`, lo que permite que el diccionario salga del ámbito. Los diccionarios Unsquashed son peligrosos, ya que un prover malicioso podría probar la corrección de actualizaciones inconsistentes.
zh_cn: 这是为了确保Cairo程序的健全性。健全性指的是，如果在程序执行过程中的一个语句是假的，任何作弊的验证者都不可能说服一个诚实的验证者相信它是真的。 在我们的案例中，我们要确保程序执行过程中连续的字典键的更新的一致性。 这只有在字典被压缩（`squashed`）时才会进行检查--它将字典的所有权转移到了`squash`方法，从而允许字典超出作用域。未被压缩的字典是危险的，因为恶意的证明者可以证明不一致更新的正确性。

source: However, types that implement the `Drop` trait are allowed to go out of scope without being explicitly moved. When a value of a type that implements the `Drop` trait goes out of scope, the `Drop` implementation is called on the type, which moves the value to the `drop` function, allowing it to go out of scope - This is what we call "dropping" a value. It is important to note that the implementation of drop is a "no-op", meaning that it doesn't perform any actions other than allowing the value to go out of scope.
es: Sin embargo, los tipos que implementan el trait `Drop` se permiten que salgan de ámbito sin ser movidos explícitamente. Cuando un valor de un tipo que implementa el trait `Drop` sale de ámbito, se llama a la implementación `Drop` en el tipo, lo que mueve el valor a la función `drop`, permitiendo que salga de ámbito: esto es lo que llamamos "eliminar" un valor. Es importante tener en cuenta que la implementación de `Drop` es una "operación nula", lo que significa que no realiza ninguna acción aparte de permitir que el valor salga de ámbito.
zh_cn: 然而，实现了`Drop` trait的类型被允许超出作用域而不被明确移动。当一个实现了`Drop` trait的类型的值超出作用域时，`Drop`的实现会被调用，它将值移动到`drop`函数中，允许它超出作用域--这就是我们所说的 "丢弃 "一个值。 值得注意的是，drop的实现是一个 "no-op"，也就是说，除了允许值离开作用域之外，它不执行任何其他操作。

source: The `Drop` implementation can be derived for all types, allowing them to be dropped when going out of scope, except for dictionaries (`Felt252Dict`) and types containing dictionaries. For example, the following code compiles:
es: La implementación `Drop` puede ser derivada para todos los tipos, permitiéndoles ser descartados cuando salen del ámbito, excepto para los diccionarios (`Felt252Dict`) y los tipos que contienen diccionarios. Por ejemplo, el siguiente código compila:
zh_cn: 除了字典（`Felt252Dict`）和包含字典的类型外，所有类型都可以派生`Drop`的实现，使得它们可以在超出作用域时被丢弃。 例如，下面的代码可以正常编译：

source: ### The `Destruct` Trait
es: ### El Trait `Destruct`
zh_cn: ### `Destruct` Trait

source: Manually calling the `squash` method on a dictionary is not very convenient, and it is easy to forget to do so. To make it easier to use dictionaries, Cairo provides the `Destruct` trait, which allows you to specify the behavior of a type when it goes out of scope. While Dictionaries don't implement the `Drop` trait, they do implement the `Destruct` trait, which allows them to automatically be `squashed` when they go out of scope. This means that you can use dictionaries without having to manually call the `squash` method.
es: Llamar manualmente al método `squash` en un diccionario no es muy conveniente y es fácil de olvidar hacerlo. Para facilitar el uso de los diccionarios, Cairo proporciona el trait `Destruct`, que te permite especificar el comportamiento de un tipo cuando sale del ámbito. Si bien los diccionarios no implementan el trait `Drop`, sí implementan el trait `Destruct`, lo que les permite ser `aplastados` automáticamente cuando salen del ámbito. Esto significa que puedes usar diccionarios sin tener que llamar manualmente al método `squash`.
id: Memanggil metode `squash` secara manual pada suatu kamus tidaklah sangat praktis, dan mudah untuk dilupakan. Untuk memudahkan penggunaan kamus, Cairo menyediakan trait `Destruct`, yang memungkinkan Anda untuk menentukan perilaku suatu tipe saat keluar dari lingkup. Meskipun Kamus tidak mengimplementasikan trait `Drop`, mereka mengimplementasikan trait `Destruct`, yang memungkinkan mereka untuk secara otomatis di-"squash" saat keluar dari lingkup. Ini berarti bahwa Anda dapat menggunakan kamus tanpa harus memanggil metode `squash` secara manual.
zh_cn: 手动调用字典上的 `squash` 方法不是很方便，而且很容易忘记这样做。为了方便使用字典，Cairo 提供了 `Destruct` trait，它允许你指定一个类型超出作用域时的行为。虽然字典没有实现`Drop` trait，但它们实现了`Destruct`trait，这允许它们在超出作用域时自动被`squashed`，因此你可以不需要手动调用`squash`方法。

source: Consider the following example, in which we define a custom type that contains a dictionary:
es: Considera el siguiente ejemplo, en el que definimos un tipo personalizado que contiene un diccionario:
id: Pertimbangkan contoh berikut, di mana kita mendefinisikan sebuah tipe kustom yang mengandung sebuah kamus:
zh_cn: 下面的这个例子中，我们定义了一个包含字典的自定义类型：

source: When A goes out of scope, it can't be dropped as it implements neither the `Drop` (as it contains a dictionary and can't `derive(Drop)`) nor the `Destruct` trait. To fix this, we can derive the `Destruct` trait implementation for the `A` type:
es: Cuando `A` sale del alcance, no puede ser liberado ya que no implementa ni el `Drop` (ya que contiene un diccionario y no puede `derive(Drop)`) ni el trait `Destruct`. Para solucionar esto, podemos derivar la implementación del trait `Destruct` para el tipo `A`:
id: Ketika A keluar dari lingkup, ia tidak dapat di-drop karena tidak mengimplementasikan trait `Drop` (karena mengandung kamus dan tidak bisa `derive(Drop)`) maupun trait `Destruct`. Untuk memperbaiki ini, kita dapat menurunkan implementasi trait `Destruct` untuk tipe `A`:
zh_cn: 当A超出作用域时，它不能被丢弃，因为它既没有实现`Drop`（因为它包含一个字典，不能派生`derive(Drop)`）也没有实现`Destruct` trait。为了解决这个问题，我们可以为`A`类型派生出`Destruct` trait的实现：

source: ### Copy Array data with Clone
es: ### Copiar datos de un Array con Clone
zh_cn: ### 用Clone复制数组数据

source: If we _do_ want to deeply copy the data of an `Array`, we can use a common method called `clone`. We’ll discuss method syntax in Chapter 6, but because methods are a common feature in many programming languages, you’ve probably seen them before.
zh_cn: 如果我们确实想深拷贝一个 "数组 "的数据，我们可以使用一个叫做 `clone`的通用方法。 我们将在第6章中讨论方法的语法，但由于方法是许多编程语言的共同特征，你可能已经见过它们了。

source: > Note: in the following example, we need to import the `Clone` trait from the corelib `clone` module, and its implementation for the array type from the `array` module.
es: > Nota: en el siguiente ejemplo, necesitamos importar el rasgo `Clone` del módulo `clone` de la biblioteca estándar, y su implementación para el tipo `array` del módulo `array`.
zh_cn: > 注意：在下面的例子中，我们需要从corelib的`clone`模块中导入`clone`trait，并从`array`模块中导入其对数组类型的实现。

source: > Note: you will need to run `scarb cairo-run` with the `--available-gas=2000000` option to run this example, because it uses a loop and must be ran with a gas limit.
zh_cn: > 注意：你需要用`--available-gas=2000000`选项运行`scarb cairo-run`来运行这个例子，因为它使用了一个循环，运行时必须有gas限制。

source: When you see a call to `clone`, you know that some arbitrary code is being executed and that code may be expensive. It’s a visual indicator that something different is going on.
es: Cuando ves una llamada a `clone`, sabes que se está ejecutando algún código arbitrario y ese código puede ser costoso. Es un indicador visual de que algo diferente está sucediendo.
zh_cn: 当你看到对`clone`的调用时，你知道一些特定的代码被执行而且这些代码可能相当消耗资源。 你很容易察觉到一些不寻常的事情正在发生。

source: ### Ownership and Functions
es: ### Ownership y Funciones
zh_cn: ### 所有权与函数

source: Passing a variable to a function will either move it or copy it. As seen in the Array section, passing an `Array` as a function parameter transfers its ownership; let's see what happens with other types.
es: Pasar una variable a una función puede moverla o copiarla. Como se vio en la sección de Array, pasar un `Array` como parámetro de función transfiere su propiedad; veamos qué sucede con otros tipos.
id: Mengirimkan sebuah variabel ke dalam sebuah fungsi akan entah memindahkannya atau menyalinnya. Seperti yang terlihat pada bagian Array, melewatkan sebuah `Array` sebagai parameter fungsi mentransfer kepemilikannya; mari lihat apa yang terjadi dengan tipe-tipe lainnya.
zh_cn: 将一个变量传递给一个函数，要么移动它，要么复制它。正如在数组部分所看到的，将 `Array` 作为一个函数参数传递同时会传递它的所有权；让我们看看其他类型会发生什么。

source: Listing 4-3 has an example with some annotations showing where variables go into and out of scope.
zh_cn: 示例4-3使用注释展示变量何时进入和离开作用域。

source: <span class="caption">Listing 4-3: Functions with ownership and scope annotated</span>
zh_cn: <span class="caption">示例4-3：带有所有权和作用域注释的函数</span>

source: If we tried to use `my_struct` after the call to `takes_ownership`, Cairo would throw a compile-time error. These static checks protect us from mistakes. Try adding code to `main` that uses `my_struct` and `x` to see where you can use them and where the ownership rules prevent you from doing so.
es: Si intentamos usar `my_struct` después de la llamada a `takes_ownership`, Cairo lanzará un error en tiempo de compilación. Estas verificaciones estáticas nos protegen de errores. Intenta agregar código a `main` que use `my_struct` y `x` para ver dónde puedes usarlos y dónde las reglas de propiedad te impiden hacerlo.
zh_cn: 如果我们试图在调用`takes_ownership`之后使用`my_struct`，Cairo会抛出一个编译时错误。 这些静态检查可以保护我们不犯错误。试着在`main`中添加使用`my_struct`和`x`的代码，看看哪里可以使用它们， 哪里所有权规则将会阻止你这样做。

source: ### Return Values and Scope
es: ### Valores de retorno y alcance
zh_cn: ### 返回值与作用域

source: Returning values can also transfer ownership. Listing 4-4 shows an example of a function that returns some value, with similar annotations as those in Listing 4-3.
zh_cn: 返回值也可以转移所有权。示例4-4显示了一个例子 该函数返回一些值，其注释与示例4-3中的相似。

source: <span class="caption">Listing 4-4: Transferring ownership of return values</span>
zh_cn: <span class="caption">示例4-4：转移返回值的所有权 </span>

source: When a variable goes out of scope, its value is dropped, unless ownership of the value has been moved to another variable.
es: Cuando una variable sale del ámbito, su valor se elimina, a menos que la propiedad del valor se haya transferido a otra variable.
id: Ketika sebuah variabel keluar dari lingkup, nilainya dihapus (dropped), kecuali kepemilikannya dari nilai tersebut telah dipindahkan ke variabel lain.
zh_cn: 当一个变量超出作用域时，它的值会被丢弃，除非值的所有权被转移到另一个变量上。

source: While this works, taking ownership and then returning ownership with every function is a bit tedious. What if we want to let a function use a value but not take ownership? It’s quite annoying that anything we pass in also needs to be passed back if we want to use it again, in addition to any data resulting from the body of the function that we might want to return as well.
es: Si bien esto funciona, tomar propiedad y luego devolver la propiedad con cada función es un poco tedioso. ¿Qué sucede si queremos permitir que una función use un valor pero no tome posesión de él? Es bastante molesto que todo lo que pasemos también deba ser devuelto si queremos usarlo nuevamente, además de cualquier dato que resulte del cuerpo de la función que también podríamos querer devolver.
zh_cn: 虽然这样是可以的，但是在每一个函数中都获取所有权并接着返回所有权有些啰嗦。 如果我们想要函数使用一个值但不获取所有权该怎么办呢？ 除此之外，我们也可能想返回函数体中产生的一些数据。

source: Cairo does let us return multiple values using a tuple, as shown in Listing 4-5.
id: Cairo memungkinkan kita untuk mengembalikan multiple nilai menggunakan tuple, seperti yang ditunjukkan pada Listing 4-5.
zh_cn: Cairo的确让我们可以使用一个元组返回多个值，如示例4-5所示。

source: <span class="caption">Listing 4-5: Returning ownership of parameters</span>
zh_cn: <span class="caption">示例4-5：返回参数的所有权</span>

source: But this is too much ceremony and a lot of work for a concept that should be common. Luckily for us, Cairo has two features for using a value without transferring ownership, called _references_ and _snapshots_.
es: Pero esto es demasiado ceremonioso y mucho trabajo para un concepto que debería ser común. Afortunadamente, Cairo tiene dos características para usar un valor sin transferir la propiedad, llamadas _referencias_ y _snapshots_.
zh_cn: 但是这未免有些形式主义，而且这种场景应该很常见。 幸运的是，Cairo提供了两个功能可以在不转移所有权的情况下使用一个值， 称为 引用（ _references_ ）和 快照（ _snapshots_ ）。

source: ## References and Snapshots
es: ## Referencias y Snapshots
zh_cn: ## 引用和快照

source: The issue with the tuple code in Listing 4-5 is that we have to return the `Array` to the calling function so we can still use the `Array` after the call to `calculate_length`, because the `Array` was moved into `calculate_length`.
zh_cn: 示例4-5中元组代码的问题是，因为 `Array`的所有权被移到了`calculate_length`中。 我们必须返回`Array`给调用的函数，这样我们在调用`calculate_length`后才仍然可以使用`Array`。

source: ### Snapshots
zh_cn: ### 快照（Snapshots）

source: Instead, we can provide a _snapshot_ of the `Array` value. In Cairo, a snapshot is an immutable view of a value at a certain point in time. In the previous chapter, we talked about how Cairo's ownership system prevents us from using a value after we've moved it, protecting us from potentially writing twice to the same memory cell when appending values to arrays. However, it's not very convenient. Let's see how we can retain ownership of the value in the calling function using snapshots.
es: En su lugar, podemos proporcionar una _instantánea_ del valor `Array`. En Cairo, una instantánea es una vista inmutable de un valor en un cierto momento en el tiempo. En el capítulo anterior, hablamos de cómo el sistema de propiedad de Cairo nos impide usar un valor después de haberlo movido, protegiéndonos de escribir potencialmente dos veces en la misma celda de memoria al agregar valores a los arreglos. Sin embargo, no es muy conveniente. Veamos cómo podemos mantener la propiedad del valor en la función de llamada usando instantáneas.
zh_cn: 不过，我们可以提供一个`Array`值的 _snapshot_ 。在Cairo，一个快照是一个在某个时间点上的不可改变的值的视图。 在上一章中，我们谈到了Cairo的所有权系统是如何防止我们在移动一个值后使用它，从而防止我们在向数组添加值时不会潜在地多次写入相同的内存单元。 然而，这不是很方便。让我们看看如何使用快照在调用函数中保留值的所有权。

source: Here is how you would define and use a `calculate_length` function that takes a snapshot to an array as a parameter instead of taking ownership of the underlying value. In this example, the `calculate_length` function returns the length of the array passed as parameter. As we're passing it as a snapshot, which is an immutable view of the array, we can be sure that the `calculate_length` function will not mutate the array, and ownership of the array is kept in the main function.
es: Aquí es cómo definiría y usaría una función `calculate_length` que toma una instantánea de un arreglo como parámetro en lugar de tomar propiedad del valor subyacente. En este ejemplo, la función `calculate_length` devuelve la longitud del arreglo pasado como parámetro. Como lo estamos pasando como una instantánea, que es una vista inmutable del arreglo, podemos estar seguros de que la función `calculate_length` no mutará el arreglo, y la propiedad del arreglo se mantiene en la función principal.
zh_cn: 下面是你如何定义和使用一个`calculate_length` 函数，它以一个快照作为参数，而不是获取底层值的所有权。在这个例子中、 `calculate_length`函数返回作为参数的数组的长度。 因为我们是以快照的形式传递的，这是一个不可改变的数组视图，我们可以确定 `calculate_length`函数不会改变数组，数组的所有权被保留在主函数中。

source: > Note: It is only possible to call the `len()` method on an array snapshot because it is defined as such in the `ArrayTrait` trait. If you try to call a method that is not defined for snapshots on a snapshot, you will get a compilation error. However, you can call methods expecting a snapshot on non-snapshot types.
es: > Nota: Solo es posible llamar al método `len()` en un snapshot de un array porque está definido así en el trait `ArrayTrait`. Si intentas llamar a un método que no está definido para snapshots en un snapshot, obtendrás un error de compilación. Sin embargo, puedes llamar a métodos que esperan un snapshot en tipos que no son snapshots.
zh_cn: > 注意：只有在数组快照上才能调用 `len()` 方法，因为它在 `ArrayTrait` trait中被定义成这样。如果你试图在一个快照上调用一个没有为快照定义的方法，你会得到一个编译错误。然而，你可以在非快照类型上调用快照的方法。

source: First, notice that all the tuple code in the variable declaration and the function return value is gone. Second, note that we pass `@arr1` into `calculate_length` and, in its definition, we take `@Array<u128>` rather than `Array<u128>`.
es: La primera observación es que todo el código de tuplas en la declaración de variables y en el valor de retorno de la función ha desaparecido. La segunda observación es que pasamos `@arr1` a `calculate_length` y, en su definición, tomamos `@Array<u128>` en lugar de `Array<u128>`.
zh_cn: 首先，注意到变量声明和函数返回值中的所有元组代码都消失了。 第二，注意看我们把`@arr1`传入`calculate_length`，因此在它的定义中，我们采用`@Array<u128>`，而不是`Array<u128>`。

source: The `@arr1` syntax lets us create a snapshot of the value in `arr1`. Because a snapshot is an immutable view of a value, the value it points to cannot be modified through the snapshot, and the value it refers to will not be dropped once the snapshot stops being used.
es: La sintaxis `@arr1` nos permite crear una instantánea (snapshot) del valor en `arr1`. Como una instantánea es una vista inmutable de un valor, el valor al que apunta no puede ser modificado a través de la instantánea y el valor al que se refiere no será eliminado una vez que la instantánea deje de ser usada.
id: Sintaks `@arr1` memungkinkan kita membuat snapshot dari nilai di `arr1`. Karena sebuah snapshot adalah pandangan yang tidak dapat diubah dari sebuah nilai, nilai yang ditunjuknya tidak dapat dimodifikasi melalui snapshot, dan nilai yang dirujuknya tidak akan dihapus begitu snapshot berhenti digunakan.
zh_cn: `@arr1`语法让我们为`arr1`中的值创建了一个快照。因为快照是一个值的不可改变的视图，它所指向的值不能通过快照被修改，因此即使快照停止被使用，它所指向的值也不会被丢弃。

source: #### Desnap Operator
zh_cn: #### Desnap 操作符
