Repository: cairo-book/cairo-book
Catalog: po/*.po
Languages: es, id, ko, zh_cn

source: The Cairo Programming Language
es: El lenguaje de programación Cairo
id: Bahasa Pemrograman Cairo
ko: 카이로 프로그래밍 언어
zh_cn: Cairo编程语言

source: The Cairo Programming Language Foreword Introduction
id: Pengantar Awal Bahasa Pemrograman Cairo
ko: 카이로 프로그래밍 언어 서문 소개

source: Getting Started
es: Primeros pasos
id: Memulai
ko: 시작하기
zh_cn: 入门

source: Installation
es: Instalación
id: Instalasi
ko: 설치
zh_cn: 安装

source: Common Programming Concepts
es: Conceptos comunes de programación
id: Konsep Pemrograman Umum
ko: 일반적인 프로그래밍 개념들
zh_cn: 常见的编程概念

source: Variables and Mutability
es: Variables y mutabilidad
id: Variabel dan Mutabilitas
ko: 변수와 가변성
zh_cn: 变量与可变性

source: Data Types
es: Tipos de datos
id: Tipe Data
ko: 자료형
zh_cn: 数据类型

source: Functions
es: Funciones
id: Fungsi
ko: 함수
zh_cn: 函数

source: Comments
es: Comentarios
id: Komentar
ko: 주석
zh_cn: 注释

source: Control Flow
es: Flujo de control
id: Alur Kontrol
ko: 제어 흐름
zh_cn: 控制流

source: Common Collections
es: Colecciones Comunes
id: Koleksi Umum
ko: 일반적인 컬렉션
zh_cn: 常见集合

source: Arrays
id: Array
ko: 배열
zh_cn: 数组

source: Dictionaries
ko: 사전
zh_cn: 字典

source: Custom Data Structures
id: Struktur Data Kustom
ko: 사용자 정의 데이터 구조
zh_cn: 自定义数据结构

source: Understanding Ownership
es: Comprender Ownership
id: Memahami Kepemilikan
ko: 오너십 이해
zh_cn: 认识所有权

source: What is Ownership?
es: ¿Qué es Ownership?
id: Apa Itu Kepemilikan?
ko: 오너십이란?
zh_cn: 什么是所有权？

source: References and Snapshots
es: Referencias y Snapshots
id: Referensi dan Snapshot
ko: 참조와 스냅샷
zh_cn: 引用和快照

source: Using Structs to Structure Related Data
es: Uso de estructuras para estructurar datos relacionados
id: Menggunakan Struct untuk Struktur Data Terkait
ko: 구조체를 사용하여 관련 데이터 구조화
zh_cn: 使用结构体组织相关联的数据

source: Defining and Instantiating Structs
es: Definición e instanciación de estructuras
id: Mendefinisikan dan Menginstansiasi Struct
ko: 구조체 정의 및 인스턴스화
zh_cn: 结构体的定义和实例化

source: An Example Program Using Structs
es: Un programa de ejemplo usando estructuras
id: Contoh Program Menggunakan Struct
ko: 구조체를 사용한 예제 프로그램
zh_cn: 结构体实例程序

source: Method Syntax
es: Sintaxis de métodos
id: Sintaks Metode
ko: 메서드 구문
zh_cn: 方法语法

source: Enums and Pattern Matching
es: Enums y Concordancia de Patrones
id: Enum dan Pola Penyesuaian
ko: 열거형과 패턴 매칭
zh_cn: 枚举和模式匹配

source: Enums
id: Enum
ko: 열거형
zh_cn: 枚举的定义

source: The Match Control Flow Construct
es: La construcción del flujo de control de coincidencias
id: Konstruksi Alur Kontrol Cocok
ko: match 흐름 제어 구조
zh_cn: Match控制流结构

source: Managing Cairo Projects with Packages, Crates and Modules
es: Gestionando Proyectos Cairo con Paquetes, Crates y Módulos
id: Mengelola Proyek Cairo dengan Paket, Krate, dan Modul
ko: 패키지, 크레이트 및 모듈을 이용한 카이로 프로젝트 관리
zh_cn: 使用包、Crate 和模块管理Cairo项目

source: Packages and Crates
es: Paquetes y Crates
id: Paket dan Krate
ko: 패키지와 크레이트
zh_cn: 包和 Crate

source: Defining Modules to Control Scope
es: Definición de módulos para controlar el alcance
id: Mendefinisikan Modul untuk Mengontrol Ruang Lingkup
ko: 범위 제어를 위한 모듈 정의
zh_cn: 定义模块以控制作用域

source: Paths for Referring to an Item in the Module Tree
es: Rutas para referirse a un elemento en el Arbol de Módulos
id: Jalur untuk Merujuk pada Item dalam Pohon Modul
ko: 모듈 트리에서 항목을 참조하는 경로
zh_cn: 引用模块项目的路径

source: Bringing Paths into Scope with the 'use' Keyword
es: Introducción de Rutas con la Palabra Clave 'use'
id: Membawa Jalur ke Ruang Lingkup dengan Kata Kunci 'use'
ko: 'use' 키워드를 사용하여 범위에 경로 가져오기
zh_cn: 使用 ‘use’ 关键字将路径引入作用域

source: Separating Modules into Different Files
es: Separación de Módulos en Distintos Ficheros
id: Memisahkan Modul ke File yang Berbeda
ko: 다른 파일로 모듈 분리하기
zh_cn: 将模块拆分成多个文件

source: Generic Data Types
id: Tipe Data Generik
ko: 제네릭 데이터 타입

source: Generic Types
es: Tipos Genéricos
id: Tipe Generik
ko: 제네릭 타입
zh_cn: 泛型

source: Generic Functions
es: Funciones Genéricas
id: Fungsi Generik
ko: 제네릭 함수
zh_cn: 在函数定义中使用泛型

source: Traits in Cairo
es: Traits en Cairo
id: Sifat dalam Cairo
ko: 카이로에서의 트레잇
zh_cn: Cairo中的Trait

source: Testing Cairo Programs
es: Test de Programas en Cairo
id: Menguji Program Cairo
ko: 카이로 프로그램 테스트
zh_cn: 测试Cairo 程序

source: How To Write Tests
es: Cómo Escribir Tests
id: Cara Menulis Tes
ko: 테스트 작성 방법
zh_cn: 如何编写测试

source: Testing Organization
es: Organización de Testing
id: Organisasi Pengujian
ko: 테스트 구성
zh_cn: 测试的组织结构

source: Error Handling
es: Gestión de Errores
id: Penanganan Kesalahan
ko: 오류 처리
zh_cn: 错误处理

source: Unrecoverable Errors with panic
es: Errores Irrecuperables con pánico
id: Kesalahan yang Tidak Dapat Diperbaiki dengan panic
ko: 패닉과 함께 복구할 수 없는 오류
zh_cn: 用panic处理不可恢复的错误

source: Recoverable Errors with Result
es: Errores Recuperables con Resultados
id: Kesalahan yang Dapat Diperbaiki dengan Hasil
ko: 결과와 복구 가능한 오류
zh_cn: 用Result处理可恢复的错误

source: Advanced Features
es: Funciones Avanzadas
id: Fitur Lanjutan
ko: 고급 기능
zh_cn: 高级特性

source: Operator Overloading
es: Sobrecarga de Operadores
id: Peng-overloadan Operator
ko: 연산자 오버로딩
zh_cn: 操作符重载

source: Macros
id: Makro
ko: 매크로
zh_cn: 宏

source: Working with Hashes
ko: 해시와 함께 작업하기
zh_cn: 使用哈希

source: Starknet smart contracts
id: Kontrak pintar Starknet
ko: 스타크넷 스마트 계약

source: Starknet Smart Contracts
id: Kontrak Pintar Starknet
ko: 스타크넷 스마트 계약
zh_cn: Starknet智能合约

source: Introduction to smart-contracts
es: Introducción a los smart-contracts
id: Pengantar kontrak pintar
ko: 스마트 계약 소개
zh_cn: 智能合约简介

source: A simple contract
id: Kontrak sederhana
ko: 간단한 계약
zh_cn: 一份简单的合约

source: A deeper dive into contracts
id: Penggalian lebih dalam ke dalam kontrak
ko: 계약에 대한 심층적인 탐구
zh_cn: 深入了解合约

source: Contract Storage
id: Penyimpanan Kontrak
ko: 계약 보관
zh_cn: 存储变量

source: Contract Functions
id: Fungsi Kontrak
ko: 계약 기능
zh_cn: 合约函数

source: Contract Events
id: Event Kontrak
ko: 계약 이벤트
zh_cn: 合约的事件

source: Reducing boilerplate
id: Mengurangi boilerplate
ko: 보일러플레이트 줄이기
zh_cn: 减少冗余模板代码

source: Optimizing storage costs
id: Mengoptimalkan biaya penyimpanan
ko: 저장 비용 최적화
zh_cn: 优化存储成本

source: Components
id: Komponen
ko: 구성 요소
zh_cn: 组件

source: Under the hood
id: Di balik layar
ko: 머리카락 아래
zh_cn: 深入了解组件

source: Component dependencies
id: Ketergantungan komponen
ko: 구성 요소 의존성
zh_cn: 组件依赖

source: Testing components
id: Menguji komponen
ko: 구성 요소 테스트
zh_cn: 测试组件

source: ABIs and Cross-contract Interactions
es: ABIs e Interacciones entre Contratos Multicapa
id: ABIs dan Interaksi antar Kontrak
ko: ABIs 및 교차 계약 상호 작용
zh_cn: ABI和跨合约交互

source: ABIs and Interfaces
es: ABIs e interfaces
id: ABIs dan Antarmuka
ko: ABIs와 인터페이스
zh_cn: ABI和接口

source: Contract Dispatchers, Library Dispatchers and system calls
ko: 계약 디스패처, 도서관 디스패처 및 시스템 호출

source: Other examples
id: Contoh lainnya
ko: 다른 예시
zh_cn: 其他例子

source: Deploying and Interacting with a Voting contract
id: Mendeploy dan Berinteraksi dengan kontrak pemungutan suara
ko: 투표 계약을 배포하고 상호 작용하기
zh_cn: 部署投票合约并与之交互

source: L1 \<\> L2 Messaging
id: Pesan L1 \<\> L2
ko: L1 \<\> L2 메시징

source: Security Considerations
es: Consideraciones de Seguridad
id: Pertimbangan Keamanan
ko: 보안 고려 사항
zh_cn: 安全考量

source: Appendix
es: Apéndice
id: Lampiran
ko: 부록
zh_cn: 附录

source: A - Keywords
es: A - Palabras clave
id: A - Kata Kunci
ko: A - 키워드
zh_cn: A - 关键字

source: B - Operators and Symbols
es: B - Operadores y Símbolos
id: B - Operator dan Simbol
ko: B - 연산자 및 기호
zh_cn: B - 运算符和符号

source: C - Derivable Traits
es: C - Traits Derivables
id: C - Sifat yang Dapat Diambil
ko: C - 유도 가능한 특성
zh_cn: C - 可派生的 Trait

source: D - Useful Development Tools
es: D - Herramientas de Desarrollo Útiles
id: D - Alat Pengembangan yang Berguna
ko: D - 유용한 개발 도구
zh_cn: D - 实用开发工具

source: E - Common Types & Traits and the Cairo Prelude
id: E - Tipe dan Sifat Umum serta Pendahuluan Cairo
ko: E - 일반 유형 및 특성 및 카이로 프렐류드
zh_cn: E - 常见类型和trait以及Cairo Prelude

source: F - Installing Cairo binaries
id: F - Menginstal biner Cairo
ko: F - 카이로 이진 파일 설치
zh_cn: F - 安装Cairo二进制文件

source: G - System Calls
ko: G - 시스템 호출

source: By the Cairo Community and its [contributors](https://github.com/cairo-book/cairo-book.github.io). Special thanks to [Starkware](https://starkware.co/) through [OnlyDust](https://www.onlydust.xyz/), and [Voyager](https://voyager.online/) for supporting the creation of this book.
ko: 카이로 커뮤니티와 [기여자들](https://github.com/cairo-book/cairo-book.github.io)에 의해 제작되었습니다. 이 책 제작을 지원해준 [Starkware](https://starkware.co/)의 [OnlyDust](https://www.onlydust.xyz/)와 [Voyager](https://voyager.online/)에 특별히 감사드립니다.

source: This version of the text assumes you’re using the [Cairo Compiler](https://github.com/starkware-libs/cairo) [version 2.5.1](https://github.com/starkware-libs/cairo/releases). See the “Installation” section of Chapter 1 to install or update Cairo.
ko: 이 텍스트 버전은 [Cairo Compiler](https://github.com/starkware-libs/cairo) [버전 2.5.1](https://github.com/starkware-libs/cairo/releases)을 사용한다고 가정합니다. Cairo를 설치하거나 업데이트하려면 1장의 "설치" 섹션을 참조하십시오.

source: Foreword
es: Prólogo
id: Pendahuluan
ko: 서문
zh_cn: 前言

source: In 2020, StarkWare released Cairo 0, a Turing-complete programming language supporting verifiable computation. Cairo started as an assembly language and gradually became more expressive. The learning curve was initially steep, as Cairo 0.x was a low-level language that did not entirely abstract the underlying cryptographic primitives required to build a proof for the execution of a program.
es: En 2020, StarkWare lanzó Cairo 0, un lenguaje de programación Turing completo que admite cálculo verificable. Cairo comenzó como un lenguaje ensamblador y gradualmente se volvió más expresivo. La curva de aprendizaje fue inicialmente pronunciada, ya que Cairo 0.x era un lenguaje de bajo nivel que no abstraía por completo las primitivas criptográficas subyacentes requeridas para construir una prueba para la ejecución de un programa.
id: Pada tahun 2020, StarkWare merilis Cairo 0, bahasa pemrograman Turing-complete yang mendukung komputasi yang dapat diverifikasi. Cairo awalnya merupakan bahasa assembly dan secara bertahap menjadi lebih ekspresif. Kurva pembelajarannya pada awalnya curam, karena Cairo 0.x adalah bahasa tingkat rendah yang tidak sepenuhnya mengabstraksi primitif kriptografis yang mendasari yang diperlukan untuk membangun bukti untuk eksekusi program.
ko: 2020년에 StarkWare는 검증 가능한 계산을 지원하는 Turing-complete 프로그래밍 언어인 Cairo 0을 출시했습니다. Cairo는 어셈블리 언어로 시작하여 점차 표현력이 향상되었습니다. 학습 곡선은 처음에 가파르며, Cairo 0.x는 프로그램 실행에 대한 증명을 구축하는 데 필요한 기본 암호학적 기본 요소를 완전히 추상화하지 않은 저수준 언어였습니다.
zh_cn: 2020年，StarkWare发布了Cairo 0，这是一种支持可验证计算的图灵完备编程语言。Cairo最初是一种汇编语言，后来逐渐变得更具表现力。因为Cairo 0.x是一种低级语言，没有完全抽象出为程序的执行建立证明所需的底层加密原语，所以最初的学习曲线很陡峭。

source: With the release of Cairo 1, the developer experience has considerably improved, abstracting away the underlying immutable memory model of the Cairo architecture where possible. Strongly inspired by Rust, Cairo 1 has been built to help you create provable programs without specific knowledge of its underlying architecture so that you can focus on the program itself, increasing the overall security of Cairo programs. Powered by a Rust VM, the execution of Cairo programs is now _blazingly_ fast, allowing you to build an extensive test suite without compromising on performance.
es: Con el lanzamiento de Cairo 1, la experiencia del desarrollador ha mejorado considerablemente, abstrayendo el modelo de memoria inmutable subyacente de la arquitectura de Cairo siempre que sea posible. Inspirado en Rust, Cairo 1 ha sido construido para ayudarte a crear programas comprobables sin conocimientos específicos de su arquitectura subyacente, para que puedas concentrarte en el programa en sí, aumentando la seguridad general de los programas de Cairo. Alimentado por una máquina virtual Rust, la ejecución de los programas de Cairo es ahora _extremadamente_ rápida, lo que te permite construir una amplia suite de pruebas sin comprometer el rendimiento.
id: Dengan rilis Cairo 1, pengalaman pengembang telah meningkat secara signifikan, mengabstraksi model memori tak berubah yang mendasari arsitektur Cairo bila memungkinkan. Terinspirasi kuat oleh Rust, Cairo 1 dibangun untuk membantu Anda membuat program yang dapat dibuktikan tanpa pengetahuan khusus tentang arsitektur dasarnya sehingga Anda dapat mengutamakan program itu sendiri, meningkatkan keamanan keseluruhan program Cairo. Didukung oleh VM Rust, eksekusi program Cairo sekarang sangat cepat, memungkinkan Anda membangun serangkaian uji yang luas tanpa mengorbankan kinerja.
ko: 카이로 1의 출시로 개발자 경험이 상당히 향상되었으며, 가능한 경우 카이로 아키텍처의 기본 불변 메모리 모델을 추상화했습니다. 러스트에 강한 영감을 받아, 카이로 1은 당신이 프로그램 자체에 집중할 수 있도록 기본 아키텍처에 대한 특정 지식 없이 증명 가능한 프로그램을 만들 수 있도록 설계되었습니다. 러스트 VM을 기반으로 한 카이로 프로그램의 실행은 이제 _매우_ 빠르며, 성능을 희생하지 않고 광범위한 테스트 스위트를 구축할 수 있습니다.
zh_cn: 随着Cairo 1的发布，由于尽可能地对Cairo架构底层的不可变内存模型进行了抽象，开发者的体验有了很大的改善。受到Rust的强烈启发，Cairo 1是为了帮助你无需具体了解其底层架构就创建可证明的程序而生，这样你就可以专注于程序本身，这提高Cairo程序的整体安全性。在Rust虚拟机的支持下，Cairo程序的执行速度现在快得惊人，允许你在不影响性能的情况下建立一个广泛的测试套件。

source: Blockchain developers that want to deploy contracts on Starknet will use the Cairo programming language to code their smart contracts. This allows the Starknet OS to generate execution traces for transactions to be proved by a prover, which is then verified on Ethereum L1 prior to updating the state root of Starknet.
es: Los desarrolladores de blockchain que desean implementar contratos en Starknet utilizarán el lenguaje de programación Cairo para codificar sus contratos inteligentes. Esto permite al sistema operativo Starknet generar trazas de ejecución para transacciones que deben ser demostradas por un probador, que luego se verifica en Ethereum L1 antes de actualizar la raíz del estado de Starknet.
id: Para pengembang blockchain yang ingin mendeploy kontrak di Starknet akan menggunakan bahasa pemrograman Cairo untuk membuat kontrak pintar mereka. Hal ini memungkinkan OS Starknet untuk menghasilkan jejak eksekusi untuk transaksi yang akan dibuktikan oleh pembuktian, yang kemudian diverifikasi di Ethereum L1 sebelum memperbarui root state dari Starknet.
ko: 스타크넷에 계약을 배포하려는 블록체인 개발자들은 스마트 계약을 코딩하기 위해 카이로 프로그래밍 언어를 사용할 것입니다. 이는 스타크넷 OS가 실행 추적을 생성하여 증명자가 증명할 거래에 대한 것을 생성하게 하며, 그 후에는 스타크넷의 상태 루트를 업데이트하기 전에 이더리움 L1에서 검증됩니다.
zh_cn: 想在Starknet上部署合约的区块链开发者将使用Cairo编程语言来编写他们的智能合约。这允许Starknet操作系统生成交易的执行跟踪，以供证明者生成证明，然后在更新Starknet的状态根之前在Ethereum L1上由验证者验证该证明。

source: However, Cairo is not only for blockchain developers. As a general purpose programming language, it can be used for any computation that would benefit from being proved on one computer and verified on other machines with lower hardware requirements.
es: Sin embargo, Cairo no es solo para desarrolladores de blockchain. Como lenguaje de programación de propósito general, se puede utilizar para cualquier cálculo que se beneficie de ser demostrado en una computadora y verificado en otras máquinas con requisitos de hardware más bajos.
id: Namun, Cairo bukan hanya untuk pengembang blockchain. Sebagai bahasa pemrograman umum, ia dapat digunakan untuk komputasi apa pun yang akan mendapatkan manfaat dari pembuktian pada satu komputer dan verifikasi pada mesin lain dengan persyaratan perangkat keras yang lebih rendah.
ko: 그러나 카이로는 블록체인 개발자들을 위한 것만이 아닙니다. 일반 목적의 프로그래밍 언어로서, 한 컴퓨터에서 증명되고 다른 하드웨어 요구 사양이 낮은 다른 기계에서 확인되는 계산에 사용될 수 있습니다.
zh_cn: 然而，Cairo不仅仅适用于区块链开发者。作为一种通用的编程语言，它可以用于任何需要在一台计算机上生成证明并在其他硬件要求较低的机器上验证的计算场景。

source: This book is designed for developers with a basic understanding of programming concepts. It is a friendly and approachable text intended to help you level up your knowledge of Cairo, but also help you develop your programming skills in general. So, dive in and get ready to learn all there is to know about Cairo!
es: Este libro está diseñado para desarrolladores con una comprensión básica de los conceptos de programación. Es un texto amigable y accesible destinado a ayudarte a mejorar tus conocimientos de Cairo, pero también a ayudarte a desarrollar tus habilidades de programación en general. ¡Así que sumérgete y prepárate para aprender todo lo que hay que saber sobre Cairo!
id: Buku ini dirancang untuk para pengembang dengan pemahaman dasar tentang konsep-konsep pemrograman. Ini adalah teks yang ramah dan mudah dipahami yang dimaksudkan untuk membantu Anda meningkatkan pengetahuan Anda tentang Cairo, tetapi juga membantu Anda mengembangkan keterampilan pemrograman Anda secara umum. Jadi, mulailah dan bersiaplah untuk belajar segala hal tentang Cairo!
ko: 이 책은 프로그래밍 개념에 기본적인 이해를 가진 개발자들을 대상으로 설계되었습니다. 친근하고 접근하기 쉬운 텍스트로, 카이로에 대한 지식을 높이는 데 도움을 주는 것은 물론, 프로그래밍 기술을 전반적으로 향상시키는 데도 도움이 되도록 의도되었습니다. 그러니, 들어가서 카이로에 대해 알아야 할 모든 것을 배우기 위해 준비하세요!
zh_cn: 本书是为对编程概念有基本了解的开发人员设计的。它是一本友好而平易近人的书本，旨在帮助你提高你的Cairo知识水平，同时也帮助你提高你的通用编程技能。因此，请潜下心来，并准备好学习所有关于Cairo的知识!

source: Acknowledgements
ko: 감사의 글

source: This book would not have been possible without the help of the Cairo community. We would like to thank every contributor for their contributions to this book!
ko: 이 책은 카이로 커뮤니티의 도움 없이는 불가능했을 것입니다. 이 책에 기여해 주신 모든 분들께 감사드립니다!

source: We would like to thank the Rust community for the [Rust Book](https://doc.rust-lang.org/book/), which has been a great source of inspiration for this book. Many examples and explanations have been adapted from the Rust Book to fit the Cairo programming language, as the two languages share many similarities.
ko: 우리는 [Rust Book](https://doc.rust-lang.org/book/)에 대해 Rust 커뮤니티에 감사드리고 싶습니다. 이 책은 이 책에 큰 영감을 주었습니다. 많은 예제와 설명이 Rust Book에서 채택되어 Cairo 프로그래밍 언어에 맞게 조정되었는데, 두 언어는 많은 유사성을 공유합니다.

source: Introduction
es: Introducción
id: Pengenalan
ko: 소개
zh_cn: 介绍

source: What is Cairo?
id: Apa itu Cairo?
ko: 카이로는 무엇인가요?

source: Cairo is a programming language designed for a virtual CPU of the same name. The unique aspect of this processor is that it was not created for the physical constraints of our world but for cryptographic ones, making it capable of efficiently proving the execution of any program running on it. This means that you can perform time consuming operations on a machine you don't trust, and check the result very quickly on a cheaper machine. While Cairo 0 used to be directly compiled to CASM, the Cairo CPU assembly, Cairo 1 is a higher level language. It first compiles to Sierra, an intermediate representation of Cairo which will compile later down to a safe subset of CASM. The point of Sierra is to ensure your CASM will always be provable, even when the computation fails.
ko: 카이로는 동일한 이름의 가상 CPU를 위해 설계된 프로그래밍 언어입니다. 이 프로세서의 독특한 측면은 우리 세계의 물리적 제약을 위해 만들어진 것이 아니라 암호학적 제약을 위해 만들어졌다는 것입니다. 이는 그 위에서 실행되는 모든 프로그램의 실행을 효율적으로 증명할 수 있게 만들어줍니다. 이는 신뢰할 수 없는 기계에서 시간이 많이 소요되는 작업을 수행하고, 결과를 더 저렴한 기계에서 매우 빠르게 확인할 수 있다는 것을 의미합니다. 카이로 0은 처음에 CASM, 카이로 CPU 어셈블리로 직접 컴파일되었지만, 카이로 1은 더 높은 수준의 언어입니다. 먼저 카이로의 중간 표현인 시에라로 컴파일되며, 이후에 CASM의 안전한 하위 집합으로 컴파일됩니다. 시에라의 목적은 계산이 실패해도 CASM이 항상 증명 가능하도록 하는 것입니다.

source: What can you do with it?
id: Apa yang bisa Anda lakukan dengannya?
ko: 그것으로 무엇을 할 수 있나요?

source: Cairo allows you to compute trustworthy values on untrusted machines. One major usecase is Starknet, a solution to Ethereum scaling. Ethereum is a decentralized blockchain platform that enables the creation of decentralized applications where every single interaction between a user and a d-app is verified by all the participants. Starknet is a Layer 2 built on top of Ethereum. Instead of having all the participants of the network to verify all user interactions, only one node, called the prover, executes the programs and generates proofs that the computations were done correctly. These proofs are then verified by an Ethereum smart contract, requiring significantly less computational power compared to executing the interactions themselves. This approach allows for increased throughput and reduced transaction costs while preserving Ethereum security.
es: Cairo permite calcular valores confiables en máquinas no confiables. Un caso de uso importante es Starknet, una solución para escalar Ethereum. Ethereum es una plataforma de blockchain descentralizada que permite la creación de aplicaciones descentralizadas donde cada interacción entre un usuario y una dApp es verificada por todos los participantes. Starknet es una capa 2 construida sobre Ethereum. En lugar de requerir que todos los participantes de la red verifiquen todas las interacciones del usuario, solo un nodo, llamado probador (prover), ejecuta los programas y genera pruebas de que los cálculos se realizaron correctamente. Estas pruebas luego son verificadas por un contrato inteligente de Ethereum, lo que requiere significativamente menos potencia de cómputo en comparación con ejecutar las interacciones en sí mismas. Este enfoque permite aumentar la capacidad de procesamiento y reducir los costos de transacción, al tiempo que se preserva la seguridad de Ethereum.
id: Cairo memungkinkan Anda menghitung nilai yang dapat dipercaya pada mesin yang tidak dapat dipercaya. Salah satu penggunaan utamanya adalah Starknet, solusi untuk skalabilitas Ethereum. Ethereum adalah platform blockchain terdesentralisasi yang memungkinkan pembuatan aplikasi terdesentralisasi di mana setiap interaksi antara pengguna dan d-app diverifikasi oleh semua peserta. Starknet adalah Layer 2 yang dibangun di atas Ethereum. Alih-alih memerlukan semua peserta jaringan untuk memverifikasi semua interaksi pengguna, hanya satu node, yang disebut pembuktian, yang menjalankan program dan menghasilkan bukti bahwa komputasi dilakukan dengan benar. Bukti-bukti ini kemudian diverifikasi oleh kontrak pintar Ethereum, memerlukan daya komputasi yang jauh lebih sedikit dibandingkan dengan mengeksekusi interaksi itu sendiri. Pendekatan ini memungkinkan peningkatan throughput dan pengurangan biaya transaksi sambil mempertahankan keamanan Ethereum.
ko: 카이로는 신뢰할 수 있는 값을 신뢰할 수 없는 기계에서 계산할 수 있게 합니다. 주요 사용 사례 중 하나는 이더리움 확장 솔루션인 Starknet입니다. 이더리움은 사용자와 d-앱 간의 모든 상호 작용이 모든 참여자에 의해 확인되는 탈중앙화된 블록체인 플랫폼입니다. Starknet은 이더리움 위에 구축된 Layer 2입니다. 네트워크의 모든 참여자가 모든 사용자 상호 작용을 확인하는 대신, 증명자라고 불리는 단일 노드만 프로그램을 실행하고 계산이 올바르게 수행되었음을 증명하는 증명을 생성합니다. 이 증명은 이후에 이더리움 스마트 계약에 의해 확인되며, 상호 작용 자체를 실행하는 것에 비해 상당히 적은 계산 능력이 필요합니다. 이 접근 방식은 이더리움 보안을 유지하면서 처리량을 증가시키고 거래 비용을 줄일 수 있게 합니다.
zh_cn: Cairo允许你在不被信任的机器上计算值得信任的值。一个主要的用例是Starknet，这是一个针对Ethereum扩展的解决方案。以太坊是一个去中心化的区块链平台，它可以创建去中心化的应用程序，用户和d-app之间的每一次交互都会被所有参与者验证。Starknet是一个建立在以太坊之上的Layer 2。不同于以太坊让网络的所有参与者来验证所有的用户的交互，Starknet只让一个被称为验证者(prover)的节点来执行程序，并生成计算正确的证明。这些证明再由以太坊智能合约来验证，与执行交互本身相比，需要的计算能力要少得多。这种方法增加了吞吐量和降低交易成本，但保留了以太坊的安全性。

source: What are the differences with other programming languages?
id: Apa perbedaannya dengan bahasa pemrograman lainnya?
ko: 다른 프로그래밍 언어와의 차이점은 무엇인가요?

source: Cairo is quite different from traditional programming languages, especially when it comes to overhead costs and its primary advantages. Your program can be executed in two different ways:
es: Cairo es bastante diferente de los lenguajes de programación tradicionales, especialmente en cuanto a los costos generales y sus ventajas principales. Tu programa se puede ejecutar de dos formas diferentes:
id: Cairo cukup berbeda dari bahasa pemrograman tradisional, terutama ketika datang ke biaya overhead dan keuntungan utamanya. Program Anda dapat dieksekusi dengan dua cara yang berbeda:
ko: 카이로는 오버헤드 비용과 주요 장점에 관해서 트래디셔널 프로그래밍 언어와 매우 다릅니다. 당신의 프로그램은 두 가지 다른 방식으로 실행될 수 있습니다:
zh_cn: Cairo与传统的编程语言，尤其是在额外的性能开销和语言的主要优势方面，有很大不同。你的程序可以通过两种不同的方式执行：
