Repository: cairo-book/cairo-book
Catalog: po/*.po
Languages: es, id, ko, zh_cn

source: The `smallest_element` function uses a generic type `T` that implements the `PartialOrd` trait, takes a snapshot of an `Array<T>` as a parameter and returns a copy of the smallest element. Because the parameter is of type `@Array<T>`, we no longer need to drop it at the end of the execution and so we don't require to implement the `Drop` trait for `T` as well. Why it does not compile then?
es: La función `smallest_element` utiliza un tipo genérico `T` que implementa el trait `PartialOrd`, toma una instantánea de un `Array<T>` como parámetro y devuelve una copia del elemento más pequeño. Debido a que el parámetro es de tipo `@Array<T>`, ya no necesitamos soltarlo al final de la ejecución y por lo tanto no necesitamos implementar el trait `Drop` para `T` también. ¿Por qué entonces no compila?
id: Fungsi `smallest_element` menggunakan tipe generik `T` yang mengimplementasikan trait `PartialOrd`, mengambil snapshot dari `Array<T>` sebagai parameter, dan mengembalikan salinan elemen terkecil. Karena parameter adalah tipe `@Array<T>`, kita tidak lagi perlu menghapusnya di akhir eksekusi dan karenanya kita tidak memerlukan implementasi trait `Drop` untuk `T` juga. Mengapa kemudian kode ini tidak dapat dikompilasi?
ko: `smallest_element` 함수는 `PartialOrd` 트레이트를 구현하는 일반 타입 `T`를 사용하며, `Array<T>`의 스냅샷을 매개변수로 사용하고 가장 작은 요소의 복사본을 반환합니다. 매개변수가 `@Array<T>` 타입이기 때문에 실행이 끝날 때 더 이상 삭제할 필요가 없으므로 `T`에 대해 `Drop` 트레이트를 구현할 필요가 없습니다. 그렇다면 왜 컴파일되지 않을까요?
zh_cn: 名为`smallest_element`函数使用一个实现了`PartialOrd`的trait的通用类型`T`，接收一个`Array<T>`的快照作为参数并返回其中最小元素的拷贝。因为参数是`@Array<T>`的类型，我们不再需要在执行结束时丢弃它，所以我们不需要为`T`实现`Drop`特性。那为什么它不能编译呢？

source: When indexing on `list`, the value results in a snap of the indexed element, unless `PartialOrd` is implemented for `@T` we need to desnap the element using `*`. The `*` operation requires a copy from `@T` to`T`, which means that `T` needs to implement the `Copy` trait. After copying an element of type `@T` to `T`, there are now variables with type `T` that need to be dropped, requiring for `T` to implement the `Drop` trait as well. We must then add both `Drop` and `Copy` traits implementation for the function to be correct. After updating the`smallest_element` function the resulting code would be:
es: Cuando hacemos indexación en `list`, el valor resultante es una instantánea del elemento indexado, a menos que `PartialOrd` esté implementado para `@T` necesitamos deshacer la instantánea del elemento usando `*`. La operación `*` requiere una copia de `@T` a `T`, lo que significa que `T` necesita implementar el trait `Copy`. Después de copiar un elemento de tipo `@T` a `T`, ahora hay variables con tipo `T` que necesitan ser soltadas, lo que requiere que `T` implemente también el trait `Drop`. Debemos entonces agregar la implementación de los traits `Drop` y `Copy` para que la función sea correcta. Después de actualizar la función `smallest_element`, el código resultante sería:
id: Ketika mengindeks pada `list`, nilai menghasilkan snap dari elemen yang diindeks, kecuali `PartialOrd` diimplementasikan untuk `@T` kita perlu melepaskan snap elemen tersebut menggunakan `*`. Operasi `*` memerlukan salinan dari `@T` ke `T`, yang berarti bahwa `T` perlu mengimplementasikan trait `Copy`. Setelah menyalin elemen bertipe `@T` ke `T`, sekarang ada variabel dengan tipe `T` yang perlu dibuang, memerlukan `T` untuk mengimplementasikan trait `Drop` juga. Oleh karena itu, kita harus menambahkan implementasi trait `Drop` dan `Copy` untuk fungsi tersebut agar menjadi benar. Setelah memperbarui fungsi `smallest_element`, kode hasilnya akan menjadi:
ko: `list`에 대한 인덱싱을 할 때, 값은 인덱스된 요소의 스냅으로 나타납니다. 단, `@T`에 대한 `PartialOrd`가 구현되어 있지 않은 경우에는 `*`를 사용하여 요소를 스냅해제해야 합니다. `*` 연산은 `@T`에서 `T`로의 복사를 필요로 하며, 이는 `T`가 `Copy` 트레이트를 구현해야 함을 의미합니다. `@T` 유형의 요소를 `T`로 복사한 후, 이제 `T` 유형의 변수가 생성되어야 하며, 이는 `T`가 `Drop` 트레이트를 구현해야 함을 의미합니다. 따라서 함수가 올바르게 작동하려면 `Drop`와 `Copy` 트레이트 모두를 구현해야 합니다. `smallest_element` 함수를 업데이트한 후, 결과 코드는 다음과 같을 것입니다:
zh_cn: 当对`list`进行索引时，其结果是对被索引的元素进行快照，除非`@T`实现了`PartialOrd`，否则我们需要使用 `*` 对元素进行解快照。`*` 操作需要从`@T`复制到`T`，这意味着`T`需要实现`Copy`特性。在复制了一个`@T`类型的元素到`T`之后，现在有`T`类型的变量需要被删除，这就要求`T`也要实现`Drop`特性。然后我们必须同时添加`Drop`和`Copy`特性的实现，以使该函数正确。在更新`smallest_element`函数后，产生的代码将是：

source: Anonymous Generic Implementation Parameter (`+` operator)
ko: 익명 일반 구현 매개변수 (`+` 연산자)

source: Until now, we have always specified a name for each implementation of the required generic trait: `TPartialOrd` for `PartialOrd<T>`, `TDrop` for `Drop<T>`, and `TCopy` for `Copy<T>`.
ko: 지금까지, 우리는 필요한 일반적 특성의 각 구현에 대해 항상 이름을 지정해 왔습니다: `PartialOrd<T>`에 대한 `TPartialOrd`, `Drop<T>`에 대한 `TDrop`, 그리고 `Copy<T>`에 대한 `TCopy`.

source: However, most of the time, we don't use the implementation in the function body; we only use it as a constraint. In these cases, we can use the `+` operator to specify that the generic type must implement a trait without naming the implementation. This is referred to as an _anonymous generic implementation parameter_.
ko: 그러나 대부분의 경우, 우리는 함수 본문에서 구현을 사용하지 않습니다; 우리는 그것을 제약 조건으로만 사용합니다. 이러한 경우에는 제네릭 타입이 특성을 구현해야 한다는 것을 명시하기 위해 `+` 연산자를 사용할 수 있습니다. 이를 _익명 제네릭 구현 매개변수_ 라고 합니다.

source: For example, `+PartialOrd<T>` is equivalent to `impl TPartialOrd: PartialOrd<T>`.
ko: 예를 들어, `+PartialOrd<T>`은 `impl TPartialOrd: PartialOrd<T>`과 동등합니다.

source: We can rewrite the `smallest_element` function signature as follows:
ko: 우리는 `smallest_element` 함수 서명을 다음과 같이 다시 작성할 수 있습니다:

source: Structs
ko: 구조체

source: We can also define structs to use a generic type parameter for one or more fields using the `<>` syntax, similar to function definitions. First we declare the name of the type parameter inside the angle brackets just after the name of the struct. Then we use the generic type in the struct definition where we would otherwise specify concrete data types. The next code example shows the definition `Wallet<T>` which has a `balance` field of type `T`.
es: También podemos definir estructuras que usen un parámetro de tipo genérico para uno o más campos usando la sintaxis `<>`, similar a las definiciones de funciones. Primero declaramos el nombre del parámetro de tipo dentro de los corchetes angulares justo después del nombre de la estructura. Luego usamos el tipo genérico en la definición de la estructura donde de otra manera especificaríamos tipos de datos concretos. El siguiente ejemplo de código muestra la definición de `Wallet<T>` que tiene un campo `balance` de tipo `T`.
id: Kita juga dapat mendefinisikan struct untuk menggunakan parameter tipe generik untuk satu atau lebih bidang menggunakan sintaks `<>`, mirip dengan definisi fungsi. Pertama, kita mendeklarasikan nama parameter tipe di dalam tanda kurung sudut tepat setelah nama struct. Kemudian kita menggunakan tipe generik dalam definisi struct di tempat kita seharusnya menentukan tipe data konkret. Contoh kode berikut menunjukkan definisi `Wallet<T>` yang memiliki bidang `balance` bertipe `T`.
ko: 우리는 또한 `<>` 구문을 사용하여 하나 이상의 필드에 대한 일반 유형 매개변수를 사용하도록 구조체를 정의할 수 있습니다. 이는 함수 정의와 유사합니다. 먼저 우리는 구조체의 이름 바로 뒤에 꺾쇠 괄호 내에 유형 매개변수의 이름을 선언합니다. 그런 다음 우리는 일반 유형을 사용하여 구조체 정의를 하며, 그 곳에 구체적인 데이터 유형을 지정했던 자리에 일반 유형을 사용합니다. 다음 코드 예제는 `Wallet<T>`라는 정의를 보여줍니다. 이 정의는 `balance` 필드가 `T` 유형임을 가지고 있습니다.
zh_cn: 我们也可以使用类似于函数定义的`<>` 语法来定义结构，它包含一个或多个泛型参数类型字段。首先，必须在结构体名称后面的尖括号中声明泛型参数的名称，接着在结构体定义中可以指定具体数据类型的位置使用泛型类型。下一个代码示例显示了 `Wallet<T>` 的定义，它有一个 `balance`字段，类型为 `T`。

source: The above code derives the `Drop` trait for the `Wallet` type automatically. It is equivalent to writing the following code:
es: El código anterior deriva el trait `Drop` para el tipo `Wallet` automáticamente. Es equivalente a escribir el siguiente código:
id: Kode di atas menghasilkan trait `Drop` untuk tipe `Wallet` secara otomatis. Ini setara dengan menulis kode berikut:
ko: 위의 코드는 `Wallet` 타입에 대한 `Drop` 트레이트를 자동으로 파생합니다. 다음 코드를 작성하는 것과 동일합니다:
zh_cn: 上述代码自动为`Wallet`类型派生`Drop` trait。这效果等同于手动编写以下代码：

source: We avoid using the `derive` macro for `Drop` implementation of `Wallet` and instead define our own `WalletDrop` implementation. Notice that we must define, just like functions, an additional generic type for `WalletDrop` saying that `T` implements the `Drop` trait as well. We are basically saying that the struct `Wallet<T>` is droppable as long as `T` is also droppable.
es: Evitamos el uso de la macro `derive` para la implementación de `Drop` de `Wallet` y en su lugar definimos nuestra propia implementación de `WalletDrop`. Nótese que debemos definir, al igual que en las funciones, un tipo genérico adicional para `WalletDrop` diciendo que `T` también implementa el trait `Drop`. Básicamente estamos diciendo que la estructura `Wallet<T>` es dropeable siempre y cuando `T` también lo sea.
id: Kami menghindari menggunakan makro `derive` untuk implementasi `Drop` dari `Wallet` dan sebaliknya mendefinisikan implementasi `WalletDrop` kami sendiri. Perhatikan bahwa kita harus mendefinisikan, sama seperti fungsi, tipe generik tambahan untuk `WalletDrop` yang menyatakan bahwa `T` juga mengimplementasikan trait `Drop`. Pada dasarnya, kami mengatakan bahwa struct `Wallet<T>` dapat dihapus selama `T` juga dapat dihapus.
ko: `Wallet`의 `Drop` 구현에 `derive` 매크로를 사용하지 않고 대신 우리만의 `WalletDrop` 구현을 정의합니다. 함수와 마찬가지로 `WalletDrop`에 대한 추가적인 제네릭 타입을 정의해야 함을 주목하세요. 이는 `T`가 `Drop` 트레이트를 구현해야 한다는 것을 말합니다. 기본적으로 `Wallet<T>` 구조체가 `T`도 삭제 가능한 경우에만 삭제 가능하다고 말하는 것입니다.
zh_cn: 应该避免使用`derive`宏来实现`Wallet`的`Drop`，而是定义我们自己的`WalletDrop`实现。注意，我们必须像定义函数一样，为`WalletDrop`定义一个额外的泛型`T`并且也实现了`Drop`特性。这基本上是在说，只要`T`也是可丢弃的，那么`钱包<T>`这个结构就是可丢弃的。

source: Finally, if we want to add a field to `Wallet` representing its address and we want that field to be different than `T` but generic as well, we can simply add another generic type between the `<>`:
es: Finalmente, si queremos añadir un campo a `Wallet` que represente su dirección y queremos que ese campo sea diferente de `T` pero genérico también, podemos simplemente añadir otro tipo genérico entre el `<>`:
id: Terakhir, jika kita ingin menambahkan bidang ke `Wallet` yang mewakili alamatnya dan kita ingin bidang tersebut berbeda dari `T` tetapi juga generik, kita hanya perlu menambahkan tipe generik lain di antara `<>`:
ko: 마지막으로, `Wallet`에 주소를 나타내는 필드를 추가하고 그 필드를 `T`와 다르게 하고 싶지만 제네릭하게 유지하고 싶다면, `< >` 사이에 또 다른 제네릭 타입을 간단히 추가할 수 있습니다:
zh_cn: 最后，如果我们想给`Wallet`添加一个代表其Cairo地址的字段，并且我们希望这个字段是与`T`不同的另一个泛型，我们可以简单地通过在`<>`之间添加另一个泛型来实现：

source: We add to `Wallet` struct definition a new generic type `U` and then assign this type to the new field member `address`. Notice that the derive attribute for the `Drop` trait works for `U` as well.
es: Añadimos a la definición de la estructura `Wallet` un nuevo tipo genérico `U` y asignamos este tipo al nuevo campo miembro `address`. Observa que el atributo derive del rasgo `Drop` también funciona para `U`.
id: Kita menambahkan ke definisi struct `Wallet` tipe generik baru `U` dan kemudian menetapkan tipe ini ke anggota bidang baru `address`. Perhatikan bahwa atribut `derive` untuk trait `Drop` juga berfungsi untuk `U`.
ko: `Wallet` 구조체 정의에 새로운 제네릭 타입 `U`를 추가하고 이 타입을 새로운 필드 멤버 `address`에 할당합니다. `Drop` 트레이트에 대한 derive 속성이 `U`에도 작동한다는 점에 유의하세요.
zh_cn: 我们在`Wallet`结构定义中添加一个新的泛型`U`，然后将这个类型分配给新的字段成员`address`。 注意派生属性的 `Drop`的trait在新的泛型 `U `上同样起作用。

source: As we did with structs, we can define enums to hold generic data types in their variants. For example the `Option<T>` enum provided by the Cairo core library:
es: Como hicimos con las estructuras, podemos definir enumeraciones para contener tipos de datos genéricos en sus variantes. Por ejemplo, la enumeración `Option<T>` proporcionada por la biblioteca central de Cairo:
id: Seperti yang kita lakukan dengan struct, kita dapat mendefinisikan enums untuk menyimpan tipe data generik dalam variasi mereka. Sebagai contoh, enum `Option<T>` yang disediakan oleh perpustakaan inti Cairo:
ko: 우리는 구조체와 마찬가지로 열거형을 정의하여 변형에 일반 데이터 유형을 보유할 수 있습니다. 예를 들어, 카이로 코어 라이브러리에서 제공하는 `Option<T>` 열거형:
zh_cn: 和结构体类似，枚举也可以在成员中存放泛型数据类型。例如，Cairo核心库提供的`Option<T>`枚举：

source: The `Option<T>` enum is generic over a type `T` and has two variants: `Some`, which holds one value of type `T` and `None` that doesn't hold any value. By using the `Option<T>` enum, it is possible for us to express the abstract concept of an optional value and because the value has a generic type `T` we can use this abstraction with any type.
es: El enum `Option<T>` es genérico sobre un tipo `T` y tiene dos variantes: `Some`, que contiene un valor de tipo `T`, y `None`, que no contiene ningún valor. Al utilizar el enum `Option<T>`, es posible expresar el concepto abstracto de un valor opcional y debido a que el valor tiene un tipo genérico `T`, podemos utilizar esta abstracción con cualquier tipo.
id: Enum `Option<T>` adalah generic terhadap tipe `T` dan memiliki dua variasi: `Some`, yang menyimpan satu nilai tipe `T`, dan `None` yang tidak menyimpan nilai apa pun. Dengan menggunakan enum `Option<T>`, kita dapat menyatakan konsep abstrak dari nilai opsional dan karena nilai memiliki tipe generik `T`, kita dapat menggunakan abstraksi ini dengan tipe apa pun.
ko: `Option<T>` 열거형은 타입 `T`에 대해 제네릭하며 `Some`과 `None` 두 가지 변형을 가지고 있습니다. `Some`은 타입 `T`의 값을 하나 보유하고 있고 `None`은 어떤 값도 보유하지 않습니다. `Option<T>` 열거형을 사용함으로써 선택적인 값의 추상적 개념을 표현할 수 있으며 값이 제네릭 타입 `T`를 가지고 있기 때문에 이 추상화를 어떤 타입에도 사용할 수 있습니다.
zh_cn: 如你所见 `Option<T>` 是一个拥有泛型 `T` 的枚举，它有两个成员：`Some`，它存放了一个类型 `T` 的值，和不存在任何值的`None`。通过 `Option<T>` 枚举可以表达有一个可能的值的抽象概念，同时因为 `Option<T>` 是泛型的，无论这个可能的值是什么类型都可以使用这个抽象。

source: Enums can use multiple generic types as well, like definition of the `Result<T, E>` enum that the core library provides:
es: Los Enums también pueden utilizar múltiples tipos genéricos, como la definición del enum `Result<T, E>` que proporciona la biblioteca estándar:
id: Enums juga dapat menggunakan beberapa tipe generik, seperti definisi enum `Result<T, E>` yang disediakan oleh perpustakaan inti:
ko: 열거형은 `Result<T, E>`와 같이 여러 개의 제네릭 타입을 사용할 수도 있습니다. 이는 코어 라이브러리에서 제공하는 열거형의 정의입니다.
zh_cn: 枚举也可以拥有多个泛型类型，比如核心库提供的`Result<T, E>`枚举的定义：

source: The `Result<T, E>` enum has two generic types, `T` and `E`, and two variants: `Ok` which holds the value of type `T` and `Err` which holds the value of type `E`. This definition makes it convenient to use the `Result` enum anywhere we have an operation that might succeed (by returning a value of type `T`) or fail (by returning a value of type `E`).
es: El enum `Result<T, E>` tiene dos tipos genéricos, `T` y `E`, y dos variantes: `Ok` que tiene el valor de tipo `T` y `Err` que tiene el valor de tipo `E`. Esta definición hace que sea conveniente usar el enum `Result` en cualquier lugar donde tengamos una operación que pueda tener éxito (devolviendo un valor de tipo `T`) o fallar (devolviendo un valor de tipo `E`).
id: Enum `Result<T, E>` memiliki dua tipe generik, `T` dan `E`, dan dua variasi: `Ok` yang menyimpan nilai tipe `T` dan `Err` yang menyimpan nilai tipe `E`. Definisi ini membuatnya nyaman untuk menggunakan enum `Result` di mana pun kita memiliki operasi yang mungkin berhasil (dengan mengembalikan nilai tipe `T`) atau gagal (dengan mengembalikan nilai tipe `E`).
ko: `Result<T, E>` 열거형은 두 개의 제네릭 타입인 `T`와 `E`를 가지며, `Ok`와 `Err` 두 가지 변형이 있습니다. `Ok`는 `T` 타입의 값을 보유하고, `Err`은 `E` 타입의 값을 보유합니다. 이 정의는 성공할 수도 있고(타입 `T`의 값을 반환함으로써), 실패할 수도 있는(타입 `E`의 값을 반환함으로써) 작업이 있는 곳에서 `Result` 열거형을 편리하게 사용할 수 있게 합니다.
zh_cn: `Result<T, E>`枚举有两个泛型类型，`T`和`E`，以及两个成员：`Ok`，存放`T`类型的值，`Err`，存放`E`类型的值。这个定义使得我们可以在任何地方使用`Result`枚举，该操作可能成功（返回`T`类型的值）或失败（返回`E`类型的值）。

source: Generic Methods
id: Metode Generic
ko: 일반 메소드

source: We can implement methods on structs and enums, and use the generic types in their definition, too. Using our previous definition of `Wallet<T>` struct, we define a `balance` method for it:
es: También podemos implementar métodos en structs y enums, y usar los tipos genéricos en su definición. Utilizando nuestra definición anterior de la struct `Wallet<T>`, definimos un método `balance` para ella:
id: Kita dapat mengimplementasikan metode pada struct dan enums, dan juga menggunakan tipe generik dalam definisinya. Dengan menggunakan definisi sebelumnya dari struct `Wallet<T>`, kita mendefinisikan metode `balance` untuknya:
ko: 우리는 구조체와 열거형에 메서드를 구현하고, 그 정의에 일반 타입을 사용할 수도 있습니다. 이전에 정의한 `Wallet<T>` 구조체를 사용하여, 해당 구조체에 `balance` 메서드를 정의합니다:
zh_cn: 我们可以在结构和枚举上实现方法，也可以在其定义中使用泛型。在之前定义的`Wallet<T>`结构体上为其定义一个`balance` 方法：

source: We first define `WalletTrait<T>` trait using a generic type `T` which defines a method that returns a snapshot of the field `balance` from `Wallet`. Then we give an implementation for the trait in `WalletImpl<T>`. Note that you need to include a generic type in both definitions of the trait and the implementation.
ko: 먼저, `WalletTrait<T>` 트레이트를 정의합니다. 이 트레이트는 제네릭 타입 `T`를 사용하여 `Wallet`에서 `balance` 필드의 스냅샷을 반환하는 메소드를 정의합니다. 그런 다음, 이 트레이트에 대한 구현을 `WalletImpl<T>`에서 제공합니다. 트레이트와 구현의 모두에 제네릭 타입을 포함해야 함에 유의하세요.
zh_cn: 我们首先定义了`WalletTrait<T>`trait，使用一个泛型`T`，它定义了一个方法，从`Wallet`中返回字段`balance`的快照。然后我们在`WalletImpl<T>`中给出该trait的实现。请注意，你需要在trait的定义和实现中都包含一个泛型。

source: We can also specify constraints on generic types when defining methods on the type. We could, for example, implement methods only for `Wallet<u128>` instances rather than `Wallet<T>`. In the code example we define an implementation for wallets which have a concrete type of `u128` for the `balance` field.
es: También podemos especificar restricciones en los tipos genéricos al definir métodos en la clase. Por ejemplo, podríamos implementar métodos solo para instancias de `Wallet<u128>` en lugar de `Wallet<T>`. En el ejemplo de código, definimos una implementación para carteras que tienen un tipo concreto de `u128` para el campo `balance`.
id: Kita juga dapat menentukan batasan pada tipe generik saat mendefinisikan metode pada tipe tersebut. Sebagai contoh, kita bisa mengimplementasikan metode hanya untuk instans `Wallet<u128>` daripada `Wallet<T>`. Pada contoh kode, kita mendefinisikan implementasi untuk dompet yang memiliki tipe konkret `u128` untuk bidang `balance`.
ko: 우리는 또한 유형에 대한 메소드를 정의할 때 일반 유형에 대한 제약 조건을 지정할 수 있습니다. 예를 들어, `Wallet<T>` 대신 `Wallet<u128>` 인스턴스에 대해서만 메소드를 구현할 수 있습니다. 코드 예제에서는 `balance` 필드의 구체적인 유형이 `u128`인 지갑에 대한 구현을 정의합니다.
zh_cn: 在定义类型上的方法时，我们也可以指定对泛型的约束。例如，我们可以只为`Wallet<u128>`实例而不是`Wallet<T>`实现方法。在代码示例中，我们为钱包定义了一个实现，这些钱包的`balance`字段的具体类型为`u128`。

source: /// Generic trait for wallets
ko: 지갑에 대한 일반적인 특성

source: /// Trait for wallets of type u128
ko: /// u128 유형의 지갑에 대한 특성

source: The new method `receive` increments the size of the balance of any instance of a `Wallet<u128>`. Notice that we changed the `main` function making `w` a mutable variable in order for it to be able to update its balance. If we were to change the initialization of `w` by changing the type of `balance` the previous code wouldn't compile.
es: El nuevo método `receive` incrementa el tamaño del saldo de cualquier instancia de una `Wallet<u128>`. Observe que se cambió la función `main` haciendo que `w` sea una variable mutable para que pueda actualizar su saldo. Si cambiáramos la inicialización de `w` cambiando el tipo de `balance`, el código anterior no se compilaría.
id: Metode baru `receive` menambahkan ukuran saldo dari setiap instans `Wallet<u128>`. Perhatikan bahwa kita mengubah fungsi `main` dengan membuat variabel `w` menjadi mutable agar dapat memperbarui saldonya. Jika kita mengubah inisialisasi `w` dengan mengubah tipe `balance`, kode sebelumnya tidak akan dapat dikompilasi.
ko: 새로운 `receive` 메서드는 `Wallet<u128>`의 인스턴스의 잔액 크기를 증가시킵니다. `main` 함수를 변경하여 `w`를 변경 가능한 변수로 만들어야만 잔액을 업데이트할 수 있습니다. `w`의 초기화를 변경하여 `balance`의 유형을 변경하면 이전 코드가 컴파일되지 않을 것입니다.
zh_cn: 新的方法`receive`增加了`Wallet<u128>`的实例的余额大小。请注意，我们改变了`main`函数，使`w`成为一个可变的变量，以便它能够更新其余额。如果我们通过改变`balance`的类型来改变`w`的初始化，那么之前的代码就不能编译了。

source: Cairo allows us to define generic methods inside generic traits as well. Using the past implementation from `Wallet<U, V>` we are going to define a trait that picks two wallets of different generic types and create a new one with a generic type of each. First, let's rewrite the struct definition:
es: Cairo nos permite definir métodos genéricos dentro de traits genéricos también. Usando la implementación previa de `Wallet<U, V>`, vamos a definir un trait que tome dos wallets de diferentes tipos genéricos y cree uno nuevo con un tipo genérico de cada uno. Primero, reescribamos la definición de la estructura:
id: Cairo memungkinkan kita untuk mendefinisikan metode generik di dalam trait generik juga. Dengan menggunakan implementasi sebelumnya dari `Wallet<U, V>`, kita akan mendefinisikan sebuah trait yang memilih dua dompet dengan tipe generik yang berbeda dan membuat yang baru dengan tipe generik dari masing-masing. Pertama, mari kita tulis kembali definisi struct:
ko: 카이로는 일반적인 트레이트 내에서 일반적인 메소드를 정의할 수 있게 해줍니다. `Wallet<U, V>`의 이전 구현을 사용하여 서로 다른 일반 타입의 두 지갑을 선택하고 각각의 일반 타입으로 새로운 지갑을 생성하는 트레이트를 정의할 것입니다. 먼저, 구조체 정의를 다시 작성해 봅시다.
zh_cn: Cairo也允许我们在泛型trait中定义泛型方法。在之前的 `Wallet<U, V>`的实现上定义一个trait，用来选取两个不同泛型的钱包，并创建一个拥有两者泛型新的钱包。首先，让我们重写结构体定义：

source: Next we are going to naively define the mixup trait and implementation:
es: A continuación vamos a definir ingenuamente el rasgo mixup y su implementación:
id: Selanjutnya, kita akan dengan naif mendefinisikan trait dan implementasi untuk mixup:
ko: 다음에는 혼동 특성과 구현을 순진하게 정의할 것입니다.
zh_cn: 接下来，我们将初步地定义混合trait和其实现：

source: // This does not compile!
ko: 이것은 컴파일되지 않습니다!
