Repository: cairo-book/cairo-book
Catalog: po/*.po
Languages: es, id, ko, zh_cn

source: | Operator | Example | Explanation | Overloadable? | |----------|---------|-------------|---------------| | `!` | `!expr` | Bitwise or logical complement | `Not` | | `!=` | `expr != expr` | Non-equality comparison | `PartialEq` | | `%` | `expr % expr` | Arithmetic remainder | `Rem` | | `%=` | `var %= expr` | Arithmetic remainder and assignment | `RemEq` | | `&` | `expr & expr` | Bitwise AND | `BitAnd` | | `*` | `expr * expr` | Arithmetic multiplication | `Mul` | | `*=` | `var *= expr` | Arithmetic multiplication and assignment | `MulEq` | | `@` | `@var` | Snapshot | | | `*` | `*var` | Desnap | | | `+` | `expr + expr` | Arithmetic addition | `Add` | | `+=` | `var += expr` | Arithmetic addition and assignment | `AddEq` | | `,` | `expr, expr` | Argument and element separator | | | `-` | `-expr` | Arithmetic negation | `Neg` | | `-` | `expr - expr` | Arithmetic subtraction | `Sub` | | `-=` | `var -= expr` | Arithmetic subtraction and assignment | `SubEq` | | `->` | `fn(...) -> type`, <code>&vert;...&vert; -> type</code> | Function and closure return type | | | `.` | `expr.ident` | Member access | | | `/` | `expr / expr` | Arithmetic division | `Div` | | `/=` | `var /= expr` | Arithmetic division and assignment | `DivEq` | | `:` | `pat: type`, `ident: type` | Constraints | | | `:` | `ident: expr` | Struct field initializer | | | `;` | `expr;` | Statement and item terminator | | | `<` | `expr < expr` | Less than comparison | `PartialOrd` | | `<=` | `expr <= expr` | Less than or equal to comparison | `PartialOrd` | | `=` | `var = expr` | Assignment | | | `==` | `expr == expr` | Equality comparison | `PartialEq` | | `=>` | `pat => expr` | Part of match arm syntax | | | `>` | `expr > expr` | Greater than comparison | `PartialOrd` | | `>=` | `expr >= expr` | Greater than or equal to comparison | `PartialOrd` | | `^` | `expr ^ expr` | Bitwise exclusive OR | `BitXor` | | <code>&vert;</code> | <code>expr &vert; expr</code> | Bitwise OR | `BitOr` |
es: | Operador | Ejemplo | Explicación | ¿Sobrecargable? | |----------|---------|-------------|---------------| | `!` | `!expr` | Complemento lógico o de bits | `Not` | | `!=` | `expr != expr` | Comparación de no igualdad | `PartialEq` | | `%` | `expr % expr` | Resto aritmético | `Rem` | | `%=` | `var %= expr` | Resto aritmético y asignación | `RemEq` | | `&` | `expr & expr` | AND de bits | `BitAnd` | | `*` | `expr * expr` | Multiplicación aritmética | `Mul` | | `*=` | `var *= expr` | Multiplicación aritmética y asignación | `MulEq` | | `@` | `@var` | Snapshot | | | `*` | `*var` | Desnap | | | `+` | `expr + expr` | Suma aritmética | `Add` | | `+=` | `var += expr` | Suma aritmética y asignación | `AddEq` | | `,` | `expr, expr` | Separador de argumentos y elementos | | | `-` | `-expr` | Negación aritmética | `Neg` | | `-` | `expr - expr` | Resta aritmética | `Sub` | | `-=` | `var -= expr` | Resta aritmética y asignación | `SubEq` | | `->` | `fn(...) -> type`, <code>|...| -> type</code> | Tipo de retorno de función y clausura | | | `.` | `expr.ident` | Acceso a miembro | | | `/` | `expr / expr` | División aritmética | `Div` | | `/=` | `var /= expr` | División aritmética y asignación | `DivEq` | | `:` | `pat: type`, `ident: type` | Restricciones | | | `:` | `ident: expr` | Inicializador de campo de estructura | | | `;` | `expr;` | Terminador de declaración e ítem | | | `<` | `expr < expr` | Comparación menor que | `PartialOrd` | | `<=` | `expr <= expr` | Comparación menor o igual que | `PartialOrd` | | `=` | `var = expr` | Asignación | | | `==` | `expr == expr` | Comparación de igualdad | `PartialEq` | | `=>` | `pat => expr` | Parte de la sintaxis de brazo de coincidencia | | | `>` | `expr > expr` | Comparación mayor que | `PartialOrd` | | `>=` | `expr >= expr` | Comparación mayor o igual que | `PartialOrd` | | `^` | `expr ^ expr` | OR exclusivo de bits | `BitXor` | | <code>|</code> | <code>expr | expr</code> | OR de bits | `BitOr` |

source: When moving out of scope, variables need to be moved first. This is where the `Drop` trait intervenes. You can find more details about its usage [here](ch03-01-what-is-ownership.md#the-drop-trait).
es: Cuando se mueve fuera del ámbito, las variables necesitan ser movidas primero. Aquí es donde interviene el rasgo `Drop`. Puedes encontrar más detalles sobre su uso [aquí](ch03-01-what-is-ownership.md#the-drop-trait).

source: Moreover Dictionary need to be squashed before going out of scope. Calling manually the `squash` method on each of them can be quickly redundant. `Destruct` trait allows Dictionaries to be automatically squashed when they get out of scope. You can also find more information about `Destruct` [here](ch03-01-what-is-ownership.md#the-destruct-trait).
es: Además, los Diccionarios deben ser aplastados antes de salir del ámbito. Llamar manualmente al método `squash` en cada uno de ellos puede ser rápidamente redundante. El trait `Destruct` permite que los Diccionarios sean aplastados automáticamente cuando salen del ámbito. Puedes encontrar más información sobre `Destruct` [aquí](ch03-01-what-is-ownership.md#the-destruct-trait).

source: TODO (Not derivable yet ?)
es: TODO (¿Todavía no derivable?)

source: ### Automatic Formatting with `cairo-format`
es: ### Formateo automático con `cairo-format`

source: The `cairo-format` tool reformats your code according to the community code style. Many collaborative projects use `cairo-format` to prevent arguments about which style to use when writing Cairo: everyone formats their code using the tool.
es: La herramienta `cairo-format` reformatea tu código de acuerdo con el estilo de código de la comunidad. Muchos proyectos colaborativos usan `cairo-format` para evitar discusiones sobre qué estilo usar al escribir Cairo: todo el mundo formatea su código usando la herramienta.

source: Running this command reformats all the Cairo code in the current directory, recursively. This should only change the code style, not the code semantics.
es: Ejecutando este comando reformateará todo el código de Cairo en el directorio actual de forma recursiva. Esto solo cambiará el estilo de código, no la semántica del código.

source: Visit the `vscode-cairo` [page][vscode-cairo]<!-- ignore --> for installation instructions, You will gain abilities such as autocompletion, jump to definition, and inline errors.
es: Visite la página `vscode-cairo` [page][vscode-cairo]<!-- ignore --> para obtener instrucciones de instalación, Usted ganará habilidades tales como autocompletado, saltar a y errores en línea.

source: ## Appendix E - Most Common Types and Traits Required To Write Contracts
es: ## Apéndice E - Tipos y Traits Más Comunes Necesarios para Escribir Contratos

source: This appendix provides a reference for common types and traits used in contract development, along with their corresponding imports, paths, and usage examples.
es: Este apéndice proporciona una referencia para los tipos y traits comunes utilizados en el desarrollo de contratos, junto con sus correspondientes importaciones, rutas y ejemplos de uso.

source: | Import | Path | Usage | | ------------------------- | ----------------------------------------------------- | -------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------- | | `OptionTrait` | `std::option::OptionTrait` | `OptionTrait<T>` defines a set of methods required to manipulate optional value. | | `ResultTrait` | `std::result::ResultTrait` | `ResultTrait<T, E>` Type for Starknet contract address, a value in the range [0, 2 \*\* 251). | | `ContractAddress` | `starknet::ContractAddress` | `ContractAddress` is a type to represent the smart contract address | | `ContractAddressZeroable` | `starknet::contract_address::ContractAddressZeroable` | `ContractAddressZeroable` is the implementation of the trait `Zeroable` for the `ContractAddress` type. It is required to check whether a value of `t:ContractAddress` is zero or not. | | `contract_address_const` | `starknet::contract_address_const` | The `contract_address_const!` it's a function that allows instantiating constant contract address values. | | `Into` | `traits::Into;` | `Into<T>` is a trait used for conversion between types. If there is an implementation of Into<T,S> for the types T and S, you can convert T into S. | | `TryInto` | `traits::TryInto;` | `TryInto<T>` is a trait used for conversion between types.If there is an implementation of TryInto<T,S> for the types T and S, you can convert T into S. | | `get_caller_address` | `starknet::get_caller_address` | `get_caller_address()` is a function that returns the address of the caller of the contract. It can be used to identify the caller of a contract function. | | `get_contract_address` | `starknet::info::get_contract_address` | `get_contract_address()` is a function that returns the address of the current contract. It can be used to obtain the address of the contract being executed. |
es: | Import | Path | Uso | | ------------------------- | ----------------------------------------------------- | -------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------- | | `OptionTrait` | `std::option::OptionTrait` | `OptionTrait<T>` define un conjunto de métodos necesarios para manipular un valor opcional. | | `ResultTrait` | `std::result::ResultTrait` | `ResultTrait<T, E>` es un tipo para la dirección de contrato Starknet, un valor en el rango [0, 2 \*\* 251). | | `ContractAddress` | `starknet::ContractAddress` | `ContractAddress` es un tipo que representa la dirección del contrato inteligente. | | `ContractAddressZeroable` | `starknet::contract_address::ContractAddressZeroable` | `ContractAddressZeroable` es la implementación del trait `Zeroable` para el tipo `ContractAddress`. Se utiliza para verificar si un valor de `t:ContractAddress` es cero o no. | | `contract_address_const` | `starknet::contract_address_const` | `contract_address_const!` es una función que permite instanciar valores de dirección de contrato constantes. | | `Into` | `traits::Into;` | `Into<T>` es un trait utilizado para la conversión entre tipos. Si hay una implementación de Into<T,S> para los tipos T y S, puedes convertir T en S. | | `TryInto` | `traits::TryInto;` | `TryInto<T>` es un rasgo utilizado para la conversión entre tipos. Si hay una implementación de TryInto<T,S> para los tipos T y S, puedes convertir T en S. | | `get_caller_address` | `starknet::get_caller_address` | `get_caller_address()` es una función que devuelve la dirección del llamante del contrato. Se puede usar para identificar al llamante de una función del contrato. | | `get_contract_address` | `starknet::info::get_contract_address` | `get_contract_address()` es una función que devuelve la dirección del contrato actual. Se puede usar para obtener la dirección del contrato que se está ejecutando. |
