Repository: cairo-book/cairo-book
Catalog: po/*.po
Languages: es, id, ko, zh_cn

source: Static analysis refers to the process of examining code without its execution, focusing on its structure, syntax, and properties. It involves analyzing the source code to identify potential issues, vulnerabilities, or violations of specified rules.
es: El análisis estático se refiere al proceso de examinar el código sin su ejecución, centrándose en su estructura, sintaxis y propiedades. Consiste en analizar el código fuente para identificar posibles problemas, vulnerabilidades o infracciones de normas específicas.
id: Analisis statis mengacu pada proses pemeriksaan kode tanpa eksekusinya, fokus pada struktur, sintaksis, dan propertinya. Ini melibatkan analisis kode sumber untuk mengidentifikasi masalah potensial, kerentanan, atau pelanggaran aturan yang ditentukan.
ko: 정적 분석은 코드를 실행하지 않고 구조, 구문 및 속성에 중점을 두고 검사하는 과정을 의미합니다. 소스 코드를 분석하여 잠재적인 문제, 취약점 또는 지정된 규칙의 위반을 식별하는 것을 포함합니다.
zh_cn: 静态分析指的是在不执行代码的情况下对其进行检查的过程，重点关注其结构、语法和属性。它涉及到分析源代码，以识别潜在的问题、漏洞或违反特定规则的行为。

source: By defining rules, such as coding conventions or security guidelines, developers can utilize static analysis tools to automatically check the code against these standards.
es: Mediante la definición de normas, como convenciones de codificación o directrices de seguridad, los desarrolladores pueden utilizar herramientas de análisis estático para comprobar automáticamente el código con respecto a estas normas.
id: Dengan mendefinisikan aturan, seperti konvensi penulisan kode atau pedoman keamanan, para pengembang dapat menggunakan alat analisis statis untuk secara otomatis memeriksa kode berdasarkan standar tersebut.
ko: 규칙을 정의함으로써 코딩 규칙이나 보안 지침과 같은 것들을 개발자들은 정적 분석 도구를 활용하여 코드를 이러한 표준에 자동으로 확인할 수 있습니다.
zh_cn: 通过定义规则，例如编码规范或安全指南，开发人员可以使用静态分析工具自动检查代码是否符合这些标准。

source: Reference:
es: Referencias:
ko: 참조:
zh_cn: 参考文献：

source: [Semgrep Cairo 1.0 support](https://semgrep.dev/blog/2023/semgrep-now-supports-cairo-1-0)
ko: [Semgrep Cairo 1.0 지원](https://semgrep.dev/blog/2023/semgrep-now-supports-cairo-1-0)

source: [Caracal, a Starknet static analyzer](https://github.com/crytic/caracal)
ko: [Caracal, 스타크넷 정적 분석기](https://github.com/crytic/caracal)

source: The following sections contain reference material you may find useful in your Cairo journey.
id: Bagian-bagian berikut berisi materi referensi yang mungkin berguna dalam perjalanan Anda dengan Cairo.
ko: 다음 섹션에는 카이로 여행에서 유용하게 활용할 수 있는 참고 자료가 포함되어 있습니다.

source: Appendix A: Keywords
ko: 부록 A: 키워드

source: The following list contains keywords that are reserved for current or future use by the Cairo language.
id: Daftar berikut berisi kata kunci yang dicadangkan untuk penggunaan saat ini atau di masa depan oleh bahasa Cairo.
ko: 다음 목록에는 카이로 언어에서 현재 또는 미래에 사용할 예약어가 포함되어 있습니다.

source: There are two keyword categories:
es: Hay dos categorías de (Keyword) palabras clave:
id: Ada dua kategori kata kunci:
ko: 두 가지 키워드 카테고리가 있습니다.
zh_cn: 有两个关键字类别：

source: strict
ko: 엄격한

source: reserved
ko: 예약된

source: There is a third category, which are functions from the core library. While their names are not reserved, they are not recommended to be used as names of any items to follow good practices.
id: Ada kategori ketiga, yaitu fungsi-fungsi dari pustaka inti. Meskipun namanya tidak dipesan, tidak disarankan untuk digunakan sebagai nama item apa pun untuk mengikuti praktik terbaik.
ko: 세 번째 카테고리는 코어 라이브러리에서 가져온 함수들입니다. 이들의 이름은 예약되어 있지 않지만, 좋은 관행을 따르기 위해 어떤 항목의 이름으로 사용하는 것은 권장되지 않습니다.

source: Strict keywords
ko: 엄격한 키워드

source: These keywords can only be used in their correct contexts. They cannot be used as names of any items.
id: Kata kunci ini hanya dapat digunakan dalam konteks yang benar. Mereka tidak dapat digunakan sebagai nama untuk item apa pun.
ko: 이 키워드들은 올바른 맥락에서만 사용될 수 있습니다. 어떤 항목의 이름으로 사용될 수 없습니다.

source: `as` - Rename import
ko: `as` - import 이름 바꾸기

source: `break` - Exit a loop immediately
ko: `break` - 루프를 즉시 종료합니다

source: `const` - Define constant items
ko: `const` - 상수 항목 정의

source: `continue` - Continue to the next loop iteration
ko: `계속` - 다음 루프 반복으로 이동합니다

source: `else` - Fallback for `if` and `if let` control flow constructs
ko: `else` - `if` 및 `if let` 제어 흐름 구조의 대체 옵션

source: `enum` - Define an enumeration
ko: `enum` - 열거형을 정의합니다.

source: `extern` - Function defined at the compiler level using hint available at cairo1 level with this declaration
ko: `extern` - 이 선언을 사용하여 컴파일러 수준에서 cairo1 레벨 힌트를 사용하여 정의된 함수

source: `false` - Boolean false literal
ko: `false` - 부울 false 리터럴

source: `fn` - Define a function
ko: `fn` - 함수를 정의합니다

source: `if` - Branch based on the result of a conditional expression
ko: `if` - 조건식의 결과에 따라 분기함

source: `impl` - Implement inherent or trait functionality
ko: `impl` - 상속 또는 트레이트 기능 구현

source: `implicits` - Special kind of function parameters that are required to perform certain actions
ko: `implicits` - 특정 작업을 수행하는 데 필요한 특별한 종류의 함수 매개변수

source: `let` - Bind a variable
ko: `let` - 변수를 바인딩합니다.

source: `loop` - Loop unconditionally
ko: `loop` - 무조건 반복하기

source: `match` - Match a value to patterns
ko: `match` - 값과 패턴을 매칭합니다.

source: `mod` - Define a module
ko: `mod` - 모듈을 정의합니다.

source: `mut` - Denote variable mutability
ko: `mut` - 변수의 가변성을 나타냅니다

source: `nopanic` - Functions marked with this notation mean that the function will never panic.
ko: `nopanic` - 이 표기가 있는 함수는 해당 함수가 절대로 패닉하지 않음을 의미합니다.

source: `of` - Implement a trait
ko: `of` - 특성 구현

source: `ref` - Parameter passed implicitly returned at the end of a function
ko: `ref` - 함수 끝에 암시적으로 전달된 매개변수가 반환됩니다.

source: `return` - Return from function
ko: `return` - 함수에서 반환

source: `struct` - Define a structure
ko: `struct` - 구조체를 정의합니다.

source: `trait` - Define a trait
ko: `trait` - 특성 정의

source: `true` - Boolean true literal
ko: `true` - 부울 참 리터럴

source: `type` - Define a type alias
ko: `type` - 타입 별칭을 정의합니다.

source: `use` - Bring symbols into scope
ko: `use` - 심볼을 범위에 포함하기

source: Reserved keywords
ko: 예약어

source: These keywords aren't used yet, but they are reserved for future use. They have the same restrictions as strict keywords. The reasoning behind this is to make current programs forward compatible with future versions of Cairo by forbidding them to use these keywords.
id: Kata kunci-kata kunci ini belum digunakan, tetapi mereka sudah dicadangkan untuk penggunaan di masa depan. Mereka memiliki batasan yang sama dengan kata kunci ketat. Alasan di balik ini adalah untuk membuat program-program saat ini kompatibel ke depan dengan versi-versi masa depan Cairo dengan melarang mereka menggunakan kata kunci-kata kunci ini.
ko: 이 키워드들은 아직 사용되지 않았지만, 미래 사용을 위해 예약되어 있습니다. 이들은 엄격한 키워드와 동일한 제한을 가지고 있습니다. 이것의 이유는 현재 프로그램들이 미래 버전의 Cairo와 호환되도록 하기 위해 이 키워드들을 사용하지 못하도록 금지하는 것입니다.

source: The Cairo programming language provides several specific functions that serve a special purpose. We will not cover all of them in this book, but using the names of these functions as names of other items is not recommended.
es: El lenguaje de programación Cairo proporciona varias funciones específicas que sirven a un propósito especial. No las cubriremos todas en este libro, pero no se recomienda usar los nombres de estas funciones como nombres de otros elementos.
id: Bahasa pemrograman Cairo menyediakan beberapa fungsi khusus yang memiliki tujuan tertentu. Kami tidak akan membahas semuanya dalam buku ini, tetapi penggunaan nama-nama fungsi ini sebagai nama item lain tidak disarankan.
ko: 카이로 프로그래밍 언어는 특정 목적을 위한 여러 가지 특정 기능을 제공합니다. 이 책에서는 모든 기능을 다 다루지는 않겠지만, 이러한 기능들의 이름을 다른 항목의 이름으로 사용하는 것은 권장되지 않습니다.
zh_cn: Cairo编程语言提供了���个具有特殊用途的函数。我们不会在本书中介绍所有这些函数，但不建议使用这些函数的名称作为任何项的标识符。

source: \-`assert` - This function checks a boolean expression, and if it evaluates to false, it triggers the panic function. -`panic` - This function terminates the program.
id: - `assert` - Fungsi ini memeriksa suatu ekspresi boolean, dan jika hasil evaluasinya adalah false, itu memicu fungsi panic. - `panic` - Fungsi ini mengakhiri program.
ko: \- `assert` - 이 함수는 부울 표현식을 확인하고, 그 값이 거짓이면 패닉 함수를 트리거합니다. - `panic` - 이 함수는 프로그램을 종료합니다.

source: Appendix B: Operators and Symbols
id: Lampiran B: Operator dan Simbol
ko: 부록 B: 연산자 및 기호

source: This appendix includes a glossary of Cairo's syntax.
es: Este apéndice incluye un glosario de la sintaxis de Cairo.
id: Lampiran ini mencakup glosarium sintaks Cairo.
ko: 이 부록에는 카이로 구문의 용어 해설이 포함되어 있습니다.
zh_cn: 本附录包含了Cairo语法的词汇表。

source: Operators
ko: 연산자

source: Table B-1 contains the operators in Cairo, an example of how the operator would appear in context, a short explanation, and whether that operator is overloadable. If an operator is overloadable, the relevant trait to use to overload that operator is listed.
es: La Tabla B-1 contiene los operadores en Cairo, un ejemplo de cómo aparecería el operador en contexto, una breve explicación y si el operador es sobrecargable. Si un operador es sobrecargable, se lista el trait relevante a usar para sobrecargar ese operador.
id: Tabel B-1 berisi operator-operator dalam Cairo, contoh bagaimana operator akan muncul dalam konteks, penjelasan singkat, dan apakah operator tersebut dapat di-overload. Jika suatu operator dapat di-overload, trait yang relevan untuk digunakan untuk meng-overload operator tersebut tercantum.
ko: 표 B-1에는 카이로의 연산자, 연산자가 어떻게 문맥에서 나타나는지의 예시, 간단한 설명, 그리고 해당 연산자가 오버로드 가능한지 여부가 포함되어 있습니다. 연산자가 오버로드 가능한 경우, 해당 연산자를 오버로드하는 데 사용할 수 있는 관련 특성이 나열되어 있습니다.
zh_cn: 表B-1包含了开罗的运算符，运算符在上下文中出现的例子和简短的解释，以及该运算符是否可以重载。如果一个运算符是可重载的，则列出了用于重载该运算符的相关特性。

source: Table B-1: Operators
ko: 표 B-1: 연산자

source: Operator
ko: 운영자

source: Explanation
ko: 설명

source: Bitwise AND
ko: 비트 AND

source: Short-circuiting logical AND
ko: 논리 AND의 단락 회로(short-circuiting)

source: Arithmetic multiplication
ko: 산술 곱셈

source: `Mul`
ko: `물`

source: Arithmetic multiplication and assignment
ko: 산술 곱셈 및 할당

source: Snapshot
ko: 스냅샷

source: Desnap
ko: Desnap -> 디스냅

source: Arithmetic addition
ko: 산술 덧셈

source: `Add`
ko: 추가하기

source: `var += expr`
ko: `var += expr` -> `var += expr`

source: Arithmetic addition and assignment
ko: 산술 덧셈 및 할당

source: Argument and element separator
ko: 논거 및 요소 구분자

source: `-expr`
ko: `-expr` translates to `-식` in Korean.

source: Arithmetic negation
ko: 산술 부정

source: `Neg`
ko: 부정

source: Arithmetic subtraction
ko: 산술 뺄셈

source: `Sub`
ko: 서브

source: `var -= expr`
ko: `var -= expr` 는 변수에서 표현식을 빼는 연산자입니다.

source: Arithmetic subtraction and assignment
ko: 산술 뺄셈 및 할당

source: `SubEq`
ko: `SubEq` translates to `서브 동일` in Korean.

source: \|...\| -> type
ko: \|...\| -> 유형

source: Function and closure return type
ko: 기능과 클로저 반환 유형

source: `expr.ident`
ko: `expr.ident` translates to `식별자` in Korean.

source: Member access
ko: 회원 액세스

source: Arithmetic division
id: Pembagian aritmetika
ko: 산술 나눗셈

source: Arithmetic division and assignment
id: Pembagian dan penugasan aritmetika
ko: 산술 나눗셈 및 할당

source: `DivEq`
ko: `DivEq` would be translated to `분배 등호` in Korean.

source: `pat: type`, `ident: type`
ko: `pat: 유형`, `ident: 유형`

source: Constraints
ko: 제약사항

source: `ident: expr`
ko: `식별자: 표현식`

source: Struct field initializer
id: Penginisialisasi bidang struktur
ko: 구조체 필드 초기화자

source: Statement and item terminator
id: Pernyataan dan terminator item
ko: 문장 및 항목 종결자

source: Less than comparison
id: Perbandingan kurang dari
ko: 미만 비교

source: `PartialOrd`
ko: 부분 순서 (Partial Order)

source: Less than or equal to comparison
id: Perbandingan kurang dari atau sama dengan
ko: 작거나 같음 비교

source: Assignment
ko: 과제

source: Equality comparison
id: Perbandingan kesetaraan
ko: 동등 비교

source: Part of match arm syntax
ko: 매치 암 구문의 일부

source: Greater than comparison
id: Perbandingan lebih besar dari
ko: 크기 비교

source: `expr >= expr`
ko: `expr >= expr` would be translated to `expr >= expr` in Korean.

source: Greater than or equal to comparison
id: Perbandingan lebih besar dari atau sama dengan
ko: 크거나 같음 비교

source: Bitwise exclusive OR
ko: 바이트 단위 배타적 OR

source: expr \|\| expr
ko: 표현식 \|\| 표현식

source: Short-circuiting logical OR
ko: 논리 OR의 단락 회로(short-circuiting)

source: expr?
ko: 표현?

source: Error propagation
ko: 오차 전파

source: Non Operator Symbols
ko: 비 운영자 기호

source: The following list contains all symbols that are not used as operators; that is, they do not have the same behavior as a function or method call.
es: La siguiente lista contiene todos los símbolos que no se utilizan como operadores; es decir, no tienen el mismo comportamiento que una llamada a una función o método.
id: Daftar berikut berisi semua simbol yang tidak digunakan sebagai operator; artinya, mereka tidak memiliki perilaku yang sama seperti panggilan fungsi atau metode.
ko: 다음 목록은 연산자로 사용되지 않는 모든 기호를 포함하고 있습니다. 즉, 이들은 함수나 메소드 호출과 같은 동작을 하지 않습니다.
zh_cn: 下面的列表包含了所有不作为运算符使用的符号；也就是说，他们并不像函数调用或方法调用一样表现。

source: Table B-2 shows symbols that appear on their own and are valid in a variety of locations.
es: La Tabla B-2 muestra símbolos que aparecen solos y son válidos en diversas ubicaciones.
id: Tabel B-2 menunjukkan simbol-simbol yang muncul sendiri dan valid dalam berbagai lokasi.
ko: 표 B-2는 독립적으로 나타나며 다양한 위치에서 유효한 기호를 보여줍니다.
zh_cn: 表B-2 展示了以其自身出现以及出现在合法其他各个地方的符号。

source: Table B-2: Stand-Alone Syntax
ko: 표 B-2: 독립 구문

source: Symbol
ko: 상징

source: `..._u8`, `..._usize`, etc.
ko: `..._u8`, `..._usize` 등.

source: Numeric literal of specific type
id: Literal numerik dengan tipe tertentu
ko: 특정 유형의 숫자 리터럴

source: Short string
ko: 짧은 문자열

source: “Ignored” pattern binding; also used to make integer literals readable
id: Pola ikatan "Ignored"; juga digunakan untuk membuat literal bilangan bulat dapat dibaca
ko: "무시된" 패턴 바인딩; 또한 정수 리터럴을 읽기 쉽게 만드는 데 사용됩니다.

source: Table B-3 shows symbols that are used within the context of a module hierarchy path to access an item.
es: La Tabla B-3 muestra los símbolos que se utilizan en el contexto de una ruta de jerarquía de módulos para acceder a un elemento.
id: Tabel B-3 menunjukkan simbol-simbol yang digunakan dalam konteks jalur hierarki modul untuk mengakses suatu item.
ko: 표 B-3은 모듈 계층 구조 경로 내에서 항목에 액세스하는 데 사용되는 기호를 보여줍니다.
zh_cn: 表B-3 展示了出现在从模块结构到项的路径上下文中的符号。

source: Table B-3: Path-Related Syntax
ko: 표 B-3: 경로 관련 구문

source: Namespace path
ko: 네임스페이스 경로

source: `super::path`
ko: `슈퍼::패스`

source: Path relative to the parent of the current module
id: Jalur relatif terhadap induk modul saat ini
ko: 현재 모듈의 부모에 대한 상대 경로

source: Disambiguating a method call by naming the trait that defines it
id: Membedakan panggilan metode dengan menamai trait yang mendefinisikannya
ko: 메소드 호출을 명명하여 그것을 정의하는 트레이트를 구분하는 것

source: Table B-4 shows symbols that appear in the context of using generic type parameters.
es: La Tabla B-4 muestra los símbolos que aparecen en el contexto del uso de parámetros de tipo genérico.
id: Tabel B-4 menunjukkan simbol-simbol yang muncul dalam konteks penggunaan parameter tipe generik.
ko: 테이블 B-4는 일반 유형 매개변수를 사용하는 맥락에서 나타나는 기호를 보여줍니다.
zh_cn: 表B-4 展示了出现在泛型类型参数上下文中的符号。

source: Table B-4: Generics
ko: 표 B-4: 일반적인 것들

source: `path<...>`
ko: 경로<...>

source: Specifies parameters to generic type in a type (e.g., `Vec<u8>`)
id: Menentukan parameter ke tipe generik dalam suatu tipe (misalnya, `Vec<u8>`)
ko: 일반 유형에 매개변수를 지정합니다 (예: `Vec<u8>`).

source: Specifies parameters to a generic type, function, or method in an expression; often referred to as turbofish
ko: 식에서 일반 유형, 함수 또는 메서드에 매개변수를 지정합니다. 종종 turbofish로 불립니다.

source: Define generic function
id: Mendefinisikan fungsi generik
ko: 일반 함수를 정의하다

source: `struct ident<...> ...`
ko: `구조체 식별자<...> ...`

source: Define generic structure
id: Mendefinisikan struktur generik
ko: 일반적인 구조를 정의하다

source: `enum ident<...> ...`
ko: `열거형 식별자<...> ...`

source: Define generic enumeration
ko: 일반적인 열거형을 정의하세요.

source: Define generic implementation
id: Mendefinisikan implementasi generik
ko: 일반 구현을 정의하십시오.

source: Table B-5 shows symbols that appear in the context of calling or defining macros and specifying attributes on an item.
es: La Tabla B-5 muestra los símbolos que aparecen en el contexto de la llamada o definición de macros y la especificación de atributos en un elemento.
id: Tabel B-5 menunjukkan simbol-simbol yang muncul dalam konteks pemanggilan atau definisi makro dan penentuan atribut pada suatu item.
ko: 표 B-5는 매크로 호출 또는 정의 및 항목에 속성을 지정하는 맥락에서 나타나는 기호를 보여줍니다.
zh_cn: 表B-5展示了在调用或定义宏以及在其上指定属性时的上下文中出现的符号。

source: Table B-5: Macros and Attributes
id: Table B-5: Macros dan Attributes
ko: 표 B-5: 매크로 및 속성

source: Outer attribute
ko: 외부 속성

source: Table B-6 shows symbols that create comments.
es: La Tabla B-6 muestra los símbolos que crean comentarios.
id: Tabel B-6 menunjukkan simbol-simbol yang membuat komentar.
ko: 표 B-6에는 주석을 작성하는 데 사용되는 기호가 나와 있습니다.
zh_cn: 表B-6 展示了创建注释的符号。

source: Table B-6: Comments
ko: 표 B-6: 코멘트

source: Line comment
ko: 라인 주석

source: Table B-7 shows symbols that appear in the context of using tuples.
es: La Tabla B-7 muestra los símbolos que aparecen en el contexto del uso de tuplas.
id: Tabel B-7 menunjukkan simbol-simbol yang muncul dalam konteks menggunakan tuple.
ko: 테이블 B-7은 튜플을 사용하는 맥락에서 나타나는 기호를 보여줍니다.
zh_cn: 表B-7 展示了出现在使用元组时上下文中的符号。

source: Table B-7: Tuples
id: Tabel B-7 menunjukkan simbol-simbol yang muncul dalam konteks menggunakan tuple
ko: 표 B-7: 튜플

source: Empty tuple (aka unit), both literal and type
id: Tuple kosong (alias unit), baik literal maupun tipe
ko: 빈 튜플 (일명 유닛), 리터럴과 타입

source: `(expr)`
ko: `(식)`

source: Parenthesized expression
ko: 괄호로 묶인 표현

source: `(expr,)`
id: `expr + expr
ko: `(식,)`

source: Single-element tuple expression
ko: 단일 요소 튜플 표현식

source: `(type,)`
ko: `(유형,)`

source: Single-element tuple type
ko: 단일 요소 튜플 유형

source: `(expr, ...)`
ko: `(표현식, ...)`

source: Tuple expression
ko: 튜플 표현식

source: `(type, ...)`
ko: `(유형, ...)`

source: Tuple type
ko: 튜플 유형

source: Function call expression; also used to initialize tuple `struct`s and tuple `enum` variants
id: Ekspresi panggilan fungsi; juga digunakan untuk menginisialisasi struktur tuple dan varian tuple enumerasi
ko: 함수 호출 표현식; 또한 튜플 '구조체' 및 튜플 '열거형' 변수를 초기화하는 데 사용됩니다.

source: Table B-8 shows the contexts in which curly braces are used.
es: La Tabla B-8 muestra los contextos en los que se utilizan los corchetes.
id: Tabel B-8 menunjukkan konteks di mana kurung kurawal digunakan.
ko: 표 B-8은 중괄호가 사용되는 맥락을 보여줍니다.
zh_cn: 表B-8展示了使用大括号的上下文。

source: Table B-8: Curly Brackets
id: Tabel B-8: Kurung Kurawal
ko: 표 B-8: 중괄호

source: Context
ko: 문맥

source: Block expression
ko: 표현 차단

source: `Type {...}`
ko: `입력하세요 {...}`

source: `struct` literal
ko: `struct` 리터럴

source: Appendix C: Derivable Traits
id: Lampiran C: Derivable Traits
ko: 부록 C: 유도 가능한 특성

source: In various places in the book, we’ve discussed the `derive` attribute, which you can apply to a struct or enum definition. The `derive` attribute generates code to implement a default trait on the type you’ve annotated with the `derive` syntax.
es: En varias partes del libro, hemos discutido el atributo `derive`, que puedes aplicar a una definición struct o enum. El atributo `derive` genera código para implementar un trait por defecto en el tipo que has anotado con la sintaxis `derive`.
id: Di berbagai tempat dalam buku ini, kita telah membahas atribut `derive`, yang dapat Anda terapkan pada definisi struktur atau enumerasi. Atribut `derive` menghasilkan kode untuk mengimplementasikan sebuah trait default pada tipe yang Anda anotasi dengan sintaks `derive`.
ko: 책의 여러 곳에서 `derive` 속성에 대해 논의했는데, 이는 구조체 또는 열거형 정의에 적용할 수 있습니다. `derive` 속성은 `derive` 구문으로 주석을 달아 놓은 유형에 대한 기본 트레이트를 구현하는 코드를 생성합니다.
zh_cn: 在本书的各个部分中，我们讨论了可应用于结构体和枚举定义的 `derive` 属性。`derive` 属性会在使用 `derive` 语法标记的类型上生成对应 trait 的默认实现的代码。

source: In this appendix, we provide a comprehensive reference detailing all the traits in the standard library compatible with the `derive` attribute.
es: En este apéndice, proporcionamos una referencia completa que detalla todos los traits de la biblioteca estándar compatibles con el atributo `derive`.
id: Pada lampiran ini, kami menyediakan referensi komprehensif yang merinci semua trait dalam pustaka standar yang kompatibel dengan atribut `derive`.
ko: 본 부록에서는 `derive` 속성과 호환되는 표준 라이브러리의 모든 특성을 자세히 설명하는 종합 참조를 제공합니다.
zh_cn: 在这个附录中，我们提供了一个全面的参考，详细介绍了标准库中所有与`derive`属性兼容的trait。

source: These traits listed here are the only ones defined by the core library that can be implemented on your types using `derive`. Other traits defined in the standard library don’t have sensible default behavior, so it’s up to you to implement them in the way that makes sense for what you’re trying to accomplish.
es: Estos traits listados aquí son los únicos definidos por la librería principal que pueden ser implementados en tus tipos usando `derive`. Otros traits definidos en la biblioteca estándar no tienen un comportamiento sensible por defecto, por lo que depende de ti implementarlos de la manera que tenga sentido para lo que estás tratando de lograr.
id: Trait-trait yang terdaftar di sini adalah satu-satunya yang didefinisikan oleh pustaka inti yang dapat diimplementasikan pada tipe-tipe Anda menggunakan `derive`. Trait-trait lain yang didefinisikan dalam pustaka standar tidak memiliki perilaku default yang masuk akal, sehingga terserah Anda untuk mengimplementasikannya sesuai dengan apa yang masuk akal untuk tujuan yang ingin Anda capai.
ko: 여기 나열된 이 특성들은 코어 라이브러리에서 정의된 유일한 특성들이며 `derive`를 사용하여 타입에 구현할 수 있습니다. 표준 라이브러리에 정의된 다른 특성들은 합리적인 기본 동작이 없으므로, 당신이 달성하려는 목표에 맞게 구현하는 것이 중요합니다.
zh_cn: 这里列出的 trait 是仅有的在标准库中定义且能通过 `derive` 在类型上实现。标准库中定义的其它 trait 不能通过 `derive` 在类型上实现。这些 trait 不存在有意义的默认行为，所以由你负责以合理的方式实现它们。

source: Debug for Programmer Output
ko: 프로그래머 출력을 위한 디버깅

source: The `Debug` trait enables debug formatting in format strings, which you indicate by adding `:?` within `{}` placeholders.
ko: `Debug` 트레이트는 포맷 문자열에서 디버그 포맷팅을 가능하게 합니다. 이는 `{}` 자리 표시자 내에 `:?`를 추가하여 표시합니다.

source: The `Debug` trait allows you to print instances of a type for debugging purposes, so you and other programmers using your type can inspect an instance at a particular point in a program’s execution.
ko: `Debug` 트레이트는 디버깅 목적으로 타입의 인스턴스를 출력할 수 있도록 해줍니다. 따라서 당신과 당신의 타입을 사용하는 다른 프로그래머들은 프로그램 실행 중 특정 시점에서 인스턴스를 검사할 수 있습니다.

source: The `Debug` trait is required, for example, in use of the `assert_eq!` macro. This macro prints the values of instances given as arguments if the equality assertion fails so programmers can see why the two instances weren’t equal.
ko: `Debug` 트레이트는 `assert_eq!` 매크로를 사용할 때 필요합니다. 이 매크로는 동등성 어설션에 실패한 경우 인수로 제공된 인스턴스의 값을 출력하므로 프로그래머가 두 인스턴스가 동일하지 않은 이유를 볼 수 있습니다.

source: PartialEq for equality comparison
id: `PartialEq` untuk perbandingan kesetaraan
ko: 동등 비교를 위한 PartialEq

source: The `PartialEq` trait allows for comparison between instances of a type for equality, thereby enabling the == and != operators.
es: El trait `PartialEq` permite la comparación entre instancias de un tipo por igualdad, habilitando así los operadores == y !=.
id: Trait `PartialEq` memungkinkan perbandingan antara instansi dari suatu tipe untuk kesetaraan, sehingga memungkinkan operator == dan !=.
ko: `PartialEq` 트레이트는 동등성을 비교하기 위해 타입의 인스턴스 간에 사용되며, == 및 != 연산자를 가능하게 합니다.
zh_cn: `PartialEq` trait允许在一个类型的实例之间进行等值比较，从而实现 == 和 != 运算符。
