Repository: cairo-book/cairo-book
Catalog: po/*.po
Languages: es, id, ko, zh_cn

source: The second time we call `add_to_waitlist`, we use a relative path. The path starts with `front_of_house`, the name of the module defined at the same level of the module tree as `eat_at_restaurant`. Here the filesystem equivalent would be using the path `./front_of_house/hosting/add_to_waitlist`. Starting with a module name means that the path is relative to the current module.
id: Ketika kita memanggil `add_to_waitlist` untuk kedua kalinya, kita menggunakan jalur relatif. Jalur dimulai dengan `front_of_house`, nama modul yang didefinisikan pada level yang sama dengan `eat_at_restaurant` dalam pohon modul. Di sini, ekuivalen pada sistem file akan menggunakan jalur `./front_of_house/hosting/add_to_waitlist`. Memulai dengan nama modul berarti bahwa jalur tersebut relatif terhadap modul saat ini.
ko: `add_to_waitlist`를 두 번째 호출할 때 상대 경로를 사용합니다. 경로는 `front_of_house`로 시작하며, `eat_at_restaurant`과 동일한 수준의 모듈 트리에 정의된 모듈의 이름입니다. 여기서 파일 시스템과 동등한 것은 경로 `./front_of_house/hosting/add_to_waitlist`를 사용하는 것입니다. 모듈 이름으로 시작하면 해당 경로가 현재 모듈을 기준으로 상대적임을 의미합니다.

source: Starting Relative Paths with `super`
id: Memulai Relative Path dengan `super`
ko: `super`를 사용하여 상대 경로 시작하기

source: Choosing whether to use a `super` or not is a decision you’ll make based on your project, and depends on whether you’re more likely to move item definition code separately from or together with the code that uses the item.
id: Memilih apakah akan menggunakan `super` atau tidak adalah keputusan yang akan Anda buat berdasarkan proyek Anda, dan bergantung pada apakah Anda lebih cenderung untuk memindahkan kode definisi item secara terpisah dari atau bersama dengan kode yang menggunakan item tersebut.
ko: `super`를 사용할지 여부를 결정하는 것은 프로젝트에 따라 달라지며, 항목 정의 코드를 별도로 이동할지 아니면 항목을 사용하는 코드와 함께 이동할지에 따라 결정됩니다.

source: Listing 7-4: Calling a function using a relative path starting with super
id: Listing 7-4: Memanggil sebuah fungsi menggunakan relative path yang dimulai dengan `super`
ko: 리스트 7-4: super로 시작하는 상대 경로를 사용하여 함수 호출하기

source: Here you can see directly that you access a parent's module easily using `super`, which wasn't the case previously.
es: Aquí se puede ver directamente que se accede fácilmente a un módulo padre usando `super`, lo que no era el caso anteriormente.
id: Di sini Anda dapat melihat dengan jelas bahwa Anda dapat mengakses modul induk dengan mudah menggunakan `super`, yang sebelumnya tidak mungkin dilakukan.
ko: 여기에서는 이전에 그랬지 않았던 `super`를 사용하여 부모 모듈에 쉽게 액세스할 수 있다는 것을 직접 확인할 수 있습니다.
zh_cn: 在这里你可以直接看到，和之前的例子不同，在这你可以使用`super`轻松地访问父级的模块。

source: Bringing Paths into Scope with the `use` Keyword
id: Membawa Paths ke dalam Scope dengan Kata Kunci `use`
ko: `use` 키워드를 사용하여 경로를 스코프에 가져오기

source: Having to write out the paths to call functions can feel inconvenient and repetitive. Fortunately, there’s a way to simplify this process: we can create a shortcut to a path with the `use` keyword once, and then use the shorter name everywhere else in the scope.
es: Tener que escribir las rutas para llamar a las funciones puede resultar incómodo y repetitivo. Afortunadamente, hay una manera de simplificar este proceso: podemos crear un acceso directo a una ruta con la palabra clave `use` una vez, y luego utilizar el nombre más corto en todas partes en el ámbito.
id: Mengharuskan menuliskan jalur untuk memanggil fungsi dapat terasa merepotkan dan repetitif. Untungnya, ada cara untuk menyederhanakan proses ini: kita dapat membuat pintasan ke suatu jalur dengan menggunakan kata kunci `use` sekali, dan kemudian menggunakan nama yang lebih pendek di mana pun dalam lingkup tersebut.
ko: 함수를 호출하기 위한 경로를 작성해야 하는 것은 불편하고 반복적일 수 있습니다. 다행히도, 이 프로세스를 간소화하는 방법이 있습니다: `use` 키워드를 사용하여 경로에 대한 바로 가기를 한 번 만들고, 그 다음에는 스코프 내 어디에서든 더 짧은 이름을 사용할 수 있습니다.
zh_cn: 不得不编写路径来调用函数显得不便且重复。幸运的是，有一种方法可以简化这个过程：我们可以用`use`关键字创建一个路径的快捷方式，然后在作用域内的其他地方使用这个较短的名字。

source: In Listing 7-5, we bring the `restaurant::front_of_house::hosting` module into the scope of the `eat_at_restaurant` function so we only have to specify `hosting::add_to_waitlist` to call the `add_to_waitlist` function in `eat_at_restaurant`.
id: Pada Listing 7-5, kita memasukkan modul `restaurant::front_of_house::hosting` ke dalam lingkup fungsi `eat_at_restaurant` sehingga kita hanya perlu menentukan `hosting::add_to_waitlist` untuk memanggil fungsi `add_to_waitlist` di dalam `eat_at_restaurant`.
ko: 리스팅 7-5에서는 `restaurant::front_of_house::hosting` 모듈을 `eat_at_restaurant` 함수의 범위로 가져와 `eat_at_restaurant` 함수에서 `add_to_waitlist` 함수를 호출할 때 `hosting::add_to_waitlist`만 지정하면 됩니다.

source: // Assuming "front_of_house" module is contained in a crate called "restaurant", as mentioned in the section "Defining Modules to Control Scope" // If the path is created in the same crate, "restaurant" is optional in the use statement
ko: // "front_of_house" 모듈이 "Defining Modules to Control Scope" 섹션에서 언급된대로 "restaurant" 크레이트에 포함되어 있다고 가정합니다. // 경로가 동일한 크레이트에 생성된 경우, "restaurant"는 use 문에서 선택 사항입니다.

source: // ✅ Shorter path
ko: // ✅ 더 짧은 경로

source: Listing 7-5: Bringing a module into scope with `use`
id: Listing 7-5: Membawa module ke dalam scope dengan `use`
ko: 리스팅 7-5: `use`를 사용하여 모듈을 스코프로 가져오기

source: Adding use and a path in a scope is similar to creating a symbolic link in the filesystem. By adding `use restaurant::front_of_house::hosting` in the crate root, hosting is now a valid name in that scope, just as though the `hosting` module had been defined in the crate root.
es: Añadir use y una ruta en un ámbito es similar a crear un enlace simbólico en el sistema de ficheros. Al añadir `use restaurant::front_of_house::hosting` en la raíz de crate, hosting es ahora un nombre válido en ese ámbito, como si el módulo `hosting` se hubiera definido en la raíz de un crate.
id: Menambahkan `use` dan sebuah path dalam suatu scope mirip dengan membuat tautan simbolik dalam sistem file. Dengan menambahkan `use restaurant::front_of_house::hosting` di root crate, `hosting` sekarang menjadi nama yang valid dalam scope tersebut, seolah-olah modul `hosting` telah didefinisikan di root crate.
ko: 범위에 use와 경로를 추가하는 것은 파일 시스템에서 심볼릭 링크를 생성하는 것과 유사합니다. 크레이트 루트에 `use restaurant::front_of_house::hosting`을 추가하면 해당 범위에서 hosting은 이제 유효한 이름이 되며, 마치 `hosting` 모듈이 크레이트 루트에 정의된 것처럼 작동합니다.
zh_cn: 在作用域中添加 use 和路径类似于在文件系统中创建一个软连接（符号连接，symbolic link）。通过在 crate 根中添加 `use restaurant::front_of_house::hosting`，hosting 现在是该作用域中的一个有效名称，就像在 crate 根中定义了`hosting`模块一样。

source: Note that `use` only creates the shortcut for the particular scope in which the `use` occurs. Listing 7-6 moves the `eat_at_restaurant` function into a new child module named `customer`, which is then a different scope than the `use` statement, so the function body won’t compile:
id: Perhatikan bahwa `use` hanya membuat pintasan untuk scope tertentu di mana `use` tersebut terjadi. Listing 7-6 memindahkan fungsi `eat_at_restaurant` ke dalam modul anak baru bernama `customer`, yang kemudian menjadi scope yang berbeda dari pernyataan `use`, sehingga badan fungsi tidak akan dapat dikompilasi:
ko: `use`는 `use`가 발생하는 특정 범위에 대한 바로 가기만 생성한다는 점을 유의하십시오. 7-6 목록은 `eat_at_restaurant` 함수를 `customer`라는 새로운 하위 모듈로 이동시키는데, 이는 `use` 문이 있는 범위와 다른 범위이므로 함수 본문이 컴파일되지 않습니다.

source: Listing 7-6: A `use` statement only applies in the scope it’s in
id: Listing 7-6: Pernyataan `use` hanya berlaku dalam lingkup tempat ia berada
ko: 리스팅 7-6: `use` 문은 그것이 있는 범위에만 적용됩니다.

source: The compiler error shows that the shortcut no longer applies within the `customer` module:
id: Error kompilasi menunjukkan bahwa pintasan tidak berlaku lagi di dalam modul `customer`:
ko: 컴파일러 오류는 `customer` 모듈 내에서 더 이상 해당 단축키가 적용되지 않음을 보여줍니다.

source: Creating Idiomatic `use` Paths
id: Membuat Path`use` yang Idiomatik
ko: `use` 경로 만들기

source: In Listing 7-5, you might have wondered why we specified `use restaurant::front_of_house::hosting` and then called `hosting::add_to_waitlist` in `eat_at_restaurant` rather than specifying the `use` path all the way out to the `add_to_waitlist` function to achieve the same result, as in Listing 7-7.
id: Pada Listing 7-5, Anda mungkin bertanya-tanya mengapa kita menentukan `use restaurant::front_of_house::hosting` dan kemudian memanggil `hosting::add_to_waitlist` dalam `eat_at_restaurant` daripada menentukan jalur `use` sepanjang jalan ke fungsi `add_to_waitlist` untuk mencapai hasil yang sama, seperti pada Listing 7-7.
ko: 리스팅 7-5에서 `restaurant::front_of_house::hosting`을 지정한 후 `eat_at_restaurant`에서 `hosting::add_to_waitlist`를 호출하는 이유에 대해 궁금해 할 수 있습니다. 이것을 `use` 경로를 `add_to_waitlist` 함수까지 모두 지정하여 동일한 결과를 얻기 위해 지정하지 않았을까요, 리스팅 7-7에서처럼요.

source: Listing 7-7: Bringing the `add_to_waitlist` function into scope with `use`, which is unidiomatic
id: Listing 7-7: Membawa fungsi `add_to_waitlist` ke dalam scope dengan `use`, yang kurang idiomatik
ko: 리스팅 7-7: `use`를 사용하여 `add_to_waitlist` 함수를 범위 내로 가져오는 것은 비표준적입니다.

source: Although both Listing 7-5 and 7-7 accomplish the same task, Listing 7-5 is the idiomatic way to bring a function into scope with `use`. Bringing the function’s parent module into scope with `use` means we have to specify the parent module when calling the function. Specifying the parent module when calling the function makes it clear that the function isn’t locally defined while still minimizing repetition of the full path. The code in Listing 7-7 is unclear as to where `add_to_waitlist` is defined.
ko: 리스팅 7-5와 7-7 모두 동일한 작업을 수행하지만, 리스팅 7-5가 `use`를 사용하여 함수를 스코프로 가져오는 관용적인 방법입니다. `use`를 사용하여 함수의 부모 모듈을 스코프로 가져오면 함수를 호출할 때 부모 모듈을 명시해야 합니다. 함수를 호출할 때 부모 모듈을 명시함으로써 함수가 로컬로 정의되지 않았음을 명확히 하면서도 전체 경로의 반복을 최소화합니다. 리스팅 7-7의 코드는 `add_to_waitlist`가 어디에 정의되어 있는지 명확하지 않습니다.

source: On the other hand, when bringing in structs, enums, traits, and other items with `use`, it’s idiomatic to specify the full path. Listing 7-8 shows the idiomatic way to bring the core library’s `ArrayTrait` trait into the scope.
id: Di sisi lain, saat mengimpor structs, enums, traits, dan item lain dengan `use`, cara yang idiomatik adalah dengan menentukan jalur lengkap. Listing 7-8 menunjukkan cara yang idiomatik untuk membawa trait `ArrayTrait` dari perpustakaan inti (core library) ke dalam scope.
ko: 한편, `use`를 사용하여 구조체, 열거형, 트레이트 및 기타 항목을 가져올 때는 전체 경로를 지정하는 것이 관용적입니다. 7-8 목록은 코어 라이브러리의 `ArrayTrait` 트레이트를 범위 내로 가져오는 관용적인 방법을 보여줍니다.

source: Listing 7-8: Bringing `ArrayTrait` into scope in an idiomatic way
id: Listing 7-8: Membawa `ArrayTrait` ke dalam scope dengan cara yang idiomatik
ko: 리스팅 7-8: `ArrayTrait`을 관용적인 방식으로 범위에 가져오기

source: There’s no strong reason behind this idiom: it’s just the convention that has emerged in the Rust community, and folks have gotten used to reading and writing Rust code this way. As Cairo shares many idioms with Rust, we follow this convention as well.
id: Tidak ada alasan kuat di balik idiom ini: itu hanya konvensi yang muncul dalam komunitas Rust, dan orang-orang telah terbiasa membaca dan menulis kode Rust dengan cara ini. Karena Cairo memiliki banyak kesamaan dengan idiom-idiom Rust, kami juga mengikuti konvensi ini.
ko: 이 속담 뒤에 강력한 이유는 없습니다: 이것은 러스트 커뮤니티에서 나타난 관례일 뿐이며, 사람들은 러스트 코드를 읽고 쓰는 데 이 방식에 익숙해졌습니다. 카이로는 러스트와 많은 관용구를 공유하기 때문에 우리도 이 관례를 따릅니다.

source: The exception to this idiom is if we’re bringing two items with the same name into scope with `use` statements, because Cairo doesn’t allow that.
id: Pengecualian dari idiom ini adalah jika kita membawa dua item dengan nama yang sama ke dalam lingkup dengan pernyataan `use`, karena Cairo tidak mengizinkan hal tersebut.
ko: 이 속담의 예외는 Cairo가 그것을 허용하지 않기 때문에 `use` 문으로 동일한 이름을 가진 두 항목을 범위로 가져오는 경우입니다.

source: Providing New Names with the `as` Keyword
id: Memberikan Nama Baru dengan Kata Kunci `as`
ko: `as` 키워드를 사용하여 새로운 이름 제공하기

source: There’s another solution to the problem of bringing two types of the same name into the same scope with `use`: after the path, we can specify `as` and a new local name, or _alias_, for the type. Listing 7-9 shows how you can rename an import with `as`:
id: Ada solusi lain untuk masalah membawa dua tipe dengan nama yang sama ke dalam lingkup yang sama dengan `use`: setelah path, kita dapat menentukan `as` dan nama lokal baru, atau _alias_, untuk tipe tersebut. Listing 7-9 menunjukkan bagaimana Anda dapat menamai ulang impor dengan `as`:
ko: `use`를 사용하여 동일한 이름의 두 가지 유형을 동일한 범위로 가져오는 문제에 대한 또 다른 해결책이 있습니다: 경로 뒤에 `as`와 새로운 로컬 이름 또는 _별칭_ 을 지정할 수 있습니다. 7-9 목록은 `as`를 사용하여 가져온 항목의 이름을 바꾸는 방법을 보여줍니다.

source: // ArrayTrait was renamed to Arr
ko: ArrayTrait가 Arr로 이름이 변경되었습니다.

source: Listing 7-9: Renaming a trait when it’s brought into scope with the `as` keyword
id: Listing 7-9: Menamai ulang sebuah trait ketika dibawa ke dalam lingkup dengan kata kunci `as`
ko: 리스트 7-9: `as` 키워드를 사용하여 특성을 스코프로 가져올 때 특성의 이름을 변경하기

source: Here, we brought `ArrayTrait` into scope with the alias `Arr`. We can now access the trait's methods with the `Arr` identifier.
es: En este caso, hemos introducido `ArrayTrait` en el ámbito con el alias `Arr`. Ahora podemos acceder a los métodos del rasgo con el identificador `Arr`.
id: Di sini, kami membawa `ArrayTrait` ke dalam lingkup dengan alias `Arr`. Sekarang kami dapat mengakses metode-metode dari trait tersebut menggunakan pengenal `Arr`.
ko: 여기서 우리는 `ArrayTrait`을 `Arr` 별칭과 함께 스코프로 가져왔습니다. 이제 `Arr` 식별자를 사용하여 트레이트의 메소드에 접근할 수 있습니다.
zh_cn: 在这里，我们用别名`Arr`将`ArrayTrait`带入作用域。现在我们可以用`Arr`标识符来访问该trait的方法。

source: Importing multiple items from the same module
id: Mengimpor beberapa item dari modul yang sama
ko: 동일한 모듈에서 여러 항목을 가져오기

source: When you want to import multiple items (like functions, structs or enums) from the same module in Cairo, you can use curly braces `{}` to list all of the items that you want to import. This helps to keep your code clean and easy to read by avoiding a long list of individual use statements.
id: Ketika Anda ingin mengimpor beberapa item (seperti fungsi, struktur, atau enumerasi) dari modul yang sama di Cairo, Anda dapat menggunakan kurung kurawal `{}` untuk menuliskan semua item yang ingin Anda impor. Ini membantu menjaga kode Anda bersih dan mudah dibaca dengan menghindari daftar panjang pernyataan `use` secara individual.
ko: 카이로에서 동일한 모듈에서 여러 항목(함수, 구조체 또는 열거형과 같은)을 가져오고 싶을 때는 중괄호 `{}`를 사용하여 가져오고 싶은 모든 항목을 나열할 수 있습니다. 이렇게 하면 개별적인 사용 문을 길게 나열하는 것을 피하고 코드를 깔끔하고 읽기 쉽게 유지할 수 있습니다.

source: The general syntax for importing multiple items from the same module is:
es: La sintaxis general para importar varios elementos del mismo módulo es:
id: Syntax umum untuk mengimpor beberapa item dari modul yang sama adalah:
ko: 동일한 모듈에서 여러 항목을 가져오는 일반 구문은 다음과 같습니다:
zh_cn: 从同一模块导入多个项的常见语法是：

source: Here is an example where we import three structures from the same module:
es: He aquí un ejemplo en el que importamos tres estructuras del mismo módulo:
id: Berikut contoh di mana kita mengimpor tiga struktur dari modul yang sama:
ko: 여기 같은 모듈에서 세 개의 구조체를 가져오는 예제가 있습니다:
zh_cn: 下面是一个从同一个模块导入三个结构体的例子：

source: // Assuming we have a module called `shapes` with the structures `Square`, `Circle`, and `Triangle`.
ko: // `shapes`라는 모듈에 `Square`, `Circle`, 그리고 `Triangle` 구조체가 있다고 가정합니다.

source: // We can import the structures `Square`, `Circle`, and `Triangle` from the `shapes` module like this:
ko: 우리는 `shapes` 모듈에서 `Square`, `Circle`, 그리고 `Triangle` 구조체를 이렇게 가져올 수 있습니다:

source: // Now we can directly use `Square`, `Circle`, and `Triangle` in our code.
ko: 이제 우리는 코드에서 `Square`, `Circle`, 그리고 `Triangle`을 직접 사용할 수 있습니다.

source: Listing 7-10: Importing multiple items from the same module
id: Listing 7-10: Mengimpor beberapa item dari modul yang sama
ko: 리스트 7-10: 동일한 모듈에서 여러 항목 가져오기

source: Re-exporting Names in Module Files
ko: 모듈 파일에서 이름 재내보내기

source: When we bring a name into scope with the `use` keyword, the name available in the new scope can be imported as if it had been defined in that code’s scope. This technique is called _re-exporting_ because we’re bringing an item into scope, but also making that item available for others to bring into their scope.
id: Ketika kita membawa sebuah nama ke dalam scope dengan kata kunci `use`, nama yang tersedia dalam scope baru dapat diimpor seolah-olah itu telah didefinisikan dalam scope kode tersebut. Teknik ini disebut _re-exporting_ karena kita membawa sebuah item ke dalam scope, namun juga membuat item tersebut tersedia bagi orang lain untuk diimpor ke dalam scope mereka.
ko: `use` 키워드를 사용하여 이름을 스코프에 가져올 때, 새로운 스코프에서 사용 가능한 이름은 해당 코드의 스코프에서 정의된 것처럼 가져올 수 있습니다. 이 기술은 _재내보내기(re-exporting)_ 라고 불리며, 우리는 항목을 스코프에 가져오면서 그 항목을 다른 사람들이 자신의 스코프로 가져올 수 있도록 만드는 것입니다.

source: For example, let's re-export the `add_to_waitlist` function in the restaurant example:
es: Por ejemplo, reexportemos la función `add_to_waitlist` del ejemplo del restaurante:
id: Sebagai contoh, mari kita _re-export_ fungsi `add_to_waitlist` dalam contoh restoran:
ko: 예를 들어, 레스토랑 예제에서 `add_to_waitlist` 함수를 다시 내보내 봅시다.
zh_cn: 下面这个例子，让我们重新导出餐厅例子中的`add_to_waitlist`函数：

source: Listing 7-11: Making a name available for any code to use from a new scope with `pub use`
id: Listing 7-11: Membuat sebuah nama tersedia untuk digunakan oleh kode mana pun dari scope baru dengan `pub use`
ko: 리스팅 7-11: `pub use`를 사용하여 새로운 범위에서 모든 코드가 사용할 수 있는 이름을 만드는 방법

source: Before this change, external code would have to call the `add_to_waitlist` function by using the path `restaurant::front_of_house::hosting::add_to_waitlist()`. Now that this `use` has re-exported the `hosting` module from the root module, external code can now use the path `restaurant::hosting::add_to_waitlist()` instead.
id: Sebelum perubahan ini, kode eksternal harus memanggil fungsi `add_to_waitlist` dengan menggunakan path `restaurant::front_of_house::hosting::add_to_waitlist()`. Sekarang bahwa `use` telah mere-export modul `hosting` dari modul root, kode eksternal sekarang dapat menggunakan path `restaurant::hosting::add_to_waitlist()` sebagai gantinya.
ko: 이 변경 이전에는 외부 코드가 `restaurant::front_of_house::hosting::add_to_waitlist()` 경로를 사용하여 `add_to_waitlist` 함수를 호출해야 했습니다. 이제 이 `use`가 루트 모듈에서 `hosting` 모듈을 다시 내보냈기 때문에, 외부 코드는 이제 `restaurant::hosting::add_to_waitlist()` 경로를 사용할 수 있습니다.

source: Re-exporting is useful when the internal structure of your code is different from how programmers calling your code would think about the domain. For example, in this restaurant metaphor, the people running the restaurant think about “front of house” and “back of house.” But customers visiting a restaurant probably won’t think about the parts of the restaurant in those terms. With `use`, we can write our code with one structure but expose a different structure. Doing so makes our library well organized for programmers working on the library and programmers calling the library.
id: Mere-export (_re-exporting_) berguna ketika struktur internal kode Anda berbeda dari cara para programmer yang memanggil kode Anda akan memikirkan domain tersebut. Sebagai contoh, dalam metafora restoran ini, orang-orang yang menjalankan restoran memikirkan "depan rumah" dan "belakang rumah". Tetapi pelanggan yang mengunjungi restoran mungkin tidak akan memikirkan bagian-bagian restoran dengan istilah tersebut. Dengan `use`, kita dapat menulis kode kita dengan satu struktur tetapi mengekspos struktur yang berbeda. Melakukan hal ini membuat perpustakaan kita terorganisir dengan baik untuk para programmer yang bekerja pada perpustakaan dan programmer yang memanggil perpustakaan tersebut.
ko: 재수출은 코드의 내부 구조가 프로그래머가 도메인을 생각하는 방식과 다를 때 유용합니다. 예를 들어, 이 레스토랑 비유에서 레스토랑을 운영하는 사람들은 "앞집"과 "뒷집"에 대해 생각하지만 레스토랑을 방문하는 고객들은 아마도 그 용어로 레스토랑의 부분을 생각하지 않을 것입니다. `use`를 사용하면 코드를 한 구조로 작성하고 다른 구조를 노출시킬 수 있습니다. 이렇게 함으로써 라이브러리를 사용하는 프로그래머와 라이브러리를 호출하는 프로그래머들을 위해 우리의 라이브러리를 잘 구성할 수 있습니다.

source: Using External Packages in Cairo with Scarb
id: Menggunakan Packages Eksternal di Cairo dengan Scarb
ko: Scarb를 사용하여 카이로에서 외부 패키지 사용하기

source: You might need to use external packages to leverage the functionality provided by the community. To use an external package in your project with Scarb, follow these steps:
es: Puede que necesite utilizar paquetes externos para aprovechar la funcionalidad proporcionada por la comunidad. Para utilizar un paquete externo en su proyecto con Scarb, siga estos pasos:
id: Anda mungkin perlu menggunakan packages eksternal untuk memanfaatkan fungsionalitas yang disediakan oleh komunitas. Untuk menggunakan paket eksternal dalam proyek Anda dengan Scarb, ikuti langkah-langkah berikut:
ko: 커뮤니티에서 제공하는 기능을 활용하기 위해 외부 패키지를 사용해야 할 수도 있습니다. Scarb를 사용하여 프로젝트에 외부 패키지를 사용하려면 다음 단계를 따르세요:
zh_cn: 你可能需要使用外部包来利用社区提供的功能。要在你的项目中使用Scarb的外部包，请遵循以下步骤：

source: The dependencies system is still a work in progress. You can check the official [documentation](https://docs.swmansion.com/scarb/docs/guides/dependencies.html).
id: Sistem dependensi masih dalam tahap pengembangan. Anda dapat memeriksa [dokumentasi resmi](https://docs.swmansion.com/scarb/docs/guides/dependencies.html).
ko: 의존성 시스템은 아직 진행 중인 작업입니다. 공식 [문서](https://docs.swmansion.com/scarb/docs/guides/dependencies.html)를 확인할 수 있습니다.

source: So far, all the examples in this chapter defined multiple modules in one file. When modules get large, you might want to move their definitions to a separate file to make the code easier to navigate.
id: Sejauh ini, semua contoh dalam bab ini telah mendefinisikan beberapa modul dalam satu file. Ketika modul menjadi besar, Anda mungkin ingin memindahkan definisi mereka ke file terpisah untuk memudahkan navigasi kode.
ko: 지금까지 이 장의 모든 예시는 한 파일에 여러 모듈을 정의했습니다. 모듈이 커지면 코드를 쉽게 탐색하기 위해 그 정의를 별도의 파일로 옮기고 싶을 수 있습니다.

source: For example, let’s start from the code in Listing 7-11 that had multiple restaurant modules. We’ll extract modules into files instead of having all the modules defined in the crate root file. In this case, the crate root file is _src/lib.cairo_.
id: Sebagai contoh, mari kita mulai dari kode pada Listing 7-11 yang memiliki beberapa modul restoran. Kita akan mengekstrak modul ke dalam file daripada memiliki semua modul yang didefinisikan dalam file akar krate. Dalam kasus ini, file akar krate adalah _src/lib.cairo_.
ko: 예를 들어, 여러 레스토랑 모듈을 가진 코드인 리스트 7-11에서 시작해 보겠습니다. 모듈을 모두 크레이트 루트 파일에 정의하는 대신 파일로 추출할 것입니다. 이 경우 크레이트 루트 파일은 _src/lib.cairo_ 입니다.

source: First, we’ll extract the `front_of_house` module to its own file. Remove the code inside the curly brackets for the `front_of_house` module, leaving only the `mod front_of_house;` declaration, so that _src/lib.cairo_ contains the code shown in Listing 7-12. Note that this won’t compile until we create the _src/front_of_house.cairo_ file in Listing 7-13.
id: Pertama, kita akan mengekstrak modul `front_of_house` ke dalam file terpisah. Hapuslah kode di dalam kurung kurawal untuk modul `front_of_house`, sehingga hanya tersisa deklarasi `mod front_of_house;`, sehingga _src/lib.cairo_ berisi kode seperti yang ditunjukkan dalam Listing 7-12. Perlu diingat bahwa ini tidak akan dapat dikompilasi hingga kita membuat file _src/front_of_house.cairo_ seperti yang terlihat pada Listing 7-13.
ko: 먼저 `front_of_house` 모듈을 별도의 파일로 추출합니다. `front_of_house` 모듈 내 중괄호 안의 코드를 제거하여 `mod front_of_house;` 선언만 남겨두어야 합니다. 이렇게 하면 _src/lib.cairo_ 파일에 7-12 목록에 표시된 코드가 포함됩니다. 7-13 목록에 있는 _src/front_of_house.cairo_ 파일을 생성하기 전까지는 컴파일되지 않음을 유의하세요.

source: Listing 7-12: Declaring the `front_of_house` module whose body will be in _src/front_of_house.cairo_
id: Listing 7-12: Mendeklarasikan modul `front_of_house` yang isinya akan berada di _src/front_of_house.cairo_
ko: 리스팅 7-12: `front_of_house` 모듈을 선언하고, 해당 내용은 _src/front_of_house.cairo_ 에 있을 것입니다.
