Repository: cairo-book/cairo-book
Catalog: po/*.po
Languages: es, id, ko, zh_cn

source: The `#[cfg(test)]` annotation on the tests module tells Cairo to compile and run the test code only when you run `cairo-test`, not when you run `cairo-run`. This saves compile time when you only want to build the library and saves space in the resulting compiled artifact because the tests are not included. You’ll see that because integration tests go in a different directory, they don’t need the `#[cfg(test)]` annotation. However, because unit tests go in the same files as the code, you’ll use `#[cfg(test)]` to specify that they shouldn’t be included in the compiled result.
es: La anotación `#[cfg(test)]` en el módulo de pruebas indica a Cairo que compile y ejecute el código de prueba solo cuando se ejecuta `cairo-test`, no cuando se ejecuta `cairo-run`. Esto ahorra tiempo de compilación cuando solo desea compilar la biblioteca y ahorra espacio en el artefacto compilado resultante porque las pruebas no están incluidas. Verá que debido a que las pruebas de integración van en un directorio diferente, no necesitan la anotación `#[cfg(test)]`. Sin embargo, debido a que las pruebas unitarias van en los mismos archivos que el código, usará `#[cfg(test)]` para especificar que no deben incluirse en el resultado compilado.

source: The attribute `cfg` stands for configuration and tells Cairo that the following item should only be included given a certain configuration option. In this case, the configuration option is `test`, which is provided by Cairo for compiling and running tests. By using the `cfg` attribute, Cairo compiles our test code only if we actively run the tests with `cairo-test`. This includes any helper functions that might be within this module, in addition to the functions annotated with `#[test]`.
es: El atributo `cfg` significa "configuración" y le indica a Cairo que el siguiente elemento solo debe incluirse dado una cierta opción de configuración. En este caso, la opción de configuración es `test`, que es proporcionada por Cairo para compilar y ejecutar pruebas. Al usar el atributo `cfg`, Cairo compila nuestro código de prueba solo si ejecutamos activamente las pruebas con `cairo-test`. Esto incluye cualquier función de ayuda que pueda estar dentro de este módulo, además de las funciones anotadas con `#[test]`.

source: > To successfully run your tests with `cairo-test` you will need to update your `cairo_project.toml` file to add the declaration of your `tests` crate. > > ```rust > [crate_roots] > adder = "src" > tests = "tests" > ```
es: > Para ejecutar correctamente tus pruebas con `cairo-test`, deberás actualizar tu archivo `cairo_project.toml` para agregar la declaración de tu crate `tests`. > > ```rust > [crate_roots] > adder = "src" > tests = "tests" > ```

source: Each test file is compiled as its own separate crate, that's why whenever you add a new test file you must add it to your _tests/lib.cairo_.
es: Cada archivo de prueba se compila como una entidad separada, por eso cada vez que agregas un nuevo archivo de prueba debes agregarlo a tu archivo _tests/lib.cairo_.

source: Enter the code in Listing 8-11 into the _tests/integration_test.cairo_ file:
es: Ingrese el código del Listado 8-11 en el archivo _tests/integration_test.cairo_:

source: <span class="caption">Listing 8-11: Testing functions from other modules</span>
es: <span class="caption">Listado 8-11: Probando funciones de otros módulos</span>

source: Each file in the tests directory is a separate crate, so we need to bring our library into each test crate’s scope. For that reason we add `use adder::main` at the top of the code, which we didn’t need in the unit tests.
es: Cada archivo en el directorio de pruebas es una creación separada, por lo que debemos incluir nuestra biblioteca en el alcance de cada creación de prueba. Por esa razón, agregamos `use adder::main` en la parte superior del código, lo cual no necesitábamos en las pruebas unitarias.

source: When a panic occurs, it leads to an abrupt termination of the program. The `panic` function takes an array as argument, which can be used to provide an error message and performs an unwind process where all variables are dropped and dictionaries squashed to ensure the soundness of the program to safely terminate the execution.
es: Cuando se produce un pánico, se produce una terminación abrupta del programa. La función `panic` toma como argumento un array, que puede utilizarse para proporcionar un mensaje de error y realiza un proceso de desenrollado en el que se eliminan todas las variables y se aplastan los diccionarios para garantizar la solidez del programa y terminar la ejecución de forma segura.

source: An alternative and more idiomatic approach to panic in Cairo would be to use the `panic_with_felt252` function. This function serves as an abstraction of the array-defining process and is often preferred due to its clearer and more concise expression of intent. By using `panic_with_felt252`, developers can panic in a one-liner by providing a felt252 error message as argument, making the code more readable and maintainable.
es: Una aproximación alternativa y más idiomática al pánico en Cairo sería usar la función `panic_with_felt252`. Esta función sirve como una abstracción del proceso de definición de arrays y a menudo se prefiere debido a su expresión más clara y concisa de la intención. Usando `panic_with_felt252`, los desarrolladores pueden entrar en pánico en una sola línea proporcionando un mensaje de error felt252 como argumento, haciendo el código más legible y mantenible.

source: ## panic_with macro
es: ## macro panic_with

source: You can use the `panic_with` macro to mark a function that returns an `Option` or `Result`. This macro takes two arguments, which are the data that is passed as the panic reason as well as the name for a wrapping function. It will create a wrapper for your annotated function which will panic if the function returns `None` or `Err`, the panic function will be called with the given data.
es: Puede utilizar la macro `panic_with` para marcar una función que devuelva una `Option` o un `Result`. Esta macro toma dos argumentos, que son los datos que se pasan como la razón de pánico, así como el nombre de una función envolvente. Creará una envoltura para su función anotada que entrará en pánico si la función devuelve `None` o `Err`, la función de pánico será llamada con los datos dados.

source: Recall from [“Generic data types”](ch07-01-generic-data-types.md#enums) in Chapter 7 that the `Result` enum is defined as having two variants, `Ok` and `Err`, as follows:
es: Recordemos de ["Tipos de datos genéricos"](ch07-01-generic-data-types.md#enums) en el Capítulo 7 que el enum `Result` se define como teniendo dos variantes, `Ok` y `Err`, como sigue:

source: You can find the implementation ot the `ResultTrait` [here](https://github.com/starkware-libs/cairo/blob/main/corelib/src/result.cairo#L20).
es: Puede encontrar la implementación del `ResultTrait` [aquí](https://github.com/starkware-libs/cairo/blob/main/corelib/src/result.cairo#L20).

source: <span class="caption">Listing 9-1: Using the Result type</span>
es: <span class="caption">Listado 9-1: Utilización del tipo de resultado</span>

source: <span class="caption">Listing 9-1: Using the `?` operator</span>
es: <span class="caption">Listado 9-1: Utilización del operador `?`</span>

source: Smart contracts possess several unique characteristics. They are **permissionless**, meaning anyone can deploy a smart contract on the network (within the context of a decentralized blockchain, of course). Smart contracts are also **transparent**; the data stored by the smart contract is accessible to anyone. The code that composes the contract can also be transparent, enabling **composability**. This allows developers to write smart contracts that use other smart contracts. Smart contracts can only access and interact with data from the blockchain they are deployed on. They require third-party softwares (called `oracles`) to access external data (the price of a token for instance).
es: Los contratos inteligentes poseen varias características únicas. Son **permissionless**, lo que significa que cualquiera puede desplegar un contrato inteligente en la red (dentro del contexto de una cadena de bloques descentralizada, por supuesto). Los contratos inteligentes también son **transparentes**; cualquiera puede acceder a los datos almacenados por el contrato inteligente. El código que compone el contrato también puede ser transparente, lo que permite la **composibilidad**. Esto permite a los desarrolladores escribir contratos inteligentes que utilicen otros contratos inteligentes. Los contratos inteligentes sólo pueden acceder e interactuar con los datos de la cadena de bloques en la que están desplegados. Requieren programas de terceros (llamados "oráculos") para acceder a datos externos (el precio de un token, por ejemplo).

source: Ethereum, being the most widely used and resilient smart-contract platform, became a victim of its own success. With the rapid adoption of some previously mentioned use cases, mainly DeFi, the cost of performing transactions became extremely high, rendering the network almost unusable. Engineers and researchers in the ecosystem began working on solutions to address this scalability issue. A famous theorem in the blockchain space states that it is impossible to achieve a high level of scalability, decentralization, and security simultaneously; trade-offs must be made. Ethereum is at the intersection of decentralization and security. Eventually, it was decided that Ethereum's purpose would be to serve as a secure settlement layer, while complex computations would be offloaded to other networks built on top of Ethereum. These are called Layer 2s (L2s). The two primary types of L2s are optimistic rollups and validity rollups. Both approaches involve compressing and batching numerous transactions together, computing the new state, and settling the result on Ethereum (L1). The difference lies in the way the result is settled on L1. For optimistic rollups, the new state is considered valid by default, but there is a 7-day window for nodes to identify malicious transactions. In contrast, validity rollups, such as Starknet, use cryptography to prove that the new state has been correctly computed. This is the purpose of STARKs, this cryptographic technology could permit validity rollups to scale significantly more than optimistic rollups. You can learn more about STARKs from Starkware's Medium [article](https://medium.com/starkware/starks-starkex-and-starknet-9a426680745a), which serves as a good primer.
es: Ethereum, siendo la plataforma de smart contracts más utilizada y resistente, se convirtió en víctima de su propio éxito. Con la rápida adopción de algunos de los casos de uso mencionados anteriormente, principalmente DeFi, el coste de realizar transacciones se volvió extremadamente elevado, haciendo que la red quedara prácticamente inutilizable. Los ingenieros e investigadores del ecosistema empezaron a trabajar en soluciones para resolver este problema de escalabilidad. Un famoso teorema en el ámbito de las cadenas de bloques afirma que es imposible lograr un alto nivel de escalabilidad, descentralización y seguridad simultáneamente; hay que hacer concesiones. Ethereum se encuentra en la intersección entre descentralización y seguridad. Finalmente, se decidió que el propósito de Ethereum sería servir como una capa de liquidación segura, mientras que los cálculos complejos se descargarían a otras redes construidas sobre Ethereum. Estas redes se denominan Capa 2 (L2). Los dos tipos principales de L2 son los rollups optimistas y los rollups de validez. Ambos enfoques implican comprimir y agrupar numerosas transacciones, calcular el nuevo estado y liquidar el resultado en Ethereum (L1). La diferencia radica en la forma en que el resultado se liquida en L1. En los rollups optimistas, el nuevo estado se considera válido por defecto, pero existe un plazo de 7 días para que los nodos identifiquen transacciones maliciosas. En cambio, los rollups de validez, como Starknet, utilizan la criptografía para demostrar que el nuevo estado se ha calculado correctamente. Este es el propósito de STARKs, esta tecnología criptográfica podría permitir a los rollups de validez escalar significativamente más que los rollups optimistas. Puedes aprender más sobre STARKs en el [artículo de Starkware en Medium](https://medium.com/starkware/starks-starkex-and-starknet-9a426680745a), que sirve como un buen manual.

source: Remember Cairo? It is, in fact, a language developed specifically to work with STARKs and make them general-purpose. With Cairo, we can write **provable code**. In the context of Starknet, this allows proving the correctness of computations from one state to another. Unlike most (if not all) of Starknet's competitors that chose to use the EVM (either as-is or adapted) as a base layer, Starknet employs its own VM. This frees developers from the constraints of the EVM, opening up a broader range of possibilities. Coupled with decreased transaction costs, the combination of Starknet and Cairo creates an exciting playground for developers. Native account abstraction enables more complex logic for accounts and transaction flows. Emerging use cases include **transparent AI** and artificial intelligence and machine learning applications. Finally, **blockchain games** can be developed entirely **on-chain**. Starknet has been specifically designed to maximize the capabilities of STARK proofs for optimal scalability.
es: ¿Recuerdas Cairo? Es, de hecho, un lenguaje desarrollado específicamente para trabajar con STARKs y hacerlos de propósito general. Con Cairo, podemos escribir **código demostrable**. En el contexto de Starknet, esto permite probar la corrección de los cálculos de un estado a otro. A diferencia de la mayoría (si no todos) de los competidores de Starknet que optaron por utilizar la EVM (tal cual o adaptada) como capa base, Starknet emplea su propia VM. Esto libera a los desarrolladores de las limitaciones de la EVM, abriendo un abanico más amplio de posibilidades. Junto con la disminución de los costes de transacción, la combinación de Starknet y Cairo crea un campo de juego apasionante para los desarrolladores. La abstracción nativa de cuentas permite una lógica más compleja para las cuentas y los flujos de transacciones. Entre los casos de uso emergentes se incluyen **AI transparente** y las aplicaciones de inteligencia artificial y aprendizaje automático. Por último, los **blockchain games** pueden desarrollarse completamente **en la cadena**. Starknet ha sido diseñado específicamente para maximizar las capacidades de las pruebas STARK para una escalabilidad óptima.

source: # Writing Starknet Contracts
es: # Escribiendo Contratos en Starknet

source: This chapter will guide you on how to create smart contracts in Cairo, and will clarify the distinction between Cairo programs and Starknet contracts.
es: Este capítulo te guiará sobre cómo crear contratos inteligentes en Cairo, y aclarará la distinción entre los programas de Cairo y los contratos de Starknet.

source: ## Cairo programs and Starknet contracts
es: ## Programas de Cairo y contratos Starknet

source: Starknet contracts are a special subset of Cairo programs, so the concepts previously learned in this book are still applicable to write Starknet contracts. As you may have already noticed, a Cairo program must always have a function `main` that serves as the entry point for this program:
es: Los contratos Starknet son un subconjunto especial de los programas Cairo, por lo que los conceptos aprendidos previamente en este libro siguen siendo aplicables para escribir contratos Starknet. Como ya habrás notado, un programa Cairo siempre debe tener una función `main` que sirve como punto de entrada para este programa:

source: Starknet contracts are essentially programs that can run on the Starknet OS, and as such, have access to Starknet's state. For a module to be handled as a contract by the compiler, it must be annotated with the `#[contract]` attribute:
es: Los contratos de Starknet son esencialmente programas que pueden ejecutarse en el SO de Starknet, y como tales, tienen acceso al estado de Starknet. Para que un módulo sea tratado como un contrato por el compilador, debe ser anotado con el atributo `#[contract]`:

source: <span class="caption">Listing 99-1: A simple naming service contract</span>
es: <span class="caption">Listado 9-1: Un contrato simple de servicio de nombres</span>

source: > Note: Starknet contracts are defined within [modules](./ch06-02-defining-modules-to-control-scope.md).
es: > NB: Los contratos Starknet se definen dentro de [modules](./ch06-02-defining-modules-to-control-scope.md).

source: ## Starknet Contract Attributes
es: ## Atributos del Contrato Starknet

source: Attributes are special annotations that modify the behavior of certain functions or methods. They are placed preceding a function and are denoted by the `#[]` symbol.
es: Los atributos son anotaciones especiales que modifican el comportamiento de determinadas funciones o métodos. Se colocan antes de una función y se indican con el símbolo `#[]`.

source: Here is a list of common attributes used in Starknet contracts:
es: He aquí una lista de atributos comunes utilizados en los contratos Starknet:

source: 1. `#[contract]`: This attribute is used to annotate a module to be compiled as a Starknet contract. The compiler recognizes this attribute and prepares the module with necessary contract elements, such as the logic to handle external contract calls or how to access storage variables. 2. `#[constructor]`: This attribute marks a function as a constructor. The constructor function is called only once upon deploying a contract, setting the initial state of the contract. 3. `#[external]`: This attribute marks a function as an external function. External functions can be called by other contracts or externally and can modify the contract's state. 4. `#[view]`: This attribute marks a function as a view function. View functions are read-only functions that allow you to access data from the contract, but prevent you from modifying the state of the blockchain. 5. `#[event]`: This is used to define events that can be emitted by the contract. 6. `#[l1_handler]`: This attribute is used to mark functions which can receive messages from L1s.
es: 1. `#[contract]`: Este atributo se utiliza para anotar un módulo para ser compilado como un contrato Starknet. El compilador reconoce este atributo y prepara el módulo con los elementos de contrato necesarios, como la lógica para manejar las llamadas externas del contrato o cómo acceder a las variables de almacenamiento. 2. `#[constructor]`: Este atributo marca una función como constructor. La función constructora es llamada sólo una vez al desplegar un contrato, estableciendo el estado inicial del contrato. 3. `#[external]`: Este atributo marca una función como función externa. Las funciones externas pueden ser llamadas por otros contratos o externamente y pueden modificar el estado del contrato. 4. `#[view]`: Este atributo marca una función como función de vista. Las funciones de vista son funciones de sólo lectura que permiten acceder a los datos del contrato, pero impiden modificar el estado de la blockchain. 5. `#[event]`: Se utiliza para definir eventos que pueden ser emitidos por el contrato. 6. `#[l1_handler]`: Este atributo se utiliza para marcar funciones que pueden recibir mensajes de los L1.

source: ## Storage Variables
es: ## Storage VariablesVariables de Almacenamiento

source: Storage variables allow you to store data that will be stored on the blockchain in the contract's storage. These data are persistent and can be accessed and modified anytime once the contract is deployed.
es: Las Storage variables o variables de Almacenamiento permiten guardar datos que se almacenarán en la blockchain en el almacenamiento del contrato. Estos datos son persistentes y se puede acceder a ellos y modificarlos en cualquier momento una vez desplegado el contrato.

source: <span class="caption">Listing 99-2: A Storage Struct</span>
es: <span class="caption">Listado 9-2: Una Estructura de Almacenamiento</span>

source: The storage struct is a [struct](./ch04-00-using-structs-to-structure-related-data.md) like any other, except that it allows you to define mappings using the `LegacyMap` type.
es: La estructura de almacenamiento es una [struct](./ch04-00-using-structs-to-structure-related-data.md) como cualquier otra, excepto que permite definir mapeos utilizando el tipo `LegacyMap`.

source: Mappings are a key-value data structure that you can use to store data within a smart contract. They are essentially hash tables that allow you to associate a unique key with a corresponding value. Mappings are also useful to store sets of data, as it's impossible to store arrays in storage.
es: Los mapeos son una estructura de datos clave-valor que puedes utilizar para almacenar datos dentro de un contrato inteligente. Son esencialmente tablas hash que te permiten asociar una clave única con un valor correspondiente. Los mapeos también son útiles para almacenar conjuntos de datos, ya que es imposible almacenar matrices en el almacenamiento.

source: A mapping is a variable of type LegacyMap, in which the key and value types are specified within angular brackets <>. It is important to note that the `LegacyMap` type can only be used inside the `Storage` struct, and can't be used to define mappings in user-defined structs. The syntax for declaring a mapping is as follows in Listing 99-2.
es: Un mapeo es una variable de tipo LegacyMap, en la que los tipos de clave y valor se especifican entre corchetes angulares <>. Es importante tener en cuenta que el tipo `LegacyMap` sólo se puede utilizar dentro de la estructura `Storage`, y no se puede utilizar para definir mapeos en estructuras definidas por el usuario. La sintaxis para declarar un mapeo es la siguiente en el Listado 9-2.

source: You can also create more complex mappings than that found in Listing 99-2 like the popular `allowances` storage variable in the ERC20 Standard which maps the `owner` and `spender` to the `allowance` using tuples:
es: También se pueden crear asignaciones más complejas que la del Listado 9-2, como la popular variable de almacenamiento `allowances` de la Norma ERC20, que asigna el `owner` y el `spender` a la `allowance` utilizando tuplas:

source: In mappings, the address of the value at key `k_1,...,k_n` is `h(...h(h(sn_keccak(variable_name),k_1),k_2),...,k_n)` where ℎ is the Pedersen hash and the final value is taken `mod2251−256`. You can learn more about the contract storage layout in the [Starknet Documentation](https://docs.starknet.io/documentation/architecture_and_concepts/Contracts/contract-storage/#storage_variables)
es: En los mapeos, la dirección del valor en la clave `k_1,...,k_n` es `h(...h(h(sn_keccak(nombre_variable),k_1),k_2),...,k_n)` donde ℎ es el hash de Pedersen y el valor final se toma `mod2251-256`. Puedes obtener más información sobre el esquema de almacenamiento de contratos en la [Documentación de Starknet](https://docs.starknet.io/documentation/architecture_and_concepts/Contracts/contract-storage/#storage_variables)

source: ### Reading from Storage
es: ### Lectura desde Storage

source: To read the value of the storage variable `names`, we call the `read` function on the `names` storage variable, passing in the key `_address` as a parameter.
es: Para leer el valor de la variable de almacenamiento `names`, llamamos a la función `read` sobre la variable de almacenamiento `names`, pasando la clave `_address` como parámetro.
