Repository: cairo-book/cairo-book
Catalog: po/*.po
Languages: es, id, ko, zh_cn

source: Additionally to those `20k wei`, as the `L1HandlerTransaction` that will be executed by the sequencer is not bound to any account (the message originates from L1), you must also ensure that you pay enough fees on L1 for your message to be deserialized and processed on L2.
zh_cn: 除了这 `20,000 wei` 之外，由于由序列器执行的 `L1HandlerTransaction` 不绑定到任何账户（消息源自 L1），你还必须确保在 L1 上支付足够的费用，以便你的消息在 L2 上被反序列化和处理。

source: The fees of the `L1HandlerTransaction` are computed in a regular manner as it would be done for an `Invoke` transaction. For this, you can profile the gas consumption using `starkli` or `snforge` to estimate the cost of your message execution.
zh_cn: `L1HandlerTransaction` 的费用计算方式与 `Invoke` 交易的计算方式相同。为此，你可以使用 `starkly` 或 `snforge` 对gas消耗进行分析，估算你的消息执行成本。

source: - `toAddress`: The contract address on L2 that will be called. - `selector`: The selector of the function of this contract at `toAddress`. This selector (function) must have the `#[l1_handler]` attribute to be callable. - `payload`: The payload is always an array of `felt252` (which are represented by `uint256` in solidity). For this reason we've inserted the input `myFelt` into the array. This is why we need to insert the input data into an array.
zh_cn: - `toAddress` : 在 L2 上将被调用的合约地址。 - `selector` : 位于 `toAddress` 上此合约函数的选择器。这个选择器（函数）必须具有 `#[l1_handler]` 属性以便被调用。 - `payload` : payload 始终是一个 `felt252` 数组（在 Solidity 中由 `uint256` 表示）。因此，我们将输入 `myFelt` 插入到数组中。这就是为什么我们需要将输入数据插入到数组中的原因。

source: ## Sending messages from Starknet to Ethereum
zh_cn: ## 从Starknet向以太坊发送信息

source: On L1, the important part is to build the same payload as on L2. Then you call `consumeMessageFromL2` by passing the L2 contract address and the payload. Please be aware that the L2 contract address expected by the `consumeMessageFromL2` is the contract address of the account that sends the transaction on L2, and not the address of the contract executing the `send_message_to_l1_syscall`.
zh_cn: 在L1上，重要的部分是构建与L2上相同的payload。然后，通过传递L2合约地址和payload来调用 `consumeMessageFromL2`。 请注意，`consumeMessageFromL2` 期望的L2合约地址是在L2上发送交易的账户的合约地址，而不是执行 `send_message_to_l1_syscall` 的合约的地址。

source: As you can see, in this context we don't have to verify which contract from L2 is sending the message. But we are actually using the `consumeMessageFromL2` to validate the inputs (the sender address on L2 and the payload) to ensure we are only consuming valid messages.
id: Seperti yang dapat Anda lihat, dalam konteks ini kita tidak perlu memverifikasi kontrak mana dari L2 yang mengirim pesan. Namun, kami sebenarnya menggunakan `consumeMessageFromL2` untuk memvalidasi masukan (alamat pengirim di L2 dan payload) untuk memastikan bahwa kami hanya mengonsumsi pesan yang valid.
zh_cn: 正如你所看到的，在这个上下文中，我们无需验证L2中的哪个合约正在发送消息。但实际上，我们使用 `consumeMessageFromL2` 来验证输入（在L2上的发送者地址和payload），以确保我们只处理有效的消息。

source: Before sending messages between L1 and L2, you must remember that Starknet contracts, written in Cairo, can only understand serialized data. And serialized data is always an array of `felt252`. On solidity, we have `uint256` type, and `felt252` are approximately 4 bits smaller than `uint256`. So we have to pay attention to the values contained in the payload of the messages we are sending. If, on L1, we build a message with values above the maximum `felt252`, the message will be stuck and never consumed on L2.
zh_cn: 在L1和L2之间发送消息之前，你必须记住，用Cairo编写的Starknet合约只能理解序列化数据。而序列化数据始终是一个`felt252`数组。 在Solidity中，我们有 `uint256` 类型，而 `felt252` 比 `uint256` 大约小4位。因此，我们必须注意我们发送的消息有效载荷中包含的值。 如果在L1上构建的消息的值超过了最大的 `felt252`，该消息将被卡住，无法在L2上被消耗。

source: # Security Considerations
es: # Consideraciones de Seguridad
zh_cn: # 安全考量

source: This chapter presents general recommendations for writing secure smart contracts. By incorporating these concepts during development, you can create robust and reliable smart contracts. This reduces the chances of unexpected behavior or vulnerabilities.
es: Este capítulo presenta recomendaciones generales para escribir contratos inteligentes seguros. Al incorporar estos conceptos durante el desarrollo, puedes crear contratos inteligentes robustos y confiables. Esto reduce las posibilidades de comportamientos inesperados o vulnerabilidades.
zh_cn: 本章介绍了编写安全智能合约的一般建议。在开发过程中，通过融入这些概念，你可以创建健壮可靠的智能合约。这将减少出现意外行为或漏洞的机会。

source: ## Disclaimer
es: ## Descargo de responsabilidad
zh_cn: ## 免责声明

source: ## Mindset
es: ## Mentalidad
zh_cn: ## 安全思维

source: Cairo is a highly safe language inspired by rust. It is designed in a way that force you to cover all possible cases. Security issues on Starknet mostly arise from the way smart contracts flows are designed, not much from the language itself.
es: Cairo es un lenguaje altamente seguro inspirado en rust. Está diseñado de forma que obliga a cubrir todos los casos posibles. Los problemas de seguridad en Starknet surgen principalmente de la forma en que se diseñan los flujos de contratos inteligentes, y no tanto del propio lenguaje.
zh_cn: Cairo 是一种受到 Rust 启发的高度安全的语言。它的设计方式强制你覆盖所有可能的情况。在 Starknet 上的安全问题主要源于智能合约流程的设计，而非语言本身。

source: ### Viewing smart contract as Finite State Machines
es: ### Ver los smart contracts como Finite State Machines
zh_cn: ### 将智能合约视为有限状态机

source: The `assert` or `panic` functions can be used to validate conditions before performing specific actions. You can learn more about these on the [Unrecoverable Errors with panic](./ch10-01-unrecoverable-errors-with-panic.md) page.
id: Fungsi `assert` atau `panic` dapat digunakan untuk memvalidasi kondisi sebelum melakukan tindakan tertentu. Anda dapat mempelajari lebih lanjut mengenai hal ini di halaman [Unrecoverable Errors with panic](./ch10-01-unrecoverable-errors-with-panic.md).
zh_cn: `assert` 或 `panic` 函数可以用于在执行特定操作之前验证条件。您可以在[无法恢复的错误与panic](./ch10-01-unrecoverable-errors-with-panic.md)页面上了解更多信息。

source: - Inputs provided by the caller - Execution requirements - Invariants (conditions that must always be true) - Return values from other function calls
es: - Entradas proporcionadas por el autor de la llamada - Requisitos de ejecución - Invariantes (condiciones que deben cumplirse siempre) - Valores de retorno de otras llamadas a funciones
zh_cn: - 调用者提供的输入参数 - 执行要求 - 不变量（必须始终为真的条件） - 其他函数调用的返回值

source: For example, you could use the `assert` function to validate that a user has enough funds to perform a withdraw transaction. If the condition is not met, the transaction will fail and the state of the contract will not change.
es: Por ejemplo, podría utilizar la función `assert` para validar que un usuario tiene fondos suficientes para realizar una transacción de retirada. Si la condición no se cumple, la transacción fallará y el estado del contrato no cambiará.
id: Sebagai contoh, Anda bisa menggunakan fungsi `assert` untuk memvalidasi bahwa seorang pengguna memiliki dana yang cukup untuk melakukan transaksi penarikan. Jika kondisi tidak terpenuhi, transaksi akan gagal dan status kontrak tidak akan berubah.
zh_cn: 例如，您可以使用 `assert` 函数来验证用户是否具有足够的资金执行提款交易。如果条件不满足，交易将失败，并且合约的状态不会发生变化。

source: ## Recommendations
es: ## Recomendaciones
zh_cn: ## 建议

source: ### Checks Effects Interactions Pattern
es: ### Comprueba Efectos Interacciones Patrón
zh_cn: ### 检查-效果-交互 模式

source: 1. **Checks**: Validate all conditions and inputs before performing any state changes. 2. **Effects**: Perform all state changes. 3. **Interactions**: All external calls to other contracts should be made at the end of the function.
es: 1. **Comprobaciones**: Validar todas las condiciones y entradas antes de realizar cualquier cambio de estado. 2. **Efectos**: Realizar todos los cambios de estado. 3. **Interacciones**: Todas las llamadas externas a otros contratos deben realizarse al final de la función.
zh_cn: 1. **Checks(检查)**: 在执行任何状态更改之前，验证所有条件和输入。 2. **Effects(效果)**: 执行所有状态更改。 3. **Interactions(交互)**: 所有对其他合约的外部调用应在函数的最后进行。

source: ### Access control
es: ### Control de Acceso
zh_cn: ### 访问控制

source: ### Static analysis tool
es: ### Herramienta de análisis estático
zh_cn: ### 静态分析工具

source: # Appendix
es: # Apéndice
zh_cn: # 附录

source: The following sections contain reference material you may find useful in your Cairo journey.
es: Las siguientes secciones contienen material de referencia que puede resultarle útil en su viaje a Cairo.
zh_cn: 以下章节包含的参考资料可能对您的Cairo之旅有所帮助。

source: ## Appendix A: Keywords
es: ## Apéndice A: Palabras Clave
zh_cn: ## 附录 A：关键字

source: The following list contains keywords that are reserved for current or future use by the Cairo language.
es: La siguiente lista contiene palabras clave que están reservadas para uso actual o futuro por el lenguaje Cairo por el lenguaje Cairo.
zh_cn: 下面的列表包含了为当前或未来保留的Cairo 语言的关键字。

source: - strict - reserved
zh_cn: - 严格（strict）关键字 - 保留（reserved）关键字

source: There is a third category, which are functions from the core library. While their names are not reserved, they are not recommended to be used as names of any items to follow good practices.
es: Hay una tercera categoría, que son funciones de la biblioteca central. Aunque sus nombres no están reservados no se recomienda utilizarlos como nombres de ningún elemento para seguir las buenas prácticas.
zh_cn: 还有第三类，是来自核心库的函数。虽然它们并不是保留关键字，但以遵循惯例不建议将其用作任何项的标识符。

source: ### Strict keywords
es: ### Palabras Clave Estrictas
zh_cn: ### 严格关键字

source: These keywords can only be used in their correct contexts. They cannot be used as names of any items.
es: Estas palabras clave sólo pueden utilizarse en sus contextos correctos. No pueden utilizarse como nombres de ningún elemento.
zh_cn: 这些关键词只能在其应该被使用的上下文中使用。 因此，这些关键字不能被用作标识符。

source: - `as` - Rename import - `break` - Exit a loop immediately - `const` - Define constant items - `continue` - Continue to the next loop iteration - `else` - Fallback for `if` and `if let` control flow constructs - `enum` - Define an enumeration - `extern` - Function defined at the compiler level using hint available at cairo1 level with this declaration - `false` - Boolean false literal - `fn` - Define a function - `if` - Branch based on the result of a conditional expression - `impl` - Implement inherent or trait functionality - `implicits` - Special kind of function parameters that are required to perform certain actions - `let` - Bind a variable - `loop` - Loop unconditionally - `match` - Match a value to patterns - `mod` - Define a module - `mut` - Denote variable mutability - `nopanic` - Functions marked with this notation mean that the function will never panic. - `of` - Implementation a trait - `ref` - Parameter passed implicitly returned at the end of a function - `return` - Return from function - `struct` - Define a structure - `trait` - Define a trait - `true` - Boolean true literal - `type` - Define a type alias - `use` - Bring symbols into scope
zh_cn: - `as` - 重命名导入 - `break` - 立即退出一个循环 - `const` - 定义常量项 - `continue` - 继续进行下一个循环迭代 - `else` - `if`和`if let`控制流结构的 fallback - `enum` - 定义一个枚举项 - `extern` - 于编译器层级使用此声明来表示此函数可使用Cairo1等级的hint - `false` - 布尔字面值假 - `fn` - 定义一个函数 - `if` - 基于条件表达式的结果分支 - `impl` - 实现自有或 ‘trait’ 功能 - `implicits` - 执行某些动作所需的特殊类型的函数参数 - `let` - 绑定一个变量 - `loop` -无条件地循环 - `match` - 模式匹配 - `mod` - 定义一个模块 - `mut` - 表示变量的可变性 - `nopanic` - 用这个符号标记的函数意味着该函数永远不会panic - `of` - 实现trait - `ref`- 通过引用绑定 - `return` - 从函数返回 - `struct` - 定义一个结构体 - `trait` - 定义一个trait - `true` - 布尔字面值真 - `type` - 定义一个类型的别名 - `use` - 引入外部空间的符号

source: ### Reserved keywords
es: ### Palabras Clave Reservadas
zh_cn: ### 保留关键字

source: These keywords aren't used yet, but they are reserved for future use. They have the same restrictions as strict keywords. The reasoning behind this is to make current programs forward compatible with future versions of Cairo by forbidding them to use these keywords.
es: Estas palabras clave aún no se utilizan, pero están reservadas para un uso futuro. Tienen las mismas restricciones que las palabras clave estrictas. El razonamiento detrás de esto es hacer que los programas actuales sean compatibles con futuras versiones de Cairo prohibiéndoles usar estas palabras clave.
zh_cn: 这些关键字还没有被使用，但它们被保留下来供将来使用。 它们与严格关键字有同样的限制。 禁止使用这些关键字的原因是为了可以使现在的程序向前兼容新版本的Cairo语言。

source: ### Built-in functions
es: ### Funciones incorporadas (Built-in)
zh_cn: ### 内置函数

source: -`assert` - This function checks a boolean expression, and if it evaluates to false, it triggers the panic function. -`panic` - This function terminates the program.
es: -`assert` - Esta función comprueba una expresión booleana, y si se evalúa como falsa, desencadena la función de pánico. -`panic` - Esta función termina el programa.
zh_cn: -`assert` - 这个函数检查一个布尔表达式，如果它的值是假的，就会触发panic函数。 -`panic` - 这个函数终止程序。

source: # Appendix B: Operators and Symbols
es: # Apéndice B: Operadores y Símbolos
zh_cn: # 附录B：运算符和符号

source: ## Operators
es: ## Operadores
zh_cn: ## 运算符

source: <span class="caption">Table B-1: Operators</span>
es: <span class="caption">Tabla B-1: Operadores</span>
zh_cn: <span class="caption">表B-1：运算符</span>

source: | Operator | Example | Explanation | Overloadable? | |----------|---------|-------------|---------------| | `!` | `!expr` | Bitwise or logical complement | `Not` | | `!=` | `expr != expr` | Non-equality comparison | `PartialEq` | | `%` | `expr % expr` | Arithmetic remainder | `Rem` | | `%=` | `var %= expr` | Arithmetic remainder and assignment | `RemEq` | | `&` | `expr & expr` | Bitwise AND | `BitAnd` | | `&&` | `expr && expr` | Short-circuiting logical AND | | | `*` | `expr * expr` | Arithmetic multiplication | `Mul` | | `*=` | `var *= expr` | Arithmetic multiplication and assignment | `MulEq` | | `@` | `@var` | Snapshot | | | `*` | `*var` | Desnap | | | `+` | `expr + expr` | Arithmetic addition | `Add` | | `+=` | `var += expr` | Arithmetic addition and assignment | `AddEq` | | `,` | `expr, expr` | Argument and element separator | | | `-` | `-expr` | Arithmetic negation | `Neg` | | `-` | `expr - expr` | Arithmetic subtraction | `Sub` | | `-=` | `var -= expr` | Arithmetic subtraction and assignment | `SubEq` | | `->` | `fn(...) -> type`, <code>&vert;...&vert; -> type</code> | Function and closure return type | | | `.` | `expr.ident` | Member access | | | `/` | `expr / expr` | Arithmetic division | `Div` | | `/=` | `var /= expr` | Arithmetic division and assignment | `DivEq` | | `:` | `pat: type`, `ident: type` | Constraints | | | `:` | `ident: expr` | Struct field initializer | | | `;` | `expr;` | Statement and item terminator | | | `<` | `expr < expr` | Less than comparison | `PartialOrd` | | `<=` | `expr <= expr` | Less than or equal to comparison | `PartialOrd` | | `=` | `var = expr` | Assignment | | | `==` | `expr == expr` | Equality comparison | `PartialEq` | | `=>` | `pat => expr` | Part of match arm syntax | | | `>` | `expr > expr` | Greater than comparison | `PartialOrd` | | `>=` | `expr >= expr` | Greater than or equal to comparison | `PartialOrd` | | `^` | `expr ^ expr` | Bitwise exclusive OR | `BitXor` | | <code>&vert;</code> | <code>expr &vert; expr</code> | Bitwise OR | `BitOr` | | <code>&vert;&vert;</code> | <code>expr &vert;&vert; expr</code> | Short-circuiting logical OR | |
zh_cn: | 运算符 | 示例 | 解释 | 是否可重载? | |----------|---------|-------------|---------------| | `!` | `!expr` | 位或逻辑补码 | `Not` | | `!=` | `expr != expr` | 不等于 | `PartialEq` | | `%` | `expr % expr` | 算数取余 | `Rem` | | `%=` | `var %= expr` | 算数取余并赋值 | `RemEq` | | `&` | `expr & expr` | 按位与 | `BitAnd` | | `&&` | `expr && expr` | 短路逻辑与 | | | `*` | `expr * expr` | 算数乘 | `Mul` | | `*=` | `var *= expr` | 算数乘并赋值 | `MulEq` | | `@` | `@var` | Snapshot | | | `*` | `*var` | Desnap | | | `+` | `expr + expr` | 算术加 | `Add` | | `+=` | `var += expr` | 算数加并赋值 | `AddEq` | | `,` | `expr, expr` | 参数和元素分隔符 | | | `-` | `-expr` | 算数负号 | `Neg` | | `-` | `expr - expr` | 算数减 | `Sub` | | `-=` | `var -= expr` | 算数减并赋值 | `SubEq` | | `->` | `fn(...) -> type`, <code>&vert;...&vert; -> type</code> | 函数与闭包的返回类型 | | | `.` | `expr.ident` | 成员访问 | | | `/` | `expr / expr` | 算数除 | `Div` | | `/=` | `var /= expr` | 算数除并赋值 | `DivEq` | | `:` | `pat: type`, `ident: type` | 约束条件 | | | `:` | `ident: expr` | 结构体字段初始化器 | | | `;` | `expr;` | 语句和条目结束符号 | | | `<` | `expr < expr` | 小于比较 | `PartialOrd` | | `<=` | `expr <= expr` | 小于等于比较 | `PartialOrd` | | `=` | `var = expr` | 赋值 | | | `==` | `expr == expr` | 等于比较 | `PartialEq` | | `=>` | `pat => expr` | 匹配分支的一部分语法 | | | `>` | `expr > expr` | 大于比较 | `PartialOrd` | | `>=` | `expr >= expr` | 大于等于比较 | `PartialOrd` | | `^` | `expr ^ expr` | 按位异或 | `BitXor` | | <code>&vert;</code> | <code>expr &vert; expr</code> | 按位或 | `BitOr` | | <code>&vert;&vert;</code> | <code>expr &vert;&vert; expr</code> | 短路逻辑或 | |

source: ## Non Operator Symbols
es: ## Símbolos No Operadores
zh_cn: ## 非运算符符号

source: <span class="caption">Table B-2: Stand-Alone Syntax</span>
es: <span class="caption">Tabla B-2: Sintaxis Autónoma</span>
zh_cn: <span class="caption">表B-2：独立语法</span>

source: | Symbol | Explanation | |--------|-------------| | `..._u8`, `..._usize`, etc. | Numeric literal of specific type | | `'...'` | Short string | | `_` | “Ignored” pattern binding; also used to make integer literals readable |
es: | Símbolo | Explicación | |---------|-------------| | `..._u8`, `..._usize`, etc. | Literal numérico de un tipo específico | | `'...'` | Cadena corta | | `_` | Enlace de patrón "ignorado"; también se usa para hacer que los literales enteros sean legibles |
zh_cn: | 符号 | 解释 | |--------|-------------| | `..._u8`, `..._usize`, 等等。| 指定类型的数值常量 | | `'...'` | 短字符串 | | `_` | "“忽略” 模式绑定；也用于增强整型字面值的可读性 |

source: <span class="caption">Table B-3: Path-Related Syntax</span>
es: <span class="caption">Tabla B-3: Sintaxis Relacionada con la Ruta</span>
zh_cn: <span class="caption">表B-3：路径相关语法</span>

source: | Symbol | Explanation | |--------|-------------| | `ident::ident` | Namespace path | | `super::path` | Path relative to the parent of the current module | | `trait::method(...)` | Disambiguating a method call by naming the trait that defines it |
es: | Símbolo | Explicación | |---------|-------------| | `ident::ident` | Ruta de espacio de nombres | | `super::path` | Ruta relativa al padre del módulo actual | | `trait::method(...)` | Desambiguación de una llamada de método nombrando la trait que lo define |
zh_cn: | 符号 | 解释 | |--------|-------------| | `ident::ident` | 命名空间路径 | | `super::path` | 相对于当前模块的父级路径。 | `trait::method(...)` | 通过命名定义该方法的trait来消除方法调用的二义性 |

source: <span class="caption">Table B-4: Generics</span>
es: <span class="caption">Tabla B-4: Genéricos</span>
zh_cn: <span class="caption">表 B-4：泛型</span>

source: | Symbol | Explanation | |--------|-------------| | `path<...>` | Specifies parameters to generic type in a type (e.g., `Vec<u8>`) | | `path::<...>`, `method::<...>` | Specifies parameters to generic type, function, or method in an expression; often referred to as turbofish | | `fn ident<...> ...` | Define generic function | | `struct ident<...> ...` | Define generic structure | | `enum ident<...> ...` | Define generic enumeration | | `impl<...> ...` | Define generic implementation |
es: | Símbolo | Explicación | |---------|-------------| | `path<...>` | Especifica parámetros para un tipo genérico en un tipo (por ejemplo, `Vec<u8>`) | | `path::<...>`, `method::<...>` | Especifica parámetros para un tipo genérico, función o método en una expresión; a menudo se le conoce como "turbofish" | | `fn ident<...> ...` | Define una función genérica | | `struct ident<...> ...` | Define una estructura genérica | | `enum ident<...> ...` | Define una enumeración genérica | | `impl<...> ...` | Define una implementación genérica |
zh_cn: | 符号 | 解释 | |--------|-------------| | `path<...>` | 为一个类型中的泛型指定具体参数（例如，`Vec<u8>`） | | `path::<...>`, `method::<...>` | 为一个泛型、函数或表达式中的方法指定具体参数; 通常被称为Turbofish。 | `fn ident<...>...` | 泛型函数定义 | `struct ident<...>...` | 泛型结构体定义 | `enum ident<...>...` | 泛型枚举定义 | `impl<...>...` | 定义泛型实现 |

source: <span class="caption">Table B-5: Macros and Attributes</span>
es: <span class="caption">Tabla B-5: Macros y Atributos</span>
zh_cn: <span class="caption">表B-5：宏和属性</span>

source: | Symbol | Explanation | |--------|-------------| | `#[meta]` | Outer attribute |
es: | Símbolo | Explicación | |---------|-------------| | `#[meta]` | Atributo externo |
zh_cn: | 符号 | 解释 | |--------|-------------| | `#[meta]` | 外部属性 |

source: <span class="caption">Table B-6: Comments</span>
es: <span class="caption">Tabla B-6: Comentarios</span>
zh_cn: <span class="caption">表B-6：注释</span>

source: | Symbol | Explanation | |--------|-------------| | `//` | Line comment |
es: | Símbolo | Explicación | |---------|-------------| | `//` | Comentario de línea |
zh_cn: | 符号 | 解释 | |--------|-------------| | `//` | 行注释 |

source: <span class="caption">Table B-7: Tuples</span>
es: <span class="caption">Tabla B-7: Tuplas<span>
zh_cn: <span class="caption">表B-7：元组</span>

source: | Symbol | Explanation | |--------|-------------| | `()` | Empty tuple (aka unit), both literal and type | | `(expr)` | Parenthesized expression | | `(expr,)` | Single-element tuple expression | | `(type,)` | Single-element tuple type | | `(expr, ...)` | Tuple expression | | `(type, ...)` | Tuple type | | `expr(expr, ...)` | Function call expression; also used to initialize tuple `struct`s and tuple `enum` variants |
es: | Símbolo | Explicación | |---------|-------------| | `()` | Tupla vacía (también conocida como unidad), tanto como literal como tipo | | `(expr)` | Expresión entre paréntesis | | `(expr,)` | Expresión de tupla de un solo elemento | | `(type,)` | Tipo de tupla de un solo elemento | | `(expr, ...)` | Expresión de tupla | | `(type, ...)` | Tipo de tupla | | `expr(expr, ...)` | Expresión de llamada de función; también se usa para inicializar estructuras de tuplas y variantes de tuplas de enumeraciones |
zh_cn: | 符号 | 解释 | |--------|-------------| | `()` | 空元组（又称单元），空元组（亦称单元），即是字面值也是类型 | | `(expr)` | 括号表达式 | | `(expr,)` | 单元素元组表达式 | | `(type,)` | 单元素元组类型 | | `(expr, ...)` | 元组表达式 | `(type, ...)` | 元组类型 | | `expr(expr, ...)` | 函数调用表达式；也用于初始化元组`struct`和元组`enum`变体

source: <span class="caption">Table B-8: Curly Brackets</span>
es: <span class="caption">Tabla B-8: Corchetes</span>
zh_cn: <span class="caption">表B-8：大括号</span>

source: | Context | Explanation | |---------|-------------| | `{...}` | Block expression | | `Type {...}` | `struct` literal |
es: | Contexto | Explicación | |----------|-------------| | `{...}` | Expresión de bloque | | `Type {...}` | Literal de `struct` |
zh_cn: | 上下文 | 解释 | |---------|-------------| | `{...}` | 块表达式 | | `Type {...}` | `struct`字面值 |

source: # Appendix C: Derivable Traits
es: # Apéndice C: Traits Derivables
zh_cn: # 附录C: 可派生的 Trait

source: The list of derivable traits provided in this appendix does not encompass all possibilities: external libraries can implement `derive` for their own traits, expanding the list of traits compatible with `derive`.
es: La lista de traits derivables proporcionada en este apéndice no abarca todas las posibilidades: las bibliotecas externas pueden implementar `derive` para sus propios rasgos, ampliando la lista de rasgos compatibles con `derive`.
id: Daftar trait yang dapat diterapkan yang disediakan dalam lampiran ini tidak mencakup semua kemungkinan: pustaka eksternal dapat mengimplementasikan `derive` untuk trait mereka sendiri, yang memperluas daftar trait yang kompatibel dengan `derive`.
zh_cn: 本附录所提供的可派生 trait 列表并不全面：库可以为其自己的 trait 实现 `derive`，可以使用 `derive` 的 trait 列表事实上是无限的。

source: ## PartialEq for equality comparison
es: ## PartialEq para comparación de igualdad
zh_cn: ## 等值比较的 PartialEq 和 Eq

source: ## Clone and Copy for Duplicating Values
es: ## Clonar y Copiar para Duplicar Valores
zh_cn: ## 复制值的 Clone 和 Copy

source: ## Serializing with Serde
es: ## Serializar con Serde
zh_cn: ## 用Serde进行序列化

source: ## Drop and Destruct
es: ## Drop y Destruct
zh_cn: ## Drop 和 Destruct

source: ## Store
zh_cn: ## 存储
