Repository: cairo-book/cairo-book
Catalog: po/*.po
Languages: es, id, ko, zh_cn

source: <span class="caption">Listing 99-3: Calling the `read` function on the `names` variable</span>
es: <span class="caption">Listado 9-3: Llamada a la función `read` sobre la variable `names`</span>

source: > Note: When the storage variable does not store a mapping, its value is accessed without passing any parameters to the read method
es: > Nota: Cuando la variable de almacenamiento no almacena una asignación, se accede a su valor sin pasar ningún parámetro al método de lectura

source: ### Writing to Storage
es: ### Escritura en Storage

source: To write a value to the storage variable `names`, we call the `write` function on the `names` storage variable, passing in the key and values as arguments.
es: Para escribir un valor en la variable de almacenamiento `names`, llamamos a la función `write` en la variable de almacenamiento `names`, pasando la clave y los valores como argumentos.

source: <span class="caption">Listing 99-4: Writing to the `names` variable</span>
es: <span class="caption">Listado 9-4: Escribir en la variable `names`</span>

source: In this section, we are going to be looking at some popular function types you'd encounter with most contracts:
es: En esta sección, vamos a ver algunos tipos de funciones populares que se encuentran en la mayoría de los contratos:

source: Constructors are a special type of function that runs only once when deploying a contract, and can be used to initialize the state of the contract.
es: Los constructores son un tipo especial de función que sólo se ejecuta una vez al desplegar un contrato, y pueden utilizarse para inicializar el estado del contrato.

source: 1. Your contract can't have more than one constructor. 2. Your constructor function must be named `constructor`. 3. Lastly, it must be annotated with the `#[constructor]` attribute.
es: 1. Tu contrato no puede tener más de un constructor. 2. Tu función constructora debe llamarse `constructor`. 3. Por último, debe estar anotada con el atributo `#[constructor]`.

source: ### 2. External functions
es: ### 2. Funciones Externas

source: External functions are functions that can modify the state of a contract. They are public and can be called by any other contract or externally. You can define external functions by annotating them with the `#[external]` attribute:
es: Las funciones externas son funciones que pueden modificar el estado de un contrato. Son públicas y pueden ser llamadas por cualquier otro contrato o externamente. Puedes definir funciones externas anotándolas con el atributo `#[external]`:

source: ### 3. View functions
es: ### 3. Ver funciones

source: View functions are read-only functions allowing you to access data from the contract while ensuring that the state of the contract is not modified. They can be called by other contracts or externally. You can define view functions by annotating them with the `#[view]` attribute:
es: Las funciones de vista son funciones de sólo lectura que permiten acceder a los datos del contrato garantizando al mismo tiempo que no se modifica el estado del contrato. Pueden ser llamadas por otros contratos o externamente. Puedes definir funciones de vista anotándolas con el atributo `#[view]`:

source: ```rust #[view] fn get_name(_address: ContractAddress) -> felt252 { let name = names::read(_address); return name; } ```
es: ```rust #[external] fn store_name(_name: felt252) { let caller = get_caller_address(); names::write(caller, _name); StoredName(caller, _name); } ```

source: > **Note:** It's important to note that, both external and view functions are public. To create an internal function in a contract, you simply don't annotate it with any attribute.
es: > **Nota:** Es importante tener en cuenta que, tanto las funciones externas como las de vista son públicas. Para crear una función interna en un contrato, simplemente no la anotes con ningún atributo.

source: An event is defined as an empty function annotated with the `#[event]` attribute. The parameters of this function are the data that will be emitted by the event.
es: Un evento se define como una función vacía anotada con el atributo `#[evento]`. Los parámetros de esta función son los datos que serán emitidos por el evento.

source: In Listing 99-1, `StoredName` is an event that emits information when names are stored in the contract:
es: En el Listado 9-1, `StoredName` es un evento que emite información cuando se almacenan nombres en el contrato:

source: We pass in the emitted data types as parameters within the parentheses. In this example, our event will emit the contract address of the caller and the name stored within the contract.
es: Pasamos los tipos de datos emitidos como parámetros dentro de los paréntesis. En este ejemplo, nuestro evento emitirá la dirección del contrato de la persona que llama y el nombre almacenado en el contrato.

source: After defining events, we can emit them by simply calling the event name like we'll call functions, passing in the values to be emitted as parameters:
es: Después de definir los eventos, podemos emitirlos simplemente llamando al nombre del evento como llamaremos a las funciones, pasando los valores a emitir como parámetros:

source: The ability of contracts to interact with other smart contracts on the blockchain is a common pattern found in smart contract development.
es: La capacidad de los contratos para interactuar con otros contratos inteligentes en la cadena de bloques es un patrón común en el desarrollo de contratos inteligentes.

source: This chapter covers how cross-contract interactions between Starknet contracts can be achieved. Specifically, you'll learn about ABIs, contract interfaces, the contract and library dispatchers and their low-level system call equivalents!
es: Este capítulo cubre cómo se pueden lograr interacciones entre contratos multicapa en Starknet. Específicamente, ¡Aprenderá sobre ABIs, interfaces de contrato, los despachadores de contratos y bibliotecas y sus equivalentes de llamadas al sistema de nivel inferior!

source: An interface is a list of a contract's function definitions without implementations. In other words, an interface specifies the function declarations (name, parameters, visibility and return value) contained in a smart contract without including the function body.
es: Una interfaz es una lista de definiciones de funciones de un contrato sin implementaciones. En otras palabras, una interfaz especifica las declaraciones de función (nombre, parámetros, visibilidad y valor de retorno) contenidas en un contrato inteligente sin incluir el cuerpo de la función.

source: Interfaces in Cairo are traits with the `#[abi]` attribute. If you are new to traits, check out the dedicated chapter on [traits](./ch07-02-traits-in-cairo.md).
es: Las interfaces en Cairo son traits con el atributo `[abi]`. Si eres nuevo en los traits, consulta el capítulo dedicado a [traits](./ch07-02-traits-in-cairo.md).

source: For your Cairo code to qualify as an interface, it must meet the following requirements:
es: Para que tu código de Cairo califique como una interfaz, debe cumplir con los siguientes requisitos:

source: 1. Must be appended with the `#[abi]` attribute. 2. Your interface functions should have no implementations. 3. You must explicitly declare the function's decorator. 4. Your interface should not declare a constructor. 5. Your interface should not declare state variables.
es: 1. Debe estar marcado con el atributo `[abi]`. 2. Las funciones de tu interfaz no deben tener implementaciones. 3. Debes declarar explícitamente el decorador de la función. 4. Tu interfaz no debe declarar un constructor. 5. Tu interfaz no debe declarar variables de estado.

source: Here's a sample interface for an ERC20 token contract:
es: Aquí hay un ejemplo de una interfaz para un contrato de token ERC20:

source: ABI stands for Application Binary Interface. ABIs gives a smart contract the ability to communicate and interact with external applications or other smart contracts. ABIs can be likened to APIs in traditional web development, which helps data flow between applications and servers.
es: ABI significa Interfaz Binaria de Aplicaciones. Los ABI dan a un contrato inteligente la capacidad de comunicarse e interactuar con aplicaciones externas u otros contratos inteligentes. Los ABI se pueden comparar con las API en el desarrollo web tradicional, que ayudan al flujo de datos entre aplicaciones y servidores.

source: While we write our smart contract logics in high-level Cairo, they are stored on the VM as executable bytecodes which are in binary formats. Since this bytecode is not human readable, it requires interpretation to be understood. This is where ABIs come into play, defining specific methods which can be called to a smart contract for execution.
es: Si bien escribimos nuestras lógicas de contrato inteligente en Cairo de alto nivel, se almacenan en la VM como bytecodes ejecutables que están en formatos binarios. Dado que este bytecode no es legible por humanos, requiere interpretación para ser entendido. Aquí es donde entran en juego los ABI, definiendo métodos específicos que se pueden llamar a un contrato inteligente para su ejecución.

source: Every contract on Starknet has an Application Binary Interface (ABI) that defines how to encode and decode data when calling its methods.
es: Cada contrato en Starknet tiene una Interfaz Binaria de Aplicaciones (ABI) que define cómo codificar y decodificar datos al llamar a los métodos del contrato inteligente.

source: In the next chapter, we are going to be looking into how we can call other smart contracts using a `Contract Dispatcher`, `Library Dispatcher`, and `System calls`.
es: En el próximo capítulo, veremos cómo podemos llamar a otros contratos inteligentes utilizando un `Contract Dispatcher`, un `Library Dispatcher`, y `System calls`.

source: # Contract Dispatcher, Library Dispatcher and System calls
es: # Despachador de Contratos, Despachador de Bibliotecas y Llamadas del Sistema

source: Each time a contract interface is created on Starknet, two dispatchers are automatically created and exported:
es: Cada vez que se crea una interfaz de contrato en Starknet, se crean automáticamente y exportan dos despachadores:

source: 1. The Contract Dispatcher 2. The Library Dispatcher
es: 1. El Despachador de Contratos 2. El Despachador de Bibliotecas

source: In this chapter, we are going to extensively discuss how these dispatchers work and their usage.
es: En este capítulo, discutiremos en detalle cómo funcionan estos despachadores y su uso.

source: Traits annotated with the `#[abi]` attribute are programmed to automatically generate and export the relevant dispatcher logic on compilation. The compiler also generates a new trait, two new structs (one for contract calls, and the other for library calls) and their implementation of this trait. Our interface is expanded into something like this:
es: Los traits anotados con el atributo `#[abi]` están programados para generar y exportar automáticamente la lógica del dispatcher relevante en la compilación. El compilador también genera un nuevo trait, dos nuevos structs (uno para llamadas a contratos y otro para llamadas a librerías) y su implementación de este trait. Nuestra interfaz se expande en algo como esto:

source: **Note:** The expanded code for our IERC20 interface is a lot longer, but to keep this chapter concise and straight to the point, we focused on one view function `get_name`, and one external function `transfer`.
es: **Nota:** El código expandido para nuestra interfaz IERC20 es mucho más robusto, pero para mantener este capítulo conciso y al grano, nos enfocamos en una función de vista `get_name` y una función externa `transfer`.

source: This is an example of a contract named `Dispatcher` using the Contract interface dispatcher to call an ERC-20 contract in the ERC-20 contract's context and, in the case of `transfer_token`, altering the state of the ERC-20 contract:
es: Este es un ejemplo de un contrato llamado `Dispatcher` que utiliza la interfaz Contract dispatcher para llamar a un contrato ERC-20 en el contexto del contrato ERC-20 y, en el caso de `transfer_token`, alterar el estado del contrato ERC-20:

source: As you can see, we had to first import the `IERC20DispatcherTrait` and `IERC20Dispatcher` which was generated and exported on compiling our interface, then we make calls to the methods implemented for the `IERC20Dispatcher` struct (`name`, `transfer`, etc), passing in the `contract_address` parameter which represents the address of the contract we want to call.
es: Como se puede observar, primero tuvimos que importar `IERC20DispatcherTrait` e `IERC20Dispatcher`, los cuales fueron generados y exportados al compilar nuestra interfaz. Luego realizamos llamadas a los métodos implementados para la estructura `IERC20Dispatcher` (`name`, `transfer`, etc.), pasando el parámetro `contract_address` que representa la dirección del contrato que queremos llamar.

source: The key difference between the contract dispatcher and the library dispatcher is that while the contract dispatcher calls an external contract's logic in the external contract's context, the library dispatcher calls the target contract's classhash, whilst executing the call in the calling contract's context. So unlike the contract dispatcher, calls made using the library dispatcher have no possibility of tampering with the target contract's state.
es: La diferencia clave entre el despachador de contratos y el despachador de librerías es que mientras el despachador de contratos llama a la lógica de un contrato externo en el contexto del contrato externo, el despachador de librerías llama al classhash del contrato destino, mientras ejecuta la llamada en el contexto del contrato que llama. Por lo tanto, a diferencia del despachador de contratos, las llamadas realizadas mediante el despachador de bibliotecas no tienen la posibilidad de alterar el estado del contrato de destino.

source: As stated in the previous chapter, contracts annotated with the `#[abi]` macro on compilation generates a new trait, two new structs (one for contract calls, and the other for library calls) and their implementation of this trait. The expanded form of the library traits looks like:
es: Como se indicó en el capítulo anterior, los contratos anotados con la macro `#[abi]` en la compilación generan un nuevo trait, dos nuevas estructuras (una para llamadas a contratos y otra para llamadas a bibliotecas) y su implementación de este trait. La forma expandida de los traits de biblioteca se ve así:

source: Below's a sample code on calling contracts using the Library Dispatcher:
es: A continuación se muestra un código de muestra sobre cómo llamar a contratos utilizando el Dispatcher de Biblioteca:

source: As you can see, we had to first import the `IERC20DispatcherTrait` and `IERC20LibraryDispatcher` which was generated and exported on compiling our interface, then we make calls to the methods implemented for the `IERC20LibraryDispatcher` struct (`name`, `transfer`, etc), passing in the `class_hash` parameter which represents the class of the contract we want to call.
es: Como se puede ver, primero tuvimos que importar `IERC20DispatcherTrait` e `IERC20LibraryDispatcher`, los cuales fueron generados y exportados al compilar nuestra interfaz. Luego realizamos llamadas a los métodos implementados para la estructura `IERC20LibraryDispatcher` (`name`, `transfer`, etc.), pasando el parámetro `class_hash` que representa la clase del contrato que queremos llamar.

source: ## Calling Contracts using low-level System calls
es: ## Llamando a Contratos usando llamadas de Sistema de bajo nivel

source: Another way to call other contracts is to use the `starknet::call_contract_syscall` system call. The Dispatchers we described in the previous sections are high-level syntaxes for this low-level system call.
es: Otra forma de llamar a otros contratos es mediante la llamada de sistema `starknet::call_contract_syscall`. Los Dispatchers que describimos en las secciones anteriores son sintaxis de alto nivel para esta llamada de sistema de bajo nivel.

source: Using the system call `starknet::call_contract_syscall` can be handy for customized error handling or possessing more control over the serialization/deserialization of the call data and the returned data. Here's an example demonstrating a low-level `transfer` call:
es: El uso de la llamada de sistema `starknet::call_contract_syscall` puede ser útil para la personalización del manejo de errores o para tener más control sobre la serialización/deserialización de los datos de llamada y los datos devueltos. Aquí hay un ejemplo que demuestra una llamada de `transfer` de bajo nivel:

source: <span class="caption">Listing 99-9: A sample contract implementing system calls</span>
es: <span class="caption">Listado 9-9 Un contrato de muestra que implementa llamadas de sistema</span>

source: As you can see, rather than pass our function arguments directly, we passed in the contract address, function selector (which is a keccak hash of the function name), and the calldata (function arguments). At the end, we get returned a serialized value which we'll need to deserialize ourselves!
es: Como se puede ver, en lugar de pasar nuestros argumentos de función directamente, pasamos la dirección del contrato, el selector de la función (que es un hash keccak del nombre de la función) y los datos de llamada (argumentos de función). Al final, ¡Se nos devuelve un valor serializado que tendremos que deserializar nosotros mismos!

source: The `assert` or `panic` functions can be used to validate conditions before performing specific actions. You can learn more about these on the [Unrecoverable Errors with panic](./ch09-01-unrecoverable-errors-with-panic.md) page.
es: Las funciones `assert` o `panic` pueden utilizarse para validar condiciones antes de realizar acciones específicas. Puede obtener más información sobre ellas en la página [Errores irrecuperables con pánico](./ch09-01-unrecoverable-errors-with-panic.md).

source: <!-- TODO add reference to the reentrancy CairoByExample page -->
es: <!-- TODO añadir referencia a la página de reentrada CairoByExample -->

source: - `as` - Rename import - `break` - Exit a loop immediately - `const` - Define constant items - `continue` - Continue to the next loop iteration - `else` - Fallback for `if` and `if let` control flow constructs - `enum` - Define an enumeration - `extern` - Function defined at the compiler level using hint available at cairo1 level with this declaration - `false` - Boolean false literal - `fn` - Define a function - `if` - Branch based on the result of a conditional expression - `impl` - Implement inherent or trait functionality - `implicits` - Special kind of function parameters that are required to perform certain actions - `let` - Bind a variable - `loop` - Loop unconditionally - `match` - Match a value to patterns - `mod` - Define a module - `mut` - Denote variable mutability - `nopanic` - Functions marked with this notation mean that the function will never panic. - `of` - Implement a trait - `ref` - Bind by reference - `return` - Return from function - `struct` - Define a structure - `trait` - Define a trait - `true` - Boolean true literal - `type` - Define a type alias - `use` - Bring symbols into scope
es: - `as` - Renombrar importación - `break` - Salir inmediatamente de un bucle - `const` - Definir elementos constantes - `continue` - Continúa con la siguiente iteración del bucle - `else` - Fallback para construcciones de flujo de control `if` y `if let` - `enum` - Define una enumeración - `extern` - Función definida a nivel de compilador utilizando una sugerencia disponible a nivel de cairo1 con esta declaración - `false` - Literal booleano falso - `fn` - Define una función - `if` - Rama basada en el resultado de una expresión condicional - `impl` - Implementa funcionalidad inherente o trait - `implicits` - Parámetros de función de tipo especial necesarios para realizar ciertas acciones - `let` - Vincular una variable - `loop` - Hacer un bucle incondicional - `match` - Comparar un valor con patrones - `mod` - Definir un módulo - `mut` - Denota mutabilidad de variables - `nopanic` - Las funciones marcadas con esta notación significan que la función nunca entrará en pánico. - `of` - Implementar un trait - `ref` - Vincular por referencia - `return` - Retorno de una función - `struct` - Define una estructura - `trait` - Define un trait - `true` - Literal booleano verdadero - `type` - Definir un alias de tipo - `use` - Introducir símbolos
