Repository: cairo-book/cairo-book
Catalog: po/*.po
Languages: es, id, ko, zh_cn

source: Storage mappings are similar to hash tables in that they allow mapping keys to values. However, unlike a typical hash table, the key data itself is not stored - only its hash is used to look up the associated value in the contract's storage. Mappings do not have a concept of length or whether a key/value pair is set. The only way to remove a mapping is to set its value to the default zero value.
id: Pemetaan penyimpanan mirip dengan tabel hash karena memungkinkan pemetaan kunci ke nilai. Namun, tidak seperti tabel hash biasa, data kunci itu sendiri tidak disimpan - hanya hash-nya yang digunakan untuk mencari nilai yang terkait di penyimpanan kontrak. Pemetaan tidak memiliki konsep panjang atau apakah sepasang kunci/nilai diatur. Satu-satunya cara untuk menghapus sebuah pemetaan adalah dengan mengatur nilainya menjadi nilai nol default.
ko: 저장 매핑은 키를 값에 매핑하는 해시 테이블과 유사합니다. 그러나 일반 해시 테이블과 달리 키 데이터 자체가 저장되지 않습니다. 연관된 값은 계약의 저장소에서 찾을 때 해시만 사용됩니다. 매핑에는 길이 개념이나 키/값 쌍이 설정되었는지 여부가 없습니다. 매핑을 제거하는 유일한 방법은 해당 값을 기본 제로 값으로 설정하는 것입니다.

source: Mappings are only used to compute the location of data in the storage of a contract given certain keys. They are thus **only allowed as storage variables**. They cannot be used as parameters or return parameters of contract functions, and cannot be used as types inside structs.
id: Pemetaan hanya digunakan untuk menghitung lokasi data dalam penyimpanan kontrak dengan menggunakan kunci tertentu. Oleh karena itu, pemetaan **hanya diperbolehkan sebagai variabel penyimpanan**. Mereka tidak dapat digunakan sebagai parameter atau parameter pengembalian dari fungsi kontrak, dan tidak dapat digunakan sebagai tipe dalam struktur data.
ko: 매핑은 특정 키가 주어졌을 때 계약의 저장소 내 데이터 위치를 계산하는 데에만 사용됩니다. 따라서 매핑은 **저장 변수로만 허용**됩니다. 매핑은 계약 함수의 매개변수나 반환 매개변수로 사용할 수 없으며, 구조체 내부의 유형으로 사용할 수도 없습니다.

source: To declare a mapping, use the `LegacyMap` type enclosed in angle brackets `<>`, specifying the key and value types.
id: Untuk mendeklarasikan sebuah pemetaan, gunakan tipe `LegacyMap` yang diapit oleh tanda kurung sudut `<>`, dengan menentukan tipe kunci dan tipe nilai.
ko: 매핑을 선언하려면 각괄호 `<>`로 둘러싸인 `LegacyMap` 유형을 사용하고 키와 값 유형을 지정하십시오.

source: You can also create more complex mappings with multiple keys. You can find one in Listing 99-4 like the popular `allowances` storage variable in the ERC20 Standard which maps an `owner` and an allowed `spender` to its `allowance` amount using multiple keys passed inside a tuple:
ko: 여러 개의 키를 사용하여 더 복잡한 매핑을 생성할 수도 있습니다. 99-4 목록에서 인기 있는 `allowances` 저장 변수와 같은 매핑을 찾을 수 있습니다. ERC20 표준에서는 `owner`와 허용된 `spender`를 `allowance` 금액에 매핑하는 데 튜플 내에 전달된 여러 개의 키를 사용합니다.

source: Listing 99-4: Storing mappings
ko: 리스트 99-4: 매핑 저장하기

source: The address in storage of a variable stored in a mapping is computed according to the description in the [Storage Addresses](#storage-addresses) section. If the key of a mapping is a struct, each element of the struct constitutes a key. Moreover, the struct should implement the `Hash` trait, which can be derived with the `#[derive(Hash)]` attribute. For example, if you have struct with two fields, the address will be `h(h(sn_keccak(variable_name),k_1),k_2)` - where `k_1` and `k_2` are the values of the two fields of the struct.
id: Alamat di penyimpanan dari variabel yang disimpan dalam pemetaan dihitung sesuai dengan deskripsi dalam bagian [Alamat Penyimpanan](#storage-addresses). Jika kunci dari suatu pemetaan adalah struktur, setiap elemen dari struktur tersebut menjadi kunci. Selain itu, struktur harus mengimplementasikan trait `Hash`, yang dapat diturunkan dengan atribut `#[derive(Hash)]`. Sebagai contoh, jika Anda memiliki struktur dengan dua bidang, alamatnya akan menjadi `h(h(sn_keccak(nama_variabel),k_1),k_2)` - di mana `k_1` dan `k_2` adalah nilai dari dua bidang struktur tersebut.
ko: 매핑에 저장된 변수의 저장 주소는 [Storage Addresses](#storage-addresses) 섹션에 설명된대로 계산됩니다. 매핑의 키가 구조체인 경우, 구조체의 각 요소가 키를 구성합니다. 또한, 구조체는 `Hash` 트레이트를 구현해야 하며, `#[derive(Hash)]` 속성을 사용하여 파생될 수 있습니다. 예를 들어, 두 개의 필드가 있는 구조체가 있다면, 주소는 `h(h(sn_keccak(variable_name),k_1),k_2)`가 됩니다 - 여기서 `k_1`과 `k_2`는 구조체의 두 필드의 값입니다.

source: Similarly, in the case of a nested mapping such as `LegacyMap((ContractAddress, ContractAddress), u8)`, the address will be computed in the same way: `h(h(sn_keccak(variable_name),k_1),k_2)`.
id: Demikian juga, dalam kasus pemetaan bertingkat seperti `LegacyMap((ContractAddress, ContractAddress), u8)`, alamatnya akan dihitung dengan cara yang sama: `h(h(sn_keccak(nama_variabel),k_1),k_2)`.
ko: 비슷하게, `LegacyMap((ContractAddress, ContractAddress), u8)`와 같이 중첩된 매핑의 경우에도 주소는 동일한 방식으로 계산될 것입니다: `h(h(sn_keccak(variable_name),k_1),k_2)`.
zh_cn: 类似地，对于嵌套映射，例如 `LegacyMap((ContractAddress, ContractAddress), u8)`，地址将以相同的方式计算：`h(h(sn_keccak(variable_name),k_1),k_2)`。

source: For more details about the contract storage layout in the [Starknet Documentation](https://docs.starknet.io/documentation/architecture_and_concepts/Smart_Contracts/contract-storage/#storage_variables)
ko: 더 많은 세부 정보는 [Starknet Documentation](https://docs.starknet.io/documentation/architecture_and_concepts/Smart_Contracts/contract-storage/#storage_variables)의 계약 저장 레이아웃을 참조하세요.
zh_cn: 如果你想了解更多关于合约存储布局的细节，可以访问 [Starknet 文档](https://docs.starknet.io/documentation/architecture_and_concepts/Smart_Contracts/contract-storage/#storage_variables)

source: In this section, we are going to be looking at the different types of functions you could encounter in contracts:
id: Pada bagian ini, kita akan melihat berbagai jenis fungsi yang mungkin Anda temui dalam kontrak:
ko: 이 섹션에서는 계약서에서 만날 수 있는 다양한 유형의 기능을 살펴볼 것입니다.
zh_cn: 在本节中，我们将了解合约中可能遇到的不同类型的函数：

source: 1. Constructors
ko: 1. 생성자

source: Constructors are a special type of function that only runs once when deploying a contract, and can be used to initialize the state of a contract.
id: Constructors adalah jenis fungsi khusus yang hanya dijalankan sekali saat mendeploy kontrak, dan dapat digunakan untuk menginisialisasi status kontrak.
ko: 생성자는 계약을 배포할 때 한 번만 실행되는 특별한 유형의 함수로, 계약의 상태를 초기화하는 데 사용할 수 있습니다.
zh_cn: 构造函数是一种特殊类型的函数，只在部署合约时运行一次，可用于初始化合约的状态。

source: Some important rules to note:
es: Algunas reglas importantes a tener en cuenta:
id: Beberapa aturan penting yang perlu diperhatikan:
ko: 주의할 중요한 규칙 몇 가지:
zh_cn: 一些需要注意的重要规则：

source: Your contract can't have more than one constructor.
id: Kontrak Anda tidak boleh memiliki lebih dari satu konstruktor.
ko: 귀하의 계약에는 둘 이상의 생성자가 있을 수 없습니다.

source: Your constructor function must be named `constructor`.
id: Fungsi konstruktor Anda harus diberi nama `constructor`.
ko: 생성자 함수는 `constructor`로 명명되어야 합니다.

source: It must be annotated with the `#[constructor]` attribute.
id: Harus diberi anotasi dengan atribut `#[constructor]`.
ko: `#[constructor]` 속성으로 주석이 달려 있어야 합니다.

source: 2. Public functions
ko: 2. 공공 기능

source: As stated previously, public functions are accessible from outside of the contract. They must be defined inside an implementation block annotated with the `#[abi(embed_v0)]` attribute. This attribute means that all functions embedded inside it are implementations of the Starknet interface, and therefore entry points of the contract. It only affects the visibility (public vs private/internal), but it doesn't inform us on the ability of these functions to modify the state of the contract.
ko: 이전에 언급한 대로, 공개 함수는 계약 외부에서 접근할 수 있습니다. 이 함수들은 `#[abi(embed_v0)]` 속성이 지정된 구현 블록 내에 정의되어야 합니다. 이 속성은 그 안에 포함된 모든 함수가 Starknet 인터페이스의 구현이며, 따라서 계약의 진입점(entry points)임을 의미합니다. 이 속성은 가시성(public vs private/internal)에만 영향을 미치지만, 이러한 함수들이 계약의 상태를 수정할 수 있는 능력에 대해서는 알려주지 않습니다.

source: External functions
ko: 외부 함수

source: External functions are functions that can modify the state of a contract. They are public and can be called by any other contract or externally. External functions are _public_ functions where the `self: ContractState` is passed as reference with the `ref` keyword, allowing you to modify the state of the contract.
id: Fungsi eksternal adalah fungsi yang dapat memodifikasi status suatu kontrak. Mereka bersifat publik dan dapat dipanggil oleh kontrak lain atau dari luar. Fungsi eksternal adalah fungsi _publik_ di mana `self: ContractState` dilewatkan sebagai referensi dengan kata kunci `ref`, memungkinkan Anda untuk memodifikasi status kontrak.
ko: 외부 함수는 계약의 상태를 수정할 수 있는 함수입니다. 이러한 함수들은 공개되어 있으며 다른 모든 계약 또는 외부에서 호출될 수 있습니다. 외부 함수는 `self: ContractState`이 참조로 전달되는 `_public_` 함수들이며 `ref` 키워드를 사용하여 계약의 상태를 수정할 수 있습니다.

source: View functions
ko: 기능 보기

source: View functions are read-only functions allowing you to access data from the contract while ensuring that the state of the contract is not modified. They can be called by other contracts or externally. View functions are _public_ functions where the `self: ContractState` is passed as snapshot, preventing you from modifying the state of the contract.
id: Fungsi tampilan (view) adalah fungsi hanya baca yang memungkinkan Anda mengakses data dari kontrak sambil memastikan bahwa status kontrak tidak dimodifikasi. Mereka dapat dipanggil oleh kontrak lain atau dari luar. Fungsi tampilan adalah fungsi _publik_ di mana `self: ContractState` dilewatkan sebagai snapshot, mencegah Anda untuk memodifikasi status kontrak.
ko: 뷰 함수는 계약에서 데이터에 액세스할 수 있도록 허용하면서도 계약의 상태가 수정되지 않도록 하는 읽기 전용 함수입니다. 다른 계약이나 외부에서 호출할 수 있습니다. 뷰 함수는 `self: ContractState`가 스냅샷으로 전달되는 _public_ 함수이며, 계약의 상태를 수정할 수 없게 합니다.

source: **Note:** It's important to note that both external and view functions are public. To create an internal function in a contract, you will need to define it outside of the implementation block annotated with the `#[abi(embed_v0)]` attribute.
ko: **참고:** 외부 및 뷰 함수는 모두 공개(public)임을 유의해야 합니다. 계약(contract) 내에서 내부 함수를 생성하려면 `#[abi(embed_v0)]` 속성으로 주석 처리된 구현 블록 외부에서 정의해야 합니다.

source: 3. Private functions
ko: 3. 비공개 함수

source: Functions that are not defined in a block annotated with the `#[abi(embed_v0)]` attribute are private functions (also called internal functions). They can only be called from within the contract.
ko: `#[abi(embed_v0)]` 속성이 지정된 블록에 정의되지 않은 함수는 비공개 함수(내부 함수라고도 함)입니다. 이러한 함수들은 계약 내에서만 호출할 수 있습니다.

source: They can be grouped in a dedicated impl block (e.g in components, to easily import internal functions all at once in the embedding contracts) or just be added as free functions inside the contract module. Note that these 2 methods are equivalent. Just choose the one that makes your code more readable and easy to use.
ko: 그들은 전용 impl 블록에 그룹화될 수 있습니다(예: 구성 요소에서, 내부 함수를 쉽게 한꺼번에 임베딩 계약에 가져오기 위해) 또는 계약 모듈 내에 자유 함수로 추가될 수 있습니다. 이 두 가지 방법은 동등합니다. 코드를 더 읽기 쉽고 사용하기 쉽게 만드는 방법을 선택하십시오.

source: Wait, what is this `#[generate_trait]` attribute? Where is the trait definition for this implementation? Well, the `#[generate_trait]` attribute is a special attribute that tells the compiler to generate a trait definition for the implementation block. This allows you to get rid of the boilerplate code of defining a trait and implementing it for the implementation block. We will see more about this in the [next section](./ch99-01-03-04-reducing-boilerplate.md).
id: Tunggu, apa itu atribut `#[generate_trait]`? Di mana definisi trait untuk implementasi ini? Nah, atribut `#[generate_trait]` adalah atribut khusus yang memberi tahu kompiler untuk menghasilkan definisi trait untuk blok implementasi. Ini memungkinkan Anda untuk menghilangkan kode boilerplate dari mendefinisikan sebuah trait dan mengimplementasikannya untuk blok implementasi. Kita akan melihat lebih lanjut tentang hal ini di [bagian berikutnya](./ch99-01-03-04-reducing-boilerplate.md).
ko: 이 `#[generate_trait]` 속성은 무엇인가요? 이 구현을 위한 트레이트 정의는 어디에 있나요? `#[generate_trait]` 속성은 컴파일러에게 구현 블록을 위한 트레이트 정의를 생성하도록 지시하는 특별한 속성입니다. 이를 통해 트레이트를 정의하고 구현하는 보일러플레이트 코드를 제거할 수 있습니다. 이에 대해 더 자세히 알아보려면 [다음 섹션](./ch99-01-03-04-reducing-boilerplate.md)에서 확인해보겠습니다.

source: 4. \[abi(per_item)\] attribute
ko: 4. \[abi(개별 항목)\] 속성

source: You can also define the entrypoint type of a function individually inside an impl using the`#[abi(per_item)]` attribute on top of your impl. It is often used with the `#[generate_trait]` attribute, as it allows you to define entrypoints without an explicit interface. In this case, the functions will not be grouped under an impl in the abi. Note that when using `#[abi(per_item)]` attribute, public functions need to be annotated with `#[external(v0)]` attribute - otherwise, they will not be exposed.
ko: 함수의 엔트리포인트 유형을 개별적으로 정의할 수도 있습니다. impl 내에서 `#[abi(per_item)]` 속성을 사용하여 정의할 수 있습니다. 이는 명시적 인터페이스 없이 엔트리포인트를 정의할 수 있도록 `#[generate_trait]` 속성과 함께 자주 사용됩니다. 이 경우, 함수들은 abi 내에서 impl 아래에 그룹화되지 않습니다. `#[abi(per_item)]` 속성을 사용할 때, public 함수는 `#[external(v0)]` 속성으로 주석 처리해야 합니다. 그렇지 않으면 노출되지 않습니다.

source: In the case of `#[abi(per_item)]` attribute usage without `#[generate_trait]`, it will only be possible to include `constructor`, `l1-handler` and `internal` functions in the trait implementation. Indeed, `#[abi(per_item)]` only works with a trait that is not defined as a Starknet interface. Hence, it will be mandatory to create another trait defined as interface to implement public functions.
ko: `#[generate_trait]` 없이 `#[abi(per_item)]` 속성을 사용하는 경우, 트레이트 구현에는 `constructor`, `l1-handler`, `internal` 함수만 포함될 수 있습니다. 실제로 `#[abi(per_item)]`은 Starknet 인터페이스로 정의되지 않은 트레이트와만 작동합니다. 따라서 공개 함수를 구현하기 위해 인터페이스로 정의된 다른 트레이트를 만들어야 할 것입니다.

source: Here is a short example:
ko: 다음은 간단한 예시입니다:

source: // this is a constructor function
ko: 이것은 생성자 함수입니다.

source: // this is a public function
ko: 이것은 공개 함수입니다.

source: // this is a l1_handler function
ko: // 이것은 l1_handler 함수입니다

source: // this is an internal function
ko: // 이것은 내부 함수입니다

source: Events
ko: 행사

source: Events are custom data structures that are emitted by smart contracts during execution. They provide a way for smart contracts to communicate with the external world by logging information about specific occurrences in a contract.
id: Events adalah struktur data kustom yang dihasilkan oleh kontrak pintar selama eksekusi. Mereka memberikan cara bagi kontrak pintar untuk berkomunikasi dengan dunia eksternal dengan mencatat informasi tentang kejadian khusus dalam sebuah kontrak.
ko: 이벤트는 스마트 계약이 실행 중에 발생하는 사용자 정의 데이터 구조입니다. 이벤트는 스마트 계약이 특정 사건에 대한 정보를 기록함으로써 외부 세계와 소통하는 방법을 제공합니다.

source: Events play a crucial role in the creation of smart contracts. Take, for instance, the Non-Fungible Tokens (NFTs) minted on Starknet. All of these are indexed and stored in a database, then displayed to users through the use of these events. Neglecting to include an event within your NFT contract could lead to a bad user experience. This is because users may not see their NFTs appear in their wallets (wallets use these indexers to display a user's NFTs).
es: Los acontecimientos desempeñan un papel crucial en la creación de contratos inteligentes. Tomemos, por ejemplo, las fichas no fungibles (NFT) acuñadas en Starknet. Todos ellos se indexan y almacenan en una base de datos, y luego se muestran a los usuarios mediante el uso de estos eventos. Descuidar la inclusión de un evento dentro de su contrato NFT podría conducir a una mala experiencia de usuario. Esto se debe a que los usuarios pueden no ver sus NFTs aparecer en sus carteras (las carteras utilizan estos indexadores para mostrar los NFTs de un usuario).
id: Events memiliki peran penting dalam pembuatan kontrak pintar. Ambil contoh, Token Non-Fungible (NFT) yang diciptakan di Starknet. Semua ini diindeks dan disimpan dalam database, kemudian ditampilkan kepada pengguna melalui penggunaan peristiwa ini. Mengabaikan untuk menyertakan peristiwa dalam kontrak NFT Anda dapat mengakibatkan pengalaman pengguna yang buruk. Ini karena pengguna mungkin tidak melihat NFT mereka muncul di dompet mereka (dompet menggunakan indexer ini untuk menampilkan NFT pengguna).
ko: 이벤트는 스마트 계약의 생성에서 중요한 역할을 합니다. 예를 들어, Starknet에서 민팅된 비교적 교환할 수 없는 토큰(NFT)을 살펴보십시오. 이 모든 것들은 데이터베이스에 색인화되어 저장되고, 그런 다음 이러한 이벤트를 통해 사용자에게 표시됩니다. NFT 계약에 이벤트를 포함하지 않는다면 사용자 경험이 나빠질 수 있습니다. 이는 사용자가 지갑에 자신의 NFT가 나타나지 않을 수 있기 때문입니다(지갑은 사용자의 NFT를 표시하기 위해 이 색인화자를 사용합니다).
zh_cn: 事件在智能合约的创建中起着至关重要的作用。以Starknet上铸造的Non-Fungible Tokens（NFTs）为例。所有这些都被索引并存储在数据库中，然后通过使用这些事件显示给用户。忘记在你的NFT合约中编写一个事件可能会导致糟糕的用户体验。这是因为用户可能看不到他们的NFT出现在他们的钱包里（钱包使用这些索引器来显示用户的NFT）。

source: Defining events
id: Mendefinisikan events
ko: 사건 정의

source: All the different events in the contract are defined under the `Event` enum, which implements the `starknet::Event` trait, as enum variants. This trait is defined in the core library as follows:
id: Semua peristiwa yang berbeda dalam kontrak didefinisikan dalam enum `Event`, yang mengimplementasikan trait `starknet::Event` sebagai varian-varian enum. Trait ini didefinisikan dalam perpustakaan inti sebagai berikut:
ko: 계약에 정의된 모든 다양한 이벤트는 'Event' enum 아래 정의되어 있습니다. 이 enum은 'starknet::Event' trait을 구현하며 enum 변형으로 정의됩니다. 이 trait은 다음과 같이 코어 라이브러리에 정의되어 있습니다.
zh_cn: 合约中所有不同的事件都定义在 `Event`枚举中，它实现了`starknet::Event` trait，作为枚举变量。该trait在核心库中定义如下：

source: The `#[derive(starknet::Event)]` attribute causes the compiler to generate an implementation for the above trait, instantiated with the Event type, which in our example is the following enum:
id: Atribut `#[derive(starknet::Event)]` membuat kompiler menghasilkan implementasi untuk trait di atas, yang diinstansiasi dengan tipe Event, yang dalam contoh kami adalah enum berikut:
ko: `#[derive(starknet::Event)]` 속성은 컴파일러가 위의 특성에 대한 구현을 생성하도록 하며, 이는 이벤트 유형으로 인스턴스화된 이벤트 유형과 함께 사용됩니다. 예시에서는 다음과 같은 열거형입니다.

source: Each event variant has to be a struct of the same name as the variant, and each variant needs to implement the `starknet::Event` trait itself. Moreover, the members of these variants must implement the `Serde` trait (_c.f._ [Appendix C: Serializing with Serde](./appendix-03-derivable-traits.md)), as keys/data are added to the event using a serialization process.
id: Setiap varian event harus menjadi struktur dengan nama yang sama dengan varian tersebut, dan setiap varian harus mengimplementasikan trait `starknet::Event` itu sendiri. Selain itu, anggota dari varian-varian ini harus mengimplementasikan trait `Serde` (_cf._ [Lampiran C: Serializing with Serde](./appendix-03-derivable-traits.md)), karena kunci/data ditambahkan ke peristiwa menggunakan proses serialisasi.
ko: 각 이벤트 변형은 해당 변형과 동일한 이름의 구조체여야 하며, 각 변형은 `starknet::Event` 트레이트를 직접 구현해야 합니다. 또한, 이러한 변형들의 멤버들은 이벤트에 직렬화 프로세스를 사용하여 키/데이터가 추가되므로 `Serde` 트레이트를 구현해야 합니다.

source: The auto implementation of the `starknet::Event` trait will implement the `append_keys_and_data` function for each variant of our `Event` enum. The generated implementation will append a single key based on the variant name (`StoredName`), and then recursively call `append_keys_and_data` in the impl of the Event trait for the variant’s type .
id: Implementasi otomatis dari trait `starknet::Event` akan mengimplementasikan fungsi `append_keys_and_data` untuk setiap varian dari enum `Event` kita. Implementasi yang dihasilkan akan menambahkan satu kunci berdasarkan nama varian (`StoredName`), dan kemudian secara rekursif memanggil `append_keys_and_data` pada implementasi trait Event untuk tipe varian tersebut.
ko: `starknet::Event` 트레이트의 자동 구현은 `Event` enum의 각 변형에 대해 `append_keys_and_data` 함수를 구현할 것입니다. 생성된 구현은 변형 이름(`StoredName`)을 기반으로 단일 키를 추가한 다음, 해당 타입의 변형에 대한 Event 트레이트의 impl에서 `append_keys_and_data`를 재귀적으로 호출할 것입니다.
zh_cn: `starknet::Event`trait的自动实现将为我们的 `Event`枚举的每个变体成员实现 `append_keys_and_data`函数。生成的实现将根据变量名（`StoredName`）附加一个单独的键，然后递归调用`Event`trait的实现中的`append_keys_and_data`函数。

source: In our contract, we define an event named `StoredName` that emits the contract address of the caller and the name stored within the contract, where the `user` field is serialized as a key and the `name` field is serialized as data. To index the key of an event, simply annotate it with the `#[key]` as demonstrated in the example for the `user` key.
id: Dalam kontrak kami, kami mendefinisikan sebuah peristiwa yang bernama `StoredName` yang mengeluarkan alamat kontrak dari pemanggil dan nama yang disimpan dalam kontrak, di mana bidang `user` diserialisasikan sebagai kunci dan bidang `name` diserialisasikan sebagai data. Untuk mengindeks kunci dari suatu peristiwa, cukup beri anotasi dengan `#[key]` seperti yang ditunjukkan dalam contoh untuk kunci `user`.
ko: 저희 계약서에서는 호출자의 계약 주소와 계약 내에 저장된 이름을 발신하는 `StoredName`이라는 이벤트를 정의합니다. 여기서 `user` 필드는 키로 직렬화되고 `name` 필드는 데이터로 직렬화됩니다. 이벤트의 키를 색인화하려면, 간단히 `user` 키에 대한 예제에서와 같이 `#[key]`로 주석을 달면 됩니다.

source: When emitting the event with `self.emit(StoredName { user: user, name: name })`, a key corresponding to the name ` StoredName`, specifically `sn_keccak(StoredName)`, is appended to the keys list. `user`is serialized as key, thanks to the `#[key]` attribute, while address is serialized as data. After everything is processed, we end up with the following keys and data: `keys = [sn_keccak("StoredName"),user]` and `data = [name]`.
ko: `self.emit(StoredName { user: user, name: name })` 이벤트를 발생시킬 때, 이름 `StoredName`에 해당하는 키인 `sn_keccak(StoredName)`이 키 목록에 추가됩니다. `user`는 `#[key]` 속성 덕분에 키로 직렬화되고, 주소는 데이터로 직렬화됩니다. 모든 처리가 완료되면 다음과 같은 키와 데이터가 생성됩니다: `keys = [sn_keccak("StoredName"), user]` 및 `data = [name]`.

source: Emitting events
ko: 이벤트 발생

source: After defining events, we can emit them using `self.emit`, with the following syntax:
id: Setelah mendefinisikan peristiwa, kita dapat mengeluarkannya menggunakan `self.emit`, dengan sintaks berikut:
ko: 사건을 정의한 후에는 다음 구문을 사용하여 `self.emit`을 통해 이벤트를 발생시킬 수 있습니다.
zh_cn: 定义事件后，我们可以使用`self.emit`来emit它们，语法如下：

source: In a previous section, we saw this example of an implementation block in a contract that didn't have any corresponding trait.
id: Pada bagian sebelumnya, kita melihat contoh blok implementasi dalam suatu kontrak yang tidak memiliki trait yang sesuai.
ko: 이전 섹션에서 우리는 해당 계약 내의 구현 블록 예제를 보았는데, 해당 특성이 없었습니다.
zh_cn: 在上一节中，我们看到了这样一个示例：在一个没有任何相应trait的合约中，有一个实现块。

source: It's not the first time that we encounter this attribute, we already talked about in it [Traits in Cairo](./ch08-02-traits-in-cairo.md). In this section, we'll be taking a deeper look at it and see how it can be used in contracts.
id: Ini bukan kali pertama kita bertemu dengan atribut ini, kita sudah membicarakannya dalam [Traits in Cairo](./ch08-02-traits-in-cairo.md). Pada bagian ini, kita akan melihat lebih dalam tentangnya dan melihat bagaimana atribut ini dapat digunakan dalam kontrak.
ko: 이 속성을 만나는 것은 처음이 아닙니다. 이미 [카이로의 특성](./ch08-02-traits-in-cairo.md)에서 이에 대해 이야기했습니다. 이 섹션에서는 더 깊이 살펴보고 계약에서 어떻게 사용될 수 있는지 살펴보겠습니다.
zh_cn: 这并不是我们第一次遇到这个属性，我们已经在在Cairo中使用 `Traits`(./ch08-02-traits-in-cairo.md) 中讨论过它。在本节中，我们将更深入地研究它，并看看它在合约中的使用方式。

source: In order to access the ContractState in a function in an implementation block, this implementation block must be defined with a `ContractState` generic parameter. This implies that we first need to define a generic trait that takes a `TContractState`, and then implement this trait for the `ContractState` type. But by using the `#[generate_trait]` attribute, this whole process can be skipped and we can simply define the implementation block directly, without any generic parameter, and use `self: ContractState` in our functions.
ko: 구현 블록 내의 함수에서 ContractState에 액세스하려면 해당 구현 블록은 'ContractState' 제네릭 매개변수로 정의되어야 합니다. 이는 먼저 'TContractState'를 가져오는 제네릭 트레이트를 정의하고, 이 트레이트를 'ContractState' 유형에 대해 구현해야 한다는 것을 의미합니다. 그러나 `#[generate_trait]` 속성을 사용하면 이러한 전체 과정을 건너뛸 수 있으며, 우리는 제네릭 매개변수 없이 직접 구현 블록을 정의하고 함수에서 `self: ContractState`를 사용할 수 있습니다.
