Repository: cairo-book/cairo-book
Catalog: po/*.po
Languages: es, id, ko, zh_cn

source: If we had to manually define the trait for the `InternalFunctions` implementation, it would look something like this:
id: Jika kita harus secara manual mendefinisikan trait untuk implementasi `InternalFunctions`, akan terlihat seperti ini:
ko: 만약 우리가 `InternalFunctions` 구현을 수동으로 정의해야 한다면, 이렇게 보일 것입니다:
zh_cn: 如果我们必须手动定义 `InternalFunctions` 所实现的trait，它将看起来像这样：

source: Storage Optimization with `StorePacking`
id: Optimasi Penyimpanan dengan `StorePacking`
ko: `StorePacking`를 사용한 저장 공간 최적화

source: Bit-packing is a simple concept: Use as few bits as possible to store a piece of data. When done well, it can significantly reduce the size of the data you need to store. This is especially important in smart contracts, where storage is expensive.
id: Pengemasan bit adalah konsep yang sederhana: Gunakan sebanyak mungkin bit yang diperlukan untuk menyimpan sebuah data. Jika dilakukan dengan baik, ini dapat secara signifikan mengurangi ukuran data yang perlu Anda simpan. Hal ini terutama penting dalam kontrak pintar, di mana penyimpanan mahal.
ko: 비트 패킹은 간단한 개념입니다: 가능한 한 적은 비트를 사용하여 데이터 조각을 저장합니다. 잘 수행되면 저장해야 하는 데이터의 크기를 크게 줄일 수 있습니다. 이는 특히 저장 비용이 비싼 스마트 계약에서 중요합니다.
zh_cn: 位压缩是一个简单的概念：使用尽可能少的位数来存储数据。如果做得好，它可以显著减少需要存储的数据大小。这在智能合约中尤为重要，因为存储是昂贵的。

source: When writing Cairo smart contracts, it is important to optimize storage usage to reduce gas costs. Indeed, most of the cost associated with a transaction is related to storage updates; and each storage slot costs gas to write to. This means that by packing multiple values into fewer slots, you can decrease the gas cost incurred by the users of your smart contract.
id: Ketika menulis kontrak pintar Cairo, penting untuk mengoptimalkan penggunaan penyimpanan guna mengurangi biaya gas. Memang, sebagian besar biaya yang terkait dengan suatu transaksi berhubungan dengan pembaruan penyimpanan; dan setiap slot penyimpanan memerlukan biaya gas untuk ditulis. Ini berarti dengan memadatkan beberapa nilai ke dalam slot yang lebih sedikit, Anda dapat mengurangi biaya gas yang ditanggung oleh pengguna kontrak pintar Anda.
ko: 카이로 스마트 계약을 작성할 때는 가스 비용을 줄이기 위해 저장 공간 사용을 최적화하는 것이 중요합니다. 실제로, 거래와 관련된 대부분의 비용은 저장 공간 업데이트와 관련이 있으며 각 저장 슬롯에 쓰기 위해 가스가 소요됩니다. 이는 여러 값을 더 적은 슬롯에 패킹하여 스마트 계약 사용자가 소비하는 가스 비용을 줄일 수 있다는 것을 의미합니다.

source: Cairo provides the `StorePacking` trait to enable packing struct fields into fewer storage slots. For example, consider a `Sizes` struct with 3 fields of different types. The total size is 8 + 32 + 64 = 104 bits. This is less than the 128 bits of a single `u128`. This means we can pack all 3 fields into a single `u128` variable. Since a storage slot can hold up to 251 bits, our packed value will take only one storage slot instead of 3.
id: Cairo menyediakan trait `StorePacking` untuk memungkinkan pengemasan bidang struktur ke dalam slot penyimpanan yang lebih sedikit. Sebagai contoh, pertimbangkan struktur `Sizes` dengan 3 bidang berbagai jenis. Ukuran totalnya adalah 8 + 32 + 64 = 104 bit. Ini kurang dari 128 bit dari satu variabel `u128`. Ini berarti kita dapat memadatkan semua 3 bidang ke dalam satu variabel `u128`. Karena satu slot penyimpanan dapat menampung hingga 251 bit, nilai yang dipadatkan kita akan memerlukan hanya satu slot penyimpanan daripada 3.
ko: 카이로는 `StorePacking` 특성을 제공하여 구조체 필드를 더 적은 저장 슬롯에 패킹할 수 있도록 합니다. 예를 들어, 다른 유형의 3개 필드를 가진 `Sizes` 구조체를 고려해 보겠습니다. 총 크기는 8 + 32 + 64 = 104 비트입니다. 이는 단일 `u128`의 128 비트보다 작습니다. 이는 모든 3개 필드를 단일 `u128` 변수에 패킹할 수 있다는 것을 의미합니다. 저장 슬롯은 최대 251 비트까지 보유할 수 있으므로, 우리의 패킹된 값은 3개가 아닌 단일 저장 슬롯에만 들어갈 것입니다.
zh_cn: Cairo提供了 `StorePacking` trait，以便将结构体字段打包到较少的存储槽位中。例如，考虑一个具有3个不同类型字段的 `Sizes` 结构体。总大小为8 + 32 + 64 = 104位。这比单个 `u128` 的128位要小。这意味着我们可以将这3个字段都打包到一个单独的 `u128` 变量中。由于一个存储槽位最多可以容纳251位，我们打包后的值只需要一个存储槽位，而不是3个。

source: // This will automatically pack the // struct into a single u128
ko: 이것은 구조체를 자동으로 단일 u128으로 패킹합니다.

source: // this will automatically unpack the // packed-representation into the Sizes struct
ko: 이것은 자동으로 패킹된 표현을 Sizes 구조체로 해제할 것입니다.

source: Optimizing storage by implementing the `StorePacking` trait
id: Mengoptimalkan penyimpanan dengan mengimplementasikan trait `StorePacking`
ko: `StorePacking` 트레이트를 구현하여 저장 공간 최적화하기

source: The `pack` function combines all three fields into a single `u128` value by performing bitshift and additions. The `unpack` reverses this process to extract the original fields back into a struct.
id: Fungsi `pack` menggabungkan ketiga bidang ke dalam satu nilai `u128` dengan melakukan operasi pergeseran bit dan penambahan. Fungsi `unpack` membalikkan proses ini untuk mengekstrak kembali bidang asli ke dalam sebuah struktur.
ko: `pack` 함수는 비트 시프트와 덧셈을 통해 세 필드를 하나의 `u128` 값으로 결합합니다. `unpack` 함수는 이 과정을 반대로 수행하여 원래 필드를 구조체로 다시 추출합니다.
zh_cn: `pack` 函数通过位移和加法将所有三个字段合并为一个 `u128`值。`unpack`则将这一过程逆转，将原始字段提取回结构体中。

source: If you're not familiar with bit operations, here's an explanation of the operations performed in the example: The goal is to pack the `tiny`, `small`, and `medium` fields into a single `u128` value. First, when packing:
id: Jika Anda tidak familiar dengan operasi bit, berikut adalah penjelasan dari operasi-operasi yang dilakukan dalam contoh ini: Tujuannya adalah untuk memadatkan bidang `tiny`, `small`, dan `medium` ke dalam satu nilai `u128`. Pertama, saat memadatkan:
ko: 비트 연산에 익숙하지 않다면, 여기 예제에서 수행되는 연산에 대한 설명이 있습니다: 목표는 `tiny`, `small`, 그리고 `medium` 필드를 하나의 `u128` 값으로 패킹하는 것입니다. 먼저, 패킹할 때:

source: `tiny` is a `u8` so we just convert it directly to a `u128` with `.into()`. This creates a `u128` value with the low 8 bits set to `tiny`'s value.
id: `tiny` adalah `u8` sehingga kita langsung mengonversinya menjadi `u128` dengan `.into()`. Ini membuat nilai `u128` dengan 8 bit terendah diatur ke nilai `tiny`.
ko: `tiny`는 `u8`이므로 우리는 그것을 `.into()`로 직접 `u128`로 변환합니다. 이는 `tiny`의 값으로 설정된 하위 8비트를 가진 `u128` 값을 생성합니다.

source: `small` is a `u32` so we first shift it left by 8 bits (add 8 bits with the value 0 to the left) to create room for the 8 bites taken by `tiny`. Then we add `tiny` to `small` to combine them into a single `u128` value. The value of `tiny` now takes bits 0-7 and the value of small takes bits 8-39.
id: `small` adalah `u32` sehingga kita pertama-tama menggesernya ke kiri sebanyak 8 bit (menambahkan 8 bit dengan nilai 0 di sebelah kiri) untuk membuat ruang bagi 8 bit yang diambil oleh `tiny`. Kemudian kita tambahkan nilai `tiny` ke `small` untuk menggabungkannya menjadi satu nilai `u128`. Nilai dari `tiny` sekarang mengambil bit 0-7 dan nilai dari `small` mengambil bit 8-39.
ko: `small`은 `u32`이므로 먼저 왼쪽으로 8비트 시프트하여(`tiny`가 차지하는 8비트를 왼쪽에 0으로 채워 넣음) `tiny`가 차지하는 8비트를 위해 공간을 만듭니다. 그런 다음 `tiny`를 `small`에 추가하여 하나의 `u128` 값으로 결합합니다. 이제 `tiny`의 값은 비트 0-7을 차지하고 `small`의 값은 비트 8-39를 차지합니다.

source: Similarly `medium` is a `u64` so we shift it left by 40 (8 + 32) bits (`TWO_POW_40`) to make space for the previous fields. This takes bits 40-103.
id: Demikian pula, `medium` adalah `u64` sehingga kita menggesernya ke kiri sebanyak 40 (8 + 32) bit (`TWO_POW_40`) untuk memberikan ruang bagi bidang sebelumnya. Ini mencakup bit 40-103.
ko: 비슷하게 `medium`은 `u64`이므로 이전 필드에 공간을 만들기 위해 40(8 + 32)비트(`TWO_POW_40`)만큼 왼쪽으로 시프트합니다. 이는 40-103번 비트를 차지합니다.

source: When unpacking:
ko: 풀 때:
zh_cn: 当解包时：

source: First we extract `tiny` by bitwise ANDing (&) with a bitmask of 8 ones (`& MASK_8`). This isolates the lowest 8 bits of the packed value, which is `tiny`'s value.
id: Pertama, kita ekstrak nilai `tiny` dengan melakukan operasi bitwise ANDing (&) dengan bitmask 8 ones (`& MASK_8`). Ini mengisolasi 8 bit terendah dari nilai yang dipadatkan, yang merupakan nilai `tiny`.
ko: 먼저 우리는 비트 AND 연산자(&)를 사용하여 8개의 1로 이루어진 비트 마스크와 `tiny`를 추출합니다(`& MASK_8`). 이렇게 하면 패킹된 값의 최하위 8비트를 분리하여 `tiny`의 값이 됩니다.

source: For `small`, we right shift by 8 bits (`/ TWO_POW_8`) to align it with the bitmask, then use bitwise AND with the 32 ones bitmask.
id: Untuk `small`, kita melakukan pergeseran ke kanan sebesar 8 bit (`/ TWO_POW_8`) untuk menyelaraskan dengan bitmask, kemudian menggunakan operasi bitwise AND dengan bitmask 32 ones.
ko: `small`에 대해 8비트 오른쪽 시프트(`/ TWO_POW_8`)하여 비트마스크와 일치시킨 후, 32비트 1로 이루어진 비트마스크와 비트 AND 연산을 사용합니다.

source: For `medium` we right shift by 40 bits. Since it is the last value packed, we don't need to apply a bitmask as the higher bits are already 0.
id: Untuk `medium`, kita melakukan pergeseran ke kanan sebesar 40 bit. Karena ini adalah nilai terakhir yang dipadatkan, kita tidak perlu menerapkan bitmask karena bit yang lebih tinggi sudah bernilai 0.
ko: `medium`를 40비트 오른쪽으로 시프트합니다. 마지막 값으로 패킹되었기 때문에 더 높은 비트가 이미 0이므로 비트마스크를 적용할 필요가 없습니다.

source: This technique can be used for any group of fields that fit within the bit size of the packed storage type. For example, if you have a struct with multiple fields whose bit sizes add up to 256 bits, you can pack them into a single `u256` variable. If the bit sizes add up to 512 bits, you can pack them into a single `u512` variable, and so on. You can define your own structs and logic to pack and unpack them.
id: Teknik ini dapat digunakan untuk setiap kelompok bidang yang cocok dalam ukuran bit dari tipe penyimpanan yang dipadatkan. Sebagai contoh, jika Anda memiliki struktur dengan beberapa bidang yang ukuran bit-nya ditambahkan menjadi 256 bit, Anda dapat memadatkannya ke dalam satu variabel `u256`. Jika ukuran bit-nya ditambahkan menjadi 512 bit, Anda dapat memadatkannya ke dalam satu variabel `u512`, dan seterusnya. Anda dapat mendefinisikan struktur dan logika sendiri untuk memadatkan dan membuka padatan tersebut.
ko: 이 기술은 패킹된 저장 유형의 비트 크기 내에 맞는 필드 그룹에 사용할 수 있습니다. 예를 들어, 비트 크기가 256비트가 되도록 여러 필드가 있는 구조체가 있다면, 이를 하나의 `u256` 변수에 패킹할 수 있습니다. 비트 크기가 512비트가 되도록 여러 필드가 있는 경우, 이를 하나의 `u512` 변수에 패킹할 수 있으며, 이와 같이 계속됩니다. 자체 구조체 및 패킹 및 언패킹하는 논리를 정의할 수 있습니다.
zh_cn: 这种技术可用于任何一组适合打包存储类型位大小的字段。例如，如果一个结构体有多个字段，其位大小加起来为 256 位，那么可以将它们打包成一个 `u256` 变量。如果字段的位数加起来是 512 位，则可以将它们打包到一个 `u512` 变量中，依此类推。你可以定义自己的结构和逻辑来打包和解包它们。

source: The rest of the work is done magically by the compiler - if a type implements the `StorePacking` trait, then the compiler will know it can use the `StoreUsingPacking` implementation of the `Store` trait in order to pack before writing and unpack after reading from storage. One important detail, however, is that the type that `StorePacking::pack` spits out also has to implement `Store` for `StoreUsingPacking` to work. Most of the time, we will want to pack into a felt252 or u256 - but if you want to pack into a type of your own, make sure that this one implements the `Store` trait.
id: Sisa pekerjaan tersebut dilakukan secara ajaib oleh kompiler - jika suatu tipe mengimplementasikan trait `StorePacking`, maka kompiler akan tahu bahwa dapat menggunakan implementasi `StoreUsingPacking` dari trait `Store` untuk mengemas sebelum menulis dan membongkar setelah membaca dari penyimpanan. Namun, satu detail penting adalah bahwa tipe yang dihasilkan oleh `StorePacking::pack` juga harus mengimplementasikan `Store` agar `StoreUsingPacking` dapat berfungsi. Sebagian besar waktu, kita akan menginginkan pengemasan ke felt252 atau u256 - tetapi jika Anda ingin mengemas ke tipe milik Anda sendiri, pastikan bahwa tipe tersebut mengimplementasikan trait `Store`.
ko: 일을 나머지는 컴파일러에 의해 마법처럼 처리됩니다 - 타입이 `StorePacking` 트레이트를 구현하면, 컴파일러는 저장 전에 패킹하고 저장 후에 언패킹하기 위해 `Store` 트레이트의 `StoreUsingPacking` 구현을 사용할 수 있다는 것을 알게 될 것입니다. 그러나 중요한 세부 사항은 `StorePacking::pack`이 출력하는 타입도 `Store`를 구현해야 `StoreUsingPacking`이 작동한다는 것입니다. 대부분의 경우, felt252 또는 u256로 패킹하고 싶을 것입니다 - 그러나 자체 타입으로 패킹하려면, 해당 타입이 `Store` 트레이트를 구현했는지 확인하십시오.

source: Components: Lego-Like Building Blocks for Smart Contracts
id: Komponen: Blok Bangunan Seperti Lego untuk Kontrak Pintar
ko: 구성 요소: 스마트 계약을 위한 레고처럼 조립 가능한 블록들

source: Developing contracts sharing a common logic and storage can be painful and bug-prone, as this logic can hardly be reused and needs to be reimplemented in each contract. But what if there was a way to snap in just the extra functionality you need inside your contract, separating the core logic of your contract from the rest?
id: Mengembangkan kontrak yang berbagi logika dan penyimpanan umum dapat menyakitkan dan rentan terhadap bug, karena logika ini sulit untuk digunakan kembali dan perlu diimplementasikan ulang dalam setiap kontrak. Tetapi bagaimana jika ada cara untuk menyisipkan hanya fungsionalitas tambahan yang Anda butuhkan di dalam kontrak Anda, memisahkan logika inti kontrak Anda dari yang lain?
ko: 공통 로직 및 저장소를 공유하는 계약을 개발하는 것은 고통스럽고 버그가 발생하기 쉬울 수 있습니다. 왜냐하면 이러한 로직은 재사용하기 어렵고 각 계약마다 다시 구현해야 할 수 있기 때문입니다. 그러나 계약의 핵심 로직을 나머지 부분과 분리하여 딱 필요한 추가 기능만 삽입할 수 있는 방법이 있다면 어떨까요?

source: Components provide exactly that. They are modular add-ons encapsulating reusable logic, storage, and events that can be incorporated into multiple contracts. They can be used to extend a contract's functionality, without having to reimplement the same logic over and over again.
id: Komponen menyediakan hal tersebut secara tepat. Mereka adalah tambahan modular yang mengemas logika, penyimpanan, dan peristiwa yang dapat digunakan kembali yang dapat disertakan ke dalam beberapa kontrak. Mereka dapat digunakan untuk memperluas fungsionalitas kontrak tanpa harus mengimplementasikan ulang logika yang sama berulang kali.
ko: 구성 요소는 정확히 그 역할을 합니다. 재사용 가능한 로직, 저장소 및 이벤트를 캡슐화하는 모듈식 애드온으로, 여러 계약에 통합될 수 있습니다. 동일한 로직을 반복해서 다시 구현하지 않고도 계약의 기능을 확장하는 데 사용할 수 있습니다.

source: Think of components as Lego blocks. They allow you to enrich your contracts by plugging in a module that you or someone else wrote. This module can be a simple one, like an ownership component, or more complex like a full-fledged ERC20 token.
id: Pikirkan tentang komponen sebagai blok Lego. Mereka memungkinkan Anda memperkaya kontrak Anda dengan menyematkan modul yang Anda atau orang lain tulis. Modul ini bisa menjadi yang sederhana, seperti komponen kepemilikan, atau lebih kompleks seperti token ERC20 yang lengkap.
ko: 구성 요소를 레고 블록으로 생각해보세요. 다른 사람이나 여러분이 작성한 모듈을 연결하여 계약을 보다 풍부하게 만들 수 있습니다. 이 모듈은 소유권 구성 요소와 같이 간단한 것일 수도 있고, ERC20 토큰과 같이 복잡한 것일 수도 있습니다.

source: A component is a separate module that can contain storage, events, and functions. Unlike a contract, a component cannot be declared or deployed. Its logic will eventually be part of the contract’s bytecode it has been embedded in.
id: Sebuah komponen adalah modul terpisah yang dapat berisi penyimpanan (storage), peristiwa (events), dan fungsi-fungsi. Berbeda dengan kontrak, sebuah komponen tidak dapat dideklarasikan atau didaftarkan. Logikanya pada akhirnya akan menjadi bagian dari bytecode kontrak yang telah disematkan di dalamnya.
ko: 구성 요소는 저장소, 이벤트 및 함수를 포함할 수 있는 별도의 모듈입니다. 계약과 달리 구성 요소는 선언되거나 배포될 수 없습니다. 그 로직은 결국 포함된 계약의 바이트 코드의 일부가 될 것입니다.

source: What's in a Component?
ko: 구성 요소에는 무엇이 있나요?

source: A component is very similar to a contract. It can contain:
id: Sebuah komponen sangat mirip dengan kontrak. Ini dapat berisi:
ko: 구성 요소는 계약과 매우 유사합니다. 다음을 포함할 수 있습니다:
zh_cn: 组件与合约非常相似。它可以包含：

source: Storage variables
ko: 저장 변수

source: External and internal functions
id: Fungsi eksternal dan internal
ko: 외부 및 내부 기능

source: Unlike a contract, a component cannot be deployed on its own. The component's code becomes part of the contract it's embedded to.
id: Berbeda dengan kontrak, sebuah komponen tidak dapat dideploy secara independen. Kode komponen menjadi bagian dari kontrak tempat komponen tersebut disematkan.
ko: 계약과는 달리, 구성 요소는 자체적으로 배포될 수 없습니다. 구성 요소의 코드는 포함된 계약의 일부가 됩니다.

source: Creating Components
id: Membuat Komponen
ko: 구성 요소 만들기

source: To create a component, first define it in its own module decorated with a `#[starknet::component]` attribute. Within this module, you can declare a ` Storage` struct and `Event` enum, as usually done in [Contracts](./ch99-01-02-a-simple-contract.md).
id: Untuk membuat sebuah komponen, pertama-tama tentukan komponen tersebut dalam modulnya sendiri yang diberi atribut `#[starknet::component]`. Dalam modul ini, Anda dapat mendeklarasikan struktur `Storage` dan enumerasi `Event`, seperti yang biasanya dilakukan dalam [Kontrak](./ch99-01-02-a-simple-contract.md).
ko: 컴포넌트를 만들려면 먼저 `#[starknet::component]` 속성으로 장식된 자체 모듈에서 정의해야 합니다. 이 모듈 내에서는 일반적으로 [Contracts](./ch99-01-02-a-simple-contract.md)에서 수행하는 것과 같이 `Storage` 구조체와 `Event` 열거형을 선언할 수 있습니다.

source: The next step is to define the component interface, containing the signatures of the functions that will allow external access to the component's logic. You can define the interface of the component by declaring a trait with the `#[starknet::interface]` attribute, just as you would with contracts. This interface will be used to enable external access to the component's functions using the [Dispatcher](./ch99-02-02-contract-dispatcher-library-dispatcher-and-system-calls.md) pattern.
id: Langkah selanjutnya adalah mendefinisikan antarmuka komponen, yang berisi tanda tangan fungsi-fungsi yang akan mengizinkan akses eksternal ke logika komponen. Anda dapat mendefinisikan antarmuka dari komponen dengan mendeklarasikan sebuah trait dengan atribut `#[starknet::interface]`, sama halnya dengan yang Anda lakukan dengan kontrak-kontrak. Antarmuka ini akan digunakan untuk mengaktifkan akses eksternal ke fungsi-fungsi komponen menggunakan pola [Dispatcher](./ch99-02-02-contract-dispatcher-library-dispatcher-and-system-calls.md).
ko: 다음 단계는 구성 요소 인터페이스를 정의하는 것입니다. 이 인터페이스에는 구성 요소 로직에 대한 외부 액세스를 허용하는 함수들의 시그니처가 포함됩니다. 구성 요소의 인터페이스를 정의하려면 `#[starknet::interface]` 속성을 사용하여 특성을 선언하는 것과 같은 방식으로 특성을 가진 trait를 선언할 수 있습니다. 이 인터페이스는 [Dispatcher](./ch99-02-02-contract-dispatcher-library-dispatcher-and-system-calls.md) 패턴을 사용하여 구성 요소 함수에 대한 외부 액세스를 가능하게 하는 데 사용됩니다.

source: The actual implementation of the component's external logic is done in an `impl` block marked as `#[embeddable_as(name)]`. Usually, this `impl` block will be an implementation of the trait defining the interface of the component.
id: Implementasi aktual logika eksternal komponen dilakukan dalam blok `impl` yang ditandai sebagai `#[embeddable_as(name)]`. Biasanya, blok `impl` ini akan menjadi implementasi dari trait yang mendefinisikan antarmuka dari komponen.
ko: 구성 요소의 외부 로직의 실제 구현은 `#[embeddable_as(name)]`로 표시된 `impl` 블록에서 수행됩니다. 일반적으로, 이 `impl` 블록은 구성 요소의 인터페이스를 정의하는 트레이트의 구현일 것입니다.

source: Note: `name` is the name that we’ll be using in the contract to refer to the component. It is different than the name of your impl.
id: Catatan: `name` adalah nama yang akan kita gunakan dalam kontrak untuk merujuk ke komponen. Ini berbeda dengan nama impl Anda.
ko: 참고: `name`은 계약서에서 구성 요소를 가리키는 데 사용할 이름입니다. 이는 귀하의 구현 이름과는 다릅니다.

source: You can also define internal functions that will not be accessible externally, by simply omitting the `#[embeddable_as(name)]` attribute above the internal `impl` block. You will be able to use these internal functions inside the contract you embed the component in, but not interact with it from outside, as they're not a part of the abi of the contract.
id: Anda juga dapat mendefinisikan fungsi-fungsi internal yang tidak akan dapat diakses secara eksternal, dengan hanya menghilangkan atribut `#[embeddable_as(name)]` di atas blok `impl` internal. Anda akan dapat menggunakan fungsi-fungsi internal ini di dalam kontrak yang menanamkan komponen, tetapi tidak dapat berinteraksi dengan mereka dari luar, karena mereka bukan bagian dari abi dari kontrak.
ko: `#[embeddable_as(name)]` 속성을 내부 `impl` 블록 위에 생략함으로써 외부에서 접근할 수 없는 내부 함수를 정의할 수도 있습니다. 이러한 내부 함수를 사용할 수는 있지만, 해당 함수는 계약의 abi의 일부가 아니기 때문에 외부에서 상호 작용할 수는 없습니다. 해당 내부 함수는 해당 구성 요소를 포함하는 계약 내에서만 사용할 수 있습니다.

source: Functions within these `impl` block expect arguments like `ref self: ComponentState<TContractState>` (for state-modifying functions) or `self: @ComponentState<TContractState>` (for view functions). This makes the impl generic over `TContractState`, allowing us to use this component in any contract.
id: Fungsi-fungsi dalam blok `impl` ini mengharapkan argumen seperti `ref self: ComponentState<TContractState>` (untuk fungsi-fungsi yang memodifikasi state) atau `self: @ComponentState<TContractState>` (untuk fungsi-fungsi view). Hal ini membuat impl menjadi generik terhadap `TContractState`, memungkinkan kita untuk menggunakan komponen ini dalam berbagai kontrak.
ko: 이 `impl` 블록 내의 함수들은 `ref self: ComponentState<TContractState>` (상태 수정 함수용) 또는 `self: @ComponentState<TContractState>` (뷰 함수용)와 같은 인수를 기대합니다. 이는 `TContractState`에 대해 일반화된 `impl`을 만들어 이 컴포넌트를 모든 계약에서 사용할 수 있게 합니다.

source: Example: an Ownable component
id: Contoh: sebuah komponen Ownable
ko: 예시: 소유 가능한 구성요소

source: ⚠️ The example shown below has not been audited and is not intended for production use. The authors are not responsible for any damages caused by the use of this code.
id: ⚠️ Contoh yang ditunjukkan di bawah ini belum diaudit dan tidak dimaksudkan untuk digunakan secara produksi. Para penulis tidak bertanggung jawab atas segala kerusakan yang disebabkan oleh penggunaan kode ini.
ko: ⚠️ 아래에 표시된 예시는 검토되지 않았으며 제품 사용을 위한 것이 아닙니다. 저자는 이 코드 사용으로 인해 발생하는 피해에 대해 책임지지 않습니다.

source: The interface of the Ownable component, defining the methods available externally to manage ownership of a contract, would look like this:
id: Antarmuka dari komponen Ownable, yang mendefinisikan metode-metode yang tersedia secara eksternal untuk mengelola kepemilikan sebuah kontrak, akan terlihat seperti ini:
ko: Ownable 구성 요소의 인터페이스는 계약 소유권을 관리하기 위해 외부에서 사용 가능한 메서드를 정의하며 다음과 같이 보일 것입니다:

source: The component itself is defined as:
id: Komponen itu sendiri didefinisikan sebagai:
ko: 구성 요소 자체는 다음과 같이 정의됩니다:
zh_cn: 组件本身定义为：

source: This syntax is actually quite similar to the syntax used for contracts. The only differences relate to the `#[embeddable_as]` attribute above the impl and the genericity of the impl block that we will dissect in details.
id: Syntax ini sebenarnya cukup mirip dengan syntax yang digunakan untuk kontrak. Satu-satunya perbedaan terkait dengan atribut `#[embeddable_as]` di atas impl dan genericity dari blok impl yang akan kita analisis secara detail.
ko: 이 구문은 실제로 계약에 사용되는 구문과 매우 유사합니다. 유일한 차이점은 impl 위에 있는 `#[embeddable_as]` 속성과 우리가 자세히 살펴볼 impl 블록의 일반성과 관련이 있습니다.

source: As you can see, our component has two `impl` blocks: one corresponding to the implementation of the interface trait, and one containing methods that should not be exposed externally and are only meant for internal use. Exposing the `assert_only_owner` as part of the interface wouldn't make sense, as it's only meant to be used internally by a contract embedding the component.
id: Seperti yang dapat Anda lihat, komponen kami memiliki dua blok `impl`: satu yang sesuai dengan implementasi dari trait antarmuka, dan satu berisi metode-metode yang tidak seharusnya terpapar secara eksternal dan hanya dimaksudkan untuk penggunaan internal. Memaparkan `assert_only_owner` sebagai bagian dari antarmuka tidak akan masuk akal, karena itu hanya dimaksudkan untuk digunakan secara internal oleh sebuah kontrak yang menanamkan komponen.
ko: 보시다시피, 우리 구성 요소에는 두 개의 `impl` 블록이 있습니다: 하나는 인터페이스 트레이트의 구현에 해당하고, 다른 하나는 외부에 노출되어서는 안 되는 메서드를 포함하고 있으며 내부적으로만 사용되어야 합니다. 인터페이스의 일부로 `assert_only_owner`를 노출하는 것은 의미가 없습니다. 왜냐하면 이는 구성 요소를 포함하는 계약에 의해 내부적으로만 사용되도록 의도되었기 때문입니다.

source: A closer look at the `impl` block
id: Pemeriksaan lebih rinci pada blok `impl`
ko: `impl` 블록을 더 자세히 살펴보기
