Repository: cairo-book/cairo-book
Catalog: po/*.po
Languages: es, id, ko, zh_cn

source: The example function body uses the `assert!` macro, which contains the result of adding 2 and 2, equals 4. This assertion serves as an example of the format for a typical test. Let’s run it to see that this test passes.
ko: 예제 함수 본문은 `assert!` 매크로를 사용하는데, 이는 2와 2를 더한 결과가 4인지를 포함합니다. 이 단언은 전형적인 테스트 형식의 예시로 사용됩니다. 이 테스트가 통과하는지 확인하기 위해 실행해 봅시다.

source: The `scarb cairo-test` command runs all tests founds in our project, as shown in Listing 9-2.
id: Perintah `scarb cairo-test` menjalankan semua pengujian yang ditemukan dalam proyek kita, seperti yang ditunjukkan pada Listing 9-2.
ko: `scarb cairo-test` 명령어는 프로젝트에서 찾은 모든 테스트를 실행합니다. 9-2 목록에 나와 있습니다.
zh_cn: 用`scarb cairo-test`命令运行我们项目中的所有测试，如示例9-2所示。

source: Listing 9-2: The output from running a test
id: Listing 9-2: Hasil dari menjalankan sebuah pengujian
ko: 리스팅 9-2: 테스트 실행 결과

source: `scarb cairo-test` compiled and ran the test. We see the line `running 1 tests`. The next line shows the name of the test function, called `it_works`, and that the result of running that test is `ok`. The overall summary `test result: ok.` means that all the tests passed, and the portion that reads `1 passed; 0 failed` totals the number of tests that passed or failed.
id: `scarb cairo-test` mengompilasi dan menjalankan pengujian. Kita melihat baris `running 1 tests`. Baris berikutnya menunjukkan nama fungsi pengujian, yang disebut `it_works`, dan bahwa hasil dari menjalankan pengujian tersebut adalah `ok`. Ringkasan keseluruhan `test result: ok.` berarti bahwa semua pengujian berhasil, dan bagian yang berbunyi `1 passed; 0 failed` menghitung jumlah pengujian yang berhasil atau gagal.
ko: `scarb cairo-test`가 컴파일되고 테스트가 실행되었습니다. 우리는 `running 1 tests` 라인을 볼 수 있습니다. 다음 라인에는 `it_works`라는 테스트 함수의 이름과 해당 테스트를 실행한 결과인 `ok`가 표시됩니다. 전체적인 요약인 `test result: ok.`는 모든 테스트가 통과되었음을 의미하며, `1 passed; 0 failed`라고 쓰인 부분은 통과한 테스트와 실패한 테스트의 총 수를 보여줍니다.
zh_cn: `scarb cairo-test`编译并运行了测试。我们看到一行`running 1 tests`。下一行显示了生成的测试函数的名称，叫做`it_works`，运行该测试的结果是`ok`。总体摘要`test result: ok.`意味着所有的测试都通过了，`1 passed; 0 failed` 的部分展示了通过或失败的测试的总数。

source: It’s possible to mark a test as ignored so it doesn’t run in a particular instance; we’ll cover that in the [Ignoring Some Tests Unless Specifically Requested](#ignoring-some-tests-unless-specifically-requested) section later in this chapter. Because we haven’t done that here, the summary shows `0 ignored`. We can also pass an argument to the `scarb cairo-test` command to run only a test whose name matches a string; this is called filtering and we’ll cover that in the [Running Single Tests](#running-single-tests) section. We also haven’t filtered the tests being run, so the end of the summary shows `0 filtered out`.
id: Mungkin untuk menandai pengujian sebagai diabaikan sehingga tidak dijalankan dalam suatu instansi tertentu; kita akan mencakup hal ini di bagian [Mengabaikan Beberapa Pengujian Kecuali Diminta Secara Khusus](#mengabaikan-beberapa-pengujian-kecuali-diminta-secara-khusus) nanti dalam bab ini. Karena kita belum melakukannya di sini, ringkasan menunjukkan `0 diabaikan`. Kita juga dapat melewatkan argumen ke perintah `scarb cairo-test` untuk menjalankan hanya pengujian yang namanya cocok dengan string; ini disebut sebagai penyaringan dan akan kita bahas di bagian [Menjalankan Pengujian Tunggal](#menjalankan-pengujian-tunggal). Kita juga belum menyaring pengujian yang dijalankan, sehingga akhir ringkasan menunjukkan `0 disaring`.
ko: 이 특정 인스턴스에서 테스트를 실행하지 않도록 무시된 것으로 표시할 수 있습니다; 이에 대해 이 장의 나중에 [특정 요청이 있을 때 일부 테스트 무시하기](#ignoring-some-tests-unless-specifically-requested) 섹션에서 다룰 것입니다. 여기서는 그렇게 하지 않았기 때문에 요약에는 `0 ignored`로 표시됩니다. 또한 `scarb cairo-test` 명령에 인수를 전달하여 이름과 일치하는 테스트만 실행할 수도 있습니다; 이를 필터링이라고 하며, [단일 테스트 실행](#running-single-tests) 섹션에서 다룰 것입니다. 또한 실행 중인 테스트를 필터링하지 않았기 때문에 요약의 끝에 `0 filtered out`로 표시됩니다.
zh_cn: 我们可以把一个测试标记为忽略，这样它就不会在一个特定的实例中运行；我们将在本章后面的[忽略一些测试，除非特别要求](#ignoring-some-tests-unless-specifically-requested)一节中介绍。因为我们在这里没有这样做，所以摘要中显示 `0 ignored`。我们也可以给`cairo-test`命令传递一个参数，只运行名称与某个字符串相匹配的测试；这叫做过滤，我们将在[运行单个测试](#running-single-test)一节中介绍。我们也没有对正在运行的测试进行过滤，所以总结的最后显示`0 filtered out`。

source: Let’s start to customize the test to our own needs. First change the name of the `it_works` function to a different name, such as `exploration`, like so:
es: Comencemos a personalizar la prueba según nuestras necesidades. Primero, cambie el nombre de la función `it_works` a un nombre diferente, como `exploration`, así:
id: Mari mulai menyesuaikan pengujian sesuai kebutuhan kita. Pertama, ubah nama fungsi `it_works` menjadi nama lain, misalnya `exploration`, seperti ini:
ko: 우리의 요구에 맞게 테스트를 맞춤 설정하기 시작합시다. 먼저 `it_works` 함수의 이름을 `exploration`과 같이 다른 이름으로 변경해주세요.
zh_cn: 让我们开始根据我们自己的需要定制测试。首先将`it_works`函数的名称改为不同的名称，例如`exploration`，像这样：

source: Then run `scarb cairo-test` again. The output now shows `exploration` instead of `it_works`:
id: Kemudian jalankan `scarb cairo-test` lagi. Output sekarang menunjukkan `exploration` alih-alih `it_works`:
ko: 그런 다음 `scarb cairo-test`를 다시 실행하십시오. 출력은 이제 `it_works` 대신 `exploration`을 보여줍니다.
zh_cn: 然后再次运行`scarb cairo-test`。现在输出显示的是 `exploration`而不是`it_works`：

source: Now we’ll add another test, but this time we’ll make a test that fails! Tests fail when something in the test function panics. Each test is run in a new thread, and when the main thread sees that a test thread has died, the test is marked as failed. Enter the new test as a function named `another`, so your _src/lib.cairo_ file looks like Listing 9-3.
id: Sekarang kita akan menambahkan pengujian lain, tapi kali ini kita akan membuat pengujian yang gagal! Pengujian gagal ketika ada sesuatu yang panik dalam fungsi pengujian. Setiap pengujian dijalankan dalam thread baru, dan ketika thread utama melihat bahwa thread pengujian telah mati, pengujian ditandai sebagai gagal. Masukkan pengujian baru sebagai fungsi bernama `another`, sehingga berkas _src/lib.cairo_ Anda terlihat seperti Listing 9-3.
ko: 이제 다른 테스트를 추가할 것이지만, 이번에는 실패하는 테스트를 만들 것입니다! 테스트는 테스트 함수에서 패닉이 발생할 때 실패합니다. 각 테스트는 새로운 스레드에서 실행되며, 메인 스레드가 테스트 스레드가 종료된 것을 감지하면 테스트가 실패로 표시됩니다. `another`라는 함수로 새로운 테스트를 입력하여 _src/lib.cairo_ 파일이 9-3번 코드와 같이 보이도록 합니다.
zh_cn: 现在我们将添加另一个测试，但这次我们要做一个失败的测试! 当测试函数中的某些东西发生panic时，测试就会失败。每个测试都在一个新的线程中运行，当主线程看到一个测试线程死亡时，该测试被标记为失败。将新的测试作为一个名为`another`的函数输入，因此你的 _src/lib.cairo_ 文件看起来像示例9-3里一样。

source: "Make this test fail"
ko: "이 테스트를 실패하게 만들어주세요"

source: Listing 9-3: Adding a second test that will fail
id: Listing 9-3: Menambahkan tes kedua yang akan gagal
ko: 리스트 9-3: 실패할 두 번째 테스트 추가하기

source: Listing 9-4: Test results when one test passes and one test fails
id: Listing 9-4: Hasil tes ketika satu tes berhasil dan satu tes gagal
ko: 리스팅 9-4: 하나의 테스트가 통과하고 하나의 테스트가 실패한 경우의 테스트 결과

source: Instead of `ok`, the line `adder::lib::tests::another` shows `fail`. A new section appears between the individual results and the summary. It displays the detailed reason for each test failure. In this case, we get the details that `another` failed because it panicked with `[1725643816656041371866211894343434536761780588 ('Make this test fail'), ]` in the _src/lib.cairo_ file.
es: En lugar de `ok`, la línea `adder::lib::tests::another` muestra `fail`. Aparece una nueva sección entre los resultados individuales y el resumen. Muestra la razón detallada de cada falla de prueba. En este caso, obtenemos los detalles de que `another` falló porque falló con un pánico con `[1725643816656041371866211894343434536761780588 ('Make this test fail'), ]` en el archivo _src/lib.cairo_.
id: Alih-alih `ok`, baris `adder::lib::tests::another` menunjukkan `fail`. Sebuah bagian baru muncul di antara hasil individu dan ringkasan. Ini menampilkan alasan rinci untuk setiap kegagalan tes. Dalam kasus ini, kita mendapatkan detail bahwa `another` gagal karena terjadi panic dengan `[1725643816656041371866211894343434536761780588 ('Make this test fail'), ]` di dalam file _src/lib.cairo_.
ko: `ok` 대신 `adder::lib::tests::another` 라인이 `fail`을 보여줍니다. 개별 결과와 요약 사이에 새로운 섹션이 나타납니다. 각 테스트 실패에 대한 자세한 이유를 표시합니다. 이 경우에는 `another`가 _src/lib.cairo_ 파일에서 `[1725643816656041371866211894343434536761780588 ('Make this test fail'), ]`로 패닉 상태가 되어 실패했다는 세부 정보를 얻습니다.
zh_cn: `adder::lib::test::another`这一行没有显示`ok`，而是显示`fail`。在单个结果和摘要之间出现了一个新的部分。它显示了每个测试失败的详细原因。在这个例子中，我们得到的细节在是 _src/lib.cairo_文件中`another`失败了，因为它发生了panic `[1725643816656041371866211894343434536761780588 (‘Make this test fail’), ]`。

source: The summary line displays at the end: overall, our test result is `FAILED`. We had one test pass and one test fail.
es: La línea de resumen se muestra al final: en general, nuestro resultado de prueba es `FAILED`. Tuvimos una prueba que pasó y otra que falló.
id: Baris ringkasan ditampilkan di akhir: secara keseluruhan, hasil tes kita adalah `GAGAL`. Kita memiliki satu tes yang berhasil dan satu tes yang gagal.
ko: 요약 라인은 끝에 표시됩니다: 전반적으로, 우리의 테스트 결과는 `실패`입니다. 하나의 테스트가 통과하고 하나의 테스트가 실패했습니다.
zh_cn: 摘要行显示在最后：总的来说，我们的测试结果是`FAILED`。我们有一个测试通过，一个测试失败。

source: Now that you’ve seen what the test results look like in different scenarios, let’s look at some functions that are useful in tests.
es: Ahora que ha visto cómo son los resultados de las pruebas en diferentes escenarios, veamos algunas funciones que son útiles en las pruebas.
id: Sekarang setelah Anda telah melihat bagaimana hasil tes terlihat dalam skenario yang berbeda, mari kita lihat beberapa fungsi yang berguna dalam tes.
ko: 다양한 시나리오에서 시험 결과가 어떻게 보이는지 확인했으니, 시험에서 유용한 몇 가지 기능을 살펴보겠습니다.
zh_cn: 现在你已经看到了不同场景下的测试结果，让我们看看一些在测试中有用的函数。

source: Checking Results with the `assert!` macro
ko: `assert!` 매크로를 사용하여 결과 확인하기

source: The `assert!` macro, provided by Cairo, is useful when you want to ensure that some condition in a test evaluates to `true`. We give the `assert!` macro a first argument that evaluates to a Boolean. If the value is `true`, nothing happens and the test passes. If the value is `false`, the `assert!` macro calls `panic()` to cause the test to fail with a message we defined as the second argument. Using the `assert!` macro helps us check that our code is functioning in the way we intend.
ko: `assert!` 매크로는 Cairo에서 제공되며, 테스트에서 어떤 조건이 `true`로 평가되는지를 보장하고 싶을 때 유용합니다. `assert!` 매크로에는 불리언으로 평가되는 첫 번째 인수를 제공합니다. 값이 `true`이면 아무 일도 발생하지 않고 테스트가 통과됩니다. 값이 `false`이면 `assert!` 매크로가 `panic()`을 호출하여 두 번째 인수로 정의한 메시지와 함께 테스트가 실패하도록 만듭니다. `assert!` 매크로를 사용하면 코드가 의도한 대로 작동하는지 확인할 수 있습니다.

source: In [Chapter 5, Listing 5-13](ch05-03-method-syntax.md#multiple-impl-blocks), we used a `Rectangle` struct and a `can_hold` method, which are repeated here in Listing 9-5. Let’s put this code in the _src/lib.cairo_ file, then write some tests for it using the `assert!` macro.
ko: [제 5장, 목록 5-13](ch05-03-method-syntax.md#multiple-impl-blocks)에서는 `Rectangle` 구조체와 `can_hold` 메서드를 사용했는데, 이것들이 목록 9-5에서 다시 나타납니다. 이 코드를 _src/lib.cairo_ 파일에 넣고, `assert!` 매크로를 사용하여 몇 가지 테스트를 작성해 보겠습니다.

source: Listing 9-5: Using the `Rectangle` struct and its `can_hold` method from Chapter 5
id: Listing 9-5: Menggunakan struktur `Rectangle` dan metodenya `can_hold` dari Bab 5
ko: 리스트 9-5: 5장에서 `Rectangle` 구조체와 그 `can_hold` 메서드를 사용하기

source: The `can_hold` method returns a `bool`, which means it’s a perfect use case for the `assert!` macro. In Listing 9-6, we write a test that exercises the `can_hold` method by creating a `Rectangle` instance that has a width of `8` and a height of `7` and asserting that it can hold another `Rectangle` instance that has a width of `5` and a height of `1`.
ko: `can_hold` 메서드는 `bool`을 반환하며, 이는 `assert!` 매크로에 완벽하게 사용되는 사례입니다. 9-6 목록에서는 `can_hold` 메서드를 연습하는 테스트를 작성합니다. `Rectangle` 인스턴스를 만들어 너비가 `8`이고 높이가 `7`인 `Rectangle` 인스턴스가 다른 `Rectangle` 인스턴스를 보유할 수 있다고 단언합니다. 이렇게 하면 너비가 `5`이고 높이가 `1`인 `Rectangle` 인스턴스를 만들 수 있습니다.

source: "rectangle cannot hold"
ko: "사각형은 보관할 수 없습니다."

source: Listing 9-6: A test for `can_hold` that checks whether a larger rectangle can indeed hold a smaller rectangle
id: Listing 9-6: Tes untuk `can_hold` yang memeriksa apakah suatu persegi panjang yang lebih besar dapat benar-benar menahan persegi panjang yang lebih kecil
ko: 리스팅 9-6: 더 큰 직사각형이 실제로 더 작은 직사각형을 보관할 수 있는지 확인하는 `can_hold`에 대한 테스트

source: Note that we’ve added two new lines inside the tests module: `use super::Rectangle;` and `use super::RectangleTrait;`. The tests module is a regular module that follows the usual visibility rules. Because the tests module is an inner module, we need to bring the code under test in the outer module into the scope of the inner module.
es: Note que hemos agregado dos nuevas líneas dentro del módulo de pruebas: `use super::Rectangle;` y `use super::RectangleTrait;`. El módulo de pruebas es un módulo regular que sigue las reglas normales de visibilidad. Debido a que el módulo de pruebas es un módulo interno, necesitamos traer el código bajo prueba en el módulo externo al ámbito del módulo interno.
id: Perhatikan bahwa kami telah menambahkan dua baris baru di dalam modul tes: `use super::Rectangle;` dan `use super::RectangleTrait;`. Modul tes adalah modul biasa yang mengikuti aturan visibilitas biasa. Karena modul tes adalah modul dalam, kita perlu membawa kode yang sedang diuji di modul luar ke dalam cakupan modul dalam tersebut.
ko: 테스트 모듈 내에 두 개의 새로운 줄을 추가했음을 유의하세요: `use super::Rectangle;` 및 `use super::RectangleTrait;`. 테스트 모듈은 일반적인 모듈이며 일반적인 가시성 규칙을 따릅니다. 테스트 모듈은 내부 모듈이므로 외부 모듈의 테스트 대상 코드를 내부 모듈의 범위로 가져와야 합니다.
zh_cn: 注意，我们在测试模块中加入了两行新的内容：`use super::Rectangle;`和`use super::RectangleTrait;`。测试模块是一个常规模块，遵循通常的可见性规则。因为测试模块是一个内部模块，我们需要将外部模块中的被测代码引入内部模块的范围。

source: We’ve named our test `larger_can_hold_smaller`, and we’ve created the two `Rectangle` instances that we need. Then we called the `assert!` macro and passed it the result of calling `larger.can_hold(@smaller)`. This expression is supposed to return `true`, so our test should pass. Let’s find out!
ko: 우리는 테스트를 `larger_can_hold_smaller`로 명명했고, 필요한 두 개의 `Rectangle` 인스턴스를 생성했습니다. 그런 다음 `assert!` 매크로를 호출하고 `larger.can_hold(@smaller)`를 호출한 결과를 전달했습니다. 이 표현식은 `true`를 반환해야 하므로 우리의 테스트는 통과해야 합니다. 확인해 봅시다!

source: It does pass! Let’s add another test, this time asserting that a smaller rectangle cannot hold a larger rectangle:
es: ¡Pasó la prueba! Ahora agreguemos otra prueba, esta vez afirmamos que un rectángulo más pequeño no puede contener un rectángulo más grande:
id: Tes tersebut berhasil! Mari tambahkan tes lain, kali ini mengasertakan bahwa sebuah persegi panjang yang lebih kecil tidak dapat menahan sebuah persegi panjang yang lebih besar:
ko: 그것은 통과합니다! 더 많은 테스트를 추가해 봅시다. 이번에는 더 작은 직사각형이 더 큰 직사각형을 담을 수 없음을 확인하는 테스트를 추가해 봅시다.
zh_cn: 它确实通过了!让我们再增加���个测试，这次是断言一个较小的矩形不能容纳一个较大的矩形：

source: Because the correct result of the `can_hold` function in this case is `false`, we need to negate that result before we pass it to the `assert!` macro. As a result, our test will pass if `can_hold` returns false:
ko: 이 경우 `can_hold` 함수의 올바른 결과가 `false`이기 때문에, `assert!` 매크로에 전달하기 전에 해당 결과를 부정해야 합니다. 결과적으로, `can_hold`가 false를 반환하면 테스트가 통과됩니다.

source: Two tests that pass! Now let’s see what happens to our test results when we introduce a bug in our code. We’ll change the implementation of the `can_hold` method by replacing the greater-than sign with a less-than sign when it compares the widths:
es: ¡Dos pruebas que pasan! Ahora veamos qué sucede con los resultados de nuestras pruebas cuando introducimos un error en nuestro código. Cambiaremos la implementación del método `can_hold` reemplazando el signo mayor que (`>`) por un signo menor que (`<`) cuando compara los anchos:
id: Dua tes yang berhasil! Sekarang mari kita lihat apa yang terjadi pada hasil tes kita ketika kita memperkenalkan bug dalam kode kita. Kita akan mengubah implementasi metode `can_hold` dengan mengganti tanda greater-than dengan tanda less-than ketika membandingkan lebar:
ko: 두 개의 테스트가 통과합니다! 이제 코드에 버그를 도입할 때 우리의 테스트 결과가 어떻게 변하는지 살펴봅시다. 우리는 `can_hold` 메소드의 구현을 변경하여 너비를 비교할 때 크다는 기호를 작다는 기호로 바꿀 것입니다:
zh_cn: 两个测试都通过了!现在让我们看看当我们在代码中引入一个错误时，我们的测试结果会怎样。我们将改变`can_hold`方法的实现，当它比较宽度时，将大于号替换为小于号：

source: Running the tests now produces the following:
es: Ejecutando los test ahora produce lo siguiente:
id: Menjalankan tes sekarang menghasilkan yang berikut:
ko: 지금 테스트를 실행하면 다음이 생성됩니다.
zh_cn: 现在运行测试产生以下结果：

source: Our tests caught the bug! Because `larger.width` is `8` and `smaller.width` is `5`, the comparison of the widths in `can_hold` now returns `false`: `8` is not less than `5`.
es: Nuestras pruebas han detectado el error. Como `mayor.anchura` es `8` y `menor.anchura` es `5`, la comparación de las anchuras en `can_hold` ahora devuelve `false`: `8` no es menor que `5`.
id: Tes kita menangkap bug tersebut! Karena `larger.width` adalah `8` dan `smaller.width` adalah `5`, perbandingan lebar dalam `can_hold` sekarang mengembalikan `false`: `8` tidak kurang dari `5`.
ko: 우리의 테스트가 버그를 잡았습니다! `larger.width`가 `8`이고 `smaller.width`가 `5`이기 때문에, `can_hold`에서 너비를 비교하면 이제 `false`를 반환합니다: `8`은 `5`보다 작지 않습니다.
zh_cn: 我们的测试发现了这个错误! 因为`larger.width`是`8`，`smaller.width`是`5`，`can_hold`中的宽度比较现在返回`false`：因为`8`不比`5`小。

source: Testing Equality with the `assert_eq!` and `assert_ne!` Macros
ko: `assert_eq!` 및 `assert_ne!` 매크로를 사용하여 동등성 테스트하기

source: A common way to verify functionality is to test for equality between the result of the code under test and the value you expect the code to return. You could do this using the `assert!` macro and passing it an expression using the `==` operator. However, this is such a common test that the standard library provides a pair of macros—`assert_eq!` and `assert_ne!`—to perform this test more conveniently. These macros compare two arguments for equality or inequality, respectively. They’ll also print the two values if the assertion fails, which makes it easier to see _why_ the test failed; conversely, the `assert!` macro only indicates that it got a `false` value for the `==` expression, without printing the values that led to the `false` value.
ko: 기능을 확인하는 일반적인 방법은 테스트 코드의 결과와 코드가 반환해야 하는 값을 비교하는 것입니다. `assert!` 매크로를 사용하여 `==` 연산자를 사용한 표현식을 전달하여 이 작업을 수행할 수 있습니다. 그러나 이는 매우 흔한 테스트이므로 표준 라이브러리는 이 테스트를 더 편리하게 수행하기 위해 `assert_eq!`와 `assert_ne!`라는 매크로 쌍을 제공합니다. 이러한 매크로는 각각 두 인수를 동등성 또는 부등성으로 비교합니다. 또한 단언이 실패하면 두 값을 출력하여 테스트가 실패한 이유를 더 쉽게 파악할 수 있습니다. 반면, `assert!` 매크로는 `==` 표현식에 대해 `false` 값을 받았다는 것만 나타내고 `false` 값을 유발한 값을 출력하지 않습니다.

source: In Listing 9-7, we write a function named `add_two` that adds `2` to its parameter, then we test this function using the `assert_eq!` macro.
ko: 리스팅 9-7에서는 매개변수에 `2`를 더하는 `add_two`라는 함수를 작성하고, 이 함수를 `assert_eq!` 매크로를 사용하여 테스트합니다.

source: Listing 9-7: Testing the function `add_two` using the `assert_eq!` macro
ko: 리스팅 9-7: `assert_eq!` 매크로를 사용하여 함수 `add_two`를 테스트하기

source: Let’s check that it passes!
ko: 그게 통과하는지 확인해 봅시다!

source: We pass `4` as the argument to `assert_eq!`, which is equal to the result of calling `add_two(2)`. The line for this test is `test tests::it_adds_two ... ok`, and the `ok` text indicates that our test passed!
ko: 우리는 `assert_eq!`에 인수로 `4`를 전달하고, 이는 `add_two(2)`를 호출한 결과와 같습니다. 이 테스트의 라인은 `test tests::it_adds_two ... ok`이며, `ok` 텍스트는 우리의 테스트가 통과되었음을 나타냅니다!

source: Let’s introduce a bug into our code to see what `assert_eq!` looks like when it fails. Change the implementation of the `add_two` function to instead add `3`:
ko: 우리의 코드에 버그를 도입하여 `assert_eq!`가 실패할 때 어떻게 보이는지 살펴보겠습니다. `add_two` 함수의 구현을 변경하여 대신 `3`을 추가하도록 변경하십시오.

source: Run the tests again:
ko: 테스트를 다시 실행하세요.

source: ```console $ scarb cairo-test running 1 tests test tests::it_adds_two ... fail (gas usage est.: 359600) failures: tests::it_adds_two - Panicked with "assertion `4 == add_two(2)` failed. 4: 4 add_two(2): 5". Error: test result: FAILED. 0 passed; 1 failed; 0 ignored ```
ko: ```console $ scarb cairo-test 1개의 테스트 실행 중 테스트 tests::it_adds_two ... 실패 (가스 사용량 예상: 359600) 실패 사항: tests::it_adds_two - "assertion `4 == add_two(2)` 실패로 패닉. 4: 4 add_two(2): 5". 에러: 테스트 결과: 실패. 0개 통과; 1개 실패; 0개 무시됨 ```

source: Our test caught the bug! The `it_adds_two` test failed with the following message: ``Panicked with "assertion `4 == add_two(2)` failed``. It tells use that the assertion that fails was `` "assertion `left == right` failed`` and the `left` and `right` value are printed on the next lines as `left: left_value` and `right: right_value`. This helps us start debugging: the `left` argument was `4` but the `right` argument, where we had `add_two(2)`, was `5`. You can imagine that this would be especially helpful when we have a lot of tests going on.
ko: 우리의 테스트는 버그를 잡았습니다! `it_adds_two` 테스트가 다음 메시지와 함께 실패했습니다: "assertion `4 == add_two(2)`가 실패했습니다". 실패한 단언이 "assertion `left == right`가 실패했습니다"라고 알려주며, `left`와 `right` 값이 다음 줄에 `left: left_value`와 `right: right_value`로 출력됩니다. 이는 디버깅을 시작하는 데 도움이 됩니다: `left` 인수는 `4`이지만 `add_two(2)`를 사용한 `right` 인수는 `5`였습니다. 많은 테스트가 진행 중일 때 특히 도움이 될 것입니다.

source: Note that in some languages and test frameworks, the parameters to equality assertion functions are called `expected` and `actual`, and the order in which we specify the arguments matters. However, in Cairo, they’re called `left` and `right`, and the order in which we specify the value we expect and the value the code produces doesn’t matter. We could write the assertion in this test as `assert_eq!(add_two(2), 4)`, which would result in the same failure message that displays `` assertion failed: `(left == right)` ``.
ko: 일부 언어 및 테스트 프레임워크에서는 동등성 단언 함수의 매개변수를 `예상` 및 `실제`로 부르며, 인수를 지정하는 순서가 중요합니다. 그러나 Cairo에서는 `왼쪽`과 `오른쪽`으로 불리며, 우리가 기대하는 값과 코드가 생성하는 값을 지정하는 순서는 중요하지 않습니다. 이 테스트에서 단언을 `assert_eq!(add_two(2), 4)`로 작성할 수 있으며, 이는 `` assertion failed: `(left == right)` ``라는 동일한 실패 메시지를 표시할 것입니다.

source: The `assert_ne!` macro will pass if the two values we give it are not equal and fail if they’re equal. This macro is most useful for cases when we’re not sure what a value _will_ be, but we know what the value definitely _shouldn’t_ be. For example, if we’re testing a function that is guaranteed to change its input in some way, but the way in which the input is changed depends on the day of the week that we run our tests, the best thing to assert might be that the output of the function is not equal to the input.
ko: `assert_ne!` 매크로는 우리가 제공하는 두 값이 동일하지 않으면 통과하고 동일하면 실패합니다. 이 매크로는 값이 무엇이 될지 확실하지 않지만 값이 결코 되어서는 안 될 것을 알고 있는 경우에 가장 유용합니다. 예를 들어, 우리가 테스트하는 함수가 입력을 어떤 방식으로든 변경할 것이 보장되지만 입력이 변경되는 방식은 테스트를 실행하는 요일에 따라 달라진다면, 함수의 출력이 입력과 동일하지 않아야 한다는 것을 단언하는 것이 가장 좋을 수 있습니다.

source: Under the surface, the `assert_eq!` and `assert_ne!` macros use the operators `==` and `!=`, respectively. When the assertions fail, these macros print their arguments using debug formatting, which means the values being compared must implement the `PartialEq` and `Debug` traits. All primitive types and most of the core library types implement these traits. For structs and enums that you define yourself, you’ll need to implement `PartialEq` to assert equality of those types. You’ll also need to implement `Debug` to print the values when the assertion fails. Because both traits are derivable traits this is usually as straightforward as adding the `#[derive(Drop, Debug, PartialEq)]` annotation to your struct or enum definition. See Appendix C, [“Derivable Traits”](./appendix-03-derivable-traits.md), for more details about these and other derivable traits.
ko: 표면 아래에서 `assert_eq!` 및 `assert_ne!` 매크로는 각각 `==` 및 `!=` 연산자를 사용합니다. 단언문이 실패할 때, 이러한 매크로는 디버그 형식을 사용하여 인수를 출력하며, 비교되는 값은 `PartialEq` 및 `Debug` 트레이트를 구현해야 합니다. 모든 기본 유형과 대부분의 코어 라이브러리 유형은 이러한 트레이트를 구현합니다. 직접 정의한 구조체 및 열거형에 대해선 해당 유형의 동등성을 단언하기 위해 `PartialEq`를 구현해야 합니다. 또한, 단언문이 실패할 때 값을 출력하기 위해 `Debug`를 구현해야 합니다. 두 트레이트 모두 파생 가능한 트레이트이므로, 이는 보통 구조체나 열거형 정의에 `#[derive(Drop, Debug, PartialEq)]` 주석을 추가하는 것만으로 간단하게 처리됩니다. 더 자세한 내용은 Appendix C, [“Derivable Traits”](./appendix-03-derivable-traits.md)를 참조하세요.

source: Adding Custom Failure Messages
ko: 사용자 정의 실패 메시지 추가하기
