Repository: cairo-book/cairo-book
Catalog: po/*.po
Languages: es, id, ko, zh_cn

source: Here we’ve defined a struct and named it `Rectangle`. Inside the curly brackets, we defined the fields as `width` and `height`, both of which have type `u64`. Then, in `main`, we created a particular instance of `Rectangle` that has a width of `30` and a height of `10`. Our `area` function is now defined with one parameter, which we’ve named `rectangle` which is of type `Rectangle` struct. We can then access the fields of the instance with dot notation, and it gives descriptive names to the values rather than using the tuple index values of `0` and `1`.
es: Aquí hemos definido una estructura y la hemos llamado `Rectangle`. Dentro de las llaves, definimos los campos como `width` y `height`, los cuales tienen el tipo `u64`. Luego, en `main`, creamos una instancia particular de `Rectangle` que tiene un ancho de `30` y una altura de `10`. Nuestra función `area` ahora está definida con un parámetro, al que hemos llamado `rectangle` que es de tipo de la estructura `Rectangle`. Luego podemos acceder a los campos de la instancia con notación de punto, y dar nombres descriptivos a los valores en lugar de usar los valores de índice de tupla de `0` y `1`.
id: Di sini kita telah mendefinisikan sebuah struct dan memberinya nama `Rectangle`. Di dalam kurung kurawal, kita mendefinisikan field-field sebagai `width` dan `height`, yang keduanya memiliki tipe `u64`. Kemudian, di `main`, kita membuat sebuah instance khusus dari `Rectangle` yang memiliki lebar `30` dan tinggi `10`. Fungsi `area` kita sekarang didefinisikan dengan satu parameter, yang kita beri nama `rectangle` yang bertipe struct `Rectangle`. Kita dapat mengakses field-field dari instance tersebut dengan notasi titik, dan memberikan nama-nama yang deskriptif pada nilai-nilai tersebut daripada menggunakan nilai indeks tuple `0` dan `1`.
ko: 여기서는 구조체를 정의하고 `Rectangle`이라고 이름 지었습니다. 중괄호 안에서 `width`와 `height` 필드를 정의했는데, 둘 다 `u64` 타입입니다. 그런 다음 `main`에서 `Rectangle`의 특정 인스턴스를 만들었는데, 너비가 `30`이고 높이가 `10`입니다. 이제 `area` 함수는 하나의 매개변수로 정의되었는데, 우리는 그것을 `Rectangle` 구조체 타입인 `rectangle`로 지정했습니다. 그런 다음 인스턴스의 필드에 점 표기법(dot notation)을 사용하여 액세스할 수 있으며, 튜플 인덱스 값인 `0`과 `1` 대신 값에 설명적인 이름을 부여합니다.
zh_cn: 这里我们定义了一个结构，并将其命名为 `Rectangle`。在大括号中，我们将字段定义为 `width` 和 `height`，它们的类型都是 `u64`。然后，在`main`中，我们创建了一个`Rectangle`的特殊实例，它的宽度是`30`，高度是`10`。我们的 `area`函数现在定义了一个名为 `rectangle`参数，它是`Rectangle`结构类型。然后我们可以用点符号来访问实例的字段，它给这些值起了描述性的名字，而不是使用`0`和`1`的元组索引值。结构体胜在更清晰明了。

source: Adding Useful Functionality with Trait
id: Menambahkan Fungsionalitas yang Berguna dengan Trait
ko: Trait을 사용하여 유용한 기능 추가하기

source: It’d be useful to be able to print an instance of `Rectangle` while we’re debugging our program and see the values for all its fields. Listing 5-9 tries to print `rectangle` using the `print` function. This won’t work.
ko: 프로그램을 디버깅하는 동안 `Rectangle`의 인스턴스를 인쇄하고 모든 필드의 값을 볼 수 있다면 유용할 것입니다. 5-9 목록은 `print` 함수를 사용하여 `rectangle`을 인쇄하려고 시도합니다. 이것은 작동하지 않습니다.

source: Listing 5-9: Attempting to print a `Rectangle` instance
id: Listing 5-9: Mencoba untuk mencetak sebuah instance `Rectangle`
ko: 리스트 5-9: `Rectangle` 인스턴스를 출력하려는 시도

source: When we compile this code, we get an error with this message:
es: Cuando compilamos este código, obtenemos un error con el siguiente mensaje:
id: Ketika kita mengompilasi kode ini, kita mendapatkan sebuah pesan error dengan pesan ini:
ko: 이 코드를 컴파일하면 이 메시지와 함께 오류가 발생합니다:
zh_cn: 当我们编译这段代码时，我们得到了一个错误，有这样的信息：

source: The `PrintTrait` trait is implemented for many data types, but not for the `Rectangle` struct. We can fix this by implementing the `PrintTrait` trait on `Rectangle` as shown in Listing 5-10. To learn more about traits, see [Traits in Cairo](ch08-02-traits-in-cairo.md).
ko: `PrintTrait` 트레이트는 많은 데이터 유형에 대해 구현되어 있지만 `Rectangle` 구조체에 대해서는 구현되어 있지 않습니다. 우리는 Listing 5-10에 표시된 대로 `Rectangle`에 `PrintTrait` 트레이트를 구현함으로써 이를 해결할 수 있습니다. 트레이트에 대해 더 알아보려면 [Traits in Cairo](ch08-02-traits-in-cairo.md)를 참조하십시오.

source: Listing 5-10: Implementing the `PrintTrait` trait on Rectangle
ko: 리스트 5-10: 직사각형에 `PrintTrait` 트레이트 구현하기

source: When we run the `main` function, we get the following output:
ko: `main` 함수를 실행하면 다음과 같은 출력이 나옵니다.

source: Nice! It’s not the prettiest output, but it shows the values of all the fields for this instance, which would definitely help during debugging.
es: ¡Bien! No es el resultado más bonito, pero muestra los valores de todos los campos para esta instancia, lo que definitivamente ayudaría durante la depuración.
id: Bagus! Ini bukan tampilan yang paling bagus, tetapi ini menampilkan nilai dari semua field untuk instance ini, yang pasti akan membantu selama proses debugging.
ko: 좋아요! 가장 예쁘지는 않지만, 이 인스턴스의 모든 필드 값들을 보여주기 때문에 디버깅하는 동안 도움이 될 것입니다.
zh_cn: 很好!这不是最漂亮的输出，但它显示了这个实例的所有字段的值，这在调试时肯定会有帮助。

source: _Methods_ are similar to functions: we declare them with the `fn` keyword and a name, they can have parameters and a return value, and they contain some code that’s run when the method is called from somewhere else. Unlike functions, methods are defined within the context of a type and their first parameter is always `self`, which represents the instance of the type the method is being called on. For those familiar with Rust, Cairo's approach might be confusing, as methods cannot be defined directly on types. Instead, you must define a [trait](./ch08-02-traits-in-cairo.md) and an implementation associated with the type for which the method is intended.
ko: _메소드(Methods)_ 는 함수와 유사합니다: `fn` 키워드와 이름으로 선언하며, 매개변수와 반환 값이 있을 수 있으며, 메소드가 다른 곳에서 호출될 때 실행되는 코드가 포함되어 있습니다. 함수와 달리 메소드는 타입의 문맥 내에서 정의되며, 첫 번째 매개변수는 항상 `self`이며, 이는 메소드가 호출되는 타입의 인스턴스를 나타냅니다. Rust에 익숙한 사람들에게는 Cairo의 접근 방식이 혼란스러울 수 있습니다. 메소드를 타입에 직접 정의할 수 없습니다. 대신, [trait](./ch08-02-traits-in-cairo.md)를 정의하고, 메소드가 의도된 타입과 관련된 구현을 해야 합니다.

source: Defining Methods
id: Mendefinisikan Metode
ko: 메소드 정의

source: Let’s change the `area` function that has a `Rectangle` instance as a parameter and instead make an `area` method defined on the `RectangleTrait` trait, as shown in Listing 5-11.
ko: `area` 함수를 변경하여 `Rectangle` 인스턴스를 매개변수로 사용하는 대신, `RectangleTrait` 트레이트에 정의된 `area` 메서드로 만들어봅시다. (리스팅 5-11 참조)

source: Listing 5-11: Defining an `area` method to use on the `Rectangle`
ko: 리스팅 5-11: `Rectangle`에서 사용할 `area` 메소드 정의하기

source: To define the function within the context of `Rectangle`, we start by defining a `trait` block with the signature of the method that we want to implement. Traits are not linked to a specific type; only the `self` parameter of the method defines which type it can be used with. Then, we define an `impl` (implementation) block for `RectangleTrait`, that defines the behavior of the methods implemented. Everything within this `impl` block will be associated with the type of the `self` parameter of the method called. While it is technically possible to define methods for multiple types within the same `impl` block, it is not a recommended practice, as it can lead to confusion. We recommend that the type of the `self` parameter stays consistent within the same `impl` block. Then we move the `area` function within the `impl` curly brackets and change the first (and in this case, only) parameter to be `self` in the signature and everywhere within the body. In `main`, where we called the `area` function and passed `rect1` as an argument, we can instead use the _method syntax_ to call the `area` method on our `Rectangle` instance. The method syntax goes after an instance: we add a dot followed by the method name, parentheses, and any arguments.
id: Untuk mendefinisikan fungsi dalam konteks `Rectangle`, kita mulai dengan mendefinisikan blok `trait` dengan tanda tangan dari metode yang ingin kita implementasikan. Traits tidak terikat pada tipe tertentu; hanya parameter `self` dari metode yang mendefinisikan tipe mana yang dapat digunakan. Kemudian, kita mendefinisikan blok `impl` (implementasi) untuk `RectangleTrait`, yang mendefinisikan perilaku dari metode-metode yang diimplementasikan. Segala sesuatu dalam blok `impl` ini akan terkait dengan tipe dari parameter `self` dari metode yang dipanggil. Meskipun secara teknis mungkin untuk mendefinisikan metode untuk beberapa tipe dalam blok `impl` yang sama, ini bukan praktik yang direkomendasikan, karena dapat menyebabkan kebingungan. Kami menyarankan agar tipe parameter `self` tetap konsisten dalam blok `impl` yang sama. Kemudian, kita memindahkan fungsi `area` ke dalam kurung kurawal `impl` dan mengubah parameter pertama (dan dalam kasus ini, satu-satunya) menjadi `self` dalam tanda tangan dan di semua bagian dalam tubuh fungsi. Di `main`, di mana kita memanggil fungsi `area` dan melewati `rect1` sebagai argumen, kita sebaliknya dapat menggunakan _method syntax_ untuk memanggil metode `area` pada instance `Rectangle` kita. _Method syntax_ diletakkan setelah sebuah instance: kita tambahkan titik yang diikuti dengan nama metode, tanda kurung, dan argumen-argumen apapun.
ko: 'Rectangle'의 맥락 내에서 함수를 정의하기 위해, 우리는 구현하고자 하는 메소드의 서명을 가진 'trait' 블록을 정의하는 것으로 시작합니다. Traits는 특정 유형에 연결되지 않으며, 메소드의 'self' 매개변수만이 어떤 유형과 함께 사용될 수 있는지를 정의합니다. 그런 다음, 'RectangleTrait'에 대한 'impl' (구현) 블록을 정의하여 구현된 메소드의 동작을 정의합니다. 이 'impl' 블록 내의 모든 것은 호출된 메소드의 'self' 매개변수의 유형과 관련이 있습니다. 동일한 'impl' 블록 내에서 여러 유형에 대한 메소드를 정의하는 것은 기술적으로 가능하지만 혼란을 초래할 수 있으므로 권장되지 않습니다. 'self' 매개변수의 유형이 동일하도록 유지하는 것이 좋습니다. 그런 다음, 'area' 함수를 'impl' 중괄호 내로 이동하고 서명에서 첫 번째 (이 경우에는 유일한) 매개변수를 'self'로 변경하고 본문 내에서 모두 변경합니다. 'main'에서 'area' 함수를 호출하고 'rect1'을 인수로 전달한 곳에서, 대신 _메소드 구문_ 을 사용하여 'Rectangle' 인스턴스에서 'area' 메소드를 호출할 수 있습니다. 메소드 구문은 인스턴스 뒤에 옵니다: 점을 추가한 다음 메소드 이름, 괄호 및 모든 인수를 추가합니다.

source: Methods must have a parameter named `self` of the type they will be applied to for their first parameter. Note that we used the `@` snapshot operator in front of the `Rectangle` type in the function signature. By doing so, we indicate that this method takes an immutable snapshot of the `Rectangle` instance, which is automatically created by the compiler when passing the instance to the method. Methods can take ownership of `self`, use `self` with snapshots as we’ve done here, or use a mutable reference to `self` using the `ref self: T` syntax.
id: Metode harus memiliki parameter bernama `self` dengan tipe yang akan diterapkan pada parameter pertamanya. Perhatikan bahwa kita menggunakan operator snapshot `@` di depan tipe `Rectangle` dalam tanda tangan fungsi. Dengan melakukannya, kita menunjukkan bahwa metode ini mengambil snapshot yang tidak dapat diubah dari instance `Rectangle`, yang secara otomatis dibuat oleh kompiler saat melewati instance ke metode. Metode dapat memiliki kepemilikan dari `self`, menggunakan `self` dengan snapshot seperti yang kita lakukan di sini, atau menggunakan referensi mutable ke `self` dengan menggunakan sintaks `ref self: T`.
ko: 메서드는 적용될 유형의 첫 번째 매개변수로 `self`라는 매개변수를 가져야 합니다. 함수 시그니처에서 `Rectangle` 유형 앞에 `@` 스냅샷 연산자를 사용했다는 점에 유의하십시오. 이렇게 함으로써 이 메서드가 `Rectangle` 인스턴스의 불변 스냅샷을 취하는 것을 나타냅니다. 이 스냅샷은 인스턴스를 메서드에 전달할 때 컴파일러가 자동으로 생성합니다. 메서드는 `self`의 소유권을 가져갈 수 있으며, 여기서처럼 스냅샷을 사용할 수 있거나 `ref self: T` 구문을 사용하여 `self`에 대한 가변 참조를 사용할 수 있습니다.

source: We chose `self: @Rectangle` here for the same reason we used `@Rectangle` in the function version: we don’t want to take ownership, and we just want to read the data in the struct, not write to it. If we wanted to change the instance that we’ve called the method on as part of what the method does, we’d use `ref self: Rectangle` as the first parameter. Having a method that takes ownership of the instance by using just `self` as the first parameter is rare; this technique is usually used when the method transforms `self` into something else and you want to prevent the caller from using the original instance after the transformation.
id: Kami memilih `self: @Rectangle` di sini dengan alasan yang sama dengan penggunaan `@Rectangle` pada versi fungsi: kami tidak ingin memiliki kepemilikan, dan kami hanya ingin membaca data dalam struct, bukan menulis ke dalamnya. Jika kami ingin mengubah instance yang kami panggil metode tersebut sebagai bagian dari apa yang dilakukan metode, kami akan menggunakan `ref self: Rectangle` sebagai parameter pertama. Memiliki sebuah metode yang memiliki kepemilikan dari instance dengan hanya menggunakan `self` sebagai parameter pertama adalah hal yang jarang; teknik ini biasanya digunakan ketika metode mentransformasi `self` menjadi sesuatu yang lain dan Anda ingin mencegah pemanggil untuk menggunakan instance asli setelah transformasi.
ko: 우리는 여기서 `self: @Rectangle`를 선택한 이유가 함수 버전에서 `@Rectangle`을 사용한 이유와 같습니다. 우리는 소유권을 가져가고 싶지 않고, 구조체의 데이터를 읽기만 하고 쓰기를 하고 싶지 않기 때문입니다. 만약 메서드가 호출된 인스턴스를 변경하고 싶다면, 메서드의 첫 번째 매개변수로 `ref self: Rectangle`를 사용할 것입니다. 인스턴스의 소유권을 가져가는 메서드를 가지고 있는 것은 드물지만, 이 기술은 일반적으로 메서드가 `self`을 다른 것으로 변환하고 변환 후에 원래 인스턴스를 사용하지 못하도록 하려는 경우에 사용됩니다.

source: Observe the use of the desnap operator `*` within the area method when accessing the struct's members. This is necessary because the struct is passed as a snapshot, and all of its field values are of type `@T`, requiring them to be desnapped in order to manipulate them.
id: Perhatikan penggunaan operator desnap `*` dalam metode area ketika mengakses member dari struct. Hal ini diperlukan karena struct tersebut dilewati sebagai snapshot, dan semua nilai fieldnya memiliki tipe `@T`, yang memerlukan desnap untuk memanipulasinya.
ko: 구조체의 멤버에 액세스할 때 area 메서드 내에서 desnap 연산자 `*`의 사용을 관찰하세요. 이는 구조체가 스냅샷으로 전달되고 그 모든 필드 값이 `@T` 유형이기 때문에 조작하기 위해 desnap되어야 하기 때문에 필요합니다.

source: The main reason for using methods instead of functions is for organization and code clarity. We’ve put all the things we can do with an instance of a type in one combination of `trait` & `impl` blocks, rather than making future users of our code search for capabilities of `Rectangle` in various places in the library we provide. However, we can define multiple combinations of `trait` & `impl` blocks for the same type at different places, which can be useful for a more granular code organization. For example, you could implement the `Add` trait for your type in one `impl` block, and the `Sub` trait in another block.
id: Alasan utama penggunaan metode daripada fungsi adalah untuk organisasi dan kejelasan kode. Kita telah menyatukan semua hal yang dapat kita lakukan dengan sebuah instance dari suatu tipe dalam satu kombinasi blok `trait` & `impl`, daripada membuat pengguna kode kita mencari kemampuan dari `Rectangle` di berbagai tempat dalam perpustakaan yang kita sediakan. Namun, kita dapat mendefinisikan beberapa kombinasi blok `trait` & `impl` untuk tipe yang sama di tempat-tempat yang berbeda, yang dapat berguna untuk organisasi kode yang lebih terperinci. Sebagai contoh, Anda bisa mengimplementasikan `Add` trait untuk tipe Anda dalam satu blok `impl`, dan `Sub` trait di blok lainnya.
ko: 메서드를 사용하는 주요 이유는 조직화와 코드 가독성 때문입니다. 우리는 타입의 인스턴스로 할 수 있는 모든 것을 하나의 `trait` 및 `impl` 블록 조합에 넣어 코드 라이브러리의 다양한 위치에서 `Rectangle`의 기능을 찾아야 하는 미래 사용자들을 방지합니다. 그러나 동일한 타입에 대해 서로 다른 위치에서 여러 `trait` 및 `impl` 블록 조합을 정의할 수 있으며, 이는 더 세분화된 코드 조직에 유용할 수 있습니다. 예를 들어, 한 `impl` 블록에서 타입에 대한 `Add` trait를 구현하고, 다른 블록에서 `Sub` trait를 구현할 수 있습니다.

source: Note that we can choose to give a method the same name as one of the struct’s fields. For example, we can define a method on `Rectangle` that is also named `width`:
id: Perhatikan bahwa kita dapat memilih untuk memberikan sebuah metode nama yang sama dengan salah satu field dari struct. Sebagai contoh, kita dapat mendefinisikan sebuah metode pada `Rectangle` yang juga bernama `width`:
ko: 주의할 점은 메서드에 구조체의 필드와 동일한 이름을 지정할 수 있다는 것입니다.예를 들어, `Rectangle`에도 `width`라는 이름의 메서드를 정의할 수 있습니다.

source: "Width is {}"
ko: "폭은 {}입니다"

source: Here, we’re choosing to make the `width` method return `true` if the value in the instance’s `width` field is greater than `0`, and `false` if the value is `0`: we can use a field within a method of the same name for any purpose. In `main`, when we follow `rect1.width` with parentheses, Cairo knows we mean the method `width`. When we don’t use parentheses, Cairo knows we mean the field `width`.
ko: 여기서는 `width` 메소드가 인스턴스의 `width` 필드 값이 `0`보다 크면 `true`를 반환하고, 값이 `0`이면 `false`를 반환하도록 선택했습니다: 우리는 동일한 이름의 메소드 내에서 필드를 사용할 수 있습니다. `main`에서 `rect1.width` 뒤에 괄호를 사용하면, Cairo는 우리가 `width` 메소드를 의미한다는 것을 알 수 있습니다. 괄호를 사용하지 않으면, Cairo는 `width` 필드를 의미한다는 것을 알 수 있습니다.

source: Methods with More Parameters
id: Metode dengan Parameter Lebih Banyak
ko: 더 많은 매개변수를 가진 방법들

source: Let’s practice using methods by implementing a second method on the `Rectangle` struct. This time we want an instance of `Rectangle` to take another instance of `Rectangle` and return `true` if the second `Rectangle` can fit completely within `self` (the first `Rectangle`); otherwise, it should return `false`. That is, once we’ve defined the `can_hold` method, we want to be able to write the program shown in Listing 5-12.
ko: `Rectangle` 구조체에 두 번째 메소드를 구현하여 메소드 사용을 연습해 봅시다. 이번에는 `Rectangle`의 인스턴스가 다른 `Rectangle`의 인스턴스를 받아서 두 번째 `Rectangle`이 `self` (첫 번째 `Rectangle`) 안에 완전히 들어갈 수 있는지 여부를 반환하는 메소드를 만들고 싶습니다. 즉, `can_hold` 메소드를 정의한 후에는 Listing 5-12에 표시된 프로그램을 작성할 수 있기를 원합니다.

source: "Can rect1 hold rect2? {}"
ko: "rect1이 rect2를 보유할 수 있습니까? {}"

source: "Can rect1 hold rect3? {}"
ko: "rect1이 rect3을 보유할 수 있습니까? {}"

source: Listing 5-12: Using the as-yet-unwritten `can_hold` method
ko: 리스트 5-12: 아직 작성되지 않은 `can_hold` 메서드 사용하기

source: The expected output would look like the following because both dimensions of `rect2` are smaller than the dimensions of `rect1`, but `rect3` is wider than `rect1`:
id: Output yang diharapkan akan terlihat seperti berikut karena kedua dimensi `rect2` lebih kecil daripada dimensi `rect1`, tetapi `rect3` lebih lebar daripada `rect1`:
ko: `rect2`의 두 차원이 `rect1`의 차원보다 작지만, `rect3`는 `rect1`보다 넓기 때문에 예상 출력은 다음과 같이 보일 것입니다:

source: We know we want to define a method, so it will be within the `trait RectangleTrait` and `impl RectangleImpl of RectangleTrait` blocks. The method name will be `can_hold`, and it will take a snapshot of another `Rectangle` as a parameter. We can tell what the type of the parameter will be by looking at the code that calls the method: `rect1.can_hold(@rect2)` passes in `@rect2`, which is a snapshot to `rect2`, an instance of `Rectangle`. This makes sense because we only need to read `rect2` (rather than write, which would mean we’d need a mutable borrow), and we want `main` to retain ownership of `rect2` so we can use it again after calling the `can_hold` method. The return value of `can_hold` will be a Boolean, and the implementation will check whether the width and height of `self` are greater than the width and height of the other `Rectangle`, respectively. Let’s add the new `can_hold` method to the `trait` and `impl` blocks from Listing 5-11, shown in Listing 5-13.
ko: 우리는 메소드를 정의하고 싶다는 것을 알고 있으므로, `trait RectangleTrait`와 `impl RectangleTrait의 RectangleImpl` 블록 내에 있을 것입니다. 메소드 이름은 `can_hold`이고, 다른 `Rectangle`의 스냅샷을 매개변수로 사용할 것입니다. 메소드를 호출하는 코드를 보면 매개변수의 타입을 알 수 있습니다: `rect1.can_hold(@rect2)`는 `@rect2`를 전달하는데, 이는 `Rectangle`의 인스턴스인 `rect2`에 대한 스냅샷입니다. 이는 `rect2`를 읽기만 하면 되기 때문에 (쓰기가 아닌 경우, 변경 가능한 빌림이 필요할 것입니다), `main`이 `can_hold` 메소드를 호출한 후에도 `rect2`의 소유권을 유지하고 싶기 때문입니다. `can_hold`의 반환 값은 부울 값이며, 구현은 `self`의 너비와 높이가 다른 `Rectangle`의 너비와 높이보다 큰지 확인할 것입니다. 새로운 `can_hold` 메소드를 Listing 5-11의 `trait`와 `impl` 블록에 추가해봅시다. (Listing 5-13에 표시됨)

source: Listing 5-13: Implementing the `can_hold` method on `Rectangle` that takes another `Rectangle` instance as a parameter
ko: 리스팅 5-13: 다른 `Rectangle` 인스턴스를 매개변수로 사용하는 `Rectangle`의 `can_hold` 메서드 구현

source: When we run this code with the `main` function in Listing 5-12, we’ll get our desired output. Methods can take multiple parameters that we add to the signature after the `self` parameter, and those parameters work just like parameters in functions.
ko: 이 코드를 Listing 5-12의 `main` 함수와 함께 실행하면 원하는 출력을 얻을 수 있습니다. 메소드는 `self` 매개변수 뒤에 시그니처에 추가하는 여러 매개변수를 사용할 수 있으며, 이러한 매개변수는 함수의 매개변수와 마찬가지로 작동합니다.

source: Accessing implementation functions
id: Mengakses Fungsi Implementasi
ko: 구현 함수에 액세스하기

source: All functions defined within a `trait` and `impl` block can be directly addressed using the `::` operator on the implementation name. Functions in traits that aren’t methods are often used for constructors that will return a new instance of the struct. These are often called `new`, but `new` isn’t a special name and isn’t built into the language. For example, we could choose to provide an associated function named `square` that would have one dimension parameter and use that as both width and height, thus making it easier to create a square `Rectangle` rather than having to specify the same value twice:
id: Semua fungsi yang didefinisikan dalam blok `trait` dan `impl` dapat diakses secara langsung menggunakan operator `::` pada nama implementasi. Fungsi dalam trait yang bukan metode sering digunakan untuk konstruktor yang akan mengembalikan instansi baru dari struktur tersebut. Mereka sering disebut sebagai `new`, tetapi `new` bukanlah nama khusus dan bukan bagian dari bahasa. Sebagai contoh, kita bisa memilih untuk menyediakan fungsi terkait bernama `square` yang akan memiliki satu parameter dimensi dan menggunakan itu sebagai lebar dan tinggi, sehingga memudahkan untuk membuat `Rectangle` yang berbentuk persegi daripada harus menentukan nilai yang sama dua kali:
ko: `trait` 및 `impl` 블록 내에서 정의된 모든 함수는 구현 이름에 `::` 연산자를 사용하여 직접 호출할 수 있습니다. 메서드가 아닌 트레이트 내의 함수들은 종종 구조체의 새 인스턴스를 반환하는 생성자로 사용됩니다. 이러한 함수들은 종종 `new`로 불리지만, `new`는 특별한 이름이 아니며 언어에 내장되어 있지 않습니다. 예를 들어, 우리는 한 변의 매개변수를 가진 연관 함수인 `square`를 제공할 수 있으며, 이를 너비와 높이로 사용하여 사각형 `Rectangle`을 쉽게 생성할 수 있도록 할 수 있습니다. 이렇게 하면 동일한 값을 두 번 지정할 필요 없이 사각형 `Rectangle`을 만들 수 있습니다.

source: To call this function, we use the `::` syntax with the implementation name: `let square = RectangleImpl::square(10);` is an example. This function is namespaced by the implementation; the `::` syntax is used for both trait functions and namespaces created by modules. We’ll discuss modules in [Chapter 7](ch07-02-defining-modules-to-control-scope.md).
ko: 이 함수를 호출하려면 구현 이름과 함께 `::` 구문을 사용합니다: `let square = RectangleImpl::square(10);`은 예시입니다. 이 함수는 구현에 의해 네임스페이스화되며, `::` 구문은 트레이트 함수와 모듈에 의해 생성된 네임스페이스 모두에 사용됩니다. 모듈에 대해는 [Chapter 7](ch07-02-defining-modules-to-control-scope.md)에서 논의할 것입니다.

source: Note: It is also possible to call this function using the trait name, with `RectangleTrait::square(10)`.
id: Catatan: Juga memungkinkan untuk memanggil fungsi ini menggunakan nama trait, dengan `RectangleTrait::square(10)`.
ko: 참고: 또한 이 함수를 특성 이름을 사용하여 호출하는 것도 가능합니다. `RectangleTrait::square(10)`으로 호출할 수 있습니다.

source: Multiple `impl` Blocks
id: Blok `impl` Multipel
ko: 여러 개의 `impl` 블록

source: Each struct is allowed to have multiple `trait` and `impl` blocks. For example, Listing 5-13 is equivalent to the code shown in Listing 5-14, which has each method in its own `trait` and `impl` blocks.
ko: 각 구조체는 여러 `trait` 및 `impl` 블록을 가질 수 있습니다. 예를 들어, 5-13 목록은 각 메서드가 자체 `trait` 및 `impl` 블록에 있는 코드와 동일한 코드인 5-14 목록에 표시된 코드와 동등합니다.

source: Listing 5-14: Rewriting Listing 5-13 using multiple `impl` blocks
ko: 리스팅 5-14: 여러 `impl` 블록을 사용하여 리스팅 5-13을 다시 작성하기

source: There’s no reason to separate these methods into multiple `trait` and `impl` blocks here, but this is valid syntax. We’ll see a case in which multiple blocks are useful in [Chapter 8](ch08-00-generic-types-and-traits.md), where we discuss generic types and traits.
id: Tidak ada alasan untuk memisahkan metode-metode ini ke dalam beberapa blok `trait` dan `impl` di sini, tetapi ini adalah sintaks yang valid. Kita akan melihat kasus di mana beberapa blok berguna dalam [Chapter 8](ch08-00-generic-types-and-traits.md), di mana kita membahas jenis dan trait generik.
ko: 이러한 메서드를 여러 `trait` 및 `impl` 블록으로 분리할 이유는 없지만, 이는 유효한 구문입니다. 우리는 여러 블록이 유용한 경우를 볼 것입니다. [8장](ch08-00-generic-types-and-traits.md)에서 일반적인 타입 및 트레이트를 논의할 때입니다.
