Repository: cairo-book/cairo-book
Catalog: po/*.po
Languages: es, id, ko, zh_cn

source: A _tuple_ is a general way of grouping together a number of values with a variety of types into one compound type. Tuples have a fixed length: once declared, they cannot grow or shrink in size.
es: Una _tupla_ es una forma general de agrupar un número de valores con una variedad de tipos en un tipo compuesto. Las tuplas tienen una longitud fija: una vez declaradas, no pueden aumentar ni disminuir de tamaño.
zh_cn: _元组_ 是一个将多个其他类型的值组合进一个复合类型的主要方式。 元组长度固定：一旦声明，其长度不会增大或缩小。

source: We create a tuple by writing a comma-separated list of values inside parentheses. Each position in the tuple has a type, and the types of the different values in the tuple don’t have to be the same. We’ve added optional type annotations in this example:
es: Se crea una tupla escribiendo una lista de valores separados por comas entre paréntesis. Cada posición de la tupla tiene un tipo, y los tipos de los distintos valores de la tupla no tienen por qué ser iguales. Hemos añadido anotaciones opcionales de tipo en este ejemplo:
zh_cn: 我们使用包含在圆括号中的逗号分隔的值列表来创建一个元组。 元组中的每一个位置都有一个类型，而且这些不同值的类型也不必是相同的。 这个例子中使用了可选的类型注解：

source: The variable `tup` binds to the entire tuple because a tuple is considered a single compound element. To get the individual values out of a tuple, we can use pattern matching to destructure a tuple value, like this:
es: La variable `tup` se vincula a toda la tupla porque una tupla se considera un único elemento compuesto. Para obtener los valores individuales de una tupla, podemos utilizar la concordancia de patrones para desestructurar un valor de tupla, así:
zh_cn: `tup` 变量绑定到整个元组上，因为元组是一个单独的复合元素。 为了从元组中获取单个值，可以使用模式匹配（pattern matching） 来解构（destructure）元组值，像这样：

source: This program first creates a tuple and binds it to the variable `tup`. It then uses a pattern with `let` to take `tup` and turn it into three separate variables, `x`, `y`, and `z`. This is called _destructuring_ because it breaks the single tuple into three parts. Finally, the program prints `y is six` as the value of `y` is `6`.
es: Este programa crea primero una tupla y la asocia a la variable `tup`. A continuación, utiliza un patrón con `let` para tomar `tup` y convertirla en tres variables separadas, `x`, `y`, y `z`. Esto se llama _desestructuración_ porque divide la tupla en tres partes. Finalmente, el programa imprime `y es seis` ya que el valor de `y` es `6`.
zh_cn: 程序首先创建了一个元组并绑定到 `tup` 变量上。 接着使用了 `let` 和一个模式将 `tup` 分成了三个不同的变量， `x`、`y` 和 `z`。这叫做解构（destructuring）， 因为它将一个元组拆成了三个部分。最后，程序打印出了 `y` 的值， 也就是 `6`。

source: We can also declare the tuple with value and types at the same time. For example:
es: También podemos declarar la tupla con los valores y los tipos al mismo tiempo. Por ejemplo:
zh_cn: 我们也可以同时用 value 和 name 来声明元组。 比如说：

source: ### The unit type ()
zh_cn: ### unit类型 ()

source: A _unit type_ is a type which has only one value `()`. It is represented by a tuple with no elements. Its size is always zero, and it is guaranteed to not exist in the compiled code.
es: Un _tipo unitario_ es un tipo que sólo tiene un valor `()`. Se representa mediante una tupla sin elementos. Su tamaño es siempre cero y se garantiza que no existe en el código compilado.
zh_cn: 一个 _unit 类型_ 是一个只有一个值 `()` 的类型。 它由一个没有元素的元组来表示。 它的大小总是为零，并且它在编译后的代码中一定不存在。

source: ## Functions
es: ## Funciones
zh_cn: ## 函数

source: Functions are prevalent in Cairo code. You’ve already seen one of the most important functions in the language: the `main` function, which is the entry point of many programs. You’ve also seen the `fn` keyword, which allows you to declare new functions.
es: Las funciones son frecuentes en el código de Cairo. Ya has visto una de las funciones más importantes del lenguaje: la función `main`, que es el punto de entrada de muchos programas. También has visto la palabra clave `fn`, que te permite declarar nuevas funciones.
zh_cn: 函数在 Cairo 代码中非常普遍。你已经见过语言中最重要的函数之一： `main` 函数，它是很多程序的入口点。 你也见过 `fn` 关键字，它用来声明新函数。

source: Cairo code uses _snake case_ as the conventional style for function and variable names, in which all letters are lowercase and underscores separate words. Here’s a program that contains an example function definition:
es: El código de Cairo utiliza el estilo _snake case_ como convención para los nombres de funciones y variables, en el cual todas las letras están en minúscula y los guiones bajos separan las palabras. Aquí hay un programa que contiene un ejemplo de definición de función:
zh_cn: Cairo代码使用 *蛇形命名法（ _snake case_ ）* 作为函数和变量名称的常规样式。 所有的字母都是小写的，并以下划线分隔单词。 这里有一个程序，包含一个函数定义的例子：

source: We define a function in Cairo by entering `fn` followed by a function name and a set of parentheses. The curly brackets tell the compiler where the function body begins and ends.
es: Definimos una función en Cairo introduciendo `fn` seguido de un nombre de función y un conjunto de paréntesis. Las llaves indican al compilador dónde empieza y termina el cuerpo de la función.
zh_cn: 在 Cairo 中，我们通过输入 `fn` 和函数名称以及一组括号来定义一个函数。大括号告诉编译器函数体的开始和结束位置。

source: We can call any function we’ve defined by entering its name followed by a set of parentheses. Because `another_function` is defined in the program, it can be called from inside the `main` function. Note that we defined `another_function` _before_ the `main` function in the source code; we could have defined it after as well. Cairo doesn’t care where you define your functions, only that they’re defined somewhere in a scope that can be seen by the caller.
es: Podemos llamar a cualquier función que hayamos definido introduciendo su nombre seguido de unos de paréntesis. Como `otra_funcion` está definida en el programa, puede ser llamada desde dentro de la función `main`. Tenga en cuenta que hemos definido "otra_función _antes_ de la función `main` en el código fuente; también podríamos haberla definido después. también. A Cairo no le importa dónde definas tus funciones, sólo que estén definidas en algún lugar en un ámbito que pueda ser visto por quien las llame.
zh_cn: 可以使用函数名后跟圆括号来调用我们定义过的任意函数。 因为程序中已定义 `another_function` 函数，所以可以在 `main` 函数中调用它。 注意，源码中 `another_function` 定义在 `main` 函数 *之前* ；当然我们也可以定义在其之后。 Cairo 不关心函数定义所在的位置，只要函数被调用时出现在调用之处可见的作用域内就行。

source: Let’s start a new project with Scarb named _functions_ to explore functions further. Place the `another_function` example in _src/lib.cairo_ and run it. You should see the following output:
es: Empecemos un nuevo proyecto con Scarb llamado _functions_ para explorar las funciones más a fondo. Coloque el ejemplo `another_function` en _src/lib.cairo_ y ejecútelo. Usted Debería ver la siguiente salida:
zh_cn: 让我们用 Scarb 启动一个名为 _functions_ 的新项目来进一步探索函数。 更进一步。把 `another_function` 的例子写入 _src/lib.cairo_ 中并运行它。你应该看到以下输出：

source: The lines execute in the order in which they appear in the `main` function. First the “Hello, world!” message prints, and then `another_function` is called and its message is printed.
es: Las líneas se ejecutan en el orden en que aparecen en la función `main`. Primero se imprime el mensaje " Hello, world!", y luego se llama a `another_function` y se imprime su mensaje.
zh_cn: 这几行是按照它们在 `main` 函数中出现的顺序执行的。 首先打印 "Hello, world!" 信息，然后调用 `another_function`，并打印其信息。

source: ### Parameters
es: ### Parámetros
zh_cn: ### 参数

source: We can define functions to have _parameters_, which are special variables that are part of a function’s signature. When a function has parameters, you can provide it with concrete values for those parameters. Technically, the concrete values are called _arguments_, but in casual conversation, people tend to use the words _parameter_ and _argument_ interchangeably for either the variables in a function’s definition or the concrete values passed in when you call a function.
es: Podemos definir funciones para que tengan _parameters_, que son variables especiales que forman parte de la firma de una función. Cuando una función tiene parámetros, puede proporcionarle valores concretos para esos parámetros. Técnicamente, los valores valores concretos se llaman _arguments_, pero en la conversación informal, la gente tiende a usar las palabras _parameters_ y _arguments_ indistintamente para las variables en la definición de una función o los valores concretos que se pasan cuando se llama a una función.
zh_cn: 我们可以定义为拥有 *参数（ _parameters_ ）* 的函数，参数是特殊变量，是函数签名的一部分。当函数拥有参数（形参）时，可以为这些参数提供具体的值（实参）。 技术上讲，这些具体值被称为 *参数*（ _arguments_ ），但是在日常交流中，人们倾向于不区分使用 _parameters_ 和 _arguments_ 来表示函数定义中的变量或调用函数时传入的具体值。

source: The declaration of `another_function` has one parameter named `x`. The type of `x` is specified as `felt252`. When we pass `5` in to `another_function`, the `.print()` function outputs `5` in the console.
es: La declaración de `another_function` tiene un parámetro llamado `x`. El tipo de `x` se especifica como `felt252`. Cuando pasamos `5` a `another_function`, la función `print()` muestra `5` en la consola.
zh_cn: `another_function` 的声明有一个名为 `x` 的参数。 `x` 的类型被指定为 `felt252`。当我们把 `5` 传给 `another_function` 时，`.print()`函数在控制台中会输出 `5`。

source: In function signatures, you _must_ declare the type of each parameter. This is a deliberate decision in Cairo’s design: requiring type annotations in function definitions means the compiler almost never needs you to use them elsewhere in the code to figure out what type you mean. The compiler is also able to give more helpful error messages if it knows what types the function expects.
es: En las firmas de función, _must_ declarar el tipo de cada parámetro. Esta es una decisión deliberada en el diseño de Cairo: requerir anotaciones de tipo en las significa que el compilador casi nunca necesita usarlas en otra parte del código el código para averiguar a qué tipo se refiere. El compilador también es capaz de dar mensajes de error más útiles si sabe qué tipos espera la función.
zh_cn: 在函数签名中，你 _必须_ 声明每个参数的类型。 这是 Cairo 设计中一个经过慎重考虑的决定： 要求在函数定义中提供类型注解，意味着编译器再也不需要你在代码的 其他地方注明类型来指出你的意图。而且，在知道函数需要什么类型后， 编译器就能够给出更有用的错误消息。

source: When defining multiple parameters, separate the parameter declarations with commas, like this:
es: Cuando defina múltiples parámetros, separe las declaraciones de parámetros con comas, así:
zh_cn: 当定义多个参数时，用逗号分隔。 像这样：

source: This example creates a function named `another_function` with two parameters. The first parameter is named `x` and is an `felt252`. The second is named `y` and is type `felt252` too. The function then prints the content of the felt `x` and then the content of the felt `y`.
es: Este ejemplo crea una función llamada `another_function` con dos parámetros. El primer parámetro se llama `x` y es un `felt252`. El segundo se llama `y` y también es del tipo `felt252`. La función luego imprime el contenido del `x` y luego el contenido del `y`.
zh_cn: 这个例子创建了一个名为 `another_function` 的函数，它有两个 参数。第一个参数被命名为 `x`，类型是 `felt252`。第二个参数被命名为 `y`，也是 `felt252` 类型。然后，该函数打印了 `x` 的内容，然后打印 `y` 的内容。

source: Let’s try running this code. Replace the program currently in your _functions_ project’s _src/lib.cairo_ file with the preceding example and run it using `scarb cairo-run`:
zh_cn: 让我们试着运行这段代码。用前面的示例替换当前在你的 _functions_ 项目的 _src/lib.cairo_ 文件中的程序，然后使用 `scarb cairo-run` 运行它：

source: Because we called the function with `5` as the value for `x` and `6` as the value for `y`, the program output contains those values.
es: Debido a que llamamos a la función con `5` como valor para `x` y `6` como valor para `y`, la salida del programa contiene esos valores.
zh_cn: 因为我们在调用函数时，将 `5` 作为 `x` 的值，将 `6` 作为 `y` 的值。 程序输出包含这些值。

source: #### Named parameters
es: #### Parámetros con nombre
zh_cn: ### 命名参数

source: In Cairo, named parameters allow you to specify the names of arguments when you call a function. This makes the function calls more readable and self-descriptive. If you want to use named parameters, you need to specify the name of the parameter and the value you want to pass to it. The syntax is `parameter_name: value`. If you pass a variable that has the same name as the parameter, you can simply write `:parameter_name` instead of `parameter_name: variable_name`.
es: En Cairo, los parámetros con nombre permiten especificar los nombres de los argumentos cuando se llama a una función. Esto hace que las llamadas a funciones sean más legibles y autodescriptivas. Si quieres usar parámetros con nombre, necesitas especificar el nombre del parámetro y el valor que quieres pasarle. La sintaxis es `parameter_name: value`. Si pasas una variable que tiene el mismo nombre que el parámetro, puedes escribir simplemente `:parameter_name` en lugar de `parameter_name: variable_name`.
zh_cn: 在 Cairo 中，命名参数允许您在调用函数时指定参数的名称。这使得函数调用更具可读性和自描述性。 如果你想使用命名参数，你需要指定参数的名称和你想传递给它的值。语法是 `parameter_name: value`。如果你传递的变量与参数名称相同，你可以简写为 `:parameter_name`，而不是 `parameter_name: variable_name`。

source: ### Statements and Expressions
es: ### Declaraciones y Expresiones
zh_cn: ### 语句和表达式

source: Function bodies are made up of a series of statements optionally ending in an expression. So far, the functions we’ve covered haven’t included an ending expression, but you have seen an expression as part of a statement. Because Cairo is an expression-based language, this is an important distinction to understand. Other languages don’t have the same distinctions, so let’s look at what statements and expressions are and how their differences affect the bodies of functions.
es: Los cuerpos de las funciones están compuestos por una serie de sentencias que terminan opcionalmente en una expresión. Hasta ahora, las funciones que hemos cubierto no han incluido una expresión final, pero ya has visto una expresión como parte de una sentencia. Como Cairo es un lenguaje basado en expresiones, esta es una distinción importante que debemos entender. Otros lenguajes no tienen las mismas distinciones, así que veamos qué son las sentencias y expresiones y cómo sus diferencias afectan los cuerpos de las funciones.
zh_cn: 函数体由一系列的语句和一个可选的结尾表达式构成。 目前为止，我们提到的函数还不包含结尾表达式， 不过你已经见过作为语句一部分的表达式。因为 Cairo 是一门基于表达式 （expression-based）的语言，这是一个需要理解的（不同于其他语言） 重要区别。其他语言并没有这样的区别，所以让我们看看语句与表达式有什么区别以及这些区别是如何影响函数体的。

source: - **Statements** are instructions that perform some action and do not return a value. - **Expressions** evaluate to a resultant value. Let’s look at some examples.
es: - Las **Declaraciones** son instrucciones que realizan alguna acción y no devuelven un valor. - Las **Expresiones** se evalúan a un valor resultante. Veamos algunos ejemplos.
zh_cn: - **语句**（Statements）是执行一些操作但不返回值的指令。 - **表达式**（Expressions）计算并产生一个值。让我们看一些例子。

source: We’ve actually already used statements and expressions. Creating a variable and assigning a value to it with the `let` keyword is a statement. In Listing 2-1, `let y = 6;` is a statement.
es: De hecho, ya hemos utilizado declaraciones y expresiones. Crear una variable y asignarle un valor con la palabra clave `let` es una declaración. En el Listado 2-1, `let y = 6;` es una declaración.
zh_cn: 实际上，我们已经使用过语句和表达式。 使用 `let` 关键字创建变量并绑定一个值是一个语句。在示例 2-1 中，`let y = 6;`; 是一个语句。

source: <span class="caption">Listing 2-1: A `main` function declaration containing one statement</span>
es: <span class="caption">Listing 2-1: A `main` declaración de función que contiene una declaración</span>
zh_cn: <span class="caption">示例2-1：一个包含一条语句的 `main` 函数声明</span>

source: Function definitions are also statements; the entire preceding example is a statement in itself.
es: Las definiciones de funciones también son sentencias; todo el ejemplo anterior es una sentencia en sí misma.
zh_cn: 函数定义也是语句，上面整个例子本身就是一个语句。

source: Statements do not return values. Therefore, you can’t assign a `let` statement to another variable, as the following code tries to do; you’ll get an error:
es: Las Declaraciones no devuelven valores. Por lo tanto, no se puede asignar una sentencia `let` a otra variable, como intenta hacer el siguiente código; se producirá un error:
zh_cn: 语句不返回值。因此，不能把 `let` 语句赋值给另一个变量，比如下面的例子尝试做 的，会产生一个错误：

source: The `let y = 6` statement does not return a value, so there isn’t anything for `x` to bind to. This is different from what happens in other languages, such as C and Ruby, where the assignment returns the value of the assignment. In those languages, you can write `x = y = 6` and have both `x` and `y` have the value `6`; that is not the case in Cairo.
es: La declaración `let y = 6` no devuelve un valor, por lo que no hay nada a lo que `x` pueda enlazar. Esto es diferente de lo que sucede en otros lenguajes, como C y Ruby, donde la asignación devuelve el valor de la asignación. En esos lenguajes, puedes escribir `x = y = 6` y tanto `x` como `y` tendrán el valor `6`; esto no es así en Cairo.
zh_cn: 语句 `let y = 6` 没有返回一个值，所以没有任何东西让 `x` 与之绑定。这与其他语言 中的情况不同，比如说 C 和 Ruby，其中赋值会返回赋值的值。 在这些语言中，你可以写 `x = y = 6`，让 `x`和 `y` 都有值 `6`；但在 Cairo 中不是这样的。

source: Expressions evaluate to a value and make up most of the rest of the code that you’ll write in Cairo. Consider a math operation, such as `5 + 6`, which is an expression that evaluates to the value `11`. Expressions can be part of statements: in Listing 2-1, the `6` in the statement `let y = 6;` is an expression that evaluates to the value `6`. Calling a function is an expression. A new scope block created with curly brackets is an expression, for example:
es: Las expresiones se evalúan a un valor y forman la mayor parte del resto del código que escribirás en Cairo. escribirás en Cairo. Considera una operación matemática, como `5 + 6`, que es una expresión que se evalúa al valor `11`. Las expresiones pueden ser parte de sentencias: en el Listado 2-1, el `6` en la sentencia `let y = 6;` es una es una expresión que se evalúa al valor `6`. Llamar a una función es una expresión. Un nuevo bloque de ámbito creado con es una expresión, por ejemplo:
zh_cn: 表达式会计算出一个值，并且你编写的大部分 Cairo 代码将是由表达式组成的。 考虑一个数学运算，比如 `5 + 6` ，这是一个表达式并计算出值 `11`。 表达式可以是语句的一部分：在示例 2-1 中，语句 `let y = 6;` 中的 `6` 是一个表达式，它计算出的值是 `6` 。 函数调用是一个表达式。宏调用也是一个表达式。用大括号创建的一个新的块作用域同样也是一个表达式，例如：

source: is a block that, in this case, evaluates to `4`. That value gets bound to `y` as part of the `let` statement. Note that the `x + 1` line doesn’t have a semicolon at the end, which is unlike most of the lines you’ve seen so far. Expressions do not include ending semicolons. If you add a semicolon to the end of an expression, you turn it into a statement, and it will then not return a value. Keep this in mind as you explore function return values and expressions next.
es: este bloque de código, en este caso, se evalúa como 4. Ese valor se asigna a y como parte de la declaración let. Ten en cuenta que la línea x + 1 no tiene un punto y coma al final, lo que es diferente a la mayoría de las líneas que has visto hasta ahora. Las expresiones no incluyen un punto y coma al final. Si agregas un punto y coma al final de una expresión, la conviertes en una declaración, y en ese caso no se devolverá ningún valor. Tenlo en cuenta mientras exploras los valores de retorno de las funciones y las expresiones a continuación.
zh_cn: 是一个代码块，它的值是 `4`。这个值作为 `let` 语句的一部分被绑定到 `y` 上。注意 `x + 1` 这一行在结尾没有分号，与你见过的大部分代码行不同。表达式的结尾没有 分号。如果在表达式的结尾加上分号，它就变成了语句，而语句不会返回值。 在接下来学习具有返回值的函数和表达式时要谨记这一点。

source: ### Functions with Return Values
es: ### Funciones con Valores de Retorno
zh_cn: ### 具有返回值的函数

source: Functions can return values to the code that calls them. We don’t name return values, but we must declare their type after an arrow (`->`). In Cairo, the return value of the function is synonymous with the value of the final expression in the block of the body of a function. You can return early from a function by using the `return` keyword and specifying a value, but most functions return the last expression implicitly. Here’s an example of a function that returns a value:
es: Las funciones pueden devolver valores al código que las llama. No nombramos los valores de retorno, pero debemos declarar su tipo después de una flecha (`->`). En Cairo, el valor de retorno de la función es sinónimo del valor de la última expresión en el bloque del cuerpo de una función. Puede salir temprano de una función usando la palabra clave `return` y especificando un valor, pero la mayoría de las funciones devuelven la última expresión implícitamente. Aquí hay un ejemplo de una función que devuelve un valor:
zh_cn: 函数可以向调用它的代码返回值。我们并不对返回值命名，但要在箭头(`->`)后声明它 的类型。在 Cairo 中，函数的返回值等同于函数体最后一个表达式的值。使用 `return` 关键字和指定值，可从函数中提前返回；但大部分函数隐式的返回最后的表达式。 这是一个有返回值的函数的例子：

source: There are no function calls, or even `let` statements in the `five` function—just the number `5` by itself. That’s a perfectly valid function in Cairo. Note that the function’s return type is specified too, as `-> u32`. Try running this code; the output should look like this:
es: No hay llamadas a funciones ni declaraciones `let` en la función `five`, solo el número `5` por sí mismo. Esa es una función perfectamente válida en Cairo. Observa que se especifica el tipo de retorno de la función como `-> u32`. Intenta ejecutar este código; la salida debería verse así:
zh_cn: 在 five 函数中没有函数调用、宏、甚至没有 `let` 语句 —— 只有数字 `5`。这在 Cairo 中是一个完全有效的函数。注意，也指定了函数返回值的类型，就是 `-> u32`。尝试运行代码；输出应该看起来像这样：

source: The `5` in `five` is the function’s return value, which is why the return type is `u32`. Let’s examine this in more detail. There are two important bits: first, the line `let x = five();` shows that we’re using the return value of a function to initialize a variable. Because the function `five` returns a `5`, that line is the same as the following:
es: El `5` en `five` es el valor de retorno de la función, por eso el tipo de retorno es `u32`. Vamos a examinar esto con más detalle. Hay dos partes importantes: en primer lugar, la línea `let x = five();` muestra que estamos usando el valor de retorno de una función para inicializar una variable. Debido a que la función `five` devuelve un `5`, esa línea es lo mismo que:
zh_cn: `five` 函数的返回值是 `5` ，所以返回值类型是 `u32`。让我们仔细检查一下这段代 码。有两个重要的部分：首先，`let x = five();` 这一行表明我们使用函数的返回值初 始化一个变量。因为 `five` 函数返回 `5`，这一行与如下代码相同：

source: Second, the `five` function has no parameters and defines the type of the return value, but the body of the function is a lonely `5` with no semicolon because it’s an expression whose value we want to return. Let’s look at another example:
es: Segundo, la función `five` no tiene parámetros y define el tipo del valor de retorno, pero el cuerpo de la función es un solitario `5` sin punto y coma porque es una expresión cuyo valor queremos devolver. Veamos otro ejemplo:
zh_cn: 第二，`five` 函数没有参数并定义了返回值的类型。不过函数体只有单单一个 `5` 也没 有分号，因为这是一个表达式，我们想要返回它的值。 让我们看看另一个例子：

source: Running this code will print `[DEBUG] (raw: 6)`. But if we place a semicolon at the end of the line containing `x + 1`, changing it from an expression to a statement, we’ll get an error:
es: Al ejecutar este código se imprimirá `[DEBUG] (raw: 6)`. Pero si agregamos un punto y coma al final de la línea que contiene `x + 1`, cambiándola de una expresión a una declaración, obtendremos un error:
zh_cn: 运行这段代码将打印 `[DEBUG] (raw: 6)`。但是如果在包含 `x + 1` 的行尾放置一个 分号，把它从一个表达式变成一个语句，我们会看到一个错误：

source: Compiling this code produces an error, as follows:
es: La compilación de este código produce un error, como se muestra a continuación:
id: Mengompilasi kode ini menghasilkan kesalahan, seperti berikut:
zh_cn: 编译这段代码会产生一个错误，如下所示：
