Repository: cairo-book/cairo-book
Catalog: po/*.po
Languages: es, id, ko, zh_cn

source: `Scarb.toml` is the package manifest file, which contains metadata and configuration options for the package, such as dependencies, package name, version, and authors. You can find documentation about it on the [scarb reference](https://docs.swmansion.com/scarb/docs/reference/manifest.html).
id: `Scarb.toml` adalah berkas manifest paket, yang berisi metadata dan opsi konfigurasi untuk paket, seperti dependensi, nama paket, versi, dan penulis. Anda dapat menemukan dokumentasi tentangnya di [referensi scarb](https://docs.swmansion.com/scarb/docs/reference/manifest.html).
ko: `Scarb.toml`은 패키지 매니페스트 파일로, 패키지에 대한 메타데이터와 구성 옵션을 포함하고 있습니다. 이는 의존성, 패키지 이름, 버전 및 저자와 같은 정보를 담고 있습니다. 이에 대한 문서는 [scarb 참조](https://docs.swmansion.com/scarb/docs/reference/manifest.html)에서 찾을 수 있습니다.

source: As you develop your package, you may want to organize your code into multiple Cairo source files. You can do this by creating additional `.cairo` files within the `src` directory or its subdirectories.
es: A medida que desarrolla su paquete, es posible que desee organizar su código en varios archivos de origen de Cairo. Puede hacer esto creando archivos `.cairo` adicionales dentro del directorio `src` o sus subdirectorios.
id: Ketika Anda mengembangkan paket Anda, Anda mungkin ingin mengatur kode Anda ke dalam beberapa berkas sumber Cairo. Anda dapat melakukannya dengan membuat berkas `.cairo` tambahan di dalam direktori `src` atau subdirektorinya.
ko: 패키지를 개발하는 과정에서 코드를 여러 개의 카이로 소스 파일로 구성하고 싶을 수 있습니다. 이를 위해 `src` 디렉토리나 그 하위 디렉토리 내에 추가적인 `.cairo` 파일을 생성함으로써 이를 수행할 수 있습니다.
zh_cn: 当你开发你的包时，你可能想把你的代码组织成多个Cairo源文件。你可以通过在`src`目录或其子目录下创建额外的`.cairo`文件来做到这一点。

source: In this section, we’ll talk about modules and other parts of the module system, namely _paths_ that allow you to name items and the `use` keyword that brings a path into scope.
id: Pada bagian ini, kita akan membahas tentang modul dan bagian-bagian lain dari sistem modul, yaitu _paths_ yang memungkinkan Anda memberi nama pada item, dan kata kunci `use` yang membawa path ke dalam cakupan.
ko: 이 섹션에서는 모듈 및 모듈 시스템의 다른 부분, 즉 항목을 명명할 수 있게 해주는 _paths_ 와 경로를 범위 내로 가져오는 `use` 키워드에 대해 이야기할 것입니다.

source: First, we’re going to start with a list of rules for easy reference when you’re organizing your code in the future. Then we’ll explain each of the rules in detail.
id: Pertama, kita akan memulai dengan daftar aturan untuk referensi mudah saat Anda mengorganisir kode Anda di masa mendatang. Kemudian kita akan menjelaskan setiap aturan secara detail.
ko: 먼저, 앞으로 코드를 구성할 때 참고하기 쉬운 규칙 목록부터 시작할 것입니다. 그런 다음 각 규칙을 자세히 설명하겠습니다.

source: Modules Cheat Sheet
ko: 모듈 요약 시트

source: Here we provide a quick reference on how modules, paths and the `use` keyword work in the compiler, and how most developers organize their code. We’ll be going through examples of each of these rules throughout this chapter, but this is a great place to refer to as a reminder of how modules work. You can create a new Scarb project with `scarb new backyard` to follow along.
id: Di sini kami menyediakan referensi cepat tentang bagaimana modul, path, dan kata kunci `use` bekerja dalam kompiler, serta bagaimana sebagian besar pengembang mengatur kode mereka. Kami akan menjelaskan contoh dari setiap aturan ini sepanjang bab ini, namun ini adalah tempat yang bagus untuk dilihat kembali sebagai pengingat tentang bagaimana modul bekerja. Anda dapat membuat proyek Scarb baru dengan `scarb new backyard` untuk mengikuti langkah-langkahnya.
ko: 여기서는 컴파일러에서 모듈, 경로 및 `use` 키워드가 어떻게 작동하는지, 대부분의 개발자들이 코드를 어떻게 구성하는지에 대한 빠른 참조를 제공합니다. 이 장 전체에서 이러한 규칙 각각에 대한 예제를 살펴보겠지만, 모듈이 작동하는 방법을 상기시키기 위한 좋은 장소입니다. `scarb new backyard`를 사용하여 새로운 Scarb 프로젝트를 만들 수 있습니다.

source: **Start from the crate root**: When compiling a crate, the compiler first looks in the crate root file (_src/lib.cairo_) for code to compile.
id: **Mulai dari crate roo**: Saat mengompilasi sebuah crate, kompiler pertama-tama mencari kode yang akan dikompilasi dalam berkas akar crate (_src/lib.cairo_).
ko: **크레이트 루트에서 시작**: 크레이트를 컴파일할 때 컴파일러는 먼저 코드를 컴파일할 크레이트 루트 파일(_src/lib.cairo_)을 찾습니다.

source: **Declaring modules**: In the crate root file, you can declare new modules; say, you declare a “garden” module with `mod garden;`. The compiler will look for the module’s code in these places:
id: **Declaring modules**: Di dalam berkas crate root, Anda dapat mendeklarasikan modul baru; misalnya, Anda mendeklarasikan modul "garden" dengan `mod garden;`. Kompiler akan mencari kode modul ini di tempat-tempat berikut:
ko: **모듈 선언하기**: 크레이트 루트 파일에서 새 모듈을 선언할 수 있습니다. 예를 들어 `mod garden;`와 같이 "garden" 모듈을 선언할 수 있습니다. 컴파일러는 이 모듈의 코드를 다음 위치에서 찾습니다:

source: Inline, within curly brackets that replace the semicolon following `mod garden;`.
id: Secara langsung, di dalam tanda kurung kurawal yang menggantikan titik koma setelah `mod garden;`.
ko: `mod garden;` 다음의 세미콜론을 대체하는 중괄호 내부에서.

source: // crate root file (src/lib.cairo)
ko: // 루트 파일 생성 (src/lib.cairo)

source: // code defining the garden module goes here
ko: // 정원 모듈을 정의하는 코드는 이곳에 위치합니다

source: In the file _src/garden.cairo_
ko: 파일 _src/garden.cairo_ 에서

source: **Declaring submodules**: In any file other than the crate root, you can declare submodules. For example, you might declare `mod vegetables;` in _src/garden.cairo_. The compiler will look for the submodule’s code within the directory named for the parent module in these places:
id: **Declaring modules**: Di dalam berkas selain akar crate, Anda dapat mendeklarasikan submodul. Sebagai contoh, Anda mungkin mendeklarasikan `mod vegetables;` di _src/garden.cairo_. Kompiler akan mencari kode submodul ini dalam direktori yang dinamai sesuai dengan modul induk di tempat-tempat berikut:
ko: **서브모듈 선언하기**: 크레이트 루트 이외의 모든 파일에서 서브모듈을 선언할 수 있습니다. 예를 들어, _src/garden.cairo_ 에서 `mod vegetables;`를 선언할 수 있습니다. 컴파일러는 부모 모듈의 이름으로 된 디렉토리 내에서 서브모듈의 코드를 찾습니다.

source: Inline, directly following `mod vegetables`, within curly brackets instead of the semicolon.
id: Secara langsung, langsung setelah `mod vegetables`, di dalam tanda kurung kurawal sebagai pengganti titik koma.
ko: `mod vegetables` 다음에 직접 인라인으로, 세미콜론 대신 중괄호 내에 위치합니다.

source: // src/garden.cairo file
ko: // src/garden.cairo 파일

source: // code defining the vegetables submodule goes here
ko: // 채소 하위 모듈을 정의하는 코드가 여기에 있습니다

source: In the file _src/garden/vegetables.cairo_
id: Di dalam berkas _src/garden/vegetables.cairo_
ko: 파일 _src/garden/vegetables.cairo_ 에서

source: **Paths to code in modules**: Once a module is part of your crate, you can refer to code in that module from anywhere else in that same crate, using the path to the code. For example, an `Asparagus` type in the garden vegetables module would be found at `backyard::garden::vegetables::Asparagus`.
id: : Setelah sebuah modul menjadi bagian dari crate Anda, Anda dapat merujuk pada kode dalam modul tersebut dari mana saja di dalam crate yang sama, menggunakan path ke kode tersebut. Sebagai contoh, sebuah tipe `Asparagus` dalam modul sayuran taman akan ditemukan di `backyard::garden::vegetables::Asparagus`.
ko: **모듈 내 코드로의 경로**: 한 번 모듈이 크레이트의 일부가 되면, 해당 모듈의 코드를 동일한 크레이트의 다른 곳에서 경로를 사용하여 참조할 수 있습니다. 예를 들어, 정원 채소 모듈의 `Asparagus` 타입은 `backyard::garden::vegetables::Asparagus`에서 찾을 수 있습니다.

source: **The `use` keyword**: Within a scope, the `use` keyword creates shortcuts to items to reduce repetition of long paths. In any scope that can refer to `backyard::garden::vegetables::Asparagus`, you can create a shortcut with `use backyard::garden::vegetables::Asparagus;` and from then on you only need to write `Asparagus` to make use of that type in the scope.
id: **Kata kunci `use`**: Dalam suatu lingkup, kata kunci `use` membuat pintasan ke item untuk mengurangi pengulangan jalur panjang. Dalam setiap lingkup yang dapat merujuk ke `backyard::garden::vegetables::Asparagus`, Anda dapat membuat pintasan dengan `use backyard::garden::vegetables::Asparagus;` dan mulai dari situ Anda hanya perlu menulis `Asparagus` untuk menggunakan tipe tersebut dalam lingkup tersebut.
ko: **`use` 키워드**: 특정 범위 내에서 `use` 키워드는 긴 경로의 반복을 줄이기 위해 항목에 대한 바로 가기를 생성합니다. `backyard::garden::vegetables::Asparagus`를 참조할 수 있는 모든 범위에서 `use backyard::garden::vegetables::Asparagus;`를 사용하여 바로 가기를 만들 수 있으며, 이후에는 해당 범위에서 그 유형을 사용하기 위해 `Asparagus`만 작성하면 됩니다.

source: Here we create a crate named `backyard` that illustrates these rules. The crate’s directory, also named `backyard`, contains these files and directories:
id: Di sini kita membuat sebuah crate yang bernama `backyard` yang mengilustrasikan aturan-aturan ini. Direktori crate ini, yang juga bernama `backyard`, berisi file-file dan direktori-direktori berikut:
ko: 여기에서는 이러한 규칙을 설명하는 `backyard`라는 크레이트를 만듭니다. 크레이트의 디렉토리인 `backyard`에는 다음과 같은 파일과 디렉토리가 포함되어 있습니다.

source: The crate root file in this case is _src/lib.cairo_, and it contains:
es: El archivo raíz de la caja en este caso es _src/lib.cairo_, y contiene:
id: Berkas crate root dalam kasus ini adalah _src/lib.cairo_, dan berisi:
ko: 이 경우의 크레이트 루트 파일은 _src/lib.cairo_ 이며, 다음을 포함합니다:
zh_cn: 在这种情况下，crate根文件是 _src/lib.cairo_ ，它包含：

source: The `mod garden;` line tells the compiler to include the code it finds in _src/garden.cairo_, which is:
es: La línea `mod garden;` le indica al compilador que incluya el código que encuentra en _src/garden.cairo_, que es:
id: Baris `mod garden;` memberitahu kompiler untuk menyertakan kode yang ditemukan di _src/garden.cairo_, yang isinya adalah:
ko: `mod garden;` 라인은 컴파일러에게 _src/garden.cairo_ 에서 찾은 코드를 포함하도록 지시합니다.
zh_cn: `mod garden;`行告诉编译器包括它在 _src/garden.cairo_ 中发现的代码是：

source: Filename: src/garden.cairo
ko: 파일 이름: src/garden.cairo

source: Here, `mod vegetables;` means the code in _src/garden/vegetables.cairo_ is included too. That code is:
id: Di sini, `mod vegetables;` berarti kode dalam _src/garden/vegetables.cairo_ juga disertakan. Kode tersebut adalah:
ko: 여기서 `mod vegetables;`는 _src/garden/vegetables.cairo_ 에 있는 코드도 포함된다는 것을 의미합니다. 해당 코드는:

source: The line `use garden::vegetables::Asparagus;` lets us bring the `Asparagus` type into scope, so we can use it in the `main` function.
ko: `use garden::vegetables::Asparagus;` 라인은 `Asparagus` 타입을 범위 내로 가져오게 해줍니다. 따라서 `main` 함수에서 사용할 수 있습니다.

source: Now let’s get into the details of these rules and demonstrate them in action!
es: ¡Ahora vamos a entrar en los detalles de estas reglas y demostrarlas en acción!
id: Sekarang mari kita masuk ke dalam detail aturan-aturan ini dan tunjukkan penggunaannya dalam praktek!
ko: 이제 이 규칙들의 세부 내용을 살펴보고, 실제로 그들을 실천해 보겠습니다!
zh_cn: 现在让我们深入了解这些规则的细节并在实际中演示它们！

source: Grouping Related Code in Modules
id: Mengelompokkan Kode yang Terkait dalam Modul
ko: 모듈 내 관련 코드 그룹화

source: _Modules_ let us organize code within a crate for readability and easy reuse. As an example, let’s write a library crate that provides the functionality of a restaurant. We’ll define the signatures of functions but leave their bodies empty to concentrate on the organization of the code, rather than the implementation of a restaurant.
id: _Modules_ memungkinkan kita mengatur kode dalam sebuah crate agar mudah dibaca dan digunakan kembali. Sebagai contoh, mari kita tulis sebuah crate perpustakaan yang menyediakan fungsionalitas sebuah restoran. Kita akan mendefinisikan tanda tangan fungsi-fungsi namun tidak mengisi tubuh fungsi tersebut agar dapat fokus pada organisasi kode, bukan implementasi dari sebuah restoran.
ko: "모듈"은 코드를 가독성 있게 구성하고 쉽게 재사용할 수 있도록 합니다. 예를 들어, 레스토랑의 기능을 제공하는 라이브러리 크레이트를 작성해 보겠습니다. 함수의 시그니처를 정의하고 그 본문을 비워 코드의 구성에 집중하겠습니다. 식당의 구현이 아닌 코드의 구성에 집중할 것입니다.

source: In the restaurant industry, some parts of a restaurant are referred to as _front of house_ and others as _back of house_. Front of house is where customers are; this encompasses where the hosts seat customers, servers take orders and payment, and bartenders make drinks. Back of house is where the chefs and cooks work in the kitchen, dishwashers clean up, and managers do administrative work.
id: Dalam industri restoran, beberapa bagian dari sebuah restoran disebut sebagai _front of house_ dan yang lainnya disebut sebagai _back of house_. _Front of house_ adalah tempat di mana para pelanggan berada; ini meliputi tempat di mana tuan rumah duduknya pelanggan, pelayan mengambil pesanan dan pembayaran, dan penjaga bar membuat minuman. _Back of house_ adalah tempat di mana koki bekerja di dapur, pembersih peralatan membersihkan, dan manajer melakukan pekerjaan administratif.
ko: 식당 업계에서는 일부 부분을 '전면'이라고 하고 다른 부분을 '후면'이라고 합니다. 전면은 고객이 있는 곳이며, 이곳에는 호스트가 고객을 안내하는 곳, 서버가 주문과 결제를 받는 곳, 그리고 바텐더가 음료를 만드는 곳이 포함됩니다. 후면은 요리사와 조리사가 주방에서 일하는 곳, 설거지원이 청소를 하는 곳, 그리고 관리자가 행정 업무를 하는 곳입니다.

source: To structure our crate in this way, we can organize its functions into nested modules. Create a new package named `restaurant` by running `scarb new restaurant`; then enter the code in Listing 7-1 into _src/lib.cairo_ to define some modules and function signatures. Here’s the front of house section:
id: Untuk mengatur crate kita dengan cara ini, kita dapat mengelompokkan fungsinya ke dalam modul-modul bertingkat. Buatlah sebuah paket baru dengan nama `restaurant` dengan menjalankan perintah `scarb new restaurant`; kemudian masukkan kode dalam Listing 7-1 ke dalam _src/lib.cairo_ untuk mendefinisikan beberapa modul dan tanda tangan fungsi. Berikut bagian _front of house_-nya:
ko: 이러한 방식으로 우리의 크레이트를 구조화하기 위해, 우리는 그 함수들을 중첩된 모듈로 구성할 수 있습니다. `scarb new restaurant`를 실행하여 `restaurant`라는 새 패키지를 생성한 다음, 몇 가지 모듈과 함수 시그니처를 정의하기 위해 _src/lib.cairo_ 에 코드를 입력하십시오. 여기가 프론트 오브 하우스 섹션입니다:

source: Listing 7-1: A `front_of_house` module containing other modules that then contain functions
id: Listing 7-1: Sebuah modul `front_of_house` yang berisi modul-modul lain yang kemudian berisi fungsi-fungsi
ko: 리스팅 7-1: 다른 모듈을 포함하고 있는 `front_of_house` 모듈, 그 안에는 함수들이 포함돼 있습니다.

source: We define a module with the `mod` keyword followed by the name of the module (in this case, `front_of_house`). The body of the module then goes inside curly brackets. Inside modules, we can place other modules, as in this case with the modules `hosting` and `serving`. Modules can also hold definitions for other items, such as structs, enums, constants, traits, and—as in Listing 6-1—functions.
id: Kita mendefinisikan sebuah modul dengan kata kunci `mod` diikuti oleh nama modul (dalam kasus ini, `front_of_house`). Tubuh dari modul tersebut kemudian ditempatkan di dalam kurung kurawal. Di dalam modul, kita dapat menempatkan modul-modul lain, seperti dalam kasus ini dengan modul-modul `hosting` dan `serving`. Modul juga dapat menyimpan definisi untuk item-item lain, seperti struct, enum, konstanta, traits, dan—seperti pada Daftar 6-1—fungsi-fungsi.
ko: 우리는 `mod` 키워드로 모듈을 정의합니다. 모듈의 이름 뒤에는 모듈의 이름 (이 경우 `front_of_house`)이 옵니다. 그런 다음 모듈의 본문은 중괄호 내부에 들어갑니다. 모듈 내부에서는 다른 모듈을 배치할 수 있습니다. 이 경우 `hosting`과 `serving` 모듈이 있습니다. 모듈은 또한 구조체, 열거형, 상수, 트레이트 및 6-1 목록에서와 같이 함수에 대한 정의를 보유할 수 있습니다.

source: By using modules, we can group related definitions together and name why they’re related. Programmers using this code can navigate the code based on the groups rather than having to read through all the definitions, making it easier to find the definitions relevant to them. Programmers adding new functionality to this code would know where to place the code to keep the program organized.
id: Dengan menggunakan modul, kita dapat mengelompokkan definisi-definisi terkait bersama dan menjelaskan mengapa mereka terkait. Para programmer yang menggunakan kode ini dapat menjelajahi kode berdasarkan grup-grup tersebut daripada harus membaca melalui semua definisi, sehingga lebih mudah untuk menemukan definisi yang relevan bagi mereka. Para programmer yang menambahkan fungsionalitas baru ke dalam kode ini akan tahu di mana meletakkan kode tersebut untuk menjaga keorganisasian program.
ko: 모듈을 사용함으로써 관련된 정의들을 함께 그룹화하고 그들이 왜 관련되어 있는지 명명할 수 있습니다. 이 코드를 사용하는 프로그래머들은 모든 정의를 읽는 대신 그룹을 기반으로 코드를 탐색할 수 있어서, 자신에게 관련된 정의를 쉽게 찾을 수 있습니다. 이 코드에 새로운 기능을 추가하는 프로그래머들은 프로그램을 조직화하기 위해 코드를 배치해야 할 위치를 알 수 있을 것입니다.

source: Earlier, we mentioned that _src/lib.cairo_ is called the crate root. The reason for this name is that the content of this file form a module named after the crate name at the root of the crate’s module structure, known as the _module tree_.
id: Sebelumnya, kami menyebutkan bahwa _src/lib.cairo_ disebut sebagai akar crate. Alasan dari nama ini adalah bahwa konten dari file ini membentuk sebuah modul yang dinamai sesuai dengan nama crate pada akar struktur modul crate, yang dikenal sebagai _pohon modul_ (_module tree_).
ko: 이전에 우리는 _src/lib.cairo_ 가 크레이트 루트라고 불리는 것을 언급했습니다. 이 이름의 이유는 이 파일의 내용이 크레이트 이름에 따라 명명된 모듈을 형성하기 때문입니다. 이 모듈은 크레이트의 모듈 구조의 루트에 위치하며 _모듈 트리_ 로 알려져 있습니다.

source: Listing 7-2 shows the module tree for the structure in Listing 7-1.
id: Listing 7-2 menunjukkan pohon modul untuk struktur pada Daftar 7-1.
ko: 리스팅 7-2는 리스팅 7-1의 구조에 대한 모듈 트리를 보여줍니다.
zh_cn: 示例7-2显示了示例7-1中结构的模块树。

source: Listing 7-2: The module tree for the code in Listing 6-1
id: Listing 7-2: Pohon modul untuk kode pada Daftar 6-1
ko: 리스팅 7-2: 리스팅 6-1의 코드에 대한 모듈 트리

source: This tree shows how some of the modules nest inside one another; for example, `hosting` nests inside `front_of_house`. The tree also shows that some modules are _siblings_ to each other, meaning they’re defined in the same module; `hosting` and `serving` are siblings defined within `front_of_house`. If module A is contained inside module B, we say that module A is the _child_ of module B and that module B is the _parent_ of module A. Notice that the entire module tree is rooted under the explicit name of the crate `restaurant`.
id: Pohon ini menunjukkan bagaimana beberapa modul bersarang di dalam modul lain; misalnya, `hosting` bersarang di dalam `front_of_house`. Pohon ini juga menunjukkan bahwa beberapa modul adalah _saudara kandung_ satu sama lain, artinya mereka didefinisikan dalam modul yang sama; `hosting` dan `serving` adalah saudara kandung yang didefinisikan di dalam `front_of_house`. Jika modul A terdapat di dalam modul B, kita katakan bahwa modul A adalah _anak_ dari modul B dan bahwa modul B adalah _induk_ dari modul A. Perhatikan bahwa seluruh pohon modul berakar di bawah nama eksplisit dari peti kemas `restaurant`.
ko: 이 트리는 일부 모듈이 서로 중첩되어 있는 방식을 보여줍니다. 예를 들어, `hosting`은 `front_of_house` 내부에 중첩됩니다. 이 트리는 또한 일부 모듈이 서로 _형제_ 임을 보여줍니다. 즉, 같은 모듈에 정의된 것을 의미합니다. `hosting`과 `serving`은 `front_of_house` 내에서 정의된 형제입니다. 모듈 A가 모듈 B 내에 포함되어 있다면, 모듈 A를 모듈 B의 _자식_ 이라고 하고, 모듈 B를 모듈 A의 _부모_ 라고 합니다. 전체 모듈 트리가 명시적으로 `restaurant` 크레이트 이름 아래에 뿌리를 내리는 것에 유의하십시오.

source: The module tree might remind you of the filesystem’s directory tree on your computer; this is a very apt comparison! Just like directories in a filesystem, you use modules to organize your code. And just like files in a directory, we need a way to find our modules.
id: Pohon modul mungkin mengingatkan Anda pada pohon direktori dalam sistem file di komputer Anda; perbandingan ini sangat tepat! Sama seperti direktori dalam sistem file, Anda menggunakan modul untuk mengatur kode Anda. Dan sama seperti file dalam sebuah direktori, kita memerlukan cara untuk menemukan modul-modul kita.
ko: 모듈 트리는 컴퓨터의 파일 시스템 디렉토리 트리를 떠올리게 할 수 있습니다. 이는 매우 적절한 비교입니다! 파일 시스템의 디렉토리와 마찬가지로 모듈을 사용하여 코드를 구성합니다. 그리고 디렉토리의 파일과 마찬가지로 모듈을 찾는 방법이 필요합니다.

source: To show Cairo where to find an item in a module tree, we use a path in the same way we use a path when navigating a filesystem. To call a function, we need to know its path.
es: Para indicarle a Cairo dónde encontrar un elemento en el árbol de módulos, usamos un camino de la misma forma que usamos una ruta al navegar por un sistema de archivos. Para llamar a una función, necesitamos conocer su camino.
id: Untuk menunjukkan kepada Cairo di mana menemukan suatu item dalam pohon modul, kita menggunakan jalur dengan cara yang sama seperti saat kita menavigasi sistem file. Untuk memanggil sebuah fungsi, kita perlu tahu jalurnya.
ko: 카이로에게 모듈 트리에서 품목을 찾는 방법을 보여주기 위해, 파일 시스템을 탐색할 때와 같은 방식으로 경로를 사용합니다. 함수를 호출하려면 해당 함수의 경로를 알아야 합니다.
zh_cn: 为了告诉Cairo如何在模块树中找到一个项目，我们使用路径的方式，就像在文件系统使用路径一样。为了调用一个函数，我们需要知道它的路径。

source: A path can take two forms:
es: Un camino puede tomar dos formas:
id: Sebuah path dapat memiliki dua bentuk:
ko: 한 경로는 두 가지 형태를 취할 수 있습니다.
zh_cn: 路径可以有两种形式：

source: An _absolute path_ is the full path starting from a crate root. The absolute path begins with the crate name.
id: Sebuah _absolute path_ adalah path lengkap yang dimulai dari root crate. Absolute path dimulai dengan nama crate.
ko: 절대 경로는 크레이트 루트부터 시작하는 전체 경로입니다. 절대 경로는 크레이트 이름으로 시작합니다.

source: A _relative path_ starts from the current module.
id: _Relative path_ dimulai dari modul saat ini.
ko: 상대 경로는 현재 모듈에서 시작합니다.

source: Both absolute and relative paths are followed by one or more identifiers separated by double colons (`::`).
id: Baik jalur absolute maupun relative diikuti oleh satu atau lebih pengenal yang dipisahkan oleh titik dua ganda (`::`).
ko: 절대 경로와 상대 경로 모두 두 콜론(`::`)으로 구분된 하나 이상의 식별자를 따릅니다.

source: To illustrate this notion let's take back our example Listing 7-1 for the restaurant we used in the last chapter. We have a crate named `restaurant` in which we have a module named `front_of_house` that contains a module named `hosting`. The `hosting` module contains a function named `add_to_waitlist`. We want to call the `add_to_waitlist` function from the `eat_at_restaurant` function. We need to tell Cairo the path to the `add_to_waitlist` function so it can find it.
id: Untuk mengilustrasikan konsep ini, mari kita ambil contoh Daftar 7-1 untuk restoran yang kita gunakan dalam bab sebelumnya. Kita memiliki sebuah crate yang bernama `restaurant` di mana kita memiliki modul bernama `front_of_house` yang berisi sebuah modul bernama `hosting`. Modul `hosting` berisi sebuah fungsi yang bernama `add_to_waitlist`. Kita ingin memanggil fungsi `add_to_waitlist` dari fungsi `eat_at_restaurant`. Kita perlu memberi tahu Cairo jalur ke fungsi `add_to_waitlist` agar Cairo bisa menemukannya.
ko: 이 개념을 설명하기 위해 지난 장에서 사용한 레스토랑 예제인 Listing 7-1을 다시 살펴보겠습니다. 우리는 `front_of_house` 모듈을 포함하는 `restaurant`라는 상자가 있습니다. `front_of_house` 모듈에는 `hosting`이라는 모듈이 포함되어 있습니다. `hosting` 모듈에는 `add_to_waitlist`라는 함수가 포함되어 있습니다. 우리는 `eat_at_restaurant` 함수에서 `add_to_waitlist` 함수를 호출하고 싶습니다. Cairo에게 `add_to_waitlist` 함수의 경로를 알려주어야 찾을 수 있습니다.
zh_cn: 为了说明这个概念，让我们回到我们在上一章使用的餐厅的例子示例7-1。我们有一个名为 `restaurant`的crate，其中有一个名为`front_of_house`的模块，包含一个名为 `hosting`的模块。`hosting`模块包含一个名为 `add_to_waitlist`的函数。我们想从`eat_at_restaurant`函数中调用`add_to_waitlist`函数。我们需要告诉Cairo `add_to_waitlist`函数的路径，以便它能找到它。

source: // Absolute path
ko: 절대 경로

source: // ✅ Compiles
ko: // ✅ 컴파일됨

source: // Relative path
ko: 상대 경로

source: Listing 7-3: Calling the `add_to_waitlist` function using absolute and relative paths
id: Listing 7-3: Memanggil fungsi `add_to_waitlist` menggunakan jalur absolut dan relatif
ko: 리스팅 7-3: 절대 경로와 상대 경로를 사용하여 `add_to_waitlist` 함수를 호출하기

source: The first time we call the `add_to_waitlist` function in `eat_at_restaurant`, we use an absolute path. The `add_to_waitlist` function is defined in the same crate as `eat_at_restaurant`. In Cairo, absolute paths start from the crate root, which you need to refer to by using the crate name.
id: Ketika pertama kali kita memanggil fungsi `add_to_waitlist` dalam `eat_at_restaurant`, kita menggunakan jalur absolut. Fungsi `add_to_waitlist` didefinisikan dalam crate yang sama dengan `eat_at_restaurant`. Dalam Cairo, jalur absolut dimulai dari akar crate, yang perlu Anda rujuk dengan menggunakan nama crate.
ko: `eat_at_restaurant`에서 `add_to_waitlist` 함수를 처음 호출할 때, 우리는 절대 경로를 사용합니다. `add_to_waitlist` 함수는 `eat_at_restaurant`와 동일한 크레이트에 정의되어 있습니다. 카이로에서 절대 경로는 크레이트 루트부터 시작하며, 크레이트 이름을 사용하여 참조해야 합니다.
