Repository: cairo-book/cairo-book
Catalog: po/*.po
Languages: es, id, ko, zh_cn

source: When writing the implementation of the interface, the generic parameter corresponding to the `self` argument in the trait must be `ContractState`. The `ContractState` type is generated by the compiler, and gives access to the storage variables defined in the `Storage` struct. Additionally, `ContractState` gives us the ability to emit events. The name `ContractState` is not surprising, as it’s a representation of the contract’s state, which is what we think of `self` in the contract interface trait.
id: Ketika menulis implementasi antarmuka, parameter generik yang sesuai dengan argumen `self` dalam trait harus menjadi `ContractState`. Tipe `ContractState` dihasilkan oleh kompiler dan memberikan akses ke variabel penyimpanan yang didefinisikan dalam struktur `Storage`. Selain itu, `ContractState` memberikan kemampuan untuk mengeluarkan peristiwa (events). Nama `ContractState` tidak mengherankan, karena ini merupakan representasi dari status kontrak, yang merupakan apa yang kita pikirkan sebagai `self` dalam trait antarmuka kontrak.
ko: 인터페이스의 구현을 작성할 때, 트레이트에서 `self` 인자에 해당하는 일반 매개변수는 `ContractState`여야 합니다. `ContractState` 유형은 컴파일러에 의해 생성되며, `Storage` 구조체에서 정의된 저장 변수에 액세스할 수 있습니다. 또한, `ContractState`는 이벤트를 발생시키는 능력을 제공합니다. `ContractState`라는 이름은 계약의 상태를 나타내는 것으로, 계약 인터페이스 트레이트에서 `self`로 생각하는 것과 일치합니다.

source: Modifying the contract's state
id: Memodifikasi status kontrak
ko: 계약 상태 수정

source: As you can notice, all functions that need to access the state of the contract are defined under the implementation of a trait that has a `TContractState` generic parameter, and take a `self: ContractState` parameter. This allows us to explicitly pass the `self: ContractState` parameter to the function, allowing access the storage variables of the contract. To access a storage variable of the current contract, you add the `self` prefix to the storage variable name, which allows you to use the `read` and `write` methods to either read or write the value of the storage variable.
id: Seperti yang dapat Anda perhatikan, semua fungsi yang perlu mengakses status kontrak didefinisikan di bawah implementasi suatu trait yang memiliki parameter generik `TContractState` dan mengambil parameter `self: ContractState`. Ini memungkinkan kita untuk secara eksplisit melewati parameter `self: ContractState` ke fungsi, memungkinkan akses ke variabel penyimpanan kontrak. Untuk mengakses variabel penyimpanan kontrak saat ini, Anda menambahkan awalan `self` ke nama variabel penyimpanan, yang memungkinkan Anda menggunakan metode `read` dan `write` untuk membaca atau menulis nilai variabel penyimpanan.
ko: 당신이 알 수 있듯이, 계약 상태에 액세스해야 하는 모든 함수들은 `TContractState` 제네릭 매개변수를 가진 특성의 구현 아래에서 정의되며, `self: ContractState` 매개변수를 취합니다. 이를 통해 우리는 명시적으로 `self: ContractState` 매개변수를 함수에 전달하여 계약의 저장 변수에 액세스할 수 있습니다. 현재 계약의 저장 변수에 액세스하려면, 저장 변수 이름에 `self` 접두사를 추가하여 해당 저장 변수의 값을 읽거나 쓸 수 있는 `read` 및 `write` 메서드를 사용할 수 있습니다.

source: Using `self` and the `write` method to modify the value of a storage variable
id: Menggunakan `self` dan metode `write` untuk memodifikasi nilai variabel penyimpanan
ko: `self`와 `write` 메소드를 사용하여 저장 변수의 값을 수정합니다.

source: Note: if the contract state is passed as a snapshot instead of `ref`, attempting to modify will result in a compilation error.
id: Catatan: jika status kontrak dilewatkan sebagai snapshot alih-alih `ref`, percobaan untuk memodifikasi akan menghasilkan kesalahan kompilasi.
ko: 참고: 계약 상태가 `ref` 대신 스냅샷으로 전달된 경우 수정을 시도하면 컴파일 오류가 발생합니다.

source: This contract does not do much yet apart from allowing anyone to store a single number that is accessible by anyone in the world. Anyone could call `set` again with a different value and overwrite your number, but the number is still stored in the history of the blockchain. Later, you will see how you can impose access restrictions so that only you can alter the number.
id: Kontrak ini belum melakukan banyak hal selain memungkinkan siapa pun menyimpan satu angka yang dapat diakses oleh siapa pun di dunia. Siapa pun bisa memanggil `set` lagi dengan nilai yang berbeda dan menimpa angka Anda, tetapi angka tersebut masih disimpan dalam sejarah blockchain. Nanti, Anda akan melihat bagaimana Anda dapat memberlakukan pembatasan akses sehingga hanya Anda yang dapat mengubah angka tersebut.
ko: 이 계약은 아직 많은 일을 하지는 않지만 누구나 전 세계에서 접근할 수 있는 단일 숫자를 저장할 수 있도록 허용합니다. 누구나 다른 값으로 'set'을 호출하여 숫자를 덮어쓸 수 있지만, 숫자는 여전히 블록체인의 기록에 저장됩니다. 나중에 액세스 제한을 부과하여 당신만이 숫자를 변경할 수 있도록 할 수 있는 방법을 보게 될 것입니다.
zh_cn: 除了允许任何人存储世界上任何人都可以访问的单个号码外，该合约没做其他事。任何人都可以用不同的值再次调用`set`覆盖您的号码，但号码仍然存储在区块链的历史中。稍后，您将看到如何施加访问限制，以便只有您可以更改号码。

source: In the previous section, we gave an introductory example of a smart contract written in Cairo. In this section, we'll be taking a deeper look at all the components of a smart contract, step by step.
id: Pada bagian sebelumnya, kami memberikan contoh pengantar dari kontrak pintar yang ditulis dalam bahasa Cairo. Pada bagian ini, kita akan melihat lebih dalam semua komponen dari kontrak pintar, langkah demi langkah.
ko: 이전 섹션에서는 카이로로 작성된 스마트 계약의 입문 예제를 제시했습니다. 이번 섹션에서는 스마트 계약의 모든 구성 요소를 단계별로 자세히 살펴볼 것입니다.
zh_cn: 在上一节中，我们给出了一个用Cairo语言编写的智能合约的介绍性示例。在本节中，我们将逐步深入了解智能合约的所有组成部分。

source: When we discussed [_interfaces_](./ch99-01-02-a-simple-contract.md), we specified the difference between _public functions, external functions and view functions_, and we mentioned how to interact with _storage_.
id: Ketika kita membahas [_interfaces_](./ch99-01-02-a-simple-contract.md), kita menjelaskan perbedaan antara _fungsi publik, fungsi eksternal, dan fungsi view_, dan kita menyebutkan cara berinteraksi dengan _penyimpanan_.
ko: [ _인터페이스_ ](./ch99-01-02-a-simple-contract.md)를 논의할 때, _public 함수, external 함수 및 view 함수_ 간의 차이를 명시했으며 _storage_ 와 상호 작용하는 방법에 대해 언급했습니다.
zh_cn: 在讨论[_interfaces_](./ch99-01-02-a-simple-contract.md)时，我们明确了_public函数、external函数和view函数_ 之间的区别，并提到了如何与 _storage_ 交互。

source: At this point, you should have multiple questions that come to mind:
id: Pada titik ini, seharusnya Anda memiliki beberapa pertanyaan yang muncul dalam pikiran:
ko: 이 시점에서 당신은 머릿속에 여러 질문들이 생기게 될 것입니다:
zh_cn: 此时，您应该会想到很多问题：

source: How do I define internal/private functions?
id: Bagaimana cara saya mendefinisikan fungsi internal atau privat?
ko: 내부/비공개 함수를 어떻게 정의하나요?

source: How can I emit events? How can I index them?
id: Bagaimana cara saya mengeluarkan peristiwa (events)? Bagaimana cara saya membuat indeks pada peristiwa tersebut?
ko: 이벤트를 어떻게 발생시킬 수 있을까요? 어떻게 색인화할 수 있을까요?

source: Where should I define functions that do not need to access the contract's state?
id: Di mana sebaiknya saya mendefinisikan fungsi yang tidak perlu mengakses status kontrak?
ko: 계약 상태에 액세스할 필요가 없는 함수를 정의해야 하는 곳은 어디인가요?

source: Is there a way to reduce the boilerplate?
id: Apakah ada cara untuk mengurangi boilerplate (kode yang sering diulang)?
ko: 보일러플레이트를 줄일 수 있는 방법이 있나요?

source: How can I store more complex data types?
id: Bagaimana cara menyimpan tipe data yang lebih kompleks?
ko: 더 복잡한 데이터 유형을 어떻게 저장할 수 있을까요?

source: Luckily, we'll be answering all these questions in this chapter. Let's consider the following example contract that we'll be using throughout this chapter:
id: Untungnya, kita akan menjawab semua pertanyaan tersebut dalam bab ini. Mari pertimbangkan contoh kontrak berikut yang akan kita gunakan sepanjang bab ini:
ko: 다행히도, 이 장에서는 모든 이러한 질문에 대답할 것입니다. 이 장 전체에서 사용할 예시 계약을 고려해 봅시다.
zh_cn: 幸运的是，我们将在本章中回答所有这些问题。下面是我们在本章中将使用的合约示例：

source: // Could be a group of functions about a same topic
ko: 동일한 주제에 대한 함수 그룹일 수 있습니다.

source: // Free functions
ko: // 무료 함수

source: Listing 99-3: Our reference contract for this chapter
ko: 리스팅 99-3: 이 장의 참조 계약

source: The most common way for interacting with a contract’s storage is through storage variables. As stated previously, storage variables allow you to store data that will be stored in the contract's storage that is itself stored on the blockchain. These data are persistent and can be accessed and modified anytime once the contract is deployed.
id: Cara paling umum untuk berinteraksi dengan penyimpanan kontrak adalah melalui variabel penyimpanan. Seperti yang disebutkan sebelumnya, variabel penyimpanan memungkinkan Anda menyimpan data yang akan disimpan di penyimpanan kontrak yang sendiri disimpan di blockchain. Data ini bersifat persisten dan dapat diakses serta dimodifikasi kapan saja setelah kontrak diimplementasikan.
ko: 계약의 저장소와 상호 작용하는 가장 일반적인 방법은 저장소 변수를 통해 이루어집니다. 이전에 언급했듯이, 저장소 변수를 사용하면 블록체인에 저장된 계약의 저장소에 저장될 데이터를 저장할 수 있습니다. 이러한 데이터는 영구적이며, 계약이 배포된 후 언제든지 액세스하고 수정할 수 있습니다.
zh_cn: 与合约存储进行交互的最常见方式是通过存储变量。正如前面所述，存储变量允许您存储将存储在合约的存储中的数据，而该存储本身存储在区块链上。这些数据是持久的，一旦合约部署后，可以随时访问和修改。

source: Storage variables in Starknet contracts are stored in a special struct called `Storage`:
es: Las variables de almacenamiento en los contratos Starknet se almacenan en una estructura especial llamada `Storage`:
id: Variabel penyimpanan dalam kontrak Starknet disimpan dalam sebuah struktur khusus yang disebut `Storage`:
ko: Starknet 계약의 저장 변수는 `Storage`라는 특별한 구조체에 저장됩니다.
zh_cn: Starknet合约中的存储变量被存储在一个特殊的结构中，称为`Storage`：

source: A Storage Struct
id: Storage Struct
ko: 저장 구조체

source: The storage struct is a [struct](./ch05-00-using-structs-to-structure-related-data.md) like any other, except that it **must** be annotated with `#[storage]`. This annotation tells the compiler to generate the required code to interact with the blockchain state, and allows you to read and write data from and to storage. Moreover, this allows you to define storage mappings using the `LegacyMap` type.
id: Struktur penyimpanan adalah [struct](./ch05-00-using-structs-to-structure-related-data.md) seperti halnya struktur lainnya, kecuali bahwa struktur ini **harus** diberi anotasi `#[storage]`. Anotasi ini memberi tahu kompiler untuk menghasilkan kode yang diperlukan untuk berinteraksi dengan status blockchain, dan memungkinkan Anda membaca dan menulis data dari dan ke penyimpanan. Selain itu, ini memungkinkan Anda mendefinisikan pemetaan penyimpanan menggunakan tipe `LegacyMap`.
ko: 저장소 구조체는 다른 구조체와 마찬가지로 [struct](./ch05-00-using-structs-to-structure-related-data.md)이지만, `#[storage]`로 주석이 달려 있어야만 합니다. 이 주석은 컴파일러에게 블록체인 상태와 상호 작용하는 데 필요한 코드를 생성하도록 지시하고, 저장소에서 데이터를 읽고 쓸 수 있도록 합니다. 더불어, 이를 통해 `LegacyMap` 유형을 사용하여 저장소 매핑을 정의할 수 있습니다.

source: Each variable stored in the storage struct is stored in a different location in the contract's storage. The storage address of a variable is determined by the variable's name, and the eventual keys of the variable if it is a [mapping](#storing-mappings).
id: Setiap variabel yang disimpan dalam struktur penyimpanan disimpan di lokasi yang berbeda dalam penyimpanan kontrak. Alamat penyimpanan dari suatu variabel ditentukan oleh nama variabel tersebut, dan kunci akhir dari variabel tersebut jika itu adalah [mapping](#storing-mappings).
ko: 저장 구조체에 저장된 각 변수는 계약의 저장소 내에서 다른 위치에 저장됩니다. 변수의 저장 주소는 변수의 이름에 의해 결정되며, 변수가 [매핑](#storing-mappings)인 경우 변수의 최종 키에 의해 결정됩니다.
zh_cn: 存储结构中存储的每个变量都存储在合约存储的不同位置。变量的存储地址由变量名决定，如果是映射，则还由变量的最终键决定。

source: Storage Addresses
ko: 저장 주소

source: The address of a storage variable is computed as follows:
id: Alamat dari variabel penyimpanan dihitung sebagai berikut:
ko: 저장 변수의 주소는 다음과 같이 계산됩니다:
zh_cn: 存储变量的地址计算方式如下：

source: If the variable is a single value (not a mapping), the address is the `sn_keccak` hash of the ASCII encoding of the variable's name. `sn_keccak` is Starknet's version of the Keccak256 hash function, whose output is truncated to 250 bits.
id: Jika variabel adalah nilai tunggal (bukan pemetaan), alamatnya adalah hash `sn_keccak` dari pengodean ASCII nama variabel. `sn_keccak` adalah versi fungsi hash Keccak256 milik Starknet, dengan keluaran yang dipotong menjadi 250 bit.
ko: 변수가 단일 값(매핑이 아닌 경우)인 경우 주소는 변수 이름의 ASCII 인코딩의 `sn_keccak` 해시입니다. `sn_keccak`은 출력이 250비트로 줄어든 Keccak256 해시 함수의 Starknet 버전입니다.

source: If the variable is a [mapping](#storing-mappings), the address of the value at key `k_1,...,k_n` is `h(...h(h(sn_keccak(variable_name),k_1),k_2),...,k_n)` where ℎ is the Pedersen hash and the final value is taken `mod (2^251) − 256`.
id: Jika variabel adalah [pemetaan](#storing-mappings), alamat dari nilai pada kunci `k_1,...,k_n` adalah `h(...h(h(sn_keccak(nama_variabel),k_1),k_2),...,k_n)` di mana ℎ adalah hash Pedersen dan nilai akhir diambil `mod (2^251) − 256`.
ko: 만약 변수가 [매핑](#storing-mappings)이라면, 키 `k_1,...,k_n`의 값의 주소는 `h(...h(h(sn_keccak(variable_name),k_1),k_2),...,k_n)`이며 여기서 ℎ는 Pedersen 해시이고 최종 값은 `mod (2^251) − 256`으로 취합니다.

source: If it is a mapping to complex values (e.g., tuples or structs), then this complex value lies in a continuous segment starting from the address calculated in the previous point. Note that 256 field elements is the current limitation on the maximal size of a complex storage value.
id: Jika itu adalah pemetaan ke nilai kompleks (misalnya, tupel atau structs), maka nilai kompleks ini terletak dalam segmen berkelanjutan yang dimulai dari alamat yang dihitung pada poin sebelumnya. Perlu diperhatikan bahwa 256 elemen lapangan adalah batasan saat ini pada ukuran maksimal nilai penyimpanan kompleks.
ko: 복소 값에 대한 매핑인 경우(예: 튜플 또는 구조체), 이 복소 값은 이전 지점에서 계산된 주소를 시작으로하는 연속 세그먼트에 있습니다. 256개의 필드 요소가 복소 저장 값의 최대 크기 제한입니다.

source: You can access the address of a storage variable by calling the `address` function on the variable, which returns a `StorageBaseAddress` value.
id: Anda dapat mengakses alamat variabel penyimpanan dengan memanggil fungsi `address` pada variabel tersebut, yang mengembalikan nilai `StorageBaseAddress`.
ko: `address` 함수를 변수에 호출하여 저장 변수의 주소에 액세스할 수 있으며, 이는 `StorageBaseAddress` 값을 반환합니다.
zh_cn: 通过在变量上调用 `address` 函数，你可以访问存储变量的地址，该函数返回一个 `StorageBaseAddress` 值。

source: Interacting with Storage Variables
id: Berinteraksi dengan Variabel Penyimpanan
ko: 저장 변수와 상호 작용하기

source: Variables stored in the storage struct can be accessed and modified using the `read` and `write` functions, and you can get their address in storage using the `address` function. These functions are automatically generated by the compiler for each storage variable.
ko: 저장 구조체에 저장된 변수는 `read` 및 `write` 함수를 사용하여 액세스하고 수정할 수 있으며, `address` 함수를 사용하여 저장소에서 그들의 주소를 얻을 수 있습니다. 이러한 함수들은 컴파일러에 의해 각 저장 변수에 대해 자동으로 생성됩니다.

source: To read the value of the `owner` storage variable, which is a single value, we call the `read` function on the `owner` variable, passing in no parameters.
id: Untuk membaca nilai variabel penyimpanan `owner`, yang merupakan nilai tunggal, kita panggil fungsi `read` pada variabel `owner`, tanpa memberikan parameter.
ko: `owner` 스토리지 변수의 값을 읽으려면, 이 변수에 대해 `read` 함수를 호출하고 매개변수를 전달하지 않습니다.
zh_cn: 要读取 `owner` 存储变量的值，该变量是一个单一值，我们调用 `owner` 变量上的 `read` 函数，不传入任何参数。

source: Calling the `read` function on the `owner` variable
id: Memanggil fungsi `read` pada variabel `owner`
ko: `owner` 변수에 `read` 함수를 호출합니다.

source: To read the value of the storage variable `names`, which is a mapping from `ContractAddress` to `felt252`, we call the `read` function on the `names` variable, passing in the key `address` as a parameter. If the mapping had more than one key, we would pass in the other keys as parameters as well.
id: Untuk membaca nilai variabel penyimpanan `names`, yang merupakan pemetaan dari `ContractAddress` ke `felt252`, kita panggil fungsi `read` pada variabel `names`, dengan melewatkan kunci `address` sebagai parameter. Jika pemetaan memiliki lebih dari satu kunci, kita akan melewatkan kunci-kunci lain sebagai parameter juga.
ko: `names` 저장 변수의 값을 읽으려면 `ContractAddress`에서 `felt252`로의 매핑이며, `names` 변수에 대해 `read` 함수를 호출하여 키 `address`를 매개변수로 전달합니다. 매핑에 둘 이상의 키가 있다면 다른 키도 매개변수로 전달해야 합니다.
zh_cn: 要读取存储变量 `names` 的值，这个变量是从 `ContractAddress` 映射到 `felt252` 的，我们在 `names` 变量上调用 `read` 函数，将键 `address` 作为参数传入。如果这个映射有多个键，我们也会将其他键作为参数传入。

source: Calling the `read` function on the `names` variable
id: Memanggil fungsi `read` pada variabel `names`
ko: `names` 변수에서 `read` 함수를 호출합니다.

source: To write a value to a storage variable, we call the `write` function passing in the eventual keys the value as arguments. As with the `read` function, the number of arguments depends on the number of keys - here, we only pass in the value to write to the `owner` variable as it is a simple variable.
id: Untuk menulis nilai ke variabel penyimpanan, kita panggil fungsi `write` dengan melewatkan kunci-kunci akhir dan nilai sebagai argumen. Seperti halnya fungsi `read`, jumlah argumen tergantung pada jumlah kunci - di sini, kita hanya melewatkan nilai yang akan ditulis ke variabel `owner` karena ini adalah variabel sederhana.
ko: 저장 변수에 값을 쓰려면, 값으로 향하는 키를 전달하는 `write` 함수를 호출합니다. `read` 함수와 마찬가지로, 전달하는 인수의 수는 키의 수에 따라 달라집니다. 여기서는 `owner` 변수에 쓸 값만 전달하면 되므로 인수의 수가 하나입니다.
zh_cn: 要将值写入存储变量，我们需要调用 `write` 函数，并将其最终键和值作为参数传递。与 read 函数一样，参数的数量取决于键的数量——这里，我们只需要将要写入 `owner`变量的值作为参数，因为它是一个简单的变量。

source: Calling the `write` function on the `owner` variable
id: Memanggil fungsi `write` pada variabel `owner`
ko: `owner` 변수에 `write` 함수를 호출합니다.

source: Calling the `write` function on the `names` variable
id: Memanggil fungsi `write` pada variabel `names`
ko: `names` 변수에 `write` 함수를 호출합니다.

source: Storing custom types
ko: 사용자 지정 타입 저장하기

source: The `Store` trait, defined in the `starknet::storage_access` module, is used to specify how a type should be stored in storage. In order for a type to be stored in storage, it must implement the `Store` trait. Most types from the core library, such as unsigned integers (`u8`, `u128`, `u256`...), `felt252`, `bool`, `ContractAddress`, etc. implement the `Store` trait and can thus be stored without further action.
id: Trait `Store`, yang didefinisikan dalam modul `starknet::storage_access`, digunakan untuk menentukan bagaimana suatu tipe harus disimpan di penyimpanan. Agar suatu tipe dapat disimpan di penyimpanan, ia harus mengimplementasikan trait `Store`. Sebagian besar tipe dari pustaka inti, seperti bilangan bulat tanpa tanda (`u8`, `u128`, `u256`, ...), `felt252`, `bool`, `ContractAddress`, dll., mengimplementasikan trait `Store` dan oleh karena itu dapat disimpan tanpa tindakan lebih lanjut.
ko: `Store` 트레이트는 `starknet::storage_access` 모듈에서 정의되며, 타입이 스토리지에 저장되는 방법을 지정하는 데 사용됩니다. 타입이 스토리지에 저장되기 위해서는 `Store` 트레이트를 구현해야 합니다. 대부분의 코어 라이브러리에서 제공하는 타입들, 예를 들어 부호 없는 정수(`u8`, `u128`, `u256`...), `felt252`, `bool`, `ContractAddress` 등은 `Store` 트레이트를 구현하고 있으므로 추가 조치 없이 저장될 수 있습니다.
zh_cn: `Store` trait，定义在 `starknet::storage_access` 模块中，用于指定类型如何在存储中存储。为了将类型存储在存储中，它必须实现 `Store` trait。大多数来自核心库的类型，例如无符号整数 (`u8`, `u128`, `u256`...),、`felt252`、`bool`、`ContractAddress` 等都实现了 `Store` trait，因此无需进一步操作即可存储。

source: But what if you wanted to store a type that you defined yourself, such as an enum or a struct? In that case, you have to explicitly tell the compiler how to store this type.
id: Namun, bagaimana jika Anda ingin menyimpan tipe yang Anda tentukan sendiri, seperti enum atau struct? Dalam kasus ini, Anda harus secara eksplisit memberi tahu kompiler bagaimana menyimpan tipe ini.
ko: 그러나 사용자가 정의한 enum이나 struct와 같은 유형을 저장하려면 어떻게 해야 할까요? 이 경우, 해당 유형을 어떻게 저장할지 컴파일러에 명시적으로 알려주어야 합니다.
zh_cn: 但是，如果您想存储您自己定义的类型，例如枚举或结构，该怎么办？在这种情况下，您必须明确地告诉编译器如何存储这种类型。

source: In our example, we want to store a `Person` struct in storage, which is possible by implementing the `Store` trait for the `Person` type. This can be achieved by simply adding a `#[derive(starknet::Store)]` attribute on top of our struct definition.
id: Dalam contoh kami, kami ingin menyimpan struktur `Person` di penyimpanan, yang dapat dilakukan dengan mengimplementasikan trait `Store` untuk tipe `Person`. Ini dapat dicapai dengan menambahkan atribut `#[derive(starknet::Store)]` di atas definisi struct kami.
ko: 우리의 예시에서는 `Person` 구조체를 저장하고 싶은데, 이는 `Person` 유형에 대해 `Store` 트레이트를 구현함으로써 가능합니다. 이는 단순히 우리의 구조체 정의 맨 위에 `#[derive(starknet::Store)]` 속성을 추가함으로써 달성할 수 있습니다.
zh_cn: 在我们的例子中，我们想将 `Person` 结构存储在存储中，这可以通过为 `Person` 类型实现 `Store` 特性来实现。这可以通过在结构体定义顶部简单添加 `#[derive(starknet::Store)]` 属性来实现。

source: Similarly, Enums can be written to storage if they implement the `Store` trait, which can be trivially derived as long as all associated types implement the `Store` trait.
ko: 비슷하게, Enums는 `Store` 트레이트를 구현한다면 저장소에 작성될 수 있으며, 모든 관련된 타입이 `Store` 트레이트를 구현한다면 쉽게 파생될 수 있습니다.
zh_cn: 类似地，枚举也可以在实现 `Store` trait的情况下写入存储，只要所有关联类型也实现 `Store` trait，就可以简单地推导它。

source: Structs storage layout
ko: 구조체 저장 레이아웃

source: On Starknet, structs are stored in storage as a sequence of primitive types. The elements of the struct are stored in the same order as they are defined in the struct definition. The first element of the struct is stored at the base address of the struct, which is computed as specified in [Storage Addresses](#storage-addresses) and can be obtained by calling `var.address()`, and subsequent elements are stored at addresses contiguous to the first element. For example, the storage layout for the `owner` variable of type `Person` will result in the following layout:
id: Pada Starknet, struktur disimpan di penyimpanan sebagai urutan tipe primitif. Elemen-elemen struktur disimpan dalam urutan yang sama dengan yang didefinisikan dalam definisi struct. Elemen pertama dari struct disimpan di alamat dasar struct, yang dihitung seperti yang dijelaskan dalam [Alamat Penyimpanan](#storage-addresses) dan dapat diperoleh dengan memanggil `var.address()`, dan elemen-elemen berikutnya disimpan di alamat yang berdekatan dengan elemen pertama. Sebagai contoh, tata letak penyimpanan untuk variabel `owner` bertipe `Person` akan menghasilkan tata letak berikut:
ko: Starknet에서는 구조체가 기본 유형의 시퀀스로 저장됩니다. 구조체의 요소는 구조체 정의에서 정의된 순서대로 저장됩니다. 구조체의 첫 번째 요소는 구조체의 기본 주소에 저장되며, 이는 [저장 주소](#storage-addresses)에서 지정된대로 계산되어 `var.address()`를 호출하여 얻을 수 있습니다. 그 후의 요소들은 첫 번째 요소와 연속된 주소에 저장됩니다. 예를 들어, `Person` 유형의 `owner` 변수에 대한 저장 레이아웃은 다음과 같습니다:

source: Fields
ko: 분야

source: Address
ko: 주소

source: name
ko: 이름

source: address
ko: 주소

source: owner.address() +1
ko: 주인.주소() +1

source: Enums storage layout
ko: 열거형 저장 레이아웃

source: When you store an enum variant, what you're essentially storing is the variant's index and an eventual associated values. This index starts at 0 for the first variant of your enum and increments by 1 for each subsequent variant. If your variant has an associated value, it's stored starting from the address immediately following the base address. For example, suppose we have the `RegistrationType` enum with the `finite` variant, which carries an associated limit date. The storage layout would look like this:
ko: enum 변수를 저장할 때, 본질적으로 저장하는 것은 변수의 인덱스와 연관된 값입니다. 이 인덱스는 enum의 첫 번째 변수에 대해 0부터 시작하여 각 후속 변수마다 1씩 증가합니다. 변수에 연관된 값이 있는 경우, 기본 주소 다음 주소부터 저장됩니다. 예를 들어, `RegistrationType` enum에 `finite` 변수가 있는 경우, 연관된 유효 날짜를 가지고 있습니다. 저장 레이아웃은 다음과 같이 보일 것입니다:

source: Element
ko: 원소

source: Variant index (e.g. 1 for finite)
ko: 변형 지수 (예: 유한한 경우 1)

source: Associated limit date
ko: 연관한 제한 일자

source: registration_type.address() + 1
ko: registration_type.address() + 1 등록 유형.주소() + 1

source: Storage mappings
ko: 저장소 매핑
