Repository: cairo-book/cairo-book
Catalog: po/*.po
Languages: es, id, ko, zh_cn

source: Naming hardcoded values used throughout your program as constants is useful in conveying the meaning of that value to future maintainers of the code. It also helps to have only one place in your code you would need to change if the hardcoded value needed to be updated in the future.
es: Nombrar los valores codificados en duro utilizados en todo el programa como constantes es útil para transmitir el significado de ese valor a los futuros mantenedores del código. También ayuda a tener solo un lugar en su código donde tendría que cambiar si el valor codificado en duro necesitara ser actualizado en el futuro.
zh_cn: 将遍布于应用程序中的硬编码值声明为常量，能帮助后来的代码维护人员了解值的意图。 如果将来需要修改硬编码值，也只需修改汇此处的硬编码值。

source: ### Shadowing
zh_cn: ### 隐藏

source: Variable shadowing refers to the declaration of a new variable with the same name as a previous variable. Caironautes say that the first variable is _shadowed_ by the second, which means that the second variable is what the compiler will see when you use the name of the variable. In effect, the second variable overshadows the first, taking any uses of the variable name to itself until either it itself is shadowed or the scope ends. We can shadow a variable by using the same variable’s name and repeating the use of the `let` keyword as follows:
es: La sombra de una variable se refiere a la declaración de una nueva variable con el mismo nombre que una variable anterior. Los caironautas dicen que la primera variable está _sombreada_ por la segunda, lo que significa que el compilador verá la segunda variable cuando use el nombre de la variable. En efecto, la segunda variable oculta la primera, tomando cualquier uso del nombre de la variable para sí misma hasta que ella misma sea sombreada o que el ámbito termine. Podemos sombrear una variable usando el mismo nombre de la variable y repitiendo el uso de la palabra clave `let` de la siguiente manera:
zh_cn: 变量隐藏指的是声明一个与之前变量同名的新的变量。 当Caironautes 说第一个变量被第二个变量所 _隐藏_ 时，这意味着当您使用变量的名称时，编译器看到的是第二个变量。 实际上，第二个变量“遮蔽”了第一个变量，此时任何使用该变量名的行为中都会视为是在使用第二个变量， 直到第二个变量自己也被隐藏或第二个变量的作用域结束。 可以用相同变量名称来隐藏一个变量，以及重复使用 `let` 关键字来多次隐藏，如下所示：

source: This program first binds `x` to a value of `5`. Then it creates a new variable `x` by repeating `let x =`, taking the original value and adding `1` so the value of `x` is then `6`. Then, within an inner scope created with the curly brackets, the third `let` statement also shadows `x` and creates a new variable, multiplying the previous value by `2` to give `x` a value of `12`. When that scope is over, the inner shadowing ends and `x` returns to being `6`. When we run this program, it will output the following:
es: Este programa primero asigna un valor de `5` a `x`. Luego crea una nueva variable `x` repitiendo `let x =`, tomando el valor original y sumando `1`, por lo que el valor de `x` es ahora `6`. Luego, dentro de un ámbito interno creado con llaves, la tercera instrucción `let` también sombrea `x` y crea una nueva variable, multiplicando el valor anterior por `2` para darle a `x` un valor de `12`. Cuando ese ámbito termina, la sombra interna termina y `x` vuelve a ser `6`. Al ejecutar este programa, se mostrará lo siguiente:
zh_cn: 这个程序首先将 `x` 绑定到值 `5` 上。接着通过 `let x =` 创建了一个新变量 `x` ，获取初始值并加 `1` ，这样 `x` 的值就变成 `6` 了。然后，在使用花括号创建的内部作用域内，第三个 `let` 语句也隐藏了 `x` 并创建了一个新的变量，将之前的值乘以 `2` ， `x` 得到的值是 `12`。当该作用域结束时，内部 shadowing 的作用域也结束了， `x` 又返回到 `6`。运行这个程序，它会有如下输出：

source: Shadowing is different from marking a variable as `mut` because we’ll get a compile-time error if we accidentally try to reassign to this variable without using the `let` keyword. By using `let`, we can perform a few transformations on a value but have the variable be immutable after those transformations have been completed.
es: El sombreado es diferente de marcar una variable como `mut`, porque obtendremos un error en tiempo de compilación si intentamos reasignar a esta variable sin usar la palabra clave `let`. Al usar `let`, podemos realizar algunas transformaciones en un valor pero hacer que la variable sea inmutable después de que se hayan completado esas transformaciones.
zh_cn: 隐藏与将变量标记为 `mut` 是有区别的。 当不小心尝试对变量重新赋值时，如果没有使用 `let` 关键字，就会导致编译时错误。 通过使用 `let`，我们可以用这个新值进行一些计算，不过计算完之后变量仍然是不可变的。

source: Another distinction between `mut` and shadowing is that when we use the `let` keyword again, we are effectively creating a new variable, which allows us to change the type of the value while reusing the same name. As mentioned before, variable shadowing and mutable variables are equivalent at the lower level. The only difference is that by shadowing a variable, the compiler will not complain if you change its type. For example, say our program performs a type conversion between the `u64` and `felt252` types.
es: Otra distinción entre `mut` y el shadowing es que al usar nuevamente la palabra clave `let`, estamos creando efectivamente una nueva variable, lo que nos permite cambiar el tipo del valor mientras reutilizamos el mismo nombre. Como se mencionó anteriormente, el shadowing de variables y las variables mutables son equivalentes a un nivel más bajo. La única diferencia es que al hacer shadowing de una variable, el compilador no mostrará un error si cambias su tipo. Por ejemplo, supongamos que nuestro programa realiza una conversión de tipo entre los tipos `u64` y `felt252`.
zh_cn: `mut` 与隐藏的另一个区别是，当再次使用 `let` 时，实际上创建了一个新变量，我们可以改变值的类型，并且复用这个名字。 如前所述，变量隐藏和可变量在较低层次上是等同的。 唯一的区别是，通过隐藏变量，即使你改变它的类型。编译器也不会检测到错误 例如，假设我们的程序在`u64` 和 `felt252` 类型之间进行转换。

source: The first `x` variable has a `u64` type while the second `x` variable has a `felt252` type. Shadowing thus spares us from having to come up with different names, such as `x_u64` and `x_felt252`; instead, we can reuse the simpler `x` name. However, if we try to use `mut` for this, as shown here, we’ll get a compile-time error:
es: El primer variable `x` tiene un tipo `u64`, mientras que la segunda variable `x` tiene un tipo `felt252`. Por lo tanto, el shadowing nos ahorra tener que inventar diferentes nombres, como `x_u64` y `x_felt252`; en su lugar, podemos reutilizar el nombre más simple `x`. Sin embargo, si intentamos usar `mut` para esto, como se muestra aquí, obtendremos un error en tiempo de compilación:
zh_cn: 第一个 `x` 变量的类型是 `u64`，而第二个 `x` 变量的类型是 `felt252`。 因此，隐藏使我们不必想出不同的名字，例如 `x_u64` 和 `x_felt252`； 相反，我们可以重新使用更简单的 `x` 名称。然而，如果我们试图使用 `mut` 来实现，我们会得到一个编译时错误，如下所示：

source: Now that we’ve explored how variables work, let’s look at more data types they can have.
es: Ahora que hemos explorado cómo funcionan las variables, veamos otros tipos de datos que pueden tener.
zh_cn: 现在我们已经了解了变量如何工作，让我们看看变量可以被赋予的其他数据类型。

source: ## Data Types
es: ## Tipos de datos
zh_cn: ## 数据类型

source: Every value in Cairo is of a certain _data type_, which tells Cairo what kind of data is being specified so it knows how to work with that data. This section covers two subsets of data types: scalars and compounds.
es: Cada valor en Cairo tiene un cierto _tipo de dato_, lo que le dice a Cairo qué tipo de datos se están especificando para que sepa cómo trabajar con esos datos. Esta sección cubre dos subconjuntos de tipos de datos: escalares y compuestos.
zh_cn: 在 Cairo 中，每一个值都属于某一个数据类型（data type）， 这告诉 Cairo 它被指定为何种数据，以便明确数据处理方式。我们将看到两类数据类型子集：标量（scalar）和复合（compound）。

source: Keep in mind that Cairo is a _statically typed_ language, which means that it must know the types of all variables at compile time. The compiler can usually infer the desired type based on the value and its usage. In cases when many types are possible, we can use a cast method where we specify the desired output type.
es: Tenga en cuenta que Cairo es un lenguaje _de tipado estático_, lo que significa que debe conocer los tipos de todas las variables en tiempo de compilación. El compilador suele inferir el tipo deseado en función del valor y su uso. En casos en que pueden ser posibles varios tipos, podemos utilizar un método de conversión donde especificamos el tipo de salida deseado.
zh_cn: 记住，Cairo 是静态类型（statically typed）语言，也就是说在编译时就必须知道所有变量的类型。根据值及其使用方式，编译器通常可以推断出我们想要用的类型。 在可能存在多种类型的情况下，我们可以使用一种称为“类型转换”的方法，在其中指定所需的输出类型。

source: ### Scalar Types
es: ### Tipos escalares
zh_cn: ### 标量类型

source: A _scalar_ type represents a single value. Cairo has three primary scalar types: felts, integers, and booleans. You may recognize these from other programming languages. Let’s jump into how they work in Cairo.
es: Un tipo _scalar_ representa un único valor. Cairo tiene tres tipos escalares primarios: fieltros, enteros y booleanos. Puede que reconozca de otros lenguajes de programación. Veamos cómo funcionan en Cairo.
zh_cn: 一个 _标量_ （scalar）类型表示一个单一的值。Cairo 有三种主要的标量类型： felts、整数（integers）和布尔值（booleans）。你可能在其他语言中见过它们。 让我们深入了解它们在 Cairo 中是如何工作的。

source: #### Felt Type
es: #### Tipo Felt
zh_cn: #### Felt 类型

source: In Cairo, if you don't specify the type of a variable or argument, its type defaults to a field element, represented by the keyword `felt252`. In the context of Cairo, when we say “a field element” we mean an integer in the range `0 <= x < P`, where `P` is a very large prime number currently equal to `P = 2^{251} + 17 * 2^{192}+1`. When adding, subtracting, or multiplying, if the result falls outside the specified range of the prime number, an overflow occurs, and an appropriate multiple of P is added or subtracted to bring the result back within the range (i.e., the result is computed modulo P).
es: En Cairo, si no especificas el tipo de una variable o argumento, su tipo por defecto es un elemento de campo, representado por la palabra clave `felt252`. En el contexto de Cairo, cuando decimos "un elemento de campo" nos referimos a un entero en el rango `0 <= x < P`, donde `P` es un número primo muy grande actualmente igual a `P = 2^{251} + 17 * 2^{192}+1`. Al sumar, restar o multiplicar, si el resultado queda fuera del rango especificado del número primo, se produce un desbordamiento y se suma o resta un múltiplo apropiado de P para que el resultado vuelva a estar dentro del rango (es decir, el resultado se calcula módulo P).
zh_cn: 在 Cairo 中，如果你没有指定一个变量或参数的类型，它的类型默认为一个字段元素，由关键字 `felt252` 表示。在 Cairo 中，当我们说 "一个字段元素 "时，我们指的是范围为 `0 <= x < P` 的整数、 其中 `P` 是一个非常大的素数，目前为 `P = 2^{251} + 17 * 2^{192}+1`。当加减乘时，如果结果超出了素数的指定范围，就会发生溢出，然后再加上或减去 P 的适当倍数，使结果回到范围内（也就是说，结果是以 P 为模数计算的）。

source: The most important difference between integers and field elements is division: Division of field elements (and therefore division in Cairo) is unlike regular CPUs division, where integer division `x / y` is defined as `[x/y]` where the integer part of the quotient is returned (so you get `7 / 3 = 2`) and it may or may not satisfy the equation `(x / y) * y == x`, depending on the divisibility of `x` by `y`.
es: La diferencia más importante entre los números enteros y los elementos de campo es la división: La división de elementos de campo (y, por tanto, la división en Cairo) es distinta de la división normal de las CPU, en la que la división entera `x / y` se define como `[x/y]` donde se devuelve la parte entera del cociente (por lo que se obtiene `7 / 3 = 2`) y puede o no satisfacer la ecuación `(x / y) * y == x`, dependiendo de la divisibilidad de `x` por `y`.
zh_cn: 整数和字段元素之间最重要的区别是除法：字段元素的除法（以及 Cairo 的除法）与普通 CPU 的除法不同，其中整数除法 `x / y` 被定义为`[x/y]`， 其中商的整数部分被返回（所以你得到`7 / 3 = 2`），它可能满足或不满足方程式 `(x / y) * y == x`，这取决于 `x` 是否能被 `y` 除。

source: In Cairo, the result of `x/y` is defined to always satisfy the equation `(x / y) * y == x`. If y divides x as integers, you will get the expected result in Cairo (for example `6 / 2` will indeed result in `3`). But when y does not divide x, you may get a surprising result: For example, since `2 * ((P+1)/2) = P+1 ≡ 1 mod[P]`, the value of `1 / 2` in Cairo is `(P+1)/2` (and not 0 or 0.5), as it satisfies the above equation.
es: En Cairo, el resultado de `x/y` está definido para satisfacer siempre la ecuación `(x / y) * y == x`. Si `y` divide a `x` entre enteros, obtendrás el resultado esperado en Cairo (por ejemplo `6 / 2` dará como resultado `3`). Pero cuando `y` no divide a `x`, puedes obtener un resultado sorprendente: Por ejemplo, como `2 * ((P+1)/2) = P+1 ≡ 1 mod[P]`, el valor de `1 / 2` en Cairo es `(P+1)/2` (y no 0 ó 0,5), ya que satisface la ecuación anterior.
zh_cn: 在 Cairo，`x/y` 的结果被定义为总是满足方程式 `(x / y) * y == x`。如果 y 作为整数可以整除 x ，你将得到 Cairo 的预期结果（例如�����`6 / 2` 确实会得到`3`）。 但是当 y 不能整除 x 时，你可能会得到一个令人惊讶的结果： 例如，由于 `2 * ((P+1)/2) = P+1 ≡ 1 mod[P]`，在 Cairo 中 `1 / 2` 的值是 `(P+1)/2`（而不是0或0.5），因为它满足上述公式。

source: #### Integer Types
es: #### Tipos enteros
zh_cn: #### 整数类型

source: The felt252 type is a fundamental type that serves as the basis for creating all types in the core library. However, it is highly recommended for programmers to use the integer types instead of the `felt252` type whenever possible, as the `integer` types come with added security features that provide extra protection against potential vulnerabilities in the code, such as overflow checks. By using these integer types, programmers can ensure that their programs are more secure and less susceptible to attacks or other security threats. An _integer_ is a number without a fractional component. This type declaration indicates the number of bits the programmer can use to store the integer. Table 3-1 shows the built-in integer types in Cairo. We can use any of these variants to declare the type of an integer value.
es: El tipo felt252 es un tipo fundamental que sirve como base para la creación de todos los tipos en la librería central. Sin embargo, se recomienda encarecidamente a los programadores que utilicen los tipos enteros en lugar del tipo `felt252` siempre que sea posible, ya que los tipos `integer` vienen con características de seguridad añadidas que proporcionan protección extra contra posibles vulnerabilidades en el código, como comprobaciones de desbordamiento. Utilizando estos tipos de enteros, los programadores pueden asegurarse de que sus programas son más seguros y menos susceptibles a ataques u otras amenazas de seguridad. Un _integer_ es un número sin componente fraccionario. Esta declaración de tipo indica el número de bits que el programador puede utilizar para almacenar el entero. La Tabla 3-1 muestra los tipos enteros incorporados en Cairo. Podemos usar cualquiera de estas variantes para declarar el tipo de un valor entero.
zh_cn: 所谓的felt252 类型是一个基本类型，是创建核心库中所有类型的基础。 然而，我们强烈建议程序员尽可能使用整数类型而不是 `felt252` 类型，因为 `integer` 类型带有额外的安全功能， 对代码中的潜在漏洞提供额外保护，如溢出检查。通过使用这些整数类型，程序员可以确保他们的程序更加安全，不容易受到攻击或其他安全威胁。 一个 _integer_ 是一个没有小数部分的数字。这个类型声明指出了该类型可以用来存储整数的比特位。 表3-1显示了Cairo中内建的整数类型。我们可以使用这些变体中的任何一种来声明一个整数值的类型。

source: <span class="caption">Table 3-1: Integer Types in Cairo</span>
zh_cn: <span class="caption">表格3-1： Cairo 的整数类型</span>

source: | Length | Unsigned | | ------- | -------- | | 8-bit | `u8` | | 16-bit | `u16` | | 32-bit | `u32` | | 64-bit | `u64` | | 128-bit | `u128` | | 256-bit | `u256` | | 32-bit | `usize` |
zh_cn: | 长度 | 无符号 | | ------- | -------- | | 8-bit | `u8` | | 16-bit | `u16` | | 32-bit | `u32` | | 64-bit | `u64` | | 128-bit | `u128` | | 256-bit | `u256` | | 32-bit | `usize` |

source: Each variant has an explicit size. Note that for now, the `usize` type is just an alias for `u32`; however, it might be useful when in the future Cairo can be compiled to MLIR. As variables are unsigned, they can't contain a negative number. This code will cause the program to panic:
es: Cada variante tiene un tamaño explícito. Tenga en cuenta que por ahora, el tipo `usize` es sólo un alias para `u32`; sin embargo, podría ser útil cuando en el futuro Cairo pueda ser compilado a MLIR. Como las variables son sin signo, no pueden contener un número negativo. Este código hará que el programa entre en pánico:
zh_cn: 每个变量都有一个明确的大小。注意，现在，`usize `类型只是 `u32` 的别名；然而，当将来 Cairo 可以被编译为 MLIR 时，它可能会很有用。 由于变量是无符号的，它们不能包含一个负数。这段代码会引起程序出现错误：

source: All integer types previously mentioned fit into a `felt252`, except for `u256` which needs 4 more bits to be stored. Under the hood, `u256` is basically a struct with 2 fields: `u256 {low: u128, high: u128}`
id: Semua jenis bilangan bulat yang disebutkan sebelumnya dapat masuk ke dalam `felt252`, kecuali untuk `u256` yang membutuhkan 4 bit tambahan untuk disimpan. Pada dasarnya, di bawah layar, `u256` adalah sebuah struktur dengan 2 bidang: `u256 {low: u128, high: u128}`
zh_cn: 前面提到的所有整数类型都适合`felt252`，但`u256`除外，它需要存储 4 个以上的位。在内部原理中，`u256`基本上是一个包含 2 个字段的结构体：`u256 {low: u128, high: u128}`

source: You can write integer literals in any of the forms shown in Table 3-2. Note that number literals that can be multiple numeric types allow a type suffix, such as `57_u8`, to designate the type.
es: Puede escribir literales enteros en cualquiera de las formas mostradas en la Tabla 3-2. Observe que los literales numéricos que pueden ser múltiples tipos numéricos permiten un sufijo de tipo como `57_u8`, para designar el tipo.
zh_cn: 你可以用表 3-2 中的任何一种形式编写数字字面值。 请注意可以是多种数字类型的数字字面值允许使用类型后缀， 例如像 `57_u8` 这样指定类型。

source: <span class="caption">Table 3-2: Integer Literals in Cairo</span>
zh_cn: <span class="caption">表3-2：Cairo 的整数类型字面值</span>

source: | Numeric literals | Example | | ---------------- | --------- | | Decimal | `98222` | | Hex | `0xff` | | Octal | `0o04321` | | Binary | `0b01` |
zh_cn: | 数字字面值 | 例子 | | ---------------- | --------- | | Decimal(十进制) | `98222` | | Hex (十六进制) | `0xff` | | Octal (八进制) | `0o04321` | | Binary (二进制) | `0b01` |

source: So how do you know which type of integer to use? Try to estimate the max value your int can have and choose the good size. The primary situation in which you’d use `usize` is when indexing some sort of collection.
es: Entonces, ¿cómo saber qué tipo de entero utilizar? Intenta estimar el valor máximo que puede tener tu int y elige un buen tamaño. La principal situación en la que usarías `usize` es al indexar algún tipo de colección.
zh_cn: 那么，你如何知道要使用哪种类型的整数？试着估计你用的 int 的最大值，然后选择合适的大小。 `usize` 的主要是用在为某种集合做索引时。

source: #### Numeric Operations
es: #### Operaciones numéricas
zh_cn: #### 数值运算

source: Cairo supports the basic mathematical operations you’d expect for all the integer types: addition, subtraction, multiplication, division, and remainder. Integer division truncates toward zero to the nearest integer. The following code shows how you’d use each numeric operation in a `let` statement:
es: Cairo soporta las operaciones matemáticas básicas que esperarías para todos los tipos de enteros: suma, resta, multiplicación y resto (u256 no soporta división y resto todavía). Entero trunca hacia cero al entero más cercano. El siguiente código muestra cómo utilizar cada operación numérica en una sentencia `let`:
zh_cn: Cairo 支持所有整数类型的基本数学运算： 加法、减法、乘法、除法和取余。 整数除法将向最接近0的整数截断。以下代码展示了如何在 `let` 语句中使用它们：

source: Each expression in these statements uses a mathematical operator and evaluates to a single value, which is then bound to a variable.
es: Cada expresión de estas sentencias utiliza un operador matemático y se evalúa a un único valor, que se asigna a una variable.
zh_cn: 这些语句中的每个表达式使用了一个数学运算符并计算出了一个值，然后绑定给一个变量。

source: [Appendix B][appendix_b] contains a list of all operators that Cairo provides.
es: [Apéndice B][appendix_b] contiene una lista de todos los operadores que Cairo proporciona.
zh_cn: [附录 B][appendix_b] 包含了一个Cairo中所有操作符的列表。

source: #### The Boolean Type
es: #### El tipo Booleano
zh_cn: #### 布尔类型

source: As in most other programming languages, a Boolean type in Cairo has two possible values: `true` and `false`. Booleans are one felt252 in size. The Boolean type in Cairo is specified using `bool`. For example:
es: Como en la mayoría de los lenguajes de programación, un tipo booleano en Cairo tiene dos posibles valores: `true` y `false`. Los booleanos tienen un byte de tamaño. El tipo booleano en Cairo se especifica usando `bool`. Por ejemplo:
zh_cn: 正如其他大部分编程语言一样，Cairo 中的布尔类型有两个可能的值：`true` 和 `false`。布尔型的大小为一个 felt252。 布尔类型在 Cairo 中是用 `bool` 来指定的。例如：

source: The main way to use Boolean values is through conditionals, such as an `if` expression. We’ll cover how `if` expressions work in Cairo in the [“Control Flow”][control-flow] section.
es: La principal forma de utilizar valores booleanos es a través de condicionales, como una expresión `if` expresión. Cubriremos cómo funcionan las expresiones `if` en Cairo en la sección. [“Control de flujo”][control-de-flujo]
zh_cn: 使用布尔值的主要方式是通过条件语句，如 `if` 表达式。 我们将在["控制流”][control-flow]部分介绍 `if` 表达式在 Cairo 中的工作原理。

source: #### The Short String Type
es: #### El tipo de Short String
zh_cn: #### 短字符串类型

source: Cairo doesn't have a native type for strings, but you can store characters forming what we call a "short string" inside `felt252`s. A short string has a max length of 31 chars. This is to ensure that it can fit in a single felt (a felt is 252 bits, one ASCII char is 8 bits). Here are some examples of declaring values by putting them between single quotes:
es: Cairo no tiene un tipo nativo para strings, pero puedes almacenar caracteres formando lo que llamamos un "short string" dentro de `felt252`. Una cadena corta tiene una longitud máxima de 31 caracteres. Esto es para asegurar que puede caber en un solo felt (un felt son 252 bits, un char ASCII son 8 bits). He aquí algunos ejemplos de declaración de valores entre comillas simples:
zh_cn: Cairo 没有字符串（String）的原生类型，但你可以在 `felt252` 中存储短字符，形成我们所说的 "短字符串"。一个短字符串的最大长度为 31 个字符。这是为了确保它能装入一个 felt （一个 felt 是252位，一个 ASCII 字符是 8 位）。 可以通过把值放在单引号之间来声明短字符串，下面是一些例子：

source: ### Type casting
es: ### Conversión de Tipos
zh_cn: ### 类型转换

source: In Cairo, you can convert types scalar types from one type to another by using the `try_into` and `into` methods provided by the `TryInto` and `Into` traits, respectively.
es: En Cairo, puedes convertir tipos escalares de un tipo a otro utilizando los métodos `try_into` e `into` proporcionados por los traits `TryInto` e `Into`, respectivamente.
id: Di Cairo, Anda dapat mengonversi jenis tipe skalar dari satu jenis ke jenis lainnya dengan menggunakan metode `try_into` dan `into` yang disediakan oleh trait `TryInto` dan `Into`, masing-masing.
zh_cn: 在 Cairo 中，你可以使用 `TryInto` 和 `Into` 特性提供的 `try_into` 和 `into` 方法在标量类型之间进行显式类型转换。

source: The `try_into` method allows for safe type casting when the target type might not fit the source value. Keep in mind that `try_into` returns an `Option<T>` type, which you'll need to unwrap to access the new value.
es: El método `try_into` permite una conversión de tipos segura cuando el tipo de destino puede no encajar con el valor de origen. Ten en cuenta que `try_into` devuelve un tipo `Option<T>`, que tendrás que desenvolver para acceder al nuevo valor.
zh_cn: `try_into` 方法允许在目标类型可能不适合源值时进行安全的类型转换。请记住，`try_into` 会返回一个 `Option<T>` 类型，你需要解开（unwrap）这个类型来访问新的值。

source: On the other hand, the `into` method can be used for type casting when success is guaranteed, such as when the source type is smaller than the destination type.
es: Por otro lado, el método `into` se puede utilizar para la conversión de tipos cuando el éxito está garantizado, como cuando el tipo de destino es más pequeño que el tipo de origen.
zh_cn: 另一方面，当转换必然成功时，如源类型小于目标类型时，`into` 方法可用于类型转换。

source: To perform the conversion, call `var.into()` or `var.try_into()` on the source value to cast it to another type. The new variable's type must be explicitly defined, as demonstrated in the example below.
es: Para realizar la conversión, llame a `var.into()` o `var.try_into()` sobre el valor fuente para convertirlo a otro tipo. El tipo de la nueva variable debe definirse explícitamente, como se muestra en el siguiente ejemplo.
zh_cn: 为了进行转换，在源值上调用 `var.into()` 或 `var.try_into()` 来将其转换为另一种类型。新变量的类型必须被明确定义，如下面的例子所示。

source: ### The Tuple Type
es: ### El Tipo Tupla
zh_cn: ### 元组类型
