Repository: cairo-book/cairo-book
Catalog: po/*.po
Languages: es, id, ko, zh_cn

source: The `entry` method comes as part of `Felt252DictTrait<T>` with the purpose of creating a new entry given a certain key. Once called, this method takes ownership of the dictionary and returns the entry to update. The method signature is as follows:
id: Metode `entry` disertakan sebagai bagian dari `Felt252DictTrait<T>` dengan tujuan untuk membuat entri baru berdasarkan suatu kunci tertentu. Setelah dipanggil, metode ini mengambil kepemilikan dari kamus dan mengembalikan entri untuk diperbarui. Tanda tangan metodenya adalah sebagai berikut:
ko: `entry` 메서드는 `Felt252DictTrait<T>`의 일부로 제공되며 특정 키를 제공하여 새 항목을 만드는 목적으로 제공됩니다. 한 번 호출되면 이 메서드는 사전의 소유권을 가져가고 업데이트할 항목을 반환합니다. 메서드 서명은 다음과 같습니다:
zh_cn: `entry` 方法作为`Felt252DictTrait<T>` 的一部分，目的是在给定键的情况下创建一个新的条目。一旦被调用，该方法将获得字典的所有权并返回要更新的条目。方法签名如下:

source: The first input parameter takes ownership of the dictionary while the second one is used to create the appropriate entry. It returns a tuple containing a `Felt252DictEntry<T>`, which is the type used by Cairo to represent dictionary entries, and a `T` representing the value held previously. The `nopanic` notation simply indicates that the function is guaranteed to never panic.
ko: 첫 번째 입력 매개변수는 사전의 소유권을 가져가고, 두 번째 매개변수는 적절한 항목을 생성하는 데 사용됩니다. 이 함수는 `Cairo`가 사전 항목을 나타내는 데 사용하는 `Felt252DictEntry<T>` 유형과 이전에 보유한 값을 나타내는 `T`를 포함하는 튜플을 반환합니다. `nopanic` 표기법은 해당 함수가 절대로 패닉하지 않음을 나타냅니다.

source: The next thing to do is to update the entry with the new value. For this, we use the `finalize` method which inserts the entry and returns ownership of the dictionary:
id: Langkah selanjutnya adalah memperbarui entri dengan nilai baru. Untuk ini, kita menggunakan metode `finalize` yang memasukkan entri dan mengembalikan kepemilikan dari kamus:
ko: 다음 할 일은 새 값으로 항목을 업데이트하는 것입니다. 이를 위해 `finalize` 메소드를 사용하여 항목을 삽입하고 사전의 소유권을 반환합니다:
zh_cn: 接下来要做的是用新值更新条目。为此，我们使用`finalize`方法插入条目并返回字典的所有权：

source: This method receives the entry and the new value as parameters, and returns the updated dictionary.
ko: 이 방법은 항목과 새 값이 매개변수로 전달되고, 업데이트된 사전을 반환합니다.

source: Let us see an example using `entry` and `finalize`. Imagine we would like to implement our own version of the `get` method from a dictionary. We should then do the following:
id: Mari kita lihat contoh penggunaan `entry` dan `finalize`. Bayangkan kita ingin mengimplementasikan versi kita sendiri dari metode `get` dari sebuah kamus. Maka kita harus melakukan hal berikut:
ko: 다음은 `entry`와 `finalize`를 사용한 예제를 살펴봅시다. 사전에서 `get` 메서드의 자체 버전을 구현하고 싶다고 가정해 봅시다. 그렇다면 다음을 수행해야 합니다.
zh_cn: 让我们看一个使用`entry`和`finalize`的例子。想象一下，我们想从字典中实现我们自己版本的`get`方法。我们应该这样做：

source: Create the new entry to add using the `entry` method.
ko: `entry` 메소드를 사용하여 추가할 새 항목을 생성하십시오.

source: Insert back the entry where the `new_value` equals the `previous_value`.
id: Masukkan kembali entri di mana `nilai_baru` sama dengan `nilai_sebelumnya`.
ko: `new_value`가 `previous_value`와 같은 항목을 다시 삽입하십시오.

source: Return the value.
id: Kembalikan value tersebut.
ko: 값을 반환하십시오.

source: Implementing our custom get would look like this:
id: Implementasi custom `get` kita akan terlihat seperti ini:
ko: 우리의 사용자 정의 get을 구현하는 것은 다음과 같이 보일 것입니다:
zh_cn: 实现我们的自定义get将如下所示：

source: // Get the new entry and the previous value held at `key`
ko: `key`에 보관된 새 항목과 이전 값 가져오기

source: // Store the value to return
ko: 반환할 값을 저장합니다.

source: // Update the entry with `prev_value` and get back ownership of the dictionary
ko: // `prev_value`로 항목을 업데이트하고 사전의 소유권을 되찾습니다.

source: // Return the read value
ko: // 읽은 값을 반환합니다

source: The `ref` keyword means that the ownership of the variable will be given back at the end of the function. This concept will be explained in more detail in the [References and Snapshots](ch04-02-references-and-snapshots.md) section.
ko: `ref` 키워드는 변수의 소유권이 함수의 끝에서 다시 돌려받을 것을 의미합니다. 이 개념은 [참조 및 스냅샷](ch04-02-references-and-snapshots.md) 섹션에서 자세히 설명될 것입니다.

source: Implementing the `insert` method would follow a similar workflow, except for inserting a new value when finalizing. If we were to implement it, it would look like the following:
id: Mengimplementasikan metode `insert` akan mengikuti alur kerja yang serupa, kecuali untuk memasukkan nilai baru saat proses finalisasi. Jika kita hendak mengimplementasikannya, akan terlihat seperti berikut:
ko: `insert` 메소드를 구현하는 것은 새로운 값을 삽입할 때를 제외하고는 유사한 작업 흐름을 따를 것입니다. 만약 우리가 이를 구현한다면 다음과 같이 보일 것입니다:
zh_cn: 实现`insert`方法将遵循类似的工作流程，除了在最终确定时插入一个新值。如果我们要实现它，它将看起来像下面这样：

source: // Get the last entry associated with `key` // Notice that if `key` does not exist, `_prev_value` will // be the default value of T.
ko: // `key`와 관련된 마지막 항목을 가져옵니다. // `key`가 존재하지 않는 경우, `_prev_value`는 // T의 기본값이 됩니다.

source: // Insert `entry` back in the dictionary with the updated value, // and receive ownership of the dictionary
ko: // `entry`를 업데이트된 값과 함께 다시 사전에 삽입하고, // 사전의 소유권을 받습니다

source: As a finalizing note, these two methods are implemented in a similar way to how `insert` and `get` are implemented for `Felt252Dict<T>`. This code shows some example usage:
id: Sebagai catatan penyelesaian, kedua metode ini diimplementasikan dengan cara yang mirip dengan bagaimana `insert` dan `get` diimplementasikan untuk `Felt252Dict<T>`. Kode ini menunjukkan contoh penggunaannya:
ko: 마무리로, 이 두 가지 방법은 `Felt252Dict<T>`에 대해 `insert`와 `get`가 구현된 방식과 유사하게 구현됩니다. 이 코드는 몇 가지 사용 예시를 보여줍니다:
zh_cn: 最后要说明的是，这两个方法的实现方式类似于`Felt252Dict<T>`的`insert`和`get`的实现方式。这段代码展示了一些使用示例：

source: // Get the last entry associated with `key`
ko: `key`와 관련된 마지막 항목을 가져옵니다.

source: // Notice that if `key` does not exist, `_prev_value` will
ko: // `key`가 존재하지 않는 경우, `_prev_value`가 됩니다.

source: // be the default value of T.
ko: T의 기본값이 되십시오.

source: // Insert `entry` back in the dictionary with the updated value,
ko: 사전에 업데이트된 값으로 'entry'를 다시 삽입하세요.

source: // and receive ownership of the dictionary
ko: // 그리고 사전의 소유권을 받으십시오

source: "Expecting 100"
ko: "100을 기대하고 있습니다"

source: Dictionaries of types not supported natively
id: Dictionaries dari jenis yang tidak didukung secara native
ko: 네이티브로 지원되지 않는 유형의 사전

source: One restriction of `Felt252Dict<T>` that we haven't talked about is the trait `Felt252DictValue<T>`. This trait defines the `zero_default` method which is the one that gets called when a value does not exist in the dictionary. This is implemented by some common data types, such as most unsigned integers, `bool` and `felt252` - but it is not implemented for more complex ones types such as arrays, structs (including `u256`), and other types from the core library. This means that making a dictionary of types not natively supported is not a straightforward task, because you would need to write a couple of trait implementations in order to make the data type a valid dictionary value type. To compensate this, you can wrap your type inside a `Nullable<T>`.
id: Salah satu batasan dari `Felt252Dict<T>` yang belum kita bahas adalah trait `Felt252DictValue<T>`. Trait ini mendefinisikan metode `zero_default` yang dipanggil saat suatu nilai tidak ada dalam kamus. Ini diimplementasikan oleh beberapa jenis data umum, seperti sebagian besar bilangan bulat tidak bertanda, `bool`, dan `felt252` - tetapi tidak diimplementasikan untuk jenis yang lebih kompleks seperti array, struktur (termasuk `u256`), dan jenis lain dari pustaka inti. Ini berarti membuat kamus dari jenis yang tidak didukung secara native bukanlah tugas yang mudah, karena Anda perlu menulis beberapa implementasi trait untuk membuat tipe data menjadi tipe nilai kamus yang valid. Untuk mengompensasi hal ini, Anda dapat melingkupi tipe Anda di dalam `Nullable<T>`.
ko: `Felt252Dict<T>`의 한 제한 사항은 우리가 이야기하지 않은 `Felt252DictValue<T>` 트레이트입니다. 이 트레이트는 딕셔너리에 값이 없을 때 호출되는 `zero_default` 메서드를 정의합니다. 이는 대부분의 부호 없는 정수, `bool` 및 `felt252`와 같은 일부 일반 데이터 유형에서 구현되지만 배열, 구조체(포함된 `u256`), 및 코어 라이브러리의 다른 유형과 같은 더 복잡한 유형에 대해서는 구현되지 않습니다. 이는 네이티브로 지원되지 않는 유형의 딕셔너리를 만드는 것이 간단한 작업이 아니라는 것을 의미합니다. 왜냐하면 데이터 유형을 유효한 딕셔너리 값 유형으로 만들기 위해 몇 가지 트레이트 구현을 작성해야하기 때문입니다. 이를 보상하기 위해 유형을 `Nullable<T>`로 래핑할 수 있습니다.

source: `Nullable<T>` is a smart pointer type that can either point to a value or be `null` in the absence of value. It is usually used in Object Oriented Programming Languages when a reference doesn't point anywhere. The difference with `Option` is that the wrapped value is stored inside a `Box<T>` data type. The `Box<T>` type, inspired by Rust, allows us to allocate a new memory segment for our type, and access this segment using a pointer that can only be manipulated in one place at a time.
id: `Nullable<T>` adalah tipe pointer cerdas yang dapat menunjuk ke sebuah nilai atau menjadi `null` ketika tidak ada nilai. Ini biasanya digunakan dalam Bahasa Pemrograman Berorientasi Objek ketika suatu referensi tidak menunjuk ke mana-mana. Perbedaannya dengan `Option` adalah bahwa nilai yang dibungkus disimpan di dalam tipe data `Box<T>`. Tipe `Box<T>`, yang terinspirasi dari Rust, memungkinkan kita untuk mengalokasikan segmen memori baru untuk tipe kita, dan mengakses segmen ini menggunakan pointer yang hanya dapat dimanipulasi di satu tempat pada satu waktu.
ko: `Nullable<T>`은 값에 대한 포인터가 될 수도 있고 값이 없을 때는 `null`이 될 수 있는 스마트 포인터 유형입니다. 객체 지향 프로그래밍 언어에서 참조가 어디를 가리키지 않을 때 주로 사용됩니다. `Option`과의 차이점은 래핑된 값이 `Box<T>` 데이터 유형 내에 저장된다는 것입니다. 러스트에서 영감을 받은 `Box<T>` 유형은 우리의 유형을 위한 새로운 메모리 세그먼트를 할당하고, 이 세그먼트에 대한 포인터를 사용하여 한 번에 한 곳에서만 조작할 수 있도록 합니다.
zh_cn: `Nullable<T>` 是一种智能指针类型，既可以指向一个值，也可以在没有值的情况下为 `null`。当引用不指向任何地方时，它通常用于面向对象编程语言。与 `Option` 不同的是，封装的值存储在 `Box<T>` 数据类型中。受 Rust 的启发，`Box<T>` 类型允许我们为我们的类型分配一个新的内存段，并使用一个指针访问该内存段，该指针一次只能在一个地方操作。

source: Let's show using an example. We will try to store a `Span<felt252>` inside a dictionary. For that, we will use `Nullable<T>` and `Box<T>`. Also, we are storing a `Span<T>` and not an `Array<T>` because the latter does not implement the `Copy<T>` trait which is required for reading from a dictionary.
id: Mari kita tunjukkan dengan contoh. Kita akan mencoba menyimpan sebuah `Span<felt252>` di dalam sebuah kamus. Untuk itu, kita akan menggunakan `Nullable<T>` dan `Box<T>`. Selain itu, kita menyimpan sebuah `Span<T>` dan bukan sebuah `Array<T>` karena yang terakhir tidak mengimplementasikan trait `Copy<T>` yang diperlukan untuk membaca dari sebuah kamus.
ko: 예를 통해 보여드립시다. 우리는 사전 안에 `Span<felt252>`를 저장하려고 시도할 것입니다. 이를 위해 `Nullable<T>`와 `Box<T>`를 사용할 것입니다. 또한, 우리는 `Array<T>`가 아닌 `Span<T>`를 저장하고 있습니다. 왜냐하면 후자는 사전에서 읽기 위해 필요한 `Copy<T>` 특성을 구현하지 않기 때문입니다.
zh_cn: 让我们来举例说明。我们将尝试在字典中存储一个`Span<felt252>`。为此，我们将使用 `Nullable<T>` 和 `Box<T>`。另外，我们要存储的是一个 `Span<T>` 而不是一个 `Array<T>` ，因为后者没有实现 `Copy<T>` 特性，而从字典中读取数据是需要这个特性的。

source: // Create the dictionary
ko: // 사전을 생성합니다

source: // Create the array to insert
ko: // 삽입할 배열을 생성합니다

source: // Insert it as a `Span`
ko: // `Span`으로 삽입하세요

source: In this code snippet, the first thing we did was to create a new dictionary `d`. We want it to hold a `Nullable<Span>`. After that, we created an array and filled it with values.
id: Dalam potongan kode ini, yang pertama kita lakukan adalah membuat kamus baru `d`. Kita ingin kamus ini menampung `Nullable<Span>`. Setelah itu, kita membuat sebuah array dan mengisinya dengan nilai-nilai.
ko: 이 코드 스니펫에서 우리가 먼저 한 일은 새로운 딕셔너리 `d`를 만드는 것이었습니다. `Nullable<Span>`을 보유하길 원합니다. 그 후에 우리는 배열을 만들고 값으로 채웠습니다.
zh_cn: 在这段代码中，我们首先创建了一个新的字典`d`。我们希望它保存一个`Nullable<Span>`。然后，我们创建了一个数组，并在其中填入值。

source: The last step is inserting the array as a span inside the dictionary. Notice that we didn't do that directly, but instead, we took some steps in between:
id: Langkah terakhir adalah memasukkan array sebagai sebuah span ke dalam kamus. Perhatikan bahwa kita tidak melakukannya secara langsung, melainkan kita melakukan beberapa langkah di antaranya:
ko: 마지막 단계는 배열을 사전 안에 span으로 삽입하는 것입니다. 직접 그렇게 하지 않고 중간 단계를 거쳤음을 주의하세요.
zh_cn: 最后一步是在字典中插入数组。请注意，我们并没有直接这样做，而是在中间采取了一些步骤：

source: We wrapped the array inside a `Box` using the `new` method from `BoxTrait`.
id: Kita melingkupi array di dalam `Box` menggunakan metode `new` dari `BoxTrait`.
ko: 우리는 `BoxTrait`에서 `new` 메서드를 사용하여 `Box` 안에 배열을 감쌌습니다.

source: We wrapped the `Box` inside a nullable using the `nullable_from_box` function.
id: Kita melingkupi `Box` di dalam nullable menggunakan fungsi `nullable_from_box`.
ko: 우리는 `nullable_from_box` 함수를 사용하여 `Box`를 nullable로 감쌌습니다.

source: Finally, we inserted the result.
id: Terakhir, kita memasukkan hasilnya.
ko: 마침내, 우리는 결과를 삽입했습니다.

source: Once the element is inside the dictionary, and we want to get it, we follow the same steps but in reverse order. The following code shows how to achieve that:
id: Setelah elemen berada di dalam kamus, dan kita ingin mengambilnya, kita mengikuti langkah yang sama namun dalam urutan terbalik. Berikut adalah contoh kode untuk mencapainya:
ko: 요소가 사전 안에 들어가면, 우리는 그것을 얻고 싶을 때, 같은 단계를 역순으로 따릅니다. 다음 코드는 그것을 얻는 방법을 보여줍니다:
zh_cn: 一旦元素存在字典中，并且我们想获取它，我们将遵循相同的步骤，但顺序相反。下面的代码展示了如何实现这一点：

source: // Get value back
ko: 값을 다시 가져오기

source: // Search the value and assert it is not null
ko: // 값을 검색하고 null이 아님을 단언합니다.

source: "No value found"
ko: "값을 찾을 수 없음"

source: // Verify we are having the right values
ko: // 올바른 값을 가지고 있는지 확인합니다

source: "Expecting 8"
ko: "8를 기대하고 있습니다"

source: "Expecting 9"
ko: "9를 기대하고 있습니다"

source: "Expecting 10"
ko: "10을 기대하고 있습니다"

source: Here we:
ko: 여기 우리:
zh_cn: 我们在这里：

source: Read the value using `get`.
id: Baca nilai menggunakan `get`.
ko: `get`를 사용하여 값 읽기.

source: Verified it is non-null using the `match_nullable` function.
id: Verifikasi bahwa nilai tersebut tidak null menggunakan fungsi `match_nullable`.
ko: `match_nullable` 함수를 사용하여 비-널임을 확인했습니다.

source: Unwrapped the value inside the box and asserted it was correct.
id: Membuka nilai _wrapped_ di dalam kotak dan memastikan bahwa itu benar.
ko: 상자 안의 가치를 풀어보고 올바르다고 주장했다.

source: The complete script would look like this:
id: Skrip lengkap akan terlihat seperti ini:
ko: 전체 스크립트는 다음과 같을 것입니다:
zh_cn: 完整的脚本如下：

source: When you first start programming in Cairo, you'll likely want to use arrays (`Array<T>`) to store collections of data. However, you will quickly realize that arrays have one big limitation - the data stored in them is immutable. Once you append a value to an array, you can't modify it.
id: Ketika Anda pertama kali mulai memprogram di Cairo, Anda kemungkinan besar ingin menggunakan array (`Array<T>`) untuk menyimpan kumpulan data. Namun, Anda akan segera menyadari bahwa array memiliki satu keterbatasan besar - data yang disimpan di dalamnya bersifat tidak dapat diubah. Setelah Anda menambahkan nilai ke dalam array, Anda tidak dapat memodifikasinya.
ko: 카이로에서 프로그래밍을 처음 시작할 때, 데이터 컬렉션을 저장하기 위해 배열(`Array<T>`)을 사용하고 싶어할 것입니다. 그러나 배열에는 한 가지 큰 제한이 있다는 것을 빨리 깨닫게 될 것입니다 - 배열에 저장된 데이터는 불변입니다. 배열에 값을 추가한 후에는 수정할 수 없습니다.

source: This can be frustrating when you want to use a mutable data structure. For example, say you're making a game where the players have a level, and they can level up. You might try to store the level of the players in an array:
id: Ini dapat menjadi frustrasi ketika Anda ingin menggunakan struktur data yang dapat diubah. Sebagai contoh, katakanlah Anda membuat sebuah game di mana para pemain memiliki level, dan mereka dapat naik level. Anda mungkin mencoba menyimpan level para pemain dalam sebuah array:
ko: 이것은 가변 데이터 구조를 사용하고 싶을 때 짜증날 수 있습니다. 예를 들어, 플레이어가 레벨을 가지고 있고 레벨을 올릴 수 있는 게임을 만들고 있다고 가정해보세요. 플레이어들의 레벨을 배열에 저장해보려고 할 수 있습니다.

source: But then you realize you can't increase the level at a specific index once it's set. If a player dies, you cannot remove it from the array unless he happens to be in the first position.
id: Tetapi kemudian Anda menyadari bahwa Anda tidak dapat meningkatkan level di indeks tertentu setelah diatur. Jika seorang pemain mati, Anda tidak dapat menghapusnya dari array kecuali jika dia kebetulan berada di posisi pertama.
ko: 하지만 그런 다음에 당신은 특정 인덱스에서 레벨을 증가시킬 수 없다는 것을 깨닫게 됩니다. 플레이어가 죽으면, 그를 배열에서 제거할 수 없습니다. 그는 첫 번째 위치에 있을 때만 가능합니다.

source: Fortunately, Cairo provides a handy built-in [dictionary type](./ch03-02-dictionaries.md) called `Felt252Dict<T>` that allows us to simulate the behavior of mutable data structures. Let's first explore how to create a struct that contains, among others, a `Felt252Dict<T>`.
ko: 다행히도, 카이로는 가변 데이터 구조의 동작을 모방할 수 있게 해주는 `Felt252Dict<T>`라는 편리한 내장 [사전 유형](./ch03-02-dictionaries.md)을 제공합니다. 먼저, `Felt252Dict<T>`를 포함하는 구조체를 만드는 방법을 살펴보겠습니다.

source: Note: Several concepts used in this chapter are presented in later parts of the book. We recommend you to check out the following chapter first: [Structs](ch05-00-using-structs-to-structure-related-data.md), [Methods](./ch05-03-method-syntax.md), [Generic types](./ch08-00-generic-types-and-traits.md), [Traits](./ch08-02-traits-in-cairo.md).
ko: 참고: 이 장에서 사용된 여러 개념은 책의 후반부에 소개됩니다. 먼저 다음 장을 확인하는 것을 권장합니다: [Structs](ch05-00-using-structs-to-structure-related-data.md), [Methods](./ch05-03-method-syntax.md), [Generic types](./ch08-00-generic-types-and-traits.md), [Traits](./ch08-02-traits-in-cairo.md).

source: Dictionaries as Struct Members
id: Kamus sebagai Anggota Struktur
ko: 구조체 멤버로서의 사전

source: Defining dictionaries as struct members is possible in Cairo but correctly interacting with them may not be entirely seamless. Let's try implementing a custom _user database_ that will allow us to add users and query them. We will need to define a struct to represent the new type and a trait to define its functionality:
id: Mendefinisikan kamus sebagai anggota struktur memungkinkan dalam Cairo, tetapi berinteraksi dengan mereka dengan benar mungkin tidak sepenuhnya mulus. Mari mencoba mengimplementasikan _basis data pengguna_ kustom yang akan memungkinkan kita menambahkan pengguna dan mengajukan pertanyaan kepada mereka. Kita akan perlu mendefinisikan sebuah struktur untuk mewakili tipe baru dan sebuah trait untuk menentukan fungsinya:
ko: 카이로에서는 사전을 구조체 멤버로 정의하는 것이 가능하지만, 이를 올바르게 상호 작용하는 것은 완전히 원활하지 않을 수 있습니다. 사용자 데이터베이스를 구현해보겠습니다. 사용자를 추가하고 조회할 수 있는 사용자 데이터베이스를 만들어보겠습니다. 새로운 유형을 나타내는 구조체를 정의하고 그 기능을 정의하기 위해 특성을 정의해야 합니다.
zh_cn: 在Cairo中可将字典定义为结构体成员，但正确地与它们交互可能不是完全无障碍的。让我们尝试实现一个自定义的_user数据库，它将允许我们添加用户并查询他们。我们需要定义一个struct来表示新的类型，并定义一个trait来定义其功能：

source: Our new type `UserDatabase<T>` represents a database of users. It is generic over the balances of the users, giving major flexibility to whoever uses our data type. Its two members are:
id: Tipe baru kita `UserDatabase<T>` mewakili basis data pengguna. Ini bersifat generik terhadap saldo pengguna, memberikan fleksibilitas utama kepada siapa pun yang menggunakan tipe data kita. Dua anggotanya adalah:
ko: 새로운 유형 `UserDatabase<T>`는 사용자 데이터베이스를 나타냅니다. 사용자의 잔액을 제네릭하게 처리하여 데이터 유형을 사용하는 사람에게 주요한 유연성을 제공합니다. 이의 두 멤버는 다음과 같습니다:
zh_cn: 我们的新类型`UserDatabase<T>`表示用户数据库。它用泛型表示用户的余额，给使用我们的数据类型的人提���了很大的灵活性。它的两个成员是：

source: `users_updates`, the number of users updates in the dictionary and
ko: `users_updates`, 사전에서 사용자 업데이트 수와

source: `balances`, a mapping of each user to its balance.
id: `balances`, pemetaan setiap pengguna dengan saldo mereka.
ko: `balances`, 각 사용자의 잔액에 대한 매핑입니다.

source: The database core functionality is defined by `UserDatabaseTrait`. The following methods are defined:
id: Fungsionalitas inti basis data didefinisikan oleh `UserDatabaseTrait`. Metode-metode berikut didefinisikan:
ko: 데이터베이스의 핵심 기능은 `UserDatabaseTrait`에 의해 정의됩니다. 다음 메서드가 정의되어 있습니다:
zh_cn: 数据库核心功能由`UserDatabaseTrait`定义。定义了以下方法：

source: `new` for easily creating new `UserDatabase` types.
id: `new` untuk dengan mudah membuat tipe `UserDatabase` baru.
ko: `new`는 새로운 `UserDatabase` 유형을 쉽게 생성하는 데 사용됩니다.

source: `update_user` to update the balance of users in the database.
ko: `update_user`는 데이터베이스에서 사용자의 잔액을 업데이트합니다.

source: `get_balance` to find user's balance in the database.
id: `get_balance` untuk menemukan saldo pengguna dalam basis data.
ko: `get_balance`은 데이터베이스에서 사용자의 잔액을 찾는 데 사용됩니다.

source: The only remaining step is to implement each of the methods in `UserDatabaseTrait`, but since we are working with [generic types](/src/ch08-00-generic-types-and-traits.md) we also need to correctly establish the requirements of `T` so it can be a valid `Felt252Dict<T>` value type:
id: Langkah terakhir yang tersisa adalah mengimplementasikan setiap metode dalam `UserDatabaseTrait`, tetapi karena kita sedang bekerja dengan [tipe generik](/src/ch08-00-generic-types-and-traits.md), kita juga perlu menetapkan persyaratan `T` dengan benar agar dapat menjadi tipe nilai `Felt252Dict<T>` yang valid:
ko: `UserDatabaseTrait`의 각 메서드를 구현하는 것이 유일하게 남은 단계입니다. 그러나 [일반 유형](/src/ch08-00-generic-types-and-traits.md)을 사용하고 있기 때문에 `T`의 요구 사항을 올바르게 설정하여 유효한 `Felt252Dict<T>` 값 유형이 될 수 있도록 해야 합니다.
zh_cn: 剩下的步骤就是实现`UserDatabaseTrait`中的每一个方法，但是由于我们使用的是[泛型](/src/ch08-00-generic-types-and-traits.md)，我们还需要正确地建立`T`的要求，这样它才能成为一个有效的`Felt252Dict<T>`值类型：

source: `T` should implement the `Copy<T>` since it's required for getting values from a `Felt252Dict<T>`.
id: `T` harus mengimplementasikan `Copy<T>` karena ini diperlukan untuk mendapatkan nilai dari `Felt252Dict<T>`.
ko: `T`는 `Felt252Dict<T>`에서 값들을 가져오기 위해 필요하기 때문에 `Copy<T>`를 구현해야 합니다.

source: All value types of a dictionary implement the `Felt252DictValue<T>`, our generic type should do as well.
id: Semua tipe nilai dari kamus mengimplementasikan `Felt252DictValue<T>`, tipe generik kita juga seharusnya demikian.
ko: 사전의 모든 값 유형은 `Felt252DictValue<T>`를 구현합니다. 우리의 일반 유형도 그렇게 해야 합니다.

source: To insert values, `Felt252DictTrait<T>` requires all value types to be destructible.
id: Untuk memasukkan nilai, `Felt252DictTrait<T>` mengharuskan semua tipe nilai untuk dapat dihancurkan.
ko: 값을 삽입하려면 `Felt252DictTrait<T>`은 모든 값 유형이 소멸 가능해야 합니다.

source: The implementation, with all restrictions in place, would be as follow:
ko: 구현은 모든 제한 사항이 적용된 상태에서 다음과 같이 이루어질 것입니다.

source: // Creates a database
ko: 데이터베이스를 생성합니다.

source: // Get the user's balance
ko: 사용자의 잔액을 가져옵니다.

source: // Add a user
ko: 사용자 추가

source: Our database implementation is almost complete, except for one thing: the compiler doesn't know how to make a `UserDatabase<T>` go out of scope, since it doesn't implement the `Drop<T>` trait, nor the `Destruct<T>` trait. Since it has a `Felt252Dict<T>` as a member, it cannot be dropped, so we are forced to implement the `Destruct<T>` trait manually (refer to the [Ownership](ch04-01-what-is-ownership.md#the-drop-trait) chapter for more information). Using `#[derive(Destruct)]` on top of the `UserDatabase<T>` definition won't work because of the use of [genericity](/src/ch08-00-generic-types-and-traits.md) in the struct definition. We need to code the `Destruct<T>` trait implementation by ourselves:
id: Implementasi basis data kita hampir selesai, kecuali satu hal: kompiler tidak tahu bagaimana membuat `UserDatabase<T>` keluar dari cakupan, karena itu tidak mengimplementasikan trait `Drop<T>` maupun trait `Destruct<T>`. Karena memiliki `Felt252Dict<T>` sebagai anggota, itu tidak dapat dihapus, jadi kita terpaksa mengimplementasikan trait `Destruct<T>` secara manual (lihat bab [Milik](ch04-01-what-is-ownership.md#the-drop-trait) untuk informasi lebih lanjut). Menggunakan `#[derive(Destruct)]` di atas definisi `UserDatabase<T>` tidak akan berfungsi karena penggunaan [genericity](/src/ch08-00-generic-types-and-traits.md) dalam definisi struktur. Kita perlu mengkodekan implementasi trait `Destruct<T>` sendiri:
ko: 저희 데이터베이스 구현은 거의 완료되었습니다. 하나 빼고요: 컴파일러는 `UserDatabase<T>`가 스코프를 벗어날 때 어떻게 해야 하는지 모르기 때문에 `Drop<T>` 트레이트나 `Destruct<T>` 트레이트를 구현하지 않았습니다. `Felt252Dict<T>`를 멤버로 가지고 있기 때문에 삭제할 수 없습니다. 그래서 우리는 `Destruct<T>` 트레이트를 수동으로 구현해야 합니다 ([소유권](ch04-01-what-is-ownership.md#the-drop-trait) 장을 참조하세요). `UserDatabase<T>` 정의 맨 위에 `#[derive(Destruct)]`를 사용하는 것은 구조체 정의에서 [일반성](/src/ch08-00-generic-types-and-traits.md)을 사용했기 때문에 작동하지 않습니다. 우리는 `Destruct<T>` 트레이트 구현을 직접 코딩해야 합니다:
