Repository: cairo-book/cairo-book
Catalog: po/*.po
Languages: es, id, ko, zh_cn

source: The main reason for using methods instead of functions is for organization and code clarity. We’ve put all the things we can do with an instance of a type in one combination of `trait` & `impl` blocks, rather than making future users of our code search for capabilities of `Rectangle` in various places in the library we provide. However, we can define multiple combinations of `trait` & `impl` blocks for the same type at different places, which can be useful for a more granular code organization. For example, you could implement the `Add` trait for your type in one `impl` block, and the `Sub` trait in another block.
es: La principal razón para utilizar métodos en lugar de funciones es la organización y la claridad del código. Hemos puesto todas las cosas que podemos hacer con una instancia de un tipo en una combinación de bloques `trait` & `impl`, en lugar de hacer que los futuros usuarios de nuestro código busquen las capacidades de `Rectangle` en varios lugares del código. de nuestro código busquen las capacidades de `Rectangle` en varios lugares de la biblioteca que proporcionamos. Sin embargo, podemos definir múltiples combinaciones de bloques `trait` & `impl` para el mismo tipo en diferentes lugares, lo que puede ser útil para una organización más granular del código. Por ejemplo, puedes implementar el rasgo `Add` para tu tipo en un bloque `impl`, y el rasgo `Sub` en otro bloque.
zh_cn: 使用方法而不是函数的主要原因是为了组织和代码的清晰性。我们把所有我们能对一个类型的实例做的操作都放在一组`trait`和`impl`块的组合中，而不是让未来的用户在我们提供的库中的不同地方搜索 `Rectangle`的函数。 然而，我们可以在不同的地方为同一类型定义多个`trait`和`impl`块的组合，这对更细化的代码组织很有用。例如，你可以在一个`impl`块中为你的类型实现 `impl` trait ，在另一个块中实现 `Sub` trait 。

source: Note that we can choose to give a method the same name as one of the struct’s fields. For example, we can define a method on `Rectangle` that is also named `width`:
es: Tenga en cuenta que podemos optar por dar a un método el mismo nombre que uno de los campos de la estructura de la estructura. Por ejemplo, podemos definir un método en `Rectangle` que también se llame ancho`:
zh_cn: 请注意，我们可以选择将方法的名称与结构中的一个字段相同。例如，我们可以在 `Rectangle` 上定义一个方法，并命名为`width`：

source: Here, we’re choosing to make the `width` method return `true` if the value in the instance’s `width` field is greater than `0` and `false` if the value is `0`: we can use a field within a method of the same name for any purpose. In `main`, when we follow `rect1.width` with parentheses, Cairo knows we mean the method `width`. When we don’t use parentheses, Cairo knows we mean the field `width`.
es: Aquí, elegimos hacer que el método `width` devuelva `true` si el valor en el campo `width` de la instancia es mayor que `0` y `false` si el valor es `0`: podemos usar un campo dentro de un método del mismo nombre para cualquier propósito. En `main`, cuando colocamos `rect1.width` entre paréntesis, Cairo sabe que nos referimos al método `width`. Cuando no usamos paréntesis, Cairo sabe que nos referimos al campo `widht`.
zh_cn: 在这里，我们选择让`width`方法在实例的`width`字段中的值大于0时返回`true`，在值为0时返回`false` ：我们可以在同名方法的字段内使用任何目的。在`main`中，当我们在`rect1.width`后面跟着括号时，Cairo知道我们意思是`width`方法。当我们不使用括号时，Cairo知道我们指的是`width`字段。

source: ### Methods with More Parameters
es: ### Métodos con Más Parámetros
zh_cn: ### 带有更多参数的方法

source: Let’s practice using methods by implementing a second method on the `Rectangle` struct. This time we want an instance of `Rectangle` to take another instance of `Rectangle` and return `true` if the second `Rectangle` can fit completely within `self` (the first `Rectangle`); otherwise, it should return `false`. That is, once we’ve defined the `can_hold` method, we want to be able to write the program shown in Listing 5-14.
zh_cn: 让我们通过在`Rectangle`结构体上实现第二个方法来练习使用方法。这次，我们希望让`Rectangle`的实例接收另一个`Rectangle`的实例。如果第二个`Rectangle`可以完全适应`self` （第一个`Rectangle`）就返回 `true` ; 否则，它应该返回`false`。也就是说，一旦我们定义了`can_hold`方法，我们希望能够编写示例5-14中显示的程序。

source: <span class="caption">Listing 5-14: Using the as-yet-unwritten `can_hold` method</span>
zh_cn: <span class="caption">示例5-14：使用尚未编写的`can_hold`方法</span>

source: The expected output would look like the following because both dimensions of `rect2` are smaller than the dimensions of `rect1`, but `rect3` is wider than `rect1`:
es: La salida esperada sería similar a la siguiente porque ambas dimensiones de `rect2` son más pequeñas que las dimensiones de `rect1`, pero `rect3` es más ancha que` rect1`:
zh_cn: 预期的输出结果如下，因为`rect2`的两个尺寸都小于`rect1`的尺寸。 但`rect3`的宽度大于`rect1`：

source: We know we want to define a method, so it will be within the `trait RectangleTrait` and `impl RectangleImpl of RectangleTrait` blocks. The method name will be `can_hold`, and it will take a snapshot of another `Rectangle` as a parameter. We can tell what the type of the parameter will be by looking at the code that calls the method: `rect1.can_hold(@rect2)` passes in `@rect2`, which is a snapshot to `rect2`, an instance of `Rectangle`. This makes sense because we only need to read `rect2` (rather than write, which would mean we’d need a mutable borrow), and we want `main` to retain ownership of `rect2` so we can use it again after calling the `can_hold` method. The return value of `can_hold` will be a Boolean, and the implementation will check whether the width and height of `self` are greater than the width and height of the other `Rectangle`, respectively. Let’s add the new `can_hold` method to the `trait` and `impl` blocks from Listing 5-13, shown in Listing 5-15.
zh_cn: 我们需要定义一个方法，将它放置在在`trait RectangleTrait`和`impl RectangleImpl of RectangleTrait` 块中。该方法名为 `can_hold`，它将接收另一个`Rectangle`的快照作为参数。我们可以通过查看调用该方法的代码来确定参数的类型：`rect1.can_hold(@rect2)`将`@rect2`作为快照传递给`rect2`，它是`Rectangle`的一个实例。这是有意义的，因为我们只需要读取`rect2`（而不是写入，这意味着我们需要一个可变借用），我们希望`main`保留对`rect2`的所有权，以便在调用`can_hold` 方法后再次使用它。`can_hold` 的返回值将是一个布尔值，实现将检查`self`的宽度和高度是否分别大于另一`Rectangle`的宽度和高度。让我们将新的`can_hold`方法添加到示例5-13中的`trait`和`impl` 块中，如示例5-15所示。

source: <span class="caption">Listing 5-15: Implementing the `can_hold` method on `Rectangle` that takes another `Rectangle` instance as a parameter</span>
zh_cn: <span class="caption">示例5-15: 在`Rectangle`上实现`can_hold`方法，该方法接收另一个`Rectangle`实例作为参数</span>

source: When we run this code with the `main` function in Listing 5-14, we’ll get our desired output. Methods can take multiple parameters that we add to the signature after the `self` parameter, and those parameters work just like parameters in functions.
zh_cn: 当我们在示例 5-14中的`main`函数中运行这段代码时，我们将得到我们想要的输出。 方法可以接收多个参数，我们可以在`self`参数之后在函数签名中添加这些参数，这些参数与函数中的参数工作原理相同。

source: ### Accessing implementation functions
es: ### Acceso a las funciones de implementación
zh_cn: ### 访问实现里的函数

source: All functions defined within a `trait` and `impl` block can be directly addressed using the `::` operator on the implementation name. Functions in traits that aren’t methods are often used for constructors that will return a new instance of the struct. These are often called `new`, but `new` isn’t a special name and isn’t built into the language. For example, we could choose to provide an associated function named `square` that would have one dimension parameter and use that as both width and height, thus making it easier to create a square `Rectangle` rather than having to specify the same value twice:
es: Todas las funciones definidas dentro de un bloque `trait` e `impl` se pueden direccionar directamente utilizando el operador `::` en el nombre de la implementación. Las funciones en traits que no son métodos se utilizan a menudo para constructores que devolverán una nueva instancia de la estructura. A menudo se llaman `new`, pero `new` no es un nombre especial y no está incorporado en el lenguaje. Por ejemplo una función asociada llamada `square` que tendría un parámetro de un parámetro de dimensión y utilizarlo como anchura y altura, facilitando así la creación de un cuadrado. un `Rectángulo` cuadrado en lugar de tener que especificar el mismo valor dos veces valor dos veces:
zh_cn: 所有在`trait`和`impl` 块中定义的函数可以直接使用`::` 运算符在实现名称上进行访问。 在`trait`中的不是方法的函数通常用于构造函数，以返回一个结构体的新实例。 这些函数通常被称为`new`，但`new`不是一个特殊的名称，也不是内置到语言中的。 例如，我们可以选择提供一个名为`square` 的关联函数，它将具有一个维度参数， 并将其用作宽度和高度，从而更容易地创建一个正方形`Rectangle`，而不必指定两次相同的值：

source: To call this function, we use the `::` syntax with the implementation name; `let square = RectangleImpl::square(10);` is an example. This function is namespaced by the implementation; the `::` syntax is used for both trait functions and namespaces created by modules. We’ll discuss modules in [Chapter 8][modules]<!-- ignore -->.
zh_cn: 为了调用这个函数，我们在实现的名称后面使用`::`语法； 比如`let square = RectangleImpl::square(10);` 这个例子。这个函数的位于其实现的命名空间中；`::`语法用于关联trait的函数和模块创建的命名空间。 我们将在 [Chapter 8][modules]<！--ignore-->中讲到模块。

source: > Note: It is also possible to call this function using the trait name, with `RectangleTrait::square(10)`.
es: > Nota: También es posible llamar a esta función utilizando el nombre del trait, con `RectangleTrait::square(10)`.
zh_cn: > 注意：也可以用trait名称 `RectangleTrait::square(10)` 来调用这个函数。

source: ### Multiple `impl` Blocks
es: ### Multiples Bloques con `impl`
zh_cn: ### 多个`impl`块

source: Each struct is allowed to have multiple `trait` and `impl` blocks. For example, Listing 5-15 is equivalent to the code shown in Listing 5-16, which has each method in its own `trait` and `impl` blocks.
zh_cn: 每个结构体都可以有多个`trait` 和`impl`块。例如，示例5-15等价于示例5-16中展示的代码，其中每个方法都有自己的`trait` 和`impl`块。

source: <span class="caption">Listing 5-16: Rewriting Listing 5-15 using multiple `impl` blocks</span>
zh_cn: <span class="caption">示例5-16：使用多个`impl`重写示例5-15 块</span>

source: There’s no reason to separate these methods into multiple `trait` and `impl` blocks here, but this is valid syntax. We’ll see a case in which multiple blocks are useful in [Chapter 8](ch08-00-generic-types-and-traits.md), where we discuss generic types and traits.
zh_cn: 这里没有理由把这些方法分成多个`trait`和`impl`块， 但这是有效的语法。我们将在[第7章](ch08-00-generic-types-and-traits.md)中看到一个多块的情况，在那里我们讨论泛型和trait。

source: Structs let you create custom types that are meaningful for your domain. By using structs, you can keep associated pieces of data connected to each other and name each piece to make your code clear. In `trait` and `impl` blocks, you can define methods, which are functions associated to a type and let you specify the behavior that instances of your type have.
es: Las estructuras permiten crear tipos personalizados que son significativos para su dominio. Usando estructuras, puede mantener partes de datos asociadas conectadas entre sí y nombra cada pieza para que tu código quede claro. En los bloques `trait` e `impl`, puedes definir métodos, que son funciones asociadas a un tipo y le permiten especificar el comportamiento que las instancias de su tipo pueden tener.
zh_cn: 结构体让你可以创建出在你的领域中有意义的自定义类型。 通过结构体，我们可以将相关联的数据片段联系起来并命名它们，这样可以使得代码更加清晰。 在`trait`和`impl`块中，你可以定义与你的类型相关联的方法，而方法是一种相关联的函数，让你指定结构体的实例所具有的行为。

source: But structs aren’t the only way you can create custom types: let’s turn to Cairo’s enum feature to add another tool to your toolbox.
es: Pero las estructuras (`struct`) no son la única manera de crear tipos personalizados: pasemos a la función de enumeración (`enum`) de Cairo para agregar otra herramienta.
zh_cn: 但结构体并不是创建自定义类型的唯一方法：让我们转向 Cairo 的枚举功能，为你的工具箱再添一个工具。

source: # Enums and Pattern Matching
es: # Enums y Coincidencia de Patrones
zh_cn: # 枚举和模式匹配

source: In this chapter, we’ll look at *enumerations*, also referred to as *enums*. Enums allow you to define a type by enumerating its possible *variants*. First, we’ll define and use an enum to show how an enum can encode meaning along with data. Next, we’ll explore a particularly useful enum, called `Option`, which expresses that a value can be either something or nothing. Finally, we’ll look at how pattern matching in the `match` expression makes it easy to run different code for different values of an enum.
zh_cn: 在本章中，我们将介绍 *枚举(enumerations)* ，也称为 *enums* 。 枚举允许您通过枚举其可能的 *variants* 来定义类型。 首先我们将定义并使用枚举来展示枚举如何对含义进行编码以及数据。 接下来，我们将探索一个特别有用的枚举，称为`Option`， 它的表示值可以是某物，也可以是虚无。 最后，我们来看看`match`表达式中，如何使用模式匹配， 使得我们可以很容易的通过不同的枚举值运行不同的代码。

source: # Enums
zh_cn: # 枚举

source: ## Enum Variants and Values
es: ## Variantes y Valores de Enum
zh_cn: ## 枚举成员和值

source: ## Enums Combined with Custom Types
es: ## Enums combinados con Tipos Personalizados
zh_cn: ## 枚举与自定义类型相结合

source: - `Quit` doesn't have any associated value. - `Echo` is a single felt. - `Move` is a tuple of two u128 values.
zh_cn: - `Quit` 没有任何相关值。 - `Echo` 是一个单一的 felt。 - `Move`是两个 u128 值组成的的元组。

source: ## Trait Implementations for Enums
es: ## Implementaciones de Traits para Enums
zh_cn: ## 枚举的Trait实现

source: ## The Option Enum and Its Advantages
es: ## El Enum Option y sus Ventajas
zh_cn: ## Option枚举及其优势

source: - Recursive Approach `find_value_recursive` - Iterative Approach `find_value_iterative`
es: - Método recursivo `find_value_recursive` - Método iterativo find_value_iterative
zh_cn: - 递归法 `find_value_recursive` - 迭代法 `find_value_iterative`

source: > Note: in the future it would be nice to replace this example by something simpler using a loop and without gas related code.
es: > Nota: en el futuro sería bueno reemplazar este ejemplo con algo más simple que use un ciclo y sin código relacionado con el gas.
zh_cn: > 注意：将来最好能用循环和无需 gas 的相关代码的简单示例替换此示例。

source: # The Match Control Flow Construct
es: # La Construcción de Control de Flujo Match
zh_cn: # match控制流结构

source: Cairo has an extremely powerful control flow construct called `match` that allows you to compare a value against a series of patterns and then execute code based on which pattern matches. Patterns can be made up of literal values, variable names, wildcards, and many other things. The power of match comes from the expressiveness of the patterns and the fact that the compiler confirms that all possible cases are handled.
es: Cairo tiene una construcción de control de flujo extremadamente poderosa llamada `match` que te permite comparar un valor con una serie de patrones y luego ejecutar código basado en el patrón que coincide. Los patrones pueden estar compuestos por valores literales, nombres de variables, comodines y muchas otras cosas. El poder de `match` proviene de la expresividad de los patrones y del hecho de que el compilador confirma que se manejan todos los casos posibles.
id: Cairo memiliki konstruksi alur kontrol yang sangat kuat yang disebut `match` yang memungkinkan Anda membandingkan nilai terhadap serangkaian pola dan kemudian menjalankan kode berdasarkan pola mana yang cocok. Pola dapat terdiri dari nilai literal, nama variabel, wildcard, dan banyak hal lainnya. Keunggulan dari `match` berasal dari ekspresivitas pola dan fakta bahwa kompiler memastikan bahwa semua kasus mungkin ditangani.
zh_cn: Cairo 有一个叫做 `match` 的极为强大的控制流运算符，它允许我们将一个值与一系列的模式相比较，并根据相匹配的模式执行相应代码。模式可由字面值、变量、通配符和许多其他内容构成；第十八章会涉及到所有不同种类的模式以及它们的作用。`match` 的力量来源于模式的表现力以及编译器检查，它确保了所有可能的情况都得到处理。

source: Think of a match expression as being like a coin-sorting machine: coins slide down a track with variously sized holes along it, and each coin falls through the first hole it encounters that it fits into. In the same way, values go through each pattern in a match, and at the first pattern the value “fits”, the value falls into the associated code block to be used during execution.
es: Piensa en una expresión `match` como una máquina clasificadora de monedas: las monedas se deslizan por una pista con agujeros de diferentes tamaños a lo largo de ella, y cada moneda cae por el primer agujero que encuentra en el que encaja. De la misma manera, los valores pasan por cada patrón en un `match`, y en el primer patrón en el que el valor "encaja", el valor cae en el bloque de código asociado para ser utilizado durante la ejecución.
id: Bayangkan ekspresi match seperti mesin penyortiran koin: koin meluncur turun melalui jalur dengan lubang-lubang berbagai ukuran, dan setiap koin jatuh melalui lubang pertama yang ditemuinya yang sesuai. Dengan cara yang sama, nilai melewati setiap pola dalam match, dan pada pola pertama di mana nilai "cocok", nilai tersebut jatuh ke dalam blok kode yang terkait untuk digunakan selama eksekusi.
zh_cn: 可以把 `match` 表达式想象成某种硬币分类器：硬币滑入有着不同大小孔洞的轨道，每一个硬币都会掉入符合它大小的孔洞。同样地，值也会通过 `match` 的每一个模式，并且在遇到第一个 “符合” 的模式时，值会进入相关联的代码块并在执行中被使用。

source: Speaking of coins, let’s use them as an example using match! We can write a function that takes an unknown US coin and, in a similar way as the counting machine, determines which coin it is and returns its value in cents, as shown in Listing 6-3.
id: Berbicara tentang koin, mari gunakan mereka sebagai contoh dengan menggunakan match! Kita dapat menulis sebuah fungsi yang mengambil sebuah koin AS yang tidak diketahui dan, dengan cara yang mirip dengan mesin penghitung, menentukan jenis koinnya dan mengembalikan nilainya dalam sen, seperti yang ditunjukkan pada Listing 6-3.
zh_cn: 因为刚刚提到了硬币，让我们用它们来作为一个使用 `match` 的例子！我们可以编写一个函数来获取一个未知的硬币，并以一种类似验钞机的方式，确定它是何种硬币，并返回其价值（美分），如示例6-3所示。

source: Listing 6-3: An enum and a match expression that has the variants of the enum as its patterns
id: Listing 6-3: Sebuah enum dan ekspresi match yang memiliki varian-varian enum sebagai polanya
zh_cn: 示例6-3：一个枚举和一个将枚举成员作为其模式的 match 表达式

source: Let’s break down the `match` in the `value_in_cents` function. First we list the `match` keyword followed by an expression, which in this case is the value `coin`. This seems very similar to a conditional expression used with if, but there’s a big difference: with if, the condition needs to evaluate to a Boolean value, but here it can be any type. The type of coin in this example is the `Coin` enum that we defined on the first line.
es: Desglosemos el `match` en la función `value_in_cents`. Primero enumeramos la palabra clave `match` seguida de una expresión, que en este caso es el valor `coin`. Esto parece muy similar a una expresión condicional utilizada con `if`, pero hay una gran diferencia: con `if`, la condición debe evaluarse a un valor booleano, pero aquí puede ser de cualquier tipo. El tipo de moneda en este ejemplo es el enum `Coin` que definimos en la primera línea.
id: Mari kita bahas `match` dalam fungsi `value_in_cents`. Pertama-tama, kita daftarkan kata kunci `match` diikuti oleh suatu ekspresi, yang dalam hal ini adalah nilai `coin`. Ini tampak sangat mirip dengan ekspresi kondisional yang digunakan dengan if, tetapi ada perbedaan besar: dengan if, kondisi harus dievaluasi menjadi nilai Boolean, tetapi di sini itu bisa menjadi tipe apa pun. Tipe dari koin dalam contoh ini adalah enum `Coin` yang kita tentukan pada baris pertama.
zh_cn: 拆开 `value_in_cents` 函数中的 `match` 来看。首先，我们列出 `match` 关键字后跟一个表达式，在这个例子中是 coin 的值。这看起来非常像 `if` 所使用的条件表达式，不过这里有一个非常大的区别：对于 `if`，表达式必须返回一个布尔值，而这里它可以是任何类型的。本例中硬币的类型是我们在第一行定义的 `Coin` 枚举。

source: Next are the `match` arms. An arm has two parts: a pattern and some code. The first arm here has a pattern that is the value `Coin::Penny(_)` and then the `=>` operator that separates the pattern and the code to run. The code in this case is just the value `1`. Each arm is separated from the next with a comma.
es: A continuación, están los brazos del `match`. Un brazo tiene dos partes: un patrón y algún código. El primer brazo aquí tiene un patrón que es el valor `Coin::Penny(_)` y luego el operador `=>` que separa el patrón y el código a ejecutar. El código en este caso es simplemente el valor `1`. Cada brazo está separado del siguiente con una coma.
id: Selanjutnya adalah lengan-lengan `match`. Sebuah lengan memiliki dua bagian: sebuah pola dan beberapa kode. Lengan pertama di sini memiliki pola yang merupakan nilai `Coin::Penny(_)` dan kemudian operator `=>` yang memisahkan pola dan kode yang akan dijalankan. Kode dalam hal ini hanya nilai `1`. Setiap lengan dipisahkan dari yang berikutnya dengan koma.
zh_cn: 接下来是 `match` 分支。一个分支有两个部分：一个模式和一些代码。这里的第一个分支有一个模式，就是值 `Coin::Penny(_)`，然后是`=>`操作符，把模式和要运行的代码分开。本例中的代码只是值 `1`。每个分支都用逗号与下一个分支隔开。

source: When the `match` expression executes, it compares the resultant value against the pattern of each arm, in order. If a pattern matches the value, the code associated with that pattern is executed. If that pattern doesn’t match the value, execution continues to the next arm, much as in a coin-sorting machine. We can have as many arms as we need: in the above example, our match has four arms.
es: Cuando se ejecuta la expresión `match`, compara el valor resultante con el patrón de cada brazo, en orden. Si un patrón coincide con el valor, se ejecuta el código asociado con ese patrón. Si ese patrón no coincide con el valor, la ejecución continúa con el siguiente brazo, como en una máquina clasificadora de monedas. Podemos tener tantos brazos como necesitemos: en el ejemplo anterior, nuestro `match` tiene cuatro brazos.
id: Ketika ekspresi `match` dieksekusi, itu membandingkan nilai hasilnya dengan pola dari setiap lengan, secara berurutan. Jika suatu pola cocok dengan nilai, kode yang terkait dengan pola tersebut dieksekusi. Jika pola tersebut tidak cocok dengan nilai, eksekusi dilanjutkan ke lengan berikutnya, mirip dengan mesin penyortiran koin. Kita dapat memiliki sebanyak yang kita butuhkan: pada contoh di atas, match kita memiliki empat lengan.
zh_cn: 当 `match` 表达式执行时，它将结果值与每个分支的模式进行比较，依次进行。如果一个模式与值匹配，则执行与该模式相关的代码。如果该模式不匹配该值，则继续执行下一个分支，就像验钞机一样。我们可以根据自己的需要有多少个分支：在上面的例子中，我们的匹配有四个分支。

source: In Cairo, the order of the arms must follow the same order as the enum.
es: En Cairo, el orden de los brazos debe seguir el mismo orden que el enum.
id: Dalam Cairo, urutan lengan harus mengikuti urutan yang sama dengan enum.
zh_cn: 在 Cairo，分支的顺序必须遵循与枚举相同的顺序。

source: We don’t typically use curly brackets if the match arm code is short, as it is in our example where each arm just returns a value. If you want to run multiple lines of code in a match arm, you must use curly brackets, with a comma following the arm. For example, the following code prints “Lucky penny!” every time the method is called with a `Coin::Penny`, but still returns the last value of the block, `1`:
id: Biasanya kita tidak menggunakan kurung kurawal jika kode lengan match pendek, seperti pada contoh kita di mana setiap lengan hanya mengembalikan suatu nilai. Jika Anda ingin menjalankan beberapa baris kode dalam lengan match, Anda harus menggunakan kurung kurawal, dengan koma mengikuti lengan. Sebagai contoh, kode berikut mencetak "Lucky penny!" setiap kali metode dipanggil dengan `Coin::Penny`, tetapi tetap mengembalikan nilai terakhir dari blok, `1`:
zh_cn: 如果 match 分支的代码很短，我们通常不使用大括号，就像在我们的示例中一样，每个分支只是返回一个值。如果你想在一个 match 分支中运行多行代码，你必须使用大括号，在 match 分支后面加一个逗号。例如，下面的代码在每次调用 `Coin::Penny` 方法时都会打印出 “Lucky penny!”，但仍然返回区块的最后一个值 `1`：

source: ## Patterns That Bind to Values
es: ## Patrones que se Vinculan con Valores
zh_cn: ## 绑定值的模式

source: Another useful feature of match arms is that they can bind to the parts of the values that match the pattern. This is how we can extract values out of enum variants.
es: Otra característica útil de los brazos de coincidencia es que pueden vincularse con las partes de los valores que coinciden con el patrón. Así es como podemos extraer valores de las variantes de una enum.
id: Fitur lain yang berguna dari lengan match adalah bahwa mereka dapat terikat pada bagian-bagian dari nilai yang cocok dengan pola. Inilah cara kita dapat mengekstrak nilai dari varian enum.
zh_cn: 另一个match分支的有用的特点是它们可以绑定到值中与模式相匹配的部分。这就是如何从枚举成员中提取数值的方法。
