Repository: cairo-book/cairo-book
Catalog: po/*.po
Languages: es, id, ko, zh_cn

source: Here's a sample interface for an ERC20 token contract. As you can see, it's a generic trait over the `TContractState` type. `view` functions have a self parameter of type `@TContractState`, while `external` functions have a self parameter of type passed by reference `ref self: TContractState`.
id: Berikut adalah antarmuka contoh untuk kontrak token ERC20. Seperti yang dapat Anda lihat, ini adalah trait generik atas tipe `TContractState`. Fungsi `view` memiliki parameter `self` bertipe `@TContractState`, sementara fungsi `external` memiliki parameter `self` bertipe yang dilewatkan dengan referensi `ref self: TContractState`.
ko: 다음은 ERC20 토큰 계약을 위한 샘플 인터페이스입니다. 보시다시피, 이는 `TContractState` 유형에 대한 일반적인 특성입니다. `view` 함수는 `@TContractState` 유형의 self 매개변수를 가지고 있으며, `external` 함수는 참조로 전달된 `ref self: TContractState` 유형의 self 매개변수를 가지고 있습니다.
zh_cn: 下面是 ERC20 代币合约的接口示例。正如您所看到的，它是在 `TContractState` 类型上的泛型trait。`view`函数有一个类型为`@TContractState`的自参数，而 `external` 函数有一个类型为 `ref self: TContractState`.的自参数。

source: Listing 99-5: A simple ERC20 Interface
ko: 리스팅 99-5: 간단한 ERC20 인터페이스

source: In the next chapter, we will see how we can call contracts from other smart contracts using _dispatchers_ and _syscalls_ .
id: Pada bab berikutnya, kita akan melihat bagaimana kita dapat memanggil kontrak dari kontrak pintar lain menggunakan _dispatchers_ dan _syscalls_.
ko: 다음 장에서는 _디스패처_ 와 _시스콜_ 을 사용하여 다른 스마트 계약에서 계약을 호출하는 방법을 살펴볼 것입니다.
zh_cn: 在下一章，我们将研究如何使用 合约调度器 ( _dispatchers_ )、和 系统调用( _syscalls_ ) 来调用其他智能合约。

source: Interacting with other contracts and classes using Dispatchers and syscalls
id: Berinteraksi dengan kontrak dan kelas lain menggunakan Pemanggil dan syscalls
ko: 디스패처와 시스콜을 사용하여 다른 계약 및 클래스와 상호 작용하기

source: Each time a contract interface is defined, two dispatchers are automatically created and exported by the compiler. Let's consider an interface that we named IERC20, these would be:
id: Setiap kali sebuah antarmuka kontrak didefinisikan, dua pemanggil secara otomatis dibuat dan diekspor oleh kompiler. Mari pertimbangkan sebuah antarmuka yang kita namai IERC20, ini akan menjadi:
ko: 계약 인터페이스가 정의될 때마다 컴파일러에 의해 자동으로 두 개의 디스패처가 생성되고 내보내집니다. 우리가 IERC20이라고 이름 지은 인터페이스를 고려해 봅시다. 이들은 다음과 같을 것입니다:
zh_cn: 每次定义合约接口时，编译器都会自动创建并导出两个调度程序。我们将一个接口命名为 IERC20，它们是：

source: The Contract Dispatcher `IERC20Dispatcher`
id: Contract Dispatcher `IERC20Dispatcher`
ko: 계약 디스패처 `IERC20Dispatcher`

source: The Library Dispatcher `IERC20LibraryDispatcher`
id: Library Dispatcher `IERC20LibraryDispatcher`
ko: 라이브러리 디스패처 `IERC20LibraryDispatcher`

source: The compiler also generates a trait `IERC20DispatcherTrait`, allowing us to call the functions defined in the interface on the dispatcher struct.
id: Kompiler juga menghasilkan trait `IERC20DispatcherTrait`, memungkinkan kita untuk memanggil fungsi yang didefinisikan dalam antarmuka pada struktur dispatcher.
ko: 컴파일러는 또한 `IERC20DispatcherTrait` 특성을 생성하여 디스패처 구조체에서 인터페이스에 정의된 함수를 호출할 수 있도록 합니다.
zh_cn: 编译器还会生成一个名为 "IERC20DispatcherTrait"的trait，这使得我们可以在调度器结构上调用接口中定义的函数。

source: In this chapter, we are going to discuss what these are, how they work and how to use them.
id: Dalam bab ini, kita akan membahas apa itu, bagaimana cara kerjanya, dan bagaimana menggunakannya.
ko: 이 장에서는 이들이 무엇인지, 어떻게 작동하는지, 그리고 어떻게 사용하는지에 대해 논의할 것입니다.
zh_cn: 在本章中，我们将讨论它们是什么、如何工作以及如何使用。

source: To effectively break down the concepts in this chapter, we are going to be using the IERC20 interface from the previous chapter (refer to Listing 99-5).
ko: 이 장의 개념을 효과적으로 이해하기 위해, 이전 장에서 사용한 IERC20 인터페이스를 사용할 것입니다 (Listing 99-5를 참조하십시오).

source: Contract Dispatcher
ko: 계약 디스패처

source: As mentioned previously, traits annotated with the `#[starknet::interface]` attribute automatically generate a dispatcher and a trait on compilation. Our `IERC20` interface is expanded into something like this:
id: Seperti yang disebutkan sebelumnya, trait yang dianotasi dengan atribut `#[starknet::interface]` secara otomatis menghasilkan pemanggil dan trait saat dikompilasi. Antarmuka `IERC20` kita diperluas menjadi sesuatu seperti ini:
ko: 이전에 언급했듯이, `#[starknet::interface]` 속성으로 주석이 달린 특성은 컴파일 시 자동으로 디스패처와 특성을 생성합니다. 우리의 `IERC20` 인터페이스는 다음과 같이 확장됩니다:

source: **Note:** The expanded code for our IERC20 interface is a lot longer, but to keep this chapter concise and straight to the point, we focused on one view function `name`, and one external function `transfer`.
id: **Catatan:** Kode yang diperluas untuk antarmuka IERC20 kami jauh lebih panjang, tetapi untuk menjaga bab ini ringkas dan langsung ke pokok, kami berfokus pada satu fungsi pandangan `name`, dan satu fungsi eksternal `transfer`.
ko: **참고:** 저희 IERC20 인터페이스의 확장된 코드는 훨씬 더 길지만, 이 장을 간결하고 명료하게 유지하기 위해 한 개의 뷰 함수 `name`과 한 개의 외부 함수 `transfer`에 집중했습니다.
zh_cn: **注：** IERC20 界面的扩展代码较长，但为了使本章简明扼要，我们将重点放在一个视图函数 `name` 和一个外部函数 `transfer`上。

source: // starknet::call_contract_syscall is called in here
ko: // starknet::call_contract_syscall이 여기에서 호출됩니다.

source: Listing 99-6: An expanded form of the IERC20 trait
ko: 리스팅 99-6: IERC20 특성의 확장된 형태

source: As you can see, the "classic" dispatcher is just a struct that wraps a contract address and implements the `DispatcherTrait` generated by the compiler, allowing us to call functions from another contract. This means that we can instantiate a struct with the address of the contract we want to call, and then simply call the functions defined in the interface on the dispatcher struct as if they were methods of that type.
id: Seperti yang dapat Anda lihat, "dispatcher" klasik hanyalah sebuah struktur yang melibatkan alamat kontrak dan mengimplementasikan `DispatcherTrait` yang dihasilkan oleh kompiler, memungkinkan kita untuk memanggil fungsi dari kontrak lain. Ini berarti bahwa kita dapat membuat instansi dari struktur dengan alamat kontrak yang ingin kita panggil, dan kemudian cukup memanggil fungsi yang didefinisikan dalam antarmuka pada struktur dispatcher seolah-olah mereka adalah metode dari tipe tersebut.
ko: 보시다시피, "클래식" 디스패처는 컨트랙트 주소를 감싸고 컴파일러에 의해 생성된 `DispatcherTrait`를 구현하는 구조체일 뿐입니다. 이를 통해 다른 컨트랙트의 함수를 호출할 수 있게 됩니다. 이는 우리가 호출하고자 하는 컨트랙트의 주소로 구조체를 인스턴스화하고, 그런 다음 디스패처 구조체에서 정의된 인터페이스의 함수를 호출할 수 있다는 것을 의미합니다. 마치 해당 유형의 메서드인 것처럼요.
zh_cn: 如你所见，"典型"的调度器只是一个结构体，它封装了一个合约地址，并实现了编译器生成的 `DispatcherTrait`，允许我们调用另一个合约的函数。这意味着我们可以用要调用的合约地址实例化一个结构体，然后简单地调用调度器结构体上的接口定义的函数，就像调用该类型的方法一样。

source: It's also worthy of note that all these are abstracted behind the scenes thanks to the power of Cairo plugins.
es: También es digno de mención que todo esto se abstrae detrás de escena, gracias al poder de los complementos de Cairo.
id: Perlu dicatat bahwa semua ini diabstraksikan di balik layar berkat kekuatan plugin Cairo.
ko: 모든 이러한 것들이 카이로 플러그인의 힘으로 뒷면에 추상화되어 있는 점도 주목할 만하다.
zh_cn: 而且值得注意的是，所有这些都被Cairo插件在幕后抽象化了。

source: Calling Contracts using the Contract Dispatcher
id: Memanggil Kontrak menggunakan Pemanggil Kontrak
ko: 계약 디스패처를 사용하여 계약 호출하기

source: This is an example of a contract named `TokenWrapper` using a dispatcher to call functions defined on an ERC-20 token. Calling `transfer_token` will modify the state of the contract deployed at `contract_address`.
id: Ini adalah contoh kontrak bernama `TokenWrapper` yang menggunakan pemanggil untuk memanggil fungsi yang didefinisikan pada token ERC-20. Memanggil `transfer_token` akan memodifikasi status kontrak yang dideploy di `contract_address`.
ko: 이것은 ERC-20 토큰에서 정의된 함수를 호출하기 위해 디스패처를 사용하는 `TokenWrapper`라는 계약의 예입니다. `transfer_token`을 호출하면 `contract_address`에 배포된 계약의 상태가 변경됩니다.
zh_cn: 这是一个名为 `TokenWrapper` 的合约使用调度器调用定义在 ERC-20 令牌上的函数的示例。调用 `transfer_token` 将修改部署在 `contract_address` 的合约状态。

source: //**** Specify interface here ****//
ko: //**** 여기에 인터페이스 지정 ****//

source: Listing 99-7: A sample contract which uses the Contract Dispatcher
ko: 리스팅 99-7: Contract Dispatcher를 사용하는 샘플 계약서

source: As you can see, we had to first import `IERC20DispatcherTrait` and `IERC20Dispatcher` generated by the compiler, which allows us to make calls to the methods implemented for the `IERC20Dispatcher` struct (`name`, `transfer`, etc), passing in the `contract_address` of the contract we want to call in the `IERC20Dispatcher` struct.
id: Seperti yang dapat Anda lihat, kita harus mengimpor terlebih dahulu `IERC20DispatcherTrait` dan `IERC20Dispatcher` yang dihasilkan oleh kompiler, yang memungkinkan kita untuk melakukan panggilan ke metode-metode yang diimplementasikan untuk struct `IERC20Dispatcher` (`name`, `transfer`, dll.), meneruskan `contract_address` dari kontrak yang ingin kita panggil di dalam struct `IERC20Dispatcher`.
ko: 위에서 볼 수 있듯이, 먼저 컴파일러에 의해 생성된 `IERC20DispatcherTrait` 및 `IERC20Dispatcher`를 가져와야 했습니다. 이를 통해 `IERC20Dispatcher` 구조체에 구현된 메서드를 호출할 수 있게 되며 (`name`, `transfer` 등), `IERC20Dispatcher` 구조체에서 호출하려는 계약의 `contract_address`를 전달할 수 있습니다.
zh_cn: 正如您所看到的，我们必须首先导入编译器生成的 `IERC20DispatcherTrait` 和 `IERC20Dispatcher`，这样我们就可以调用为 `IERC20Dispatcher` 结构实现的方法（`name`、`transfer` 等），并在 `IERC20Dispatcher` 结构中传入我们要调用的合约的 `contract_address` 。

source: Library Dispatcher
ko: 도서관 디스패처

source: The key difference between the contract dispatcher and the library dispatcher lies in the execution context of the logic defined in the class. While regular dispatchers are used to call functions from **contracts** (with an associated state), library dispatchers are used to call **classes** (stateless).
id: Perbedaan kunci antara dispatcher kontrak dan dispatcher pustaka terletak pada konteks eksekusi logika yang didefinisikan di dalam kelas. Sementara dispatcher reguler digunakan untuk memanggil fungsi dari **kontrak** (dengan keadaan yang terkait), dispatcher pustaka digunakan untuk memanggil **kelas** (tanpa keadaan).
ko: 계약 디스패처와 라이브러리 디스패처 사이의 주요 차이점은 클래스에 정의된 로직의 실행 컨텍스트에 있습니다. 일반 디스패처는 **계약**(관련 상태가 있는)에서 함수를 호출하는 데 사용되는 반면, 라이브러리 디스패처는 **클래스**(상태가 없는)를 호출하는 데 사용됩니다.
zh_cn: 合约调度器和库调度器的主要区别在于类中定义的逻辑的执行上下文。普通调度程序用于调用来自 **合约**（有相关状态）的函数，而库调度程序则用于调用 **类**（无状态）。

source: Let's consider two contracts A and B.
id: Mari kita pertimbangkan dua kontrak, A dan B.
ko: A와 B 두 계약을 고려해 봅시다.
zh_cn: 让我们设想两个合约 A 和 B。

source: When A uses `IBDispatcher` to call functions from the **contract** B, the execution context of the logic defined in B is that of B. This means that the value returned by `get_caller_address()` in B will return the address of A, and updating a storage variable in B will update the storage of B.
id: Ketika A menggunakan `IBDispatcher` untuk memanggil fungsi dari **kontrak** B, konteks eksekusi logika yang didefinisikan di B adalah milik B. Ini berarti nilai yang dikembalikan oleh `get_caller_address()` di B akan mengembalikan alamat A, dan memperbarui variabel penyimpanan di B akan memperbarui penyimpanan B.
ko: A가 `IBDispatcher`를 사용하여 **contract** B에서 함수를 호출할 때, B에서 정의된 로직의 실행 컨텍스트는 B의 것입니다. 이는 B의 `get_caller_address()`에서 반환된 값이 A의 주소를 반환하고, B의 스토리지 변수를 업데이트하면 B의 스토리지가 업데이트된다는 것을 의미합니다.
zh_cn: 当A使用 `IBDispatcher` 来调用 **合约** B中的函数时，定义在B中的逻辑的执行上下文是B的。这意味着在B中由`get_caller_address()`返回的值将返回A的地址，并且在B中更新存储变量将更新B的存储。

source: When A uses `IBLibraryDispatcher` to call functions from the **class** of B, the execution context of the logic defined in B's class is that of A. This means that the value returned by `get_caller_address()` variable in B will return the address of the caller of A, and updating a storage variable in B's class will update the storage of A (remember that the **class** of B is stateless; there is no state that can be updated!)
id: Ketika A menggunakan `IBLibraryDispatcher` untuk memanggil fungsi dari **kelas** B, konteks eksekusi logika yang didefinisikan di kelas B adalah milik A. Ini berarti nilai yang dikembalikan oleh variabel `get_caller_address()` di B akan mengembalikan alamat pemanggil A, dan memperbarui variabel penyimpanan di kelas B akan memperbarui penyimpanan A (ingat bahwa **kelas** B adalah stateless; tidak ada keadaan yang dapat diperbarui!)
ko: A가 B의 **class**에서 함수를 호출하기 위해 `IBLibraryDispatcher`를 사용할 때, B의 클래스에 정의된 로직의 실행 컨텍스트는 A의 것입니다. 이는 B의 `get_caller_address()` 변수가 A의 호출자의 주소를 반환하고, B의 클래스의 저장 변수를 업데이트하면 A의 저장소가 업데이트된다는 것을 의미합니다 (B의 **class**가 상태를 가지지 않는다는 것을 기억하세요; 업데이트할 수 있는 상태가 없습니다!)
zh_cn: 当A使用 `IBLibraryDispatcher` 来调用B的 **类** 中的函数时，定义在B类中的逻辑的执行上下文是A的。这意味着在B中由 `get_caller_address()` 变量返回的值将返回A的调用者的地址，并且在B的类中更新存储变量将更新A的存储（请记住，B的类是无状态的；没有可以更新的状态！）

source: The expanded form of the struct and trait generated by the compiler look like:
id: Bentuk yang diperluas dari struct dan trait yang dihasilkan oleh kompiler terlihat seperti:
ko: 컴파일러에 의해 생성된 구조체와 트레이트의 확장된 형태는 다음과 같이 보입니다:
zh_cn: 编译器生成的 struct 和 trait 的扩展形式如下：

source: // starknet::syscalls::library_call_syscall is called in here
ko: 여기에서 starknet::syscalls::library_call_syscall가 호출됩니다.

source: Notice that the main difference between the regular contract dispatcher and the library dispatcher is that the former uses `call_contract_syscall` while the latter uses `library_call_syscall`.
id: Perhatikan bahwa perbedaan utama antara dispatcher kontrak reguler dan dispatcher pustaka adalah bahwa yang pertama menggunakan `call_contract_syscall` sedangkan yang kedua menggunakan `library_call_syscall`.
ko: 정규 계약 디스패처와 라이브러리 디스패처 사이의 주요 차이점은 전자가 `call_contract_syscall`을 사용하는 반면 후자는 `library_call_syscall`을 사용한다는 것에 있습니다.
zh_cn: 请注意，普通合约调度程序与库调度程序的主要区别在于，前者是通过 `call_contract_syscall` 生成的，而后者则使用了 `library_call_syscall`。

source: Listing 99-8: An expanded form of the IERC20 trait
ko: 리스팅 99-8: IERC20 트레이트의 확장된 형태

source: Calling Contracts using the Library Dispatcher
id: Memanggil Kontrak menggunakan Pustaka Dispatcher
ko: 라이브러리 디스패처를 사용하여 계약 호출하기

source: Below's a sample code for calling contracts using the Library Dispatcher.
id: Berikut adalah contoh kode untuk memanggil kontrak menggunakan Pustaka Dispatcher.
ko: 라이브러리 디스패처를 사용하여 계약을 호출하는 샘플 코드가 아래에 있습니다.
zh_cn: 下面是一个关于使用库调度器调用合约的示例代码。

source: Listing 99-9: A sample contract using the Library Dispatcher
ko: 99-9 목록: Library Dispatcher를 사용한 샘플 계약

source: As you can see, we had to first import in our contract the `IContractADispatcherTrait` and `IContractALibraryDispatcher` which were generated from our interface by the compiler. Then, we can create an instance of `IContractALibraryDispatcher` passing in the `class_hash` of the class we want to make library calls to. From there, we can call the functions defined in that class, executing its logic in the context of our contract. When we call `set_value` on ContractA, it will make a library call to the `set_value` function in IContractA, updating the value of the storage variable `value` in ContractA.
ko: 보시다시피, 우리는 컴파일러에 의해 인터페이스에서 생성된 `IContractADispatcherTrait` 및 `IContractALibraryDispatcher`를 먼저 계약에 가져와야 했습니다. 그런 다음, 우리는 `IContractALibraryDispatcher`의 인스턴스를 만들 수 있고, 호출하려는 클래스의 `class_hash`를 전달할 수 있습니다. 그런 다음, 해당 클래스에서 정의된 함수를 호출하여 우리 계약의 컨텍스트에서 해당 로직을 실행할 수 있습니다. ContractA에서 `set_value`를 호출하면, IContractA의 `set_value` 함수에 라이브러리 호출을 수행하여 ContractA의 저장 변수 `value`의 값을 업데이트합니다.

source: Using low-level syscalls
id: Menggunakan low-level syscalls
ko: 낮은 수준의 시스템 호출을 사용하기

source: Another way to call other contracts and classes is to use the `starknet::call_contract_syscall`and `starknet::library_call_syscall` system calls. The dispatchers we described in the previous sections are high-level syntaxes for these low-level system calls.
id: Cara lain untuk memanggil kontrak dan kelas lain adalah dengan menggunakan panggilan sistem `starknet::call_contract_syscall` dan `starknet::library_call_syscall`. Dispacher yang kita deskripsikan pada bagian sebelumnya adalah sintaks tingkat tinggi untuk panggilan sistem tingkat rendah ini.
ko: 다른 계약 및 클래스를 호출하는 또 다른 방법은 `starknet::call_contract_syscall` 및 `starknet::library_call_syscall` 시스템 호출을 사용하는 것입니다. 이전 섹션에서 설명한 디스패처들은 이러한 저수준 시스템 호출을 위한 고수준 구문입니다.
zh_cn: 调用其他合约和类的另一种方法是使用 `starknet::call_contract_syscall` 和 `starknet::library_call_syscall` 系统调用。我们在前几节中描述的调度器就是这些低级系统调用的高级语法。

source: Using these syscalls can be handy for customized error handling or to get more control over the serialization/deserialization of the call data and the returned data. Here's an example demonstrating how to use a `call_contract_sycall` to call the `transfer` function of an ERC20 contract:
id: Menggunakan syscalls ini dapat berguna untuk penanganan kesalahan yang disesuaikan atau untuk mendapatkan lebih banyak kendali atas serialisasi/deserialisasi data panggilan dan data yang dikembalikan. Berikut adalah contoh yang menunjukkan bagaimana menggunakan `call_contract_sycall` untuk memanggil fungsi `transfer` dari kontrak ERC20:
ko: 이 syscalls를 사용하면 사용자 지정 오류 처리에 유용하거나 호출 데이터 및 반환된 데이터의 직렬화/역직렬화에 대한 더 많은 제어를 얻을 수 있습니다. ERC20 계약의 `transfer` 함수를 호출하기 위해 `call_contract_sycall`을 사용하는 방법을 보여주는 예제가 여기 있습니다:
zh_cn: 使用这些系统调用可以方便地进行自定义错误处理，或对调用数据和返回数据的序列化/反序列化进行更多控制。下面的示例演示了如何使用 `call_contract_sycall`调用 ERC20 合约的 `transfer`函数：

source: Listing 99-10: A sample contract using syscalls
ko: 리스팅 99-10: 시스템 호출을 사용한 샘플 계약

source: To use this syscall, we passed in the contract address, the selector of the function we want to call, and the call arguments.
id: Untuk menggunakan syscall ini, kami meneruskan alamat kontrak, pemilih fungsi yang ingin kami panggil, dan argumen panggilan.
ko: 이 시스템 호출을 사용하려면, 우리는 호출하려는 함수의 셀렉터와 호출 인수를 전달했습니다.
zh_cn: 为了使用这个系统调用，我们传入了合约地址、我们想要调用的函数的选择器以及调用参数。

source: The call arguments must be provided as an array of `felt252`. To build this array, we serialize the expected function parameters into an `Array<felt252>` using the `Serde` trait, and then pass this array as calldata. At the end, we are returned a serialized value which we'll need to deserialize ourselves!
id: Argumen panggilan harus disediakan sebagai array `felt252`. Untuk membangun array ini, kita melakukan serialisasi parameter fungsi yang diharapkan menjadi `Array<felt252>` menggunakan trait `Serde`, dan kemudian meneruskan array ini sebagai calldata. Pada akhirnya, kita akan mendapatkan nilai yang diserialisasikan yang perlu kita deserialisasikan sendiri!
ko: 호출 인수는 `felt252` 배열로 제공되어야 합니다. 이 배열을 구성하기 위해, 우리는 예상되는 함수 매개변수를 `Serde` 특성을 사용하여 `Array<felt252>`로 직렬화하고, 이 배열을 calldata로 전달합니다. 마지막으로, 우리는 직렬화된 값을 반환받게 되는데, 이를 직접 역직렬화해야 합니다!
zh_cn: 调用参数必须以`felt252` 数组的形式提供。为了构建这个数组，我们使用 'Serde' trait 将预期的函数参数序列化为一个 `Array<felt252>`，然后将这个数组作为 calldata 传递。最后，我们返回一个序列化值，我们需要自己反序列化该值！

source: This section contains additional examples of Starknet smart contracts, utilizing various features of the Cairo programming language. Your contributions are welcome and encouraged, as we aim to gather as many diverse examples as possible.
id: Bagian ini berisi contoh tambahan kontrak pintar Starknet, memanfaatkan berbagai fitur dari bahasa pemrograman Cairo. Kontribusi Anda sangat diharapkan dan diterima dengan baik, karena kami bertujuan untuk mengumpulkan sebanyak mungkin contoh yang beragam.
ko: 이 섹션에는 카이로 프로그래밍 언어의 다양한 기능을 활용한 Starknet 스마트 계약의 추가 예제가 포함되어 있습니다. 가능한 다양한 예제를 수집하기 위해 여러분의 기여를 환영하며 장려합니다.
zh_cn: 本节包含了Starknet智能合约的其他示例，利用了Cairo编程语言的各种功能。我们欢迎并鼓励大家贡献自己的代码，因为我们的目标是收集尽可能多的不同例子。

source: The **`Vote`** contract in Starknet begins by registering voters through the contract's constructor. Three voters are initialized at this stage, and their addresses are passed to an internal function **`_register_voters`**. This function adds the voters to the contract's state, marking them as registered and eligible to vote.
id: Kontrak **`Vote`** di Starknet dimulai dengan mendaftarkan pemilih melalui konstruktor kontrak. Tiga pemilih diinisialisasi pada tahap ini, dan alamat mereka diteruskan ke fungsi internal **`_register_voters`**. Fungsi ini menambahkan pemilih ke status kontrak, menandai mereka sebagai terdaftar dan memenuhi syarat untuk memberikan suara.
ko: Starknet의 **`Vote`** 계약은 계약의 생성자를 통해 유권자를 등록함으로써 시작됩니다. 이 단계에서 세 명의 유권자가 초기화되고, 그들의 주소가 내부 함수 **`_register_voters`**에 전달됩니다. 이 함수는 유권자를 계약의 상태에 추가하여 등록되었고 투표할 자격이 있는 것으로 표시합니다.
zh_cn: Starknet的 **`Vote`** 合约首先要通过合约的构造函数注册投票人。在此阶段，三个投票人被初始化，他们的地址被传递给内部函数 **`_register_voters`**。该函数将选民添加到合约的状态中，标记为已注册并有资格投票。

source: Within the contract, the constants **`YES`** and **`NO`** are defined to represent the voting options (1 and 0, respectively). These constants facilitate the voting process by standardizing the input values.
id: Dalam kontrak, konstanta **`YES`** dan **`NO`** didefinisikan untuk mewakili opsi pemilihan (1 dan 0, masing-masing). Konstan ini memudahkan proses pemilihan dengan standarisasi nilai masukan.
ko: 계약서 내에서 상수 **`YES`**와 **`NO`**는 투표 옵션을 나타내기 위해 정의되었으며 (각각 1과 0), 이러한 상수는 입력 값을 표준화하여 투표 과정을 용이하게 합니다.
zh_cn: 在合约中，常量 **`YES`** 和 **`NO`** 被定义为表决选项（分别为 1 和 0）。这些常量使输入值标准化，从而方便了投票过程。

source: Once registered, a voter is able to cast a vote using the **`vote`** function, selecting either the 1 (YES) or 0 (NO) as their vote. When voting, the state of the contract is updated, recording the vote and marking the voter as having voted. This ensures that the voter is not able to cast a vote again within the same proposal. The casting of a vote triggers the **`VoteCast`** event, logging the action.
id: Setelah terdaftar, seorang pemilih dapat memberikan suara menggunakan fungsi **`vote`**, memilih 1 (YA) atau 0 (TIDAK) sebagai suaranya. Saat memberikan suara, status kontrak diperbarui, mencatat suara dan menandai pemilih sebagai yang sudah memberikan suara. Hal ini memastikan bahwa pemilih tidak dapat memberikan suara lagi dalam proposal yang sama. Penyelenggaraan suara memicu acara **`VoteCast`**, mencatat tindakan tersebut.
ko: 한 번 등록되면 유권자는 **`vote`** 함수를 사용하여 투표할 수 있으며, 투표로 1 (YES) 또는 0 (NO) 중 하나를 선택합니다. 투표 시 계약의 상태가 업데이트되어 투표가 기록되고, 유권자가 투표했음을 표시합니다. 이로써 유권자는 동일 제안서 내에서 다시 투표할 수 없게 됩니다. 투표가 발생하면 **`VoteCast`** 이벤트가 트리거되어 해당 작업이 로깅됩니다.
zh_cn: 注册完成后，投票者可使用 **`vote`** 函数进行投票，选择 1（YES）或 0（NO）作为其投票。投票时，合约状态会被更新，记录投票情况并标记投票人已投票。这样可以确保投票者无法在同一提案中再次投票。投票会触发 **`VoteCast`** 事件，记录投票行为。

source: The contract also monitors unauthorized voting attempts. If an unauthorized action is detected, such as a non-registered user attempting to vote or a user trying to vote again, the **`UnauthorizedAttempt`** event is emitted.
id: Kontrak ini juga memantau upaya pemilihan yang tidak sah. Jika tindakan tidak sah terdeteksi, seperti pengguna yang tidak terdaftar mencoba memberikan suara atau pengguna yang mencoba memberikan suara lagi, acara **`UnauthorizedAttempt`** akan dipancarkan.
ko: 계약은 무당위 투표 시도도 모니터링합니다. 무당위 행동이 감지되면, 예를 들어 등록되지 않은 사용자가 투표를 시도하거나 사용자가 다시 투표하려고 하는 경우 **`UnauthorizedAttempt`** 이벤트가 발생됩니다.
zh_cn: 该合约还会监控未经授权的投票尝试。如果检测到未经授权的行为，如非注册用户试图投票或用户试图再次投票，就会发出 **`UnauthorizedAttempt`** 事件。

source: Together, these functions, states, constants, and events create a structured voting system, managing the lifecycle of a vote from registration to casting, event logging, and result retrieval within the Starknet environment. Constants like **`YES`** and **`NO`** help streamline the voting process, while events play a vital role in ensuring transparency and traceability.
id: Secara bersama-sama, fungsi-fungsi, status, konstanta, dan acara-acara ini menciptakan sistem pemilihan terstruktur, mengelola siklus hidup suatu pemilihan mulai dari pendaftaran hingga pencoblosan, pencatatan acara, dan pengambilan hasil dalam lingkungan Starknet. Konstan seperti **`YES`** dan **`NO`** membantu menyederhanakan proses pemilihan, sementara acara-acara memainkan peran penting dalam memastikan transparansi dan jejak jejak.
ko: 이러한 기능, 상태, 상수 및 이벤트는 Starknet 환경 내에서 투표 수명주기를 관리하는 구조화된 투표 시스템을 만듭니다. 등록부터 투표, 이벤트 기록 및 결과 검색까지를 처리합니다. **`YES`**와 **`NO`**와 같은 상수는 투표 과정을 간소화하는 데 도움이 되고, 이벤트는 투명성과 추적 가능성을 보장하는 데 중요한 역할을 합니다.
zh_cn: 这些功能、状态、常量和事件共同创建了一个结构化投票系统，在Starknet环境中管理着从注册到投票、事件记录、以及结果检索的投票生命周期。常量（如 **`YES`** 和 **`NO`** ）有助于简化投票流程，而事件则在确保透明度和可追溯性方面发挥着重要作用。

source: /// @dev Core Library Imports for the Traits outside the Starknet Contract
ko: /// @dev Starknet 계약 외부의 Traits를 위한 Core 라이브러리 Imports
