Repository: cairo-book/cairo-book
Catalog: po/*.po
Languages: es, id, ko, zh_cn

source: We saw that recoverable errors can be handled in Cairo using the Result enum, which has two variants: `Ok` and `Err`. The `Result<T, E>` enum is generic, with types `T` and `E` representing the successful and error values, respectively. The `ResultTrait` provides methods for working with `Result<T, E>`, such as unwrapping values, checking if the result is `Ok` or `Err`, and panicking with custom messages.
es: Vimos que los errores recuperables pueden ser manejados en Cairo usando el enum Result, que tiene dos variantes: `Ok` y `Err`. El enum `Result<T, E>` es genérico, con los tipos `T` y `E` representando los valores de éxito y error, respectivamente. El `ResultTrait` proporciona métodos para trabajar con `Result<T, E>`, como desenvolver valores, comprobar si el resultado es `Ok` o `Err`, y asustar con mensajes personalizados.
id: Kita melihat bahwa kesalahan yang dapat dipulihkan dapat diatasi di Cairo menggunakan enum Result, yang memiliki dua varian: `Ok` dan `Err`. Enum `Result<T, E>` bersifat generik, dengan tipe `T` dan `E` mewakili nilai yang berhasil dan nilai kesalahan, masing-masing. Trait `ResultTrait` menyediakan metode untuk bekerja dengan `Result<T, E>`, seperti membuka nilai, memeriksa apakah hasilnya `Ok` atau `Err`, dan menimbulkan panic dengan pesan khusus.
ko: 우리는 카이로에서 Result 열거형을 사용하여 복구 가능한 오류를 처리할 수 있다는 것을 보았습니다. Result 열거형에는 `Ok`와 `Err` 두 가지 변형이 있습니다. `Result<T, E>` 열거형은 제네릭이며, `T`와 `E` 타입은 각각 성공 및 오류 값을 나타냅니다. `ResultTrait`는 `Result<T, E>`와 함께 작업하는 메서드를 제공하며, 값 언래핑, 결과가 `Ok` 또는 `Err`인지 확인, 사용자 정의 메시지로 패닉하는 등의 작업을 수행할 수 있습니다.
zh_cn: 我们看到，可恢复的错误可以在Cairo中使用结果枚举来处理，它有两个变体：`Ok`和`Err`。`Result<T, E>`枚举是通用的，其类型`T`和`E`分别代表成功和错误值。`ResultTrait`提供了处理`Result<T, E>`的方法，例如解包值，检查结果是`Ok`还是`Err`，以及用自定义消息进行panic。

source: To handle recoverable errors, a function can return a `Result` type and use pattern matching to handle the success or failure of an operation. The `?` operator can be used to implicitly handle errors by propagating the error or unwrapping the successful value. This allows for more concise and clear error handling, where the caller is responsible for managing errors raised by the called function.
es: Para gestionar errores recuperables, una función puede devolver un tipo `Result` y utilizar la concordancia de patrones para gestionar el éxito o el fracaso de una operación. El operador `?` puede utilizarse para gestionar errores implícitamente, propagando el error o desenvolviendo el valor correcto. Esto permite una gestión de errores más concisa y clara, en la que el autor de la llamada es responsable de gestionar los errores generados por la función llamada.
id: Untuk menangani kesalahan yang dapat dipulihkan, sebuah fungsi dapat mengembalikan tipe `Result` dan menggunakan pola pencocokan untuk menangani keberhasilan atau kegagalan suatu operasi. Operator `?` dapat digunakan untuk menangani kesalahan secara implisit dengan menyebarkan kesalahan atau membuka nilai yang berhasil. Ini memungkinkan penanganan kesalahan yang lebih ringkas dan jelas, di mana pemanggil bertanggung jawab untuk mengelola kesalahan yang dihasilkan oleh fungsi yang dipanggil.
ko: 복구 가능한 오류를 처리하기 위해 함수는 `Result` 타입을 반환하고 패턴 매칭을 사용하여 작업의 성공 또는 실패를 처리할 수 있습니다. `?` 연산자를 사용하여 오류를 암시적으로 처리하거나 성공적인 값을 언래핑하여 오류를 전파할 수 있습니다. 이를 통해 호출자가 호출된 함수에서 발생한 오류를 관리하는 더 간결하고 명확한 오류 처리가 가능해집니다.
zh_cn: 为了处理可恢复的错误，一个函数可以返回一个`Result`类型，并使用模式匹配来处理操作的成功或失败。`?`操作符可用于通过传播错误或解包成功的值来隐含地处理错误。这使得错误处理更加简洁明了，调用者负责管理由被调用函数引发的错误。

source: Now, let's learn about more advanced features offered by Cairo.
id: Sekarang, mari kita pelajari tentang fitur-fitur lebih lanjut yang ditawarkan oleh Cairo.
ko: 지금, 카이로가 제공하는 더 고급 기능에 대해 배워 봅시다.
zh_cn: 现在，让我们来了解 Cairo 提供的更多高级功能。

source: Operator overloading is a feature in some programming languages that allows the redefinition of standard operators, such as addition (+), subtraction (-), multiplication (\*), and division (/), to work with user-defined types. This can make the syntax of the code more intuitive, by enabling operations on user-defined types to be expressed in the same way as operations on primitive types.
es: La sobrecarga de operadores es una característica de algunos lenguajes de programación que permite redefinir operadores estándar, como la suma (+), la resta (-), la multiplicación (\*) y la división (/), para que funcionen con tipos definidos por el usuario. Esto puede hacer que la sintaxis del código sea más intuitiva, al permitir que las operaciones sobre tipos definidos por el usuario se expresen del mismo modo que las operaciones sobre tipos primitivos.
id: Operator overloading adalah fitur dalam beberapa bahasa pemrograman yang memungkinkan pengulangan definisi operator standar, seperti penambahan (+), pengurangan (-), perkalian (\*), dan pembagian (/), agar dapat berfungsi dengan tipe yang ditentukan pengguna. Hal ini dapat membuat sintaks kode lebih intuitif, dengan memungkinkan operasi pada tipe yang ditentukan pengguna untuk diungkapkan dengan cara yang sama seperti operasi pada tipe primitif.
ko: 연산자 오버로딩은 일부 프로그래밍 언어의 기능으로, 덧셈(+), 뺄셈(-), 곱셈(\*), 나눗셈(/)과 같은 표준 연산자를 재정의하여 사용자 정의 타입과 작동하도록 허용합니다. 이는 코드의 구문을 더 직관적으로 만들어 주어 사용자 정의 타입에 대한 연산을 기본 타입에 대한 연산과 동일한 방식으로 표현할 수 있게 합니다.
zh_cn: 操作符重载是一些编程语言的一个特点，它允许在用户自定义的类型上重新定义标准操作符，如加法（+）、减法（-）、乘法（\*）和除法（/）。这可以使代码的语法更加直观，因为它使对用户字定义类型的操作与对原始类型的操作表达方式相同。

source: In Cairo, operator overloading is achieved through the implementation of specific traits. Each operator has an associated trait, and overloading that operator involves providing an implementation of that trait for a custom type. However, it's essential to use operator overloading judiciously. Misuse can lead to confusion, making the code more difficult to maintain, for example when there is no semantic meaning to the operator being overloaded.
id: Di Cairo, operator overloading dicapai melalui implementasi trait khusus. Setiap operator memiliki trait terkait, dan pengulangan operator melibatkan penyediaan implementasi trait tersebut untuk tipe kustom. Namun, penting untuk menggunakan operator overloading dengan bijak. Penyalahgunaan dapat menyebabkan kebingungan, membuat kode menjadi lebih sulit untuk dikelola, misalnya ketika tidak ada makna semantik pada operator yang di-overload.
ko: 카이로에서 연산자 오버로딩은 특정 특성의 구현을 통해 달성됩니다. 각 연산자에는 연관된 특성이 있으며, 해당 연산자의 오버로딩은 사용자 정의 타입에 대한 해당 특성의 구현을 제공하는 것을 포함합니다. 그러나 연산자 오버로딩을 분별하여 사용하는 것이 중요합니다. 남용은 혼란을 야기할 수 있으며, 연산자 오버로딩에 의미가 없는 경우 코드를 유지하기 어렵게 만들 수 있습니다.

source: Consider an example where two `Potions` need to be combined. `Potions` have two data fields, mana and health. Combining two `Potions` should add their respective fields.
es: Consideremos un ejemplo en el que hay que combinar dos `Potions`. Las `Potions` tienen dos campos de datos, maná y salud. Al combinar dos `Potions` se deben añadir sus respectivos campos.
id: Pertimbangkan contoh di mana dua `Potion` perlu digabungkan. `Potion` memiliki dua bidang data, yaitu mana dan kesehatan. Menggabungkan dua `Potion` seharusnya menambahkan bidang masing-masing.
ko: 두 개의 '물약'을 결합해야 하는 예시를 고려해보세요. '물약'은 마나와 체력 두 가지 데이터 필드를 가지고 있습니다. 두 개의 '물약'을 결합하면 각각의 필드를 더해야 합니다.
zh_cn: 让我看一个例子，两个 `Potions` 需要合并。`Potions` 有两个数据字段，法力(mana)和健康(health)。合并两个`Potions` 应该是让它们各自的两个字段相加。

source: // Both potions were combined with the `+` operator.
ko: 두 물약은 `+` 연산자로 결합되었습니다.

source: In the code above, we're implementing the `Add` trait for the `Potion` type. The add function takes two arguments: `lhs` and `rhs` (left and right-hand side). The function body returns a new `Potion` instance, its field values being a combination of `lhs` and `rhs`.
es: En el código anterior, estamos implementando el rasgo `Add` para el tipo `Potion`. La función add toma dos argumentos: `lhs` y `rhs` (izquierda y derecha). El cuerpo de la función devuelve una nueva instancia de `Poción`, cuyos valores de campo son una combinación de `lhs` y `rhs`.
id: Dalam kode di atas, kami sedang mengimplementasikan trait `Add` untuk tipe `Potion`. Fungsi tambah mengambil dua argumen: `lhs` dan `rhs` (kiri dan kanan). Tubuh fungsi mengembalikan instance `Potion` baru, dengan nilai bidangnya merupakan kombinasi dari `lhs` dan `rhs`.
ko: 위의 코드에서는 `Potion` 유형에 대해 `Add` 트레이트를 구현하고 있습니다. add 함수는 두 개의 인수 `lhs`와 `rhs` (왼쪽 및 오른쪽)를 사용합니다. 함수 본문은 새로운 `Potion` 인스턴스를 반환하며, 그 필드 값은 `lhs`와 `rhs`의 조합입니다.
zh_cn: 在上面的代码中，我们为 `Potion`类型实现`Add`特性。Add函数需要两个参数：`lhs` 和 `rhs`（左手端和右手端，分别表示在运算式的左边还是右边）。函数主体返回一个新的`Potion`实例，其字段值是`lhs`和`rhs`的组合。

source: As illustrated in the example, overloading an operator requires specification of the concrete type being overloaded. The overloaded generic trait is `Add<T>`, and we define a concrete implementation for the type `Potion` with `Add<Potion>`.
es: Como se ilustra en el ejemplo, la sobrecarga de un operador requiere la especificación del tipo concreto que se sobrecarga. El trait genérico sobrecargado es `Add<T>`, y definimos una implementación concreta para el tipo `Potion` con `Add<Potion>`.
id: Seperti yang diilustrasikan dalam contoh tersebut, pengoverloadan operator memerlukan spesifikasi tipe konkret yang di-overload. Trait generik yang di-overload adalah `Add<T>`, dan kami mendefinisikan implementasi konkret untuk tipe `Potion` dengan `Add<Potion>`.
ko: 예시에서 보듯이, 연산자 오버로딩은 오버로딩되는 구체적인 유형을 명시해야 합니다. 오버로딩된 일반적인 특성은 `Add<T>`이며, 우리는 `Potion` 유형에 대한 구체적인 구현을 `Add<Potion>`으로 정의합니다.
zh_cn: 正如例子中所说明的，重载一个操作符需要指定被重载的具体类型。这里被重载用泛型表示的trait是 `Add<Potion>`，所以我们将用 `Add<Potion>`为 ‘Potion`类型定义一个具体的实现。

source: The Cairo language has some plugins that allows developers to simplify their code. They are called `inline_macros` and are a way of writing code that generates other code.
ko: 카이로 언어에는 개발자가 코드를 간소화할 수 있는 몇 가지 플러그인이 있습니다. 이들은 `inline_macros`라고 불리며 다른 코드를 생성하는 방식의 코드 작성 방법입니다.

source: `print!` and `println!` macros
ko: `print!` 및 `println!` 매크로

source: Two macros are available for printing values:
ko: 값을 인쇄하는 두 가지 매크로가 있습니다.

source: `println!` which prints on a new line
ko: `println!`은 새로운 줄에 출력합니다.

source: `print!` with inline printing
ko: 인라인 인쇄와 함께 `print!`

source: Both can be used with curly brackets as placeholders that hold a value in place:
ko: 둘 다 값이 위치를 대신하는 자리 표시자로 중괄호를 사용할 수 있습니다.

source: When printing the value of a variable, the variable name can go inside the curly brackets.
ko: 변수의 값을 출력할 때, 변수 이름은 중괄호 안에 들어갈 수 있습니다.

source: When printing the result of evaluating an expression, use empty curly brackets in the format string, then follow the format string with a comma-separated list of expressions to print in each empty curly bracket placeholder in the same order.
ko: 식을 평가한 결과를 출력할 때, 형식 문자열에 빈 중괄호를 사용한 후 형식 문자열 다음에 쉼표로 구분된 표현식 목록을 빈 중괄호 자리에 동일한 순서로 출력하세요.

source: `consteval_int!` macro
ko: `consteval_int!` 매크로

source: In some situations, a developer might need to declare a constant that is the result of a computation of integers. To compute a constant expression and use its result at compile time, it is required to use the `consteval_int!` macro.
id: Dalam beberapa situasi, seorang pengembang mungkin perlu mendeklarasikan konstanta yang merupakan hasil dari perhitungan bilangan bulat. Untuk menghitung ekspresi konstan dan menggunakan hasilnya pada saat kompilasi, diperlukan untuk menggunakan macro `consteval_int!`.
ko: 일부 상황에서 개발자는 정수의 계산 결과로 상수를 선언해야 할 수도 있습니다. 상수 식을 계산하고 컴파일 시간에 그 결과를 사용하려면 `consteval_int!` 매크로를 사용해야 합니다.
zh_cn: 在某些情况下，开发人员可能需要声明一个常量，该常量是整数计算的结果。为了在编译时计算常量表达式并使用其结果，需要使用`consteval_int!` 宏。

source: Here is an example of `consteval_int!`:
id: Berikut adalah contoh dari `consteval_int!`:
ko: 다음은 `consteval_int!`의 예입니다:
zh_cn: 下面是 `consteval_int!`的示例：

source: This will be interpreted as `const a: felt252 = 8;` by the compiler.
id: Ini akan diinterpretasikan sebagai `const a: felt252 = 8;` oleh kompiler.
ko: 이는 컴파일러에 의해 `const a: felt252 = 8;`로 해석될 것입니다.
zh_cn: 编译器将解释为 `const a: felt252 = 8`

source: Please refer to the [Arrays](./ch03-01-arrays.md) page.
ko: [Arrays](./ch03-01-arrays.md) 페이지를 참조해주세요.

source: `panic!`, `assert!` and `assert_eq!` macros macro
ko: `panic!`, `assert!` 및 `assert_eq!` 매크로입니다.

source: See [Unrecoverable Errors with panic](./ch10-01-unrecoverable-errors-with-panic.md) page.
ko: [패닉과 복구 불가능한 오류](./ch10-01-unrecoverable-errors-with-panic.md) 페이지를 참조하세요.

source: `format!` macro
ko: `format!` 매크로

source: The `format!` macro works like `println!`, but instead of printing the output to the screen, it returns a `ByteArray` with the contents. In the following example, we perform string concatenation using either the `+` operator or the `format!` macro. The version of the code using `format!` is much easier to read, and the code generated by the `format!` macro uses snapshots so that this call doesn’t take ownership of any of its parameters.
ko: `format!` 매크로는 `println!`과 비슷하게 작동하지만 출력을 화면에 표시하는 대신 내용이 담긴 `ByteArray`를 반환합니다. 다음 예제에서는 `+` 연산자나 `format!` 매크로를 사용하여 문자열 연결을 수행합니다. `format!`를 사용한 코드 버전은 훨씬 더 읽기 쉽고, `format!` 매크로에 의해 생성된 코드는 스냅샷을 사용하여 이 호출이 매개변수 중 어느 것도 소유권을 가져가지 않도록 합니다.

source: "toe"
ko: "발가락"

source: // using + operator consumes the strings, so they can't be used again!
ko: // + 연산자를 사용하면 문자열이 소비되어 다시 사용할 수 없습니다!

source: // s1, s2, s3 are not consumed by format! // or
ko: // s1, s2, s3는 format에 의해 사용되지 않습니다! // 또는

source: `write!` macro
ko: `write!` 매크로

source: The `write!` and `writeln!` are two macros which are used to emit the format string to a specified stream. This macro takes 2 arguments:
ko: `write!`와 `writeln!`은 지정된 스트림으로 형식 문자열을 출력하는 데 사용되는 두 개의 매크로입니다. 이 매크로는 2개의 인수를 사용합니다.

source: a Formatter, which is a struct containing a `ByteArray`, representing the pending result of formatting (the _stream_)
ko: `ByteArray`를 포함하는 구조체인 포매터, 이는 포맷팅의 보류 중인 결과를 나타냅니다. ( _스트림_ )

source: the 'ByteArray' to append to the formatter
ko: 포매터에 추가할 'ByteArray'

source: Calling this macro will append the provided `ByteArray` string to the formatter. Example usage is:
ko: 이 매크로를 호출하면 제공된 `ByteArray` 문자열이 포매터에 추가됩니다. 사용 예는 다음과 같습니다:

source: "hello"
ko: 안녕하세요

source: "world"
ko: 세계

source: // helloworld
ko: // 안녕세상

source: Hashes
ko: 해시들

source: At its essence, hashing is a process of converting input data (often called a message) of any length into a fixed-size value, typically referred to as a "hash." This transformation is deterministic, meaning that the same input will always produce the same hash value. Hash functions are a fundamental component in various fields, including data storage, cryptography, and data integrity verification - and are very often when developing smart contracts, especially when working with Merkle trees.
ko: 핵심적으로 해싱은 임의의 길이를 가진 입력 데이터(일반적으로 메시지라고 함)를 고정 크기의 값으로 변환하는 과정입니다. 이 값은 일반적으로 "해시"라고 불립니다. 이 변환은 결정론적이며, 동일한 입력은 항상 동일한 해시 값을 생성합니다. 해시 함수는 데이터 저장, 암호학, 데이터 무결성 검증을 포함한 다양한 분야에서 기본 구성 요소이며, 특히 Merkle 트리와 함께 작업할 때 스마트 계약을 개발할 때 매우 자주 사용됩니다.
zh_cn: 哈希本质上是一个将任意长度的输入数据（通常称为消息）转换为固定大小值的过程，该值通常称为“哈希”。这种转换是确定性的，这意味着相同的输入将始终生成相同的哈希值。哈希函数是各种领域的基石，包括数据存储、密码学和数据完整性验证 - 并且在开发智能合约时经常使用，尤其是在使用 Merkle 树时。

source: In this chapter, we will present the two hash functions implemented natively in the Cairo library : `Poseidon` and `Pedersen`. We will discuss about when and how to use them, and see examples with cairo programs.
ko: 이 장에서는 Cairo 라이브러리에 네이티브로 구현된 두 해시 함수인 `Poseidon`과 `Pedersen`을 소개할 것입니다. 언제 그리고 어떻게 사용하는지에 대해 논의하고, cairo 프로그램 예제를 살펴볼 것입니다.

source: Hash functions in Cairo
ko: 카이로의 해시 함수

source: The Cairo core library provides two hash functions: Pedersen and Poseidon.
ko: 카이로 코어 라이브러리는 Pedersen과 Poseidon 두 개의 해시 함수를 제공합니다.
zh_cn: Cairo 核心库提供了两种哈希函数：Pedersen 和 Poseidon。

source: Pedersen hash functions are cryptographic algorithms that rely on elliptic curve cryptography. These functions perform operations on points along an elliptic curve — essentially, doing math with the locations of these points — which are easy to do in one direction and hard to undo. This one-way difficulty is based on the Elliptic Curve Discrete Logarithm Problem (ECDLP), which is a problem so hard to solve that it ensures the security of the hash function. The difficulty of reversing these operations is what makes the Pedersen hash function secure and reliable for cryptographic purposes.
ko: 페더슨 해시 함수는 타원 곡선 암호학을 기반으로 하는 암호 알고리즘입니다. 이러한 함수들은 타원 곡선 위의 점들에 대한 연산을 수행하는데, 이는 본질적으로 이러한 점들의 위치에 대한 수학적 연산을 하는 것입니다. 이러한 연산은 한 방향으로 쉽게 수행되지만 되돌릴 수 없게 어렵습니다. 이 단방향 어려움은 타원 곡선 이산 로그 문제(ECDLP)에 기반하고 있으며, 이 문제는 해결하기 어려운 정도로 어렵기 때문에 해시 함수의 보안을 보장합니다. 이러한 연산을 되돌리는 어려움이 페더슨 해시 함수를 암호학적 목적으로 안전하고 신뢰할 수 있게 만듭니다.
zh_cn: Pedersen 哈希函数是一种基于椭圆曲线密码学的加密算法。这些函数对椭圆曲线上的点进行操作——本质上是使用这些点的位置进行数学运算——这在一个方向上很容易做到，但却很难反过来操作。这种单向性是基于椭圆曲线离散对数问题 (ECDLP)，它是一个很难的问题，可以确保哈希函数的安全性。无法逆转这些操作的困难性使 Pedersen 哈希函数在加密用途上安全可靠。

source: Poseidon is a family of hash functions designed for being very efficient as algebraic circuits. Its design is particularly efficient for Zero-Knowledge proof systems, including STARKs (so, Cairo). Poseidon uses a method called a 'sponge construction,' which soaks up data and transforms it securely using a process known as the Hades permutation. Cairo's version of Poseidon is based on a three element state permutation with [specific parameters](https://github.com/starkware-industries/poseidon/blob/main/poseidon3.txt).
ko: 포세이돈은 대수 회로로 매우 효율적인 해시 함수 패밀리로 설계되었습니다. 그 설계는 특히 제로-지식 증명 시스템, STARKs (그리고 카이로)를 위해 특히 효율적입니다. 포세이돈은 '스펀지 구조'라는 방법을 사용하며, 이 방법은 데이터를 흡수하고 하데스 순열이라고 알려진 프로세스를 사용하여 안전하게 변환합니다. 카이로의 포세이돈 버전은 [구체적인 매개변수](https://github.com/starkware-industries/poseidon/blob/main/poseidon3.txt)를 사용한 세 요소 상태 순열에 기반합니다.

source: When to use them ?
ko: 그들을 언제 사용해야 하나요?

source: Pedersen was the first hash function used on Starknet, and is still used to compute the addresses of variables in storage (for example, `LegacyMap` uses Pedersen to hash the keys of a storage mapping on Starknet). However, as Poseidon is cheaper and faster than Pedersen when working with STARK proofs system, it's now the recommended hash function to use in Cairo programs.
ko: 페더슨은 Starknet에서 사용된 첫 해시 함수였으며, 여전히 스토리지 변수의 주소를 계산하는 데 사용됩니다 (예: `LegacyMap`은 Starknet의 스토리지 매핑의 키를 해싱하기 위해 Pedersen을 사용합니다). 그러나 Poseidon은 STARK 증명 시스템과 함께 작업할 때 Pedersen보다 저렴하고 빠르기 때문에, 현재는 Cairo 프로그램에서 사용하는 권장 해시 함수입니다.
zh_cn: Pedersen 是 Starknet 上最初使用的哈希函数，现在仍用于计算存储中变量的地址（例如，`LegacyMap` 使用 Pedersen 对 Starknet 上存储映射的键进行哈希）。然而，由于 Poseidon 在处理 STARK 证明系统时比 Pedersen 更便宜，更快，因此现在它已成为 Cairo 程序中推荐使用的哈希函数。

source: The core library makes it easy to work with hashes. The `Hash` trait is implemented for all types that can be converted to `felt252`, including `felt252` itself. For more complex types like structs, deriving `Hash` allows them to be hashed easily using the hash function of your choice - given that all of the struct's fields are themselves hashable. You cannot derive the `Hash` trait on a struct that contains un-hashable values, such as `Array<T>` or a `Felt252Dict<T>`, even if `T` itself is hashable.
ko: 핵심 라이브러리는 해시와 작업하기 쉽게 만듭니다. `Hash` 트레이트는 `felt252`로 변환할 수 있는 모든 유형에 대해 구현되어 있으며, 이는 `felt252` 자체를 포함합니다. 구조체와 같은 보다 복잡한 유형의 경우 `Hash`를 파생하여 선택한 해시 함수를 사용하여 쉽게 해싱할 수 있습니다. 다만, 구조체의 모든 필드가 해시 가능한 경우에 한해 가능합니다. `Array<T>`나 `Felt252Dict<T>`와 같이 해싱할 수 없는 값을 포함하는 구조체에 대해 `Hash` 트레이트를 파생할 수 없습니다. 단, `T` 자체가 해시 가능한 경우에도 해당합니다.
zh_cn: 核心库使哈希操作变得简单。`Hash` trait适用于所有可以转换为 `felt252`的类型，包括 `felt252`本身。对于像结构体这样更复杂的类型，派生 `Hash`允许它们使用您选择的哈希函数进行哈希 - 只要结构体的所有字段本身都是可哈希的。即使 `T`1 本身可哈希，您也无法在包含不可哈希值的结构体上派生 `Hash`trait，例如 `Array<T>` 或 `Felt252Dict<T>`。

source: The `Hash` trait is accompanied by the `HashStateTrait` that defines the basic methods to work with hashes. They allow you to initialize a hash state that will contain the temporary values of the hash after each application of the hash function; update the hash state, and finalize it when the computation is completed. `HashStateTrait` is defined as follows:
ko: `Hash` 트레이트는 해시와 관련된 `HashStateTrait`와 함께 제공되며, 해시와 작업하는 기본 메서드를 정의합니다. 이들은 해시 함수를 적용한 후 해시의 임시 값들을 포함할 해시 상태를 초기화하고, 해시 상태를 업데이트하며, 계산이 완료되면 해시 상태를 완료하는 것을 허용합니다. `HashStateTrait`는 다음과 같이 정의됩니다:
zh_cn: `Hash`trait伴随着 `HashStateTrait`，它定义了用于处理哈希的基本方法。它们允许您初始化一个哈希状态，其中将包含哈希函数每次应用后哈希的临时值；更新哈希状态，并在计算完成后将其最终确定。`HashStateTrait`定义如下：

source: /// A trait for hash state accumulators.
ko: 해시 상태 누적기를 위한 특성입니다.

source: /// A trait for values that can be hashed.
ko: 해싱할 수 있는 값에 대한 특성입니다.

source: /// Updates the hash state with the given value.
ko: 주어진 값으로 해시 상태를 업데이트합니다.

source: To use hashes in your code, you must first import the relevant traits and functions. In the following example, we will demonstrate how to hash a struct using both the Pedersen and Poseidon hash functions.
ko: 당신의 코드에서 해시를 사용하려면 먼저 관련 특성과 함수를 가져와야 합니다. 다음 예제에서는 Pedersen 및 Poseidon 해시 함수를 사용하여 구조체를 해싱하는 방법을 보여드리겠습니다.
zh_cn: 要在代码中使用哈希，您必须首先导入相关的trait和函数。在以下示例中，我们将演示如何使用 Pedersen 和 Poseidon 哈希函数对结构体进行哈希处理。

source: The first step is to initialize the hash with either `PoseidonTrait::new() -> HashState` or `PedersenTrait::new(base: felt252) -> HashState` depending on which hash function we want to work with. Then the hash state can be updated with the `update(self: HashState, value: felt252) -> HashState` or `update_with(self: S, value: T) -> S` functions as many times as required. Then the function `finalize(self: HashState) -> felt252` is called on the hash state and it returns the value of the hash as a `felt252`.
ko: 첫 번째 단계는 작업하려는 해시 함수에 따라 `PoseidonTrait::new() -> HashState` 또는 `PedersenTrait::new(base: felt252) -> HashState` 중 하나로 해시를 초기화하는 것입니다. 그런 다음 해시 상태는 필요한 만큼 `update(self: HashState, value: felt252) -> HashState` 또는 `update_with(self: S, value: T) -> S` 함수로 업데이트될 수 있습니다. 그런 다음 해시 상태에 대해 `finalize(self: HashState) -> felt252` 함수가 호출되고 해시의 값이 `felt252`로 반환됩니다.
zh_cn: 首先，需要根据我们想要使用的哈希函数，使用 `PoseidonTrait::new() -> HashState` 或 `PedersenTrait::new(base: felt252) -> HashState` 初始化哈希状态。然后，可以使用 `update(self: HashState, value: felt252) -> HashState` 或 `update_with(self: S, value: T) -> S` 函数多次更新哈希状态，具体更新次数取决于需要。最后，使用 `finalize(self: HashState) -> felt252` 函数完成哈希计算并返回哈希值。

source: As our struct derives the trait HashTrait, we can call the function as follows for Poseidon hashing :
ko: 저희 구조체가 HashTrait 트레이트를 상속받았기 때문에 Poseidon 해싱을 위해 다음과 같이 함수를 호출할 수 있습니다:

source: Pedersen is different from Poseidon, as it starts with a base state. This base state must be of `felt252` type, which forces us to either hash the struct with an arbitrary base state using the `update_with` method, or serialize the struct into an array to loop through all of its fields and hash its elements together.
ko: 페더슨은 포세이돈과 다릅니다. 왜냐하면 페더슨은 기본 상태로 시작하기 때문입니다. 이 기본 상태는 `felt252` 유형이어야 하며, 이는 우리에게 임의의 기본 상태로 구조체를 해싱하거나 `update_with` 메서드를 사용하여 구조체를 배열로 직렬화하여 모든 필드를 루프를 통해 순회하고 그 요소들을 함께 해싱해야 한다는 것을 강제합니다.

source: Here is a short example for Pedersen hashing :
ko: 여기 Pedersen 해싱에 대한 간단한 예제가 있습니다.

source: // hash1 is the result of hashing a struct with a base state of 0
ko: hash1은 기본 상태가 0인 구조체를 해싱한 결과입니다.

source: // hash2 is the result of hashing only the fields of the struct
ko: hash2는 구조체의 필드만 해싱한 결과입니다.

source: Advanced Hashing: Hashing arrays with Poseidon
ko: 고급 해싱: 포세이돈을 사용한 해싱 배열

source: Let us look at an example of hashing a function that contains a `Span<felt252>`. To hash a `Span<felt252>` or a struct that contains a `Span<felt252>` you can use the built-in function in poseidon ` poseidon_hash_span(mut span: Span<felt252>) -> felt252`. Similarly you can hash `Array<felt252>` by calling `poseidon_hash_span` on its span.
ko: `Span<felt252>`을 포함하는 함수를 해싱하는 예제를 살펴봅시다. `Span<felt252>` 또는 `Span<felt252>`를 포함하는 구조체를 해싱하려면 포세이돈 내장 함수인 `poseidon_hash_span(mut span: Span<felt252>) -> felt252`를 사용할 수 있습니다. 비슷하게 `Array<felt252>`를 해싱하려면 해당 span에 `poseidon_hash_span`을 호출할 수 있습니다.

source: First let us import the following trait and function :
ko: 먼저 다음 특성과 함수를 가져오도록 합시다:
zh_cn: 首先，让我们引入以下trait和函数：
