Repository: cairo-book/cairo-book
Catalog: po/*.po
Languages: es, id, ko, zh_cn

source: However, types that implement the `Drop` trait are automatically destroyed when going out of scope. This destruction does nothing, it is a no-op - simply a hint to the compiler that this type can safely be destroyed once it's no longer useful. We call this "dropping" a value.
ko: 그러나 `Drop` 트레이트를 구현하는 유형은 범위를 벗어날 때 자동으로 파괴됩니다. 이 파괴는 아무것도 하지 않으며, 컴파일러에게 이 유형이 더 이상 유용하지 않을 때 안전하게 파괴될 수 있다는 힌트일 뿐입니다. 우리는 이를 "값을 버리는" 것이라고 부릅니다.

source: At the moment, the `Drop` implementation can be derived for all types, allowing them to be dropped when going out of scope, except for dictionaries (`Felt252Dict`) and types containing dictionaries. For example, the following code compiles:
ko: 현재, `Drop` 구현은 모든 유형에 대해 파생될 수 있으며, 범위를 벗어날 때 삭제될 수 있도록 허용됩니다. 단, 사전(`Felt252Dict`) 및 사전을 포함하는 유형은 제외됩니다. 예를 들어, 다음 코드는 컴파일됩니다:

source: // Now there is no error.
ko: 지금은 오류가 없습니다.

source: Destruction with a side-effect: the `Destruct` trait
ko: 파괴와 부작용: `Destruct` 특성

source: When a value is destroyed, the compiler first tries to call the `drop` method on that type. If it doesn't exist, then the compiler tries to call `destruct` instead. This method is provided by the `Destruct` trait.
ko: 값이 파괴될 때, 컴파일러는 먼저 해당 유형의 `drop` 메서드를 호출하려고 시도합니다. 그 메서드가 없는 경우 컴파일러는 대신 `destruct`를 호출하려고 시도합니다. 이 메서드는 `Destruct` 트레이트에 의해 제공됩니다.

source: As said earlier, dictionaries in Cairo are types that must be "squashed" when destructed, so that the sequence of access can be proven. This is easy for developers to forget, so instead dictionaries implement the `Destruct` trait to ensure that all dictionaries are _squashed_ when going out of scope. As such, the following example will not compile:
ko: 이전에 말했듯이, 카이로의 사전은 파괴될 때 "압축"되어야 하는 유형이므로 액세스 순서를 증명할 수 있습니다. 개발자들이 이것을 잊기 쉽기 때문에 사전은 대신 `Destruct` 특성을 구현하여 모든 사전이 범위를 벗어날 때 _압축_ 되도록 보장합니다. 따라서 다음 예제는 컴파일되지 않습니다:

source: If you try to run this code, you will get a compile-time error:
es: Si intenta ejecutar este código, obtendrá un error de tiempo de compilación:
id: Jika Anda mencoba menjalankan kode ini, Anda akan mendapatkan kesalahan pada waktu kompilasi:
ko: 만약 이 코드를 실행하려고 하면 컴파일 시간 오류가 발생합니다.
zh_cn: 如果你试图运行这段代码，你会得到一个编译时错误：

source: When `A` goes out of scope, it can't be dropped as it implements neither the `Drop` (as it contains a dictionary and can't `derive(Drop)`) nor the `Destruct` trait. To fix this, we can derive the `Destruct` trait implementation for the `A` type:
ko: `A`가 스코프를 벗어나면, 딕셔너리를 포함하고 `derive(Drop)`을 할 수 없기 때문에 `Drop`도 구현되지 않은 `Destruct` 트레이트를 구현할 수 없습니다. 이를 해결하기 위해 `A` 타입에 대한 `Destruct` 트레이트 구현을 파생할 수 있습니다:

source: // No error here
ko: 여기에 오류가 없습니다

source: Now, when `A` goes out of scope, its dictionary will be automatically `squashed`, and the program will compile.
es: Ahora, cuando `A` salga del ámbito, su diccionario será automáticamente `squashed`, y el programa compilará.
id: Sekarang, ketika `A` keluar dari lingkup, kamusnya akan secara otomatis di-"squash", dan program akan berhasil dikompilasi.
ko: 이제 `A`가 범위를 벗어나면 해당 사전이 자동으로 `압축`되고 프로그램이 컴파일됩니다.
zh_cn: 现在，当`A`超出作用域时，它的字典将被自动`squashed`，并且程序将被编译。

source: Copy Array data with Clone
id: Menyalin Data Array dengan Clone
ko: 배열 데이터를 복제하여 복사합니다.

source: If we _do_ want to deeply copy the data of an `Array`, we can use a common method called `clone`. We’ll discuss method syntax in [Chapter 5-3](ch05-03-method-syntax.md), but because methods are a common feature in many programming languages, you’ve probably seen them before.
ko: 만약 우리가 `Array`의 데이터를 깊게 복사하고 싶다면, `clone`이라는 일반적인 메서드를 사용할 수 있습니다. 메서드 구문에 대해는 [5-3장](ch05-03-method-syntax.md)에서 설명하겠지만, 메서드는 많은 프로그래밍 언어에서 흔한 기능이기 때문에 이미 본 적이 있을 것입니다.

source: Here’s an example of the `clone` method in action.
es: Aquí hay un ejemplo del método `clone` en acción.
id: Berikut adalah contoh penggunaan metode `clone`.
ko: 다음은 `clone` 메서드가 작동하는 예제입니다.
zh_cn: 下面是一个 `clone` 方法的实例。

source: When you see a call to `clone`, you know that some arbitrary code is being executed and that code may be expensive. It’s a visual indicator that something different is going on. In this case, the _value_ `arr1` refers to is being copied, resulting in new memory cells being used, and a new _variable_ `arr2` is created, referring to the new copied value.
ko: `clone` 호출을 볼 때, 임의의 코드가 실행되고 그 코드가 비용이 많이 들 수 있다는 것을 알 수 있습니다. 이것은 무언가 다른 일이 일어나고 있다는 시각적인 표시입니다. 이 경우, `_value_` `arr1`이 가리키는 것이 복사되어 새로운 메모리 셀이 사용되고, 새로운 `_variable_` `arr2`가 생성되어 새로 복사된 값이 가리키게 됩니다.

source: Return Values and Scope
id: Value Return dan Lingkup
ko: 반환 값과 범위

source: Returning values is equivalent to _moving_ them. Listing 4-2 shows an example of a function that returns some value, with similar annotations as those in Listing 4-1.
ko: 값을 반환하는 것은 그 값을 _이동_ 하는 것과 동등합니다. 4-2 목록은 값이 반환되는 함수의 예제를 보여줍니다. 4-1 목록과 유사한 주석이 달려 있습니다.

source: // gives_ownership moves its return // value into a1
ko: // gives_ownership는 반환 값을 a1로 이동합니다

source: // a2 comes into scope
ko: // a2가 범위에 들어옵니다

source: // a2 is moved into // takes_and_gives_back, which also // moves its return value into a3
ko: // a2는 takes_and_gives_back으로 이동됩니다. 이 함수는 반환 값을 a3으로 이동시킵니다.

source: // Here, a3 goes out of scope and is dropped. a2 was moved, so nothing // happens. a1 goes out of scope and is dropped.
ko: 여기서 a3가 범위를 벗어나고 삭제됩니다. a2는 이동되었으므로 아무 일도 일어나지 않습니다. a1이 범위를 벗어나고 삭제됩니다.

source: // gives_ownership will move its // return value into the function // that calls it
ko: // gives_ownership는 // 호출하는 함수로 반환 값을 이동시킵니다

source: // some_a comes into scope
ko: // some_a가 범위에 들어옵니다

source: // some_a is returned and // moves ownership to the calling // function
ko: // some_a가 반환되고 // 호출하는 함수로 소유권을 이동합니다

source: // This function takes an instance some_a of A and returns it
ko: 이 함수는 A의 인스턴스 some_a를 가져와 반환합니다.

source: // some_a is returned and // moves ownership to the calling // function
ko: // some_a가 반환되고 // 호출하는 함수로 소유권을 이전합니다

source: Listing 4-2: Moving return values
ko: 리스트 4-2: 반환 값 이동하기

source: While this works, moving into and out of every function is a bit tedious. What if we want to let a function use a value but not move the value? It’s quite annoying that anything we pass in also needs to be passed back if we want to use it again, in addition to any data resulting from the body of the function that we might want to return as well.
ko: 이 작업은 작동하지만, 모든 함수로 이동하는 것은 약간 지루합니다. 함수가 값을 사용하되 값은 이동하지 않도록 하려면 어떻게 해야 할까요? 우리가 전달하는 모든 것이 다시 사용하려면 반환해야 하는 것도 추가로 반환해야 하는 것이 귀찮습니다.

source: Cairo does let us return multiple values using a tuple, as shown in Listing 4-3.
ko: 카이로는 우리에게 튜플을 사용하여 여러 값을 반환할 수 있도록 해줍니다. 이는 4-3 목록에서 보여집니다.

source: // len() returns the length of an array
ko: len()는 배열의 길이를 반환합니다.

source: Listing 4-3: Returning many values
ko: 리스트 4-3: 여러 값 반환하기

source: But this is too much ceremony and a lot of work for a concept that should be common. Luckily for us, Cairo has two features for passing a value without destroying or moving it, called _references_ and _snapshots_.
ko: 그러나 이것은 너무 많은 의식과 많은 작업이 필요한데, 이는 보편적이어야 하는 개념에 대해 말이다. 다행히 카이로에는 값을 전달하면서 파괴하거나 이동하지 않고 전달하는 두 가지 기능인 _참조_ 와 _스냅샷_ 이 있습니다.

source: The issue with the tuple code in previous Listing 4-3 is that we have to return the `Array` to the calling function so we can still use the `Array` after the call to `calculate_length`, because the `Array` was moved into `calculate_length`.
ko: 이전 목록 4-3의 튜플 코드의 문제는 `calculate_length`를 호출한 후에도 `Array`를 계속 사용할 수 있도록 `Array`를 호출 함수에 반환해야 한다는 것입니다. 왜냐하면 `Array`가 `calculate_length`로 이동되었기 때문입니다.

source: Snapshots
ko: 스냅샷

source: In the previous chapter, we talked about how Cairo's ownership system prevents us from using a variable after we've moved it, protecting us from potentially writing twice to the same memory cell. However, it's not very convenient. Let's see how we can retain ownership of the variable in the calling function using snapshots.
ko: 이전 장에서는 카이로의 소유권 시스템이 변수를 이동한 후에 사용할 수 없게 하여 동일한 메모리 셀에 두 번 쓰는 것을 방지하는 방법에 대해 이야기했습니다. 그러나 이것은 매우 편리하지 않습니다. 호출 함수에서 스냅샷을 사용하여 변수의 소유권을 유지하는 방법을 살펴보겠습니다.

source: In Cairo, a snapshot is an immutable view of a value at a certain point in time. Recall that memory is immutable, so modifying a value actually creates a new memory cell. The old memory cell still exists, and snapshots are variables that refer to that "old" value. In this sense, snapshots are a view "into the past".
ko: 카이로에서 스냅샷은 특정 시점의 값의 불변한 관찰입니다. 기억은 불변하기 때문에 값 수정은 사실 새로운 기억 셀을 만들어냅니다. 이전 기억 셀은 여전히 존재하며, 스냅샷은 그 "이전" 값을 참조하는 변수입니다. 이런 의미에서 스냅샷은 "과거로의 시각"입니다.

source: Here is how you would define and use a `calculate_length` function that takes a snapshot of an array as a parameter instead of taking ownership of the underlying value. In this example, the `calculate_length` function returns the length of the array passed as a parameter. As we're passing it as a snapshot, which is an immutable view of the array, we can be sure that the `calculate_length` function will not mutate the array, and ownership of the array is kept in the `main` function.
ko: 다음은 배열의 스냅샷을 매개변수로 사용하여 소유권을 가져가지 않는 `calculate_length` 함수를 정의하고 사용하는 방법입니다. 이 예에서 `calculate_length` 함수는 매개변수로 전달된 배열의 길이를 반환합니다. 우리가 스냅샷으로 전달하고 있기 때문에, 이는 배열의 불변 뷰이며 `calculate_length` 함수가 배열을 변경하지 않을 것이며, 배열의 소유권은 `main` 함수에 유지됩니다.

source: // Take a snapshot of `arr1` at this point in time
ko: `arr1`의 현재 상태를 스냅샷으로 찍어주세요.

source: // Mutate `arr1` by appending a value
ko: `arr1`에 값을 추가하여 변경하십시오.

source: // Calculate the length of the array when the snapshot was taken
ko: // 스냅샷이 찍힌 시점에서 배열의 길이를 계산합니다.

source: // Calculate the current length of the array
ko: 배열의 현재 길이를 계산하세요.

source: "The length of the array when the snapshot was taken is {}"
ko: "스냅샷이 찍힌 시점에서 배열의 길이는 {}입니다."

source: "The current length of the array is {}"
ko: "배열의 현재 길이는 {}입니다"

source: Note: It is only possible to call the `len()` method on an array snapshot because it is defined as such in the `ArrayTrait` trait. If you try to call a method that is not defined for snapshots on a snapshot, you will get a compilation error. However, you can call methods expecting a snapshot on non-snapshot types.
id: Catatan: Hanya mungkin untuk memanggil metode `len()` pada sebuah snapshot array karena itu didefinisikan dalam trait `ArrayTrait`. Jika Anda mencoba memanggil sebuah metode yang tidak didefinisikan untuk snapshot pada sebuah snapshot, Anda akan mendapatkan kesalahan kompilasi. Namun, Anda dapat memanggil metode yang mengharapkan snapshot pada tipe-tipe non-snapshot.
ko: 참고: `len()` 메서드는 `ArrayTrait` 특성에서 그렇게 정의되어 있기 때문에 배열 스냅샷에서만 호출할 수 있습니다. 스냅샷에 정의되지 않은 메서드를 호출하려고 하면 컴파일 오류가 발생합니다. 그러나 스냅샷을 기대하는 메서드는 스냅샷이 아닌 유형에서 호출할 수 있습니다.

source: The output of this program is:
es: La salida de este programa es:
id: Output dari program ini:
ko: 이 프로그램의 출력물은:
zh_cn: 这个程序的输出是：

source: First, notice that all the tuple code in the variable declaration and the function return value is gone. Second, note that we pass `@arr1` into `calculate_length` and, in its definition, we take `@Array<u128>` rather than `Array<u128>`.
id: Pertama, perhatikan bahwa semua kode tuple dalam deklarasi variabel dan nilai kembalian fungsi telah hilang. Kedua, perhatikan bahwa kita melewatkan `@arr1` ke dalam `calculate_length` dan, dalam definisinya, kita mengambil `@Array<u128>` daripada `Array<u128>`.
ko: 먼저, 변수 선언과 함수 반환 값에 있는 모든 튜플 코드가 사라진 것을 주목하세요. 둘째, `calculate_length`에 `@arr1`을 전달하고, 그 정의에서 `Array<u128>` 대신 `@Array<u128>`을 사용한다는 점에 유의하세요.

source: Let’s take a closer look at the function call here:
es: Veamos más de cerca la llamada a la función aquí:
id: Mari kita perhatikan lebih dekat panggilan fungsi di sini:
ko: 여기서 함수 호출을 좀 더 자세히 살펴보겠습니다.
zh_cn: 让我们仔细看一下这里的函数调用：

source: The `@arr1` syntax lets us create a snapshot of the value in `arr1`. Because a snapshot is an immutable view of a value at a specific point in time, the usual rules of the linear type system are not enforced. In particular, snapshot variables always implement the `Drop` trait, never the `Destruct` trait, even dictionary snapshots.
ko: `@arr1` 구문을 사용하면 `arr1`의 값에 대한 스냅샷을 만들 수 있습니다. 스냅샷은 특정 시점의 값에 대한 불변 뷰이므로 일반적인 선형 타입 시스템의 규칙이 적용되지 않습니다. 특히, 스냅샷 변수는 항상 `Drop` 트레이트를 구현하며, `Destruct` 트레이트는 구현하지 않습니다. 딕셔너리 스냅샷도 마찬가지입니다.

source: Similarly, the signature of the function uses `@` to indicate that the type of the parameter `arr` is a snapshot. Let’s add some explanatory annotations:
es: De manera similar, la firma de la función utiliza `@` para indicar que el tipo del parámetro `arr` es una instantánea. Añadamos algunas anotaciones explicativas:
id: Demikian pula, tanda fungsi menggunakan `@` untuk menunjukkan bahwa tipe dari parameter `arr` adalah sebuah snapshot. Mari kita tambahkan beberapa anotasi penjelasan:
ko: 비슷하게, 함수의 시그니처는 `@`를 사용하여 매개변수 `arr`의 타입이 스냅샷임을 나타냅니다. 몇 가지 설명 주석을 추가해 봅시다:
zh_cn: 同样，函数的签名使用`@`来表示参数`arr`的类型是一个快照。让我们添加一些解释性的注解：

source: // array_snapshot is a snapshot of an Array
ko: array_snapshot은 Array의 스냅샷입니다.

source: // Here, array_snapshot goes out of scope and is dropped. // However, because it is only a view of what the original array `arr` contains, the original `arr` can still be used.
ko: 여기서 array_snapshot이 범위를 벗어나고 삭제됩니다. 그러나 이는 원래 배열 'arr'이 포함하는 것의 뷰일 뿐이므로 원래 'arr'은 여전히 사용할 수 있습니다.

source: The scope in which the variable `array_snapshot` is valid is the same as any function parameter’s scope, but the underlying value of the snapshot is not dropped when `array_snapshot` stops being used. When functions have snapshots as parameters instead of the actual values, we won’t need to return the values in order to give back ownership of the original value, because we never had it.
es: El alcance en el que la variable `array_snapshot` es válida es el mismo que el alcance de cualquier parámetro de función, pero el valor subyacente del snapshot no se eliminará cuando `array_snapshot` deje de usarse. Cuando las funciones tienen snapshots como parámetros en lugar de los valores reales, no necesitamos devolver los valores para devolver la propiedad del valor original, porque nunca la tuvimos.
id: Lingkup di mana variabel `array_snapshot` valid sama seperti lingkup parameter fungsi mana pun, tetapi nilai dasar dari snapshot tidak dihapus saat `array_snapshot` berhenti digunakan. Ketika fungsi memiliki snapshot sebagai parameter daripada nilai aktual, kita tidak perlu mengembalikan nilai untuk memberikan kembali kepemilikan dari nilai asli, karena kita tidak pernah memiliki kepemilikannya.
ko: 변수 'array_snapshot'이 유효한 범위는 모든 함수 매개변수의 범위와 동일하지만, 'array_snapshot'이 사용되지 않을 때 스냅샷의 기본 값이 삭제되지 않습니다. 함수가 실제 값 대신 스냅샷을 매개변수로 사용할 때, 우리는 원래 값의 소유권을 반환하기 위해 값을 반환할 필요가 없습니다. 왜냐하면 우리는 원래 값을 가지고 있지 않았기 때문입니다.
zh_cn: 变量`array_snapshot`的有效范围与任何函数参数的范围相同，但当`array_snapshot`停止使用时，快照的底层值不会被丢弃。当函数有快照作为参数而不是实际的值时，我们将不需要返回值以归还原始值的所有权，因为我们从未拥有过它。

source: Desnap Operator
ko: 데스냅 오퍼레이터

source: To convert a snapshot back into a regular variable, you can use the `desnap` operator `*`, which serves as the opposite of the `@` operator.
ko: 스냅샷을 일반 변수로 변환하려면, `desnap` 연산자 `*`를 사용할 수 있습니다. 이 연산자는 `@` 연산자의 반대 역할을 합니다.

source: Only `Copy` types can be desnapped. However, in the general case, because the value is not modified, the new variable created by the `desnap` operator reuses the old value, and so desnapping is a completely free operation, just like `Copy`.
ko: `Copy` 유형만 desnapped될 수 있습니다. 그러나 일반적인 경우에는 값이 수정되지 않기 때문에 `desnap` 연산자에 의해 생성된 새 변수는 이전 값이 재사용되므로 desnapping은 완전히 무료한 작업으로, 마치 `Copy`와 같습니다.

source: In the following example, we want to calculate the area of a rectangle, but we don't want to take ownership of the rectangle in the `calculate_area` function, because we might want to use the rectangle again after the function call. Since our function doesn't mutate the rectangle instance, we can pass the snapshot of the rectangle to the function, and then transform the snapshots back into values using the `desnap` operator `*`.
id: Dalam contoh berikut, kita ingin menghitung luas persegi panjang, tetapi kita tidak ingin mengambil kepemilikan dari persegi panjang di fungsi `calculate_area`, karena kita mungkin ingin menggunakan persegi panjang tersebut lagi setelah panggilan fungsi. Karena fungsi kita tidak mengubah instance persegi panjang, kita dapat meneruskan snapshot dari persegi panjang ke fungsi, dan kemudian mengubah snapshot kembali menjadi nilai menggunakan operator `desnap` `*`.
ko: 다음 예제에서는 직사각형의 면적을 계산하고 싶지만 `calculate_area` 함수에서 직사각형을 소유하고 싶지 않습니다. 왜냐하면 함수 호출 후에도 직사각형을 다시 사용하고 싶을 수도 있기 때문입니다. 함수가 직사각형 인스턴스를 변경하지 않기 때문에 직사각형의 스냅샷을 함수에 전달하고, 그런 다음 스냅샷을 값으로 변환하기 위해 `desnap` 연산자 `*`를 사용할 수 있습니다.
zh_cn: 在下面的示例中，我们要计算一个矩形的面积，但我们不想在`calculate_area`函数中取得矩形的所有权，因为我们可能想在函数调用后再次使用该矩形。由于我们的函数不会更改矩形实例，因此我们可以将矩形的快照传递给函数，然后使用 `desnap` 操作符 `*` 将快照转换回值。

source: "Area: {}"
ko: "면적: {}"

source: // As rec is a snapshot to a Rectangle, its fields are also snapshots of the fields types. // We need to transform the snapshots back into values using the desnap operator `*`. // This is only possible if the type is copyable, which is the case for u64. // Here, `*` is used for both multiplying the height and width and for desnapping the snapshots.
ko: // rec은 직사각형에 대한 스냅샷이므로, 그 필드들도 필드 유형의 스냅샷입니다. // 우리는 desnap 연산자 `*`를 사용하여 스냅샷을 다시 값으로 변환해야 합니다. // 이는 u64에 대해 복사 가능한 경우에만 가능합니다. // 여기서 `*`는 높이와 너비를 곱하고 스냅샷을 다시 값으로 변환하는 데 사용됩니다.

source: But, what happens if we try to modify something we’re passing as a snapshot? Try the code in Listing 4-4. Spoiler alert: it doesn’t work!
ko: 그러나, 우리가 스냅샷으로 전달하는 것을 수정하려고 시도하면 어떻게 될까요? 4-4 목록의 코드를 시도해보세요. 스포일러 경고: 작동하지 않습니다!

source: Listing 4-4: Attempting to modify a snapshot value
ko: 리스팅 4-4: 스냅샷 값을 수정하려는 시도

source: Here’s the error:
es: Aquí está el error:
ko: 다음은 오류입니다:
zh_cn: 这里有一个错误：

source: The compiler prevents us from modifying values associated to snapshots.
es: El compilador nos impide modificar los valores asociados a las instantáneas.
id: Compiler mencegah kita untuk memodifikasi nilai yang terkait dengan snapshot.
ko: 컴파일러는 스냅샷에 연관된 값들을 수정하는 것을 방지합니다.
zh_cn: 编译器阻止我们修改与快照相关的值。

source: Mutable References
id: Referensi yang Dapat Diubah
ko: 가변 참조

source: We can achieve the behavior we want in Listing 4-4 by using a _mutable reference_ instead of a snapshot. Mutable references are actually mutable values passed to a function that are implicitly returned at the end of the function, returning ownership to the calling context. By doing so, they allow you to mutate the value passed while keeping ownership of it by returning it automatically at the end of the execution. In Cairo, a parameter can be passed as _mutable reference_ using the `ref` modifier.
ko: 리스팅 4-4에서 원하는 동작을 얻을 수 있습니다. 스냅샷 대신 _가변 참조_ 를 사용함으로써. 가변 참조는 사실 함수에 전달된 가변 값으로, 함수의 끝에서 암묵적으로 반환되어 호출 컨텍스트에 소유권을 반환합니다. 이렇게 함으로써, 실행의 끝에서 자동으로 반환함으로써 전달된 값을 변경할 수 있으면서도 소유권을 유지할 수 있습니다. 카이로에서는 `ref` 수정자를 사용하여 매개변수를 _가변 참조_ 로 전달할 수 있습니다.

source: **Note**: In Cairo, a parameter can only be passed as _mutable reference_ using the `ref` modifier if the variable is declared as mutable with `mut`.
id: **Catatan**: Di Cairo, sebuah parameter hanya dapat dilewati sebagai _mutable reference_ menggunakan modifier `ref` jika variabel dideklarasikan sebagai mutable dengan `mut`.
ko: **참고**: 카이로에서는 변수가 `mut`로 선언되어야만 `ref` 수정자를 사용하여 _가변 참조_ 로 매개변수를 전달할 수 있습니다.

source: In Listing 4-5, we use a mutable reference to modify the value of the `height` and `width` fields of the `Rectangle` instance in the `flip` function.
ko: 리스팅 4-5에서는 `flip` 함수에서 `Rectangle` 인스턴스의 `height`와 `width` 필드의 값을 수정하기 위해 가변 참조를 사용합니다.

source: "height: {}, width: {}"
ko: "높이: {}, 너비: {}"

source: Listing 4-5: Use of a mutable reference to modify a value
ko: 리스트 4-5: 가변 참조를 사용하여 값 수정하기

source: First, we change `rec` to be `mut`. Then we pass a mutable reference of `rec` into `flip` with `ref rec`, and update the function signature to accept a mutable reference with `ref rec: Rectangle`. This makes it very clear that the `flip` function will mutate the value of the `Rectangle` instance passed as parameter.
es: Primero, cambiamos `rec` a `mut`. Luego, pasamos una referencia mutable de `rec` a `flip` con `ref rec` y actualizamos la firma de la función para aceptar una referencia mutable con `ref rec: Rectangle`. Esto deja muy claro que la función `flip` modificará el valor de la instancia de `Rectangle` pasada como parámetro.
id: Pertama, kita ubah `rec` menjadi `mut`. Kemudian kita lewatkan sebuah mutable reference dari `rec` ke dalam `flip` dengan `ref rec`, dan perbarui tanda fungsi untuk menerima sebuah mutable reference dengan `ref rec: Rectangle`. Hal ini membuat sangat jelas bahwa fungsi `flip` akan memutasi nilai dari instance `Rectangle` yang dilewatkan sebagai parameter.
ko: 먼저, 우리는 `rec`를 `mut`으로 변경합니다. 그런 다음 `flip`에 `ref rec`와 함께 `rec`의 가변 참조를 전달하고, 함수 시그니처를 수정하여 가변 참조를 받도록 합니다. 이렇게 하면 `flip` 함수가 매개변수로 전달된 `Rectangle` 인스턴스의 값을 변경할 것임을 명확히 알 수 있습니다.
zh_cn: 首先，我们把`rec`改成`mut`。然后我们用 `ref rec` 将 `rec` 的可变引用传入 `flip` ，并更新函数签名，用 `ref rec: Rectangle`接受可变引用。这很清楚地表明，`flip`函数将改变作为参数传递的`Rectangle`实例的值。

source: The output of the program is:
es: La salida del programa es:
id: Output dari program ini:
ko: 프로그램의 출력물은:
zh_cn: 程序的输出是：

source: As expected, the `height` and `width` fields of the `rec` variable have been swapped.
es: Como era de esperar, los campos `height` y `width` de la variable `rec` se han intercambiado.
id: Seperti yang diharapkan, bidang `height` dan `width` dari variabel `rec` telah ditukar.
ko: 예상대로, `rec` 변수의 `height`와 `width` 필드가 교환되었습니다.
zh_cn: 正如预期的那样， `rec` 变量的 `height` 和 `width` 字段被调换了。

source: Small recap
id: Rekap kecil
ko: 작은 요약

source: Let’s recap what we’ve discussed about the linear type system, ownership, snapshots, and references:
ko: 선형 유형 시스템, 소유권, 스냅샷 및 참조에 대해 논의한 내용을 다시 정리해 봅시다:

source: At any given time, a variable can only have one owner.
id: Pada setiap waktu tertentu, sebuah variabel hanya dapat dimiliki oleh satu entitas.
ko: 어떤 시점에서도 변수는 하나의 소유자만 가질 수 있습니다.

source: You can pass a variable by-value, by-snapshot, or by-reference to a function.
id: Anda dapat melewati sebuah variabel dengan-nilai (by-value), dengan-snapshot (by-snapshot), atau dengan-referensi (by-reference) ke dalam suatu fungsi.
ko: 함수에 변수를 값으로, 스냅샷으로 또는 참조로 전달할 수 있습니다.

source: If you pass-by-value, ownership of the variable is transferred to the function.
id: Jika Anda melewatinya dengan-nilai (pass-by-value), kepemilikan dari variabel tersebut dialihkan ke dalam fungsi.
ko: 만약 pass-by-value를 사용하면, 변수의 소유권이 함수로 이전됩니다.

source: If you want to keep ownership of the variable and know that your function won’t mutate it, you can pass it as a snapshot with `@`.
id: Jika Anda ingin tetap memegang kepemilikan dari variabel dan yakin bahwa fungsi Anda tidak akan memutasi nilainya, Anda dapat melewatinya sebagai snapshot dengan menggunakan `@`.
ko: 변수의 소유권을 유지하고 함수가 변형하지 않을 것을 알고 싶다면 `@`로 스냅샷으로 전달할 수 있습니다.

source: If you want to keep ownership of the variable and know that your function will mutate it, you can pass it as a mutable reference with `ref`.
id: Jika Anda ingin tetap memegang kepemilikan dari variabel dan mengetahui bahwa fungsi Anda akan memutasi nilainya, Anda dapat melewatinya sebagai mutable reference dengan menggunakan `ref`.
ko: 만약 변수의 소유권을 유지하고 함수가 해당 변수를 변경할 것임을 알고 싶다면, `ref`를 사용하여 가변 참조로 전달할 수 있습니다.
