Repository: cairo-book/cairo-book
Catalog: po/*.po
Languages: es, id, ko, zh_cn

source: - **Start from the crate root**: When compiling a crate, the compiler first looks in the crate root file (_src/lib.cairo_) for code to compile. - **Declaring modules**: In the crate root file, you can declare new modules; say, you declare a “garden” module with `mod garden;`. The compiler will look for the module’s code in these places: - Inline, within curly brackets that replace the semicolon following `mod garden;`. ```rust,noplayground // crate root file (src/lib.cairo) mod garden { // code defining the garden module goes here } ``` - In the file _src/garden.cairo_ - **Declaring submodules**: In any file other than the crate root, you can declare submodules. For example, you might declare `mod vegetables;` in _src/garden.cairo_. The compiler will look for the submodule’s code within the directory named for the parent module in these places: - Inline, directly following `mod vegetables`, within curly brackets instead of the semicolon. ```rust,noplayground // src/garden.cairo file mod vegetables { // code defining the vegetables submodule goes here } ``` - In the file _src/garden/vegetables.cairo_ - **Paths to code in modules**: Once a module is part of your crate, you can refer to code in that module from anywhere else in that same crate, using the path to the code. For example, an `Asparagus` type in the garden vegetables module would be found at `backyard::garden::vegetables::Asparagus`. - **The `use` keyword**: Within a scope, the `use` keyword creates shortcuts to items to reduce repetition of long paths. In any scope that can refer to `backyard::garden::vegetables::Asparagus`, you can create a shortcut with `use backyard::garden::vegetables::Asparagus;` and from then on you only need to write `Asparagus` to make use of that type in the scope.
zh_cn: - **从 crate 根节点开始**：当编译一个 crate, 编译器首先在 crate 根文件（_src/lib.cairo_）中寻找要编译的代码。 - **声明模块:**：在 crate 根文件中，你可以声明新的模块； 例如，你用`mod garden;`声明一个 “garden”模块。编译器会在下列路径中寻找模块代码： - 内联，在大括号中，当`mod garden`后方不是一个分号而是一个大括号 ```rust,noplayground // crate root file (src/lib.cairo) mod garden { // code defining the garden module goes here } ``` - 在文件 _src/garden.cairo_ 中 - **声明子模块**：在除了 crate 根节点以外的其他文件中，你可以定义子模块。例如，你可以在以下文件中声明 `mod vegetables;`。 _src/garden.cairo_ 。编译器会在以父模块命名的目录中寻找子模块代码： - 内联，直接跟在`mod vegetables`后面，用大括号代替分号 ```rust,noplayground // src/garden.cairo file mod vegetables { // code defining the vegetables submodule goes here } ``` - 在文件 _src/garden/vegetables.cairo_ 中 - **模块中的代码路径**：一旦一个模块是你 crate 的一部分，你可以在隐私规则允许的前提下，从同一个 crate 内的任意地方，通过代码路径引用该模块的代码。举例而言，一个 garden vegetables 模块下的`Asparagus`类型可以在`backyard::garden::vegetables::Asparagus`被找到。 - **`use`关键字**：在一个作用域内，`use`关键字创建了一个成员的快捷方式，用来减少长路径的重复。在任何可以引用`backyard::garden::vegetables::Asparagus`的作用域，你可以通过 `use backyard::garden::vegetables::Asparagus;`创建一个快捷方式，然后你就可以在作用域中只写`Asparagus`来使用该类型。

source: Here we create a crate named `backyard` that illustrates these rules. The crate’s directory, also named `backyard`, contains these files and directories:
es: Aquí creamos un paquete llamado `backyard` que ilustra estas reglas. El directorio del paquete, también llamado `backyard`, contiene estos archivos y directorios:
zh_cn: 这里我们创建一个名为`backyard`的crate 来说明这些规则。该 crate 的路径同样命名为`backyard`，该路径包含了这些文件和目录：

source: <span class="filename">Filename: src/garden.cairo</span>
zh_cn: <span class="filename">文件名： src/garden.cairo</span>

source: Here, `mod vegetables;` means the code in _src/garden/vegetables.cairo_ is included too. That code is:
es: Aquí, `mod vegetables;` significa que el código en _src/garden/vegetables.cairo_ también está incluido. Ese código es:
zh_cn: 这里，`mod vegetables;`意味着 _src/garden/vegetables.cairo_ 中的代码也被包括在内。这段代码是：

source: The line `use garden::vegetables::Asparagus;` lets us use bring the `Asparagus` type into scope, so we can use it in the `main` function.
es: La línea `use garden::vegetables::Asparagus;` nos permite traer el tipo `Asparagus` al ámbito de alcance, para que podamos usarlo en la función `main`.
zh_cn: 这行`use garden::vecants::Asparagus;`让我们把`Asparagus`类型带入作用域、所以我们可以在`main`函数中使用它。

source: ### Grouping Related Code in Modules
es: ### Agrupando el Código Relacionado en Módulos
zh_cn: ### 在模块中对相关代码进行分组

source: _Modules_ let us organize code within a crate for readability and easy reuse. As an example, let’s write a library crate that provides the functionality of a restaurant. We’ll define the signatures of functions but leave their bodies empty to concentrate on the organization of the code, rather than the implementation of a restaurant.
es: _Los módulos_ nos permiten organizar el código dentro de un paquete para hacerlo más legible y fácil de reutilizar. Como ejemplo, escribiremos un paquete de biblioteca que proporcione la funcionalidad de un restaurante. Definiremos las firmas de las funciones pero dejaremos sus cuerpos vacíos para concentrarnos en la organización del código, en lugar de en la implementación de un restaurante.
zh_cn: _模块_ 让我们可以将一个 crate 中的代码进行分组，以提高可读性与重用性。 作为一个例子，让我们写一个crate，提供一个餐馆的机能。我们将定义函数的签名，但将其主体留空，以专注于代码的组织，而不是餐馆的实现。

source: In the restaurant industry, some parts of a restaurant are referred to as _front of house_ and others as _back of house_. Front of house is where customers are; this encompasses where the hosts seat customers, servers take orders and payment, and bartenders make drinks. Back of house is where the chefs and cooks work in the kitchen, dishwashers clean up, and managers do administrative work.
es: En la industria de la restauración, algunas partes de un restaurante se denominan _front of house_ (delante de la casa) y otras como _back of house_. Front of house es donde están los clientes; esto abarca desde donde los anfitriones sientan a los clientes, los servidores toman órdenes y pagos, y los barman hacen bebidas. Back of house es donde los chefs y cocineros trabajan en la cocina, los lavaplatos limpian y los gerentes hacen trabajo administrativo.
zh_cn: 在餐饮业，餐馆中会有一些地方被称之为 前台（_front of house_），还有另外一些地方被称之为 后台（_back of house_）。 前台是招待顾客的地方，在这里，店主可以为顾客安排座位，服务员接受顾客下单和付款，调酒师会制作饮品。 后台则是由厨师工作的厨房，洗碗工的工作地点，以及经理做行政工作的地方组成。

source: To structure our crate in this way, we can organize its functions into nested modules. Create a new package named `restaurant` by running `scarb new restaurant`; then enter the code in Listing 7-1 into _src/lib.cairo_ to define some modules and function signatures. Here’s the front of house section:
zh_cn: 我们可以将函数放置到嵌套的模块中，来使我们的 crate 结构与实际的餐厅结构相同。 通过运行 `scarb new restaurant`创建一个名为 `restaurant`的新包；然后将示例7-1中的代码输入 _src/lib.cairo_ ，以定义一些模块和函数签名。这里是前台的部分：

source: <span class="caption">Listing 7-1: A `front_of_house` module containing other modules that then contain functions</span>
zh_cn: <span class="caption">示例7-1：一个 `front_of_house`模块包含其他的模块，而这些模块又包含了函数</span>

source: We define a module with the `mod` keyword followed by the name of the module (in this case, `front_of_house`). The body of the module then goes inside curly brackets. Inside modules, we can place other modules, as in this case with the modules `hosting` and `serving`. Modules can also hold definitions for other items, such as structs, enums, constants, traits, and—as in Listing 6-1—functions.
es: Definimos un módulo con la palabra clave `mod` seguida del nombre del módulo (en este caso, `front_of_house`). El cuerpo del módulo va entre llaves. Dentro de los módulos, podemos colocar otros módulos, como en este caso con los módulos `hosting` y `serving`. Los módulos también pueden contener definiciones de otros elementos, como structs, enums, constantes, traits y, como en el Listado 6-1, funciones.
zh_cn: 我们定义一个模块，是以 `mod`关键字为起始，然后指定模块的名字（本例中叫做 `front_of_house`），并且用花括号包围模块的主体。在模块内，我们还可以定义其他的模块，就像本例中的 `hosting` 和 `serving` 模块。模块还可以保存一些定义的其他项，比如结构体、枚举、常量、特性、以及列表中6-1中展示的函数。

source: By using modules, we can group related definitions together and name why they’re related. Programmers using this code can navigate the code based on the groups rather than having to read through all the definitions, making it easier to find the definitions relevant to them. Programmers adding new functionality to this code would know where to place the code to keep the program organized.
es: Al utilizar módulos, podemos agrupar las definiciones relacionadas y darles un nombre que indique por qué están relacionadas. Los programadores que usan este código pueden navegar por el código en función de los grupos en lugar de tener que leer todas las definiciones, lo que hace que sea más fácil encontrar las definiciones relevantes para ellos. Los programadores que agregan nueva funcionalidad a este código sabrían dónde colocar el código para mantener el programa organizado.
zh_cn: 通过使用模块，我们可以将相关的定义分组到一起，并指出他们为什么相关。程序员可以通过使用这段代码，更加容易地找到他们想要的定义，因为他们可以基于分组来对代码进行导航，而不需要阅读所有的定义。 程序员向这段代码中添加一个新的功能时，他们也会知道代码应该放置在何处，可以保持程序的组织性。

source: Earlier, we mentioned that _src/lib.cairo_ is called the crate root. The reason for this name is that the content of this file form a module named after the crate name at the root of the crate’s module structure, known as the _module tree_.
es: Anteriormente, mencionamos que _src/lib.cairo_ se llama raíz de la caja. La razón de este nombre es que el contenido de este archivo forma un módulo con el nombre de la caja en la raíz de la estructura de módulos de la caja, conocido como el _árbol de módulos_.
zh_cn: 在前面我们提到了，_src/lib.cairo_ 叫做 crate 根。之所以这样叫它是因为这个文件的内容在 crate 模块结构的根组成了一个名为 crate 的模块，该结构被称为 模块树（ _module tree_ ）。

source: <span class="caption">Listing 7-2: The module tree for the code in Listing 6-1</span>
zh_cn: <span class="caption">示例7-2：示例6-1中代码的模块树</span>

source: This tree shows how some of the modules nest inside one another; for example, `hosting` nests inside `front_of_house`. The tree also shows that some modules are _siblings_ to each other, meaning they’re defined in the same module; `hosting` and `serving` are siblings defined within `front_of_house`. If module A is contained inside module B, we say that module A is the _child_ of module B and that module B is the _parent_ of module A. Notice that the entire module tree is rooted under the explicit name of the crate `restaurant`.
es: Este árbol muestra cómo algunos módulos se anidan dentro de otros; por ejemplo, `hosting` se anida dentro de `front_of_house`. El árbol también muestra que algunos módulos son _hermanos_ entre sí, lo que significa que están definidos en el mismo módulo; `hosting` y `serving` son hermanos definidos dentro de `front_of_house`. Si el módulo A está contenido dentro del módulo B, decimos que el módulo A es el _hijo_ del módulo B y que el módulo B es el _padre_ del módulo A. Observa que todo el árbol de módulos está enraizado en el nombre explícito del paquete `restaurant`.
zh_cn: 这个树展示了一些模块是如何被嵌入到另一个模块的（例如，`hosting` 嵌套在 `front_of_house` 中）。这个树还展示了一些模块是互为 兄弟（ _siblings_ ）的，这意味着它们定义在同一模块中（ `hosting` 和 `serving` 被一起定义在 _front_of_house_ 中）。继续沿用家庭关系的比喻，如果一个模块 A 被包含在模块 B 中，我们将模块 A 称为模块 B 的 子（ _child_ ），模块 B 则是模块 A 的 父（ _parent_ ）。注意，整个模块树都植根于名为 `restaurant` crate的隐式模块下。

source: The module tree might remind you of the filesystem’s directory tree on your computer; this is a very apt comparison! Just like directories in a filesystem, you use modules to organize your code. And just like files in a directory, we need a way to find our modules.
es: El árbol de módulos podría recordarte al árbol de directorios del sistema de archivos en tu computadora; ¡esta es una comparación muy adecuada! Al igual que los directorios en un sistema de archivos, utilizamos los módulos para organizar nuestro código. Y al igual que los archivos en un directorio, necesitamos una manera de encontrar nuestros módulos.
zh_cn: 这个模块树可能会令你想起电脑上文件系统的目录树；这是一个非常恰当的类比！就像文件系统的目录，你可以使用模块来组织你的代码。并且，就像目录中的文件，我们需要一种方法来找到模块。

source: ## Paths for Referring to an Item in the Module Tree
es: ## Caminos para hacer referencia a un elemento en el árbol de módulos
zh_cn: ## 引用模块项目的路径

source: - An _absolute path_ is the full path starting from a crate root. The absolute path begins with the crate name. - A _relative path_ starts from the current module. Both absolute and relative paths are followed by one or more identifiers separated by double colons (`::`).
es: - Un _camino absoluto_ es la ruta completa que comienza desde la raíz del crate. El camino absoluto comienza con el nombre del crate. - Un _camino relativo_ comienza desde el módulo actual. Tanto los caminos absolutos como los relativos son seguidos por uno o más identificadores separados por dos puntos dobles (`::`).
zh_cn: - 绝对路径（ _absolute path_ ）是以 crate 根（root）开头的全路径。绝对路径以 crate 名开头。 - 相对路径（ _relative path_ ）是从当前模块开始的。 绝对路径和相对路径后面都有一个或多个标识符用双冒号（`::`）分开。

source: <span class="caption">Listing 7-3: Calling the `add_to_waitlist` function using absolute and relative paths</span>
zh_cn: <span class="caption">示例7-3：使用绝对和相对路径调用`add_to_waitlist`函数</span>

source: The first time we call the `add_to_waitlist` function in `eat_at_restaurant`, we use an absolute path. The `add_to_waitlist` function is defined in the same crate as `eat_at_restaurant`. In Cairo, absolute paths start from the crate root, which you need to refer to by using the crate name.
es: La primera vez que llamamos a la función `add_to_waitlist` en `eat_at_restaurant`, usamos una ruta absoluta. La función `add_to_waitlist` está definida en la misma caja que `eat_at_restaurant`. En Cairo, las rutas absolutas comienzan desde la raíz de la caja, a la cual se refiere usando el nombre de la caja.
zh_cn: 我们第一次调用`eat_at_restaurant`中的`add_to_waitlist`函数时、使用了一个绝对路径。`add_to_waitlist`函数与`eat_at_restaurant`定义在同一个crate中。在Cairo中，绝对路径从crate根开始，你需要用crate的名字来引用它。

source: The second time we call `add_to_waitlist`, we use a relative path. The path starts with `front_of_house`, the name of the module defined at the same level of the module tree as `eat_at_restaurant`. Here the filesystem equivalent would be using the path `./front_of_house/hosting/add_to_waitlist`. Starting with a module name means that the path is relative to the current module.
es: La segunda vez que llamamos a `add_to_waitlist`, usamos una ruta relativa. La ruta comienza con `front_of_house`, el nombre del módulo definido en el mismo nivel del árbol de módulos que `eat_at_restaurant`. Aquí, el equivalente en el sistema de archivos sería usar la ruta `./front_of_house/hosting/add_to_waitlist`. Comenzar con un nombre de módulo significa que la ruta es relativa al módulo actual.
zh_cn: 第二次我们调用 add_to_waitlist时，使用的是相对路径。这个路径以 `front_of_house` 为起始，这个模块在模块树中，与 `eat_at_restaurant` 定义在同一层级。 与之等价的文件系统路径就是 `./front_of_house/hosting/add_to_waitlist`。以模块名开头意味着该路径是相对路径。

source: ### Starting Relative Paths with `super`
es: ### Comenzando Rutas Relativas con `super`
zh_cn: ### 使用 `super` 起始的相对路径

source: Choosing whether to use a `super` or not is a decision you’ll make based on your project, and depends on whether you’re more likely to move item definition code separately from or together with the code that uses the item.
es: Elegir si usar o no `super` es una decisión que tomarás basada en tu proyecto y dependerá de si es más probable que muevas el código de definición de elementos por separado o junto con el código que usa el elemento.
zh_cn: 选择是否使用 `super`将根据你的项目具体情况来决定。 并取决于你是否更有可能将项目定义的代码是与使用该项目的代码分开还是放在一起。

source: <span class="caption">Listing 7-4: Calling a function using a relative path starting with super</span>
zh_cn: <span class="caption">示例7-4：使用以super开头的相对路径调用一个函数</span>

source: # Bringing Paths into Scope with the `use` Keyword
es: # Introducir Rutas con la Palabra Clave `use
zh_cn: # 使用 `use` 关键字将路径引入作用域

source: In Listing 7-5, we bring the `restaurant::front_of_house::hosting` module into the scope of the `eat_at_restaurant` function so we only have to specify `hosting::add_to_waitlist` to call the `add_to_waitlist` function in `eat_at_restaurant`.
zh_cn: 在示例7-5中，我们把`restaurant::front_of_house::hosting`模块带入到作用域内，所以我们只需要指定 `hosting::add_to_waitlist` 来调用`eat_at_restaurant`中的`add_to_waitlist` 函数。

source: <span class="caption">Listing 7-5: Bringing a module into scope with `use`</span>
zh_cn: <span class="caption">示例 7-5: 用 "使用 "将一个模块带入范围。 使用</span>

source: Note that `use` only creates the shortcut for the particular scope in which the `use` occurs. Listing 7-6 moves the `eat_at_restaurant` function into a new child module named `customer`, which is then a different scope than the `use` statement, so the function body won’t compile:
zh_cn: 注意 `use` 只能创建 `use` 所在的特定作用域内的短路径。示例 7-6 将 `eat_at_restaurant` 函数移到一个新的子模块中，这又是一个不同于 `use` 语句的作用域，所以函数体不能编译：

source: <span class="caption">Listing 7-6: A `use` statement only applies in the scope it’s in</span>
zh_cn: <span class="caption">示例7-6：一个 `use`语句只适用于它所在的作用域</span>

source: The compiler error shows that the shortcut no longer applies within the `customer` module:
es: El error del compilador muestra que el acceso directo ya no se aplica dentro del módulo módulo `customer`:
zh_cn: 编译器错误显示短路径不在适用于 `customer` 模块中：

source: ## Creating Idiomatic `use` Paths
es: ## Crear Rutas idiomáticas `use`
zh_cn: ## 创建惯用的 `use` 路径

source: In Listing 7-5, you might have wondered why we specified `use restaurant::front_of_house::hosting` and then called `hosting::add_to_waitlist` in `eat_at_restaurant` rather than specifying the `use` path all the way out to the `add_to_waitlist` function to achieve the same result, as in Listing 7-7.
zh_cn: 在示例6-5中，你可能想知道为什么我们指定`restaurant::front_of_house::hosting`，然后调用`eat_at_restaurant`中的`hosting::add_to_waitlist`，而不是通过指定一直到 `add_to_waitlist`函数的 `use` 路径来得到相同的结果，如示例7-7。

source: <span class="caption">Listing 7-7: Bringing the `add_to_waitlist` function into scope with `use`, which is unidiomatic</span>
zh_cn: <span class="caption">示例7-7：使用 `use` 将 `add_to_waitlist` 函数引入作用域，这并不符合习惯</span>

source: Although both Listing 7-5 and 6-7 accomplish the same task, Listing 7-5 is the idiomatic way to bring a function into scope with `use`. Bringing the function’s parent module into scope with `use` means we have to specify the parent module when calling the function. Specifying the parent module when calling the function makes it clear that the function isn’t locally defined while still minimizing repetition of the full path. The code in Listing 7-7 is unclear as to where `add_to_waitlist` is defined.
zh_cn: 尽管示例7-5和7-7都完成了相同的任务，但示例 7-5 是使用 use 将函数引入作用域的习惯用法。要想使用 `use` 将函数的父模块引入作用域，我们必须在调用函数时指定父模块，这样可以清晰地表明函数不是在本地定义的，同时使完整路径的重复度最小化。示例 7-7 中的代码不清楚 `add_to_waitlist` 是在哪里被定义的。

source: On the other hand, when bringing in structs, enums, traits, and other items with `use`, it’s idiomatic to specify the full path. Listing 7-8 shows the idiomatic way to bring the core library’s `ArrayTrait` trait into the scope.
zh_cn: 另一方面，使用 `use` 引入结构体、枚举和其他项时，习惯是指定它们的完整路径。示例 7-8 展示了将核心库的 `ArrayTrait` trait带入作用域。

source: <span class="caption">Listing 7-8: Bringing `ArrayTrait` into scope in an idiomatic way</span>
zh_cn: <span class="caption">示例7-8：将`ArrayTrait`引入作用域的习惯用法式</span>

source: There’s no strong reason behind this idiom: it’s just the convention that has emerged in the Rust community, and folks have gotten used to reading and writing Rust code this way. As Cairo shares many idioms with Rust, we follow this convention as well.
es: No hay ninguna razón de peso detrás de este modismo: es sólo la convención que ha surgido en la comunidad Rust y la gente se ha acostumbrado a leer y escribir código Rust de esta manera. Como Cairo comparte muchos modismos con Rust, nosotros también seguimos esta convención.
zh_cn: 这种习惯用法背后没有什么硬性要求：它只是一种惯例，人们已经习惯了以这种方式阅读和编写 Rust 代码。它只是在Rust社区中出现的惯例。 由于Cairo与Rust共享许多惯例，我们也遵循这一惯例。

source: The exception to this idiom is if we’re bringing two items with the same name into scope with `use` statements, because Cairo doesn’t allow that.
es: La excepción a este modismo es si estamos trayendo dos elementos con el mismo nombre con sentencias `use`, porque Cairo no lo permite.
zh_cn: 这个习惯用法有一个例外，那就是我们想使用 `use` 语句将两个具有相同名称的项带入作用域，因为Cairo不允许这样做。

source: ### Providing New Names with the `as` Keyword
es: ### Proporcionar nuevos nombres con la Palabra Clave `as`
zh_cn: ### 使用 as 关键字提供新的名称

source: There’s another solution to the problem of bringing two types of the same name into the same scope with `use`: after the path, we can specify `as` and a new local name, or _alias_, for the type. Listing 7-9 shows how you can rename an import with `as`:
zh_cn: 使用 `use` 将两个同名类型引入同一作用域这个问题还有另一个解决办法：在这个类型的路径后面，我们使用 `as` 指定一个新的本地名称或者别名（ _alias_ ）。示例7-9显示了如何用`as`重命名一个导入：

source: <span class="caption">Listing 7-9: Renaming a trait when it’s brought into scope with the `as` keyword</span>
zh_cn: <span class="caption">示例 7-9：使用 `as` 关键字重命名引入作用域的类型</span>

source: ### Importing multiple items from the same module
es: ### Importar varios elementos desde el mismo módulo
zh_cn: ### 从同一模块中导入多个项

source: When you want to import multiple items (like functions, structs or enums) from the same module in Cairo, you can use curly braces `{}` to list all of the items that you want to import. This helps to keep your code clean and easy to read by avoiding a long list of individual use statements.
es: Cuando quieras importar múltiples elementos (como funciones, structs o enums) del mismo módulo en Cairo, puede usar llaves `{}` para listar todos los los elementos que desea importar. Esto ayuda a mantener su código limpio y fácil de leer evitando una larga lista de sentencias use individuales.
zh_cn: 当你想从同一个模块中导入多个项（如函数、结构体或枚举）时， 你可以使用大括号`{}`来列出所有你想导入的项目。 避免了一长串单独的`use`有助于保持你的代码整洁和便于阅读。

source: <span class="caption">Listing 7-10: Importing multiple items from the same module</span>
zh_cn: <span class="caption">示例 7-10：从同一模块导入多个项</span>

source: ## Re-exporting Names in Module Files
es: ## Re-exportación de Nombres en Archivos de Módulo
zh_cn: ## 在模块文件中重导出名称

source: When we bring a name into scope with the `use` keyword, the name available in the new scope can be imported as if it had been defined in that code’s scope. This technique is called _re-exporting_ because we’re bringing an item into scope, but also making that item available for others to bring into their scope.
es: Cuando traemos un nombre al ámbito con la palabra clave `use`, el nombre disponible en el nuevo ámbito puede ser importado como si hubiera sido definido en el ámbito de ese código. Esta técnica se llama _re-exporting_ porque estamos trayendo un elemento al ámbito, pero también haciendo que ese elemento esté disponible para que otros lo introduzcan en su ámbito.
zh_cn: 当我们用`use`关键字将一个名字带入作用域时，在新的作用域中也能够正常使用这个名称，就好像它本来就在当前作用域一样。 这种技术被称为 重导出（ _re-exporting_ ），因为我们将一个项目带入作用域、但同时也使这个项目可以被其他人带入他们的作用域。

source: <span class="caption">Listing 7-11: Making a name available for any code to use from a new scope with `pub use`</span>
zh_cn: <span class="caption">示例 7-11: 通过 `pub use` 使名称可在新作用域中被导入至任何代码</span>

source: Before this change, external code would have to call the `add_to_waitlist` function by using the path `restaurant::front_of_house::hosting::add_to_waitlist()`. Now that this `use` has re-exported the `hosting` module from the root module, external code can now use the path `restaurant::hosting::add_to_waitlist()` instead.
es: Antes de este cambio, el código externo tenía que llamar a la función `add_to_waitlist` utilizando la ruta `restaurant::front_of_house::hosting::add_to_waitlist()`. Ahora que este `use` ha reexportado el módulo `hosting` desde el módulo raíz, el código externo puede usar la ruta `restaurant::hosting::add_to_waitlist()` en su lugar.
zh_cn: 在这个修改之前，外部代码需要使用路径 `restaurant::front_of_house::hosting::add_to_waitlist()` 来调用 `add_to_waitlist` 函数。 现在这个 `use` 从根模块重导出了 `hosting` 模块，外部代码现在可以使用路径 `restaurant::hosting::add_to_waitlist()` 。
