Repository: cairo-book/cairo-book
Catalog: po/*.po
Languages: es, id, ko, zh_cn

source: To put it briefly, one should think of an implementation of the above `HasComponent<T>` as saying: **“Contract whose state T has the upgradeable component”.**
id: Secara singkat, seseorang seharusnya memandang implementasi dari `HasComponent<T>` di atas sebagai berkata: **“Kontrak yang memiliki komponen yang dapat ditingkatkan untuk state T”.**
ko: 간단히 말하자면, 위의 `HasComponent<T>`의 구현을 생각해야 합니다. 이는 다음과 같이 말하는 것과 같습니다: **"상태 T를 가진 업그레이드 가능한 구성 요소를 가진 계약"**.

source: `Ownable` is annotated with the `embeddable_as(<name>)` attribute:
id: `Ownable` dianotasi dengan atribut `embeddable_as(<name>)`:
ko: `Ownable`은 `embeddable_as(<name>)` 속성으로 주석이 달렸습니다.

source: `embeddable_as` is similar to `embeddable`; it only applies to `impls` of `starknet::interface` traits and allows embedding this impl in a contract module. That said, `embeddable_as(<name>)` has another role in the context of components. Eventually, when embedding `OwnableImpl` in some contract, we expect to get an impl with the following functions:
id: `embeddable_as` mirip dengan `embeddable`; itu hanya berlaku untuk `impls` dari trait `starknet::interface` dan memungkinkan penyematan impl ini dalam modul kontrak. Meskipun demikian, `embeddable_as(<name>)` memiliki peran lain dalam konteks komponen. Pada akhirnya, ketika menyematkan `OwnableImpl` dalam suatu kontrak, kita berharap mendapatkan impl dengan fungsi-fungsi berikut:
ko: `embeddable_as`는 `embeddable`과 유사하며, `starknet::interface` 트레이트의 `impls`에만 적용되며, 이 `impl`을 계약 모듈에 포함시킬 수 있습니다. 그렇지만, `embeddable_as(<name>)`은 구성 요소의 문맥에서 다른 역할을 합니다. 어느 정도 시간이 지나면, 어떤 계약에 `OwnableImpl`을 포함시킬 때, 다음 함수를 가진 `impl`을 얻을 것으로 기대합니다:

source: Note that while starting with a function receiving the generic type `ComponentState<TContractState>`, we want to end up with a function receiving `ContractState`. This is where `embeddable_as(<name>)` comes in. To see the full picture, we need to see what is the impl generated by the compiler due to the `embeddable_as(Ownable)` annotation:
id: Perhatikan bahwa meskipun kita memulai dengan fungsi yang menerima tipe generik `ComponentState<TContractState>`, kita ingin berakhir dengan fungsi yang menerima `ContractState`. Inilah saatnya menggunakan `embeddable_as(<name>)`. Untuk melihat gambaran keseluruhan, kita perlu melihat impl yang dihasilkan oleh kompiler karena adanya anotasi `embeddable_as(Ownable)`:
ko: 제네릭 타입 `ComponentState<TContractState>`을 받는 함수로 시작하더라도, `ContractState`를 받는 함수로 끝내고 싶습니다. 여기서 `embeddable_as(<name>)`이 필요합니다. 전체 그림을 보기 위해서는 `embeddable_as(Ownable)` 어노테이션으로 생성된 컴파일러에 의한 구현을 살펴봐야 합니다.

source: Note that thanks to having an impl of `HasComponent<TContractState>`, the compiler was able to wrap our functions in a new impl that doesn’t directly know about the `ComponentState` type. `Ownable`, whose name we chose when writing `embeddable_as(Ownable)`, is the impl that we will embed in a contract that wants ownership.
id: Perhatikan bahwa berkat adanya impl dari `HasComponent<TContractState>`, kompiler dapat membungkus fungsi-fungsi kita dalam sebuah impl baru yang tidak langsung mengetahui tentang tipe `ComponentState`. `Ownable`, yang kita pilih saat menulis `embeddable_as(Ownable)`, adalah impl yang akan kita sematkan ke dalam kontrak yang ingin memiliki kepemilikan.
ko: `HasComponent<TContractState>`의 impl을 가지고 있기 때문에 컴파일러는 우리의 함수를 `ComponentState` 유형에 대해 직접 알지 못하는 새로운 impl로 래핑할 수 있었습니다. `Ownable`은 `embeddable_as(Ownable)`을 작성할 때 선택한 이름으로, 소유권을 원하는 계약에 포함할 impl입니다.

source: Contract Integration
ko: 계약 통합

source: We've seen how generic impls enable component reusability. Next let's see how a contract integrates a component.
id: Kita telah melihat bagaimana impl generik memungkinkan penggunaan kembali komponen. Selanjutnya, mari kita lihat bagaimana sebuah kontrak mengintegrasikan sebuah komponen.
ko: 일반 구현이 구성 요소의 재사용을 가능하게 하는 방법을 보았습니다. 다음으로 계약이 구성 요소를 통합하는 방법을 살펴봅시다.

source: The contract uses an **impl alias** to instantiate the component's generic impl with the concrete `ContractState` of the contract.
id: Kontrak menggunakan **alias impl** untuk menginisialisasi impl generik komponen dengan tipe konkret `ContractState` dari kontrak.
ko: 계약은 구성 요소의 일반 구현을 구체적인 `ContractState`로 인스턴스화하기 위해 **impl alias**를 사용합니다.

source: The above lines use the Cairo impl embedding mechanism alongside the impl alias syntax. We’re instantiating the generic `OwnableImpl<TContractState>` with the concrete type `ContractState`. Recall that `OwnableImpl<TContractState>` has the `HasComponent<TContractState>` generic impl parameter. An implementation of this trait is generated by the `component!` macro.
id: Baris-baris di atas menggunakan mekanisme penyematan impl Cairo bersamaan dengan sintaksis alias impl. Kami menginisialisasi generic `OwnableImpl<TContractState>` dengan tipe konkret `ContractState`. Ingat bahwa `OwnableImpl<TContractState>` memiliki parameter impl generik `HasComponent<TContractState>`. Implementasi trait ini dihasilkan oleh makro `component!`.
ko: 위의 라인들은 Cairo impl 임베딩 메커니즘을 사용하며 impl 별칭 구문과 함께 사용됩니다. 우리는 구체적인 타입 'ContractState'로 일반적인 `OwnableImpl<TContractState>`을 인스턴스화하고 있습니다. `OwnableImpl<TContractState>`은 `HasComponent<TContractState>` 일반적인 impl 매개변수를 가지고 있음을 기억하세요. 이 특성의 구현은 `component!` 매크로에 의해 생성됩니다.

source: Note that only the using contract could have implemented this trait since only it knows about both the contract state and the component state.
id: Perhatikan bahwa hanya kontrak yang menggunakan yang dapat mengimplementasikan trait ini karena hanya kontrak tersebut yang mengetahui tentang kedua status kontrak dan status komponen.
ko: 주의할 점은 사용 중인 계약만이 이 특성을 구현할 수 있다는 것입니다. 왜냐하면 계약 상태와 구성 요소 상태에 대해 알고 있는 것은 오직 그것 뿐이기 때문입니다.

source: This glues everything together to inject the component logic into the contract.
id: Ini menggabungkan semuanya untuk menyisipkan logika komponen ke dalam kontrak.
ko: 이것은 모든 것을 함께 붙여 계약에 구성 요소 논리를 주입합니다.
zh_cn: 这会将所有内容粘合在一起，以将组件逻辑注入到合约中。

source: Key Takeaways
ko: 주요 요점

source: Embeddable impls allow injecting components logic into contracts by adding entry points and modifying the contract ABI.
id: Impl yang dapat disematkan memungkinkan penyisipan logika komponen ke dalam kontrak dengan menambahkan titik masuk dan memodifikasi ABI kontrak.
ko: 임베더블 인플은 컴포넌트 로직을 계약에 주입할 수 있게 해주며, 진입점을 추가하고 계약 ABI를 수정함으로써 가능합니다.

source: The compiler automatically generates a `HasComponent` trait implementation when a component is used in a contract. This creates a bridge between the contract's state and the component's state, enabling interaction between the two.
id: Kompiler secara otomatis menghasilkan implementasi trait `HasComponent` ketika sebuah komponen digunakan dalam sebuah kontrak. Ini menciptakan jembatan antara status kontrak dan status komponen, memungkinkan interaksi di antara keduanya.
ko: 컴파일러는 컨트랙트에서 컴포넌트를 사용할 때 자동으로 `HasComponent` 트레이트 구현을 생성합니다. 이는 컨트랙트의 상태와 컴포넌트의 상태 사이에 다리를 만들어 두 개 사이의 상호작용을 가능하게 합니다.

source: Components encapsulate reusable logic in a generic, contract-agnostic way. Contracts integrate components through impl aliases and access them via the generated `HasComponent` trait.
id: Komponen mengemas logika yang dapat digunakan kembali dengan cara yang generik dan tidak tergantung pada kontrak tertentu. Kontrak mengintegrasikan komponen melalui alias implementasi dan mengaksesnya melalui trait yang dihasilkan `HasComponent`.
ko: 구성 요소는 일반적이고 계약에 중립적인 방식으로 재사용 가능한 로직을 캡슐화합니다. 계약은 구현 별칭을 통해 구성 요소를 통합하고 생성된 `HasComponent` 트레이트를 통해 액세스합니다.

source: Components build on embeddable impls by defining generic component logic that can be integrated into any contract wanting to use that component. Impl aliases instantiate these generic impls with the contract's concrete storage types.
id: Komponen membangun pada implementasi yang dapat disematkan dengan mendefinisikan logika komponen generik yang dapat diintegrasikan ke dalam setiap kontrak yang ingin menggunakan komponen tersebut. Alias implementasi menginisialisasi implementasi generik ini dengan tipe penyimpanan konkret dari kontrak.
ko: 구성 요소는 임베디드 구현을 기반으로 하며, 해당 구성 요소를 사용하려는 모든 계약에 통합할 수 있는 일반 구성 요소 논리를 정의함으로써 구현을 구축합니다. 구현 별칭은 이러한 일반 구현을 계약의 구체적인 저장 유형으로 인스턴스화합니다.

source: Testing components is a bit different than testing contracts. Contracts need to be tested against a specific state, which can be achieved by either deploying the contract in a test, or by simply getting the `ContractState` object and modifying it in the context of your tests.
ko: 컴포넌트를 테스트하는 것은 계약을 테스트하는 것과 약간 다릅니다. 계약은 특정 상태에 대해 테스트되어야 하며, 이는 테스트에서 계약을 배포하거나 단순히 `ContractState` 객체를 가져와 테스트 상황에서 수정함으로써 달성할 수 있습니다.

source: Components are a generic construct, meant to be integrated in contracts, that can't be deployed on their own and don't have a `ContractState` object that we could use. So how do we test them?
ko: 구성 요소는 계약에 통합되어야 하는 일반적인 구조물로, 자체적으로 배포할 수 없으며 사용할 수 있는 'ContractState' 객체가 없습니다. 그렇다면 어떻게 테스트해야 할까요?

source: Let's consider that we want to test a very simple component called "Counter", that will allow each contract to have a counter that can be incremented. The component is defined as follows:
ko: 우리가 "Counter"라고 불리는 매우 간단한 구성 요소를 테스트하려고 한다고 가정해 봅시다.이 구성 요소는 각 계약이 증가시킬 수 있는 카운터를 가지도록 할 것입니다. 이 구성 요소는 다음과 같이 정의됩니다:

source: Testing the component by deploying a mock contract
ko: 모의 계약을 배포하여 구성 요소를 테스트합니다.

source: The easiest way to test a component is to integrate it within a mock contract. This mock contract is only used for testing purposes, and only integrates the component you want to test. This allows you to test the component in the context of a contract, and to use a Dispatcher to call the component's entry points.
ko: 구성 요소를 테스트하는 가장 쉬운 방법은 모의 계약 내에서 통합하는 것입니다. 이 모의 계약은 테스트 목적으로만 사용되며 테스트하려는 구성 요소만 통합됩니다. 이를 통해 계약의 맥락에서 구성 요소를 테스트하고, 디스패처를 사용하여 구성 요소의 진입점을 호출할 수 있습니다.

source: We can define such a mock contract as follows:
ko: 우리는 그러한 가짜 계약을 다음과 같이 정의할 수 있습니다:

source: This contract is entirely dedicated to testing the `Counter` component. It embeds the component with the `component!` macro, exposes the component's entry points by annotating the impl aliases with `#[abi(embed_v0)]`.
ko: 이 계약은 `Counter` 구성 요소의 테스트에 완전히 전념되어 있습니다. `component!` 매크로를 사용하여 구성 요소를 포함하고, `#[abi(embed_v0)]`로 impl 별칭을 주석 처리하여 구성 요소의 진입점을 노출합니다.

source: We also need to define an interface that will be required to interact externally with this mock contract.
ko: 우리는 또한 이 가짜 계약과 외부 상호 작용이 필요한 인터페이스를 정의해야 합니다.

source: We can now write tests for the component by deploying this mock contract and calling its entry points, as we would with a typical contract.
ko: 이제 이 목업 계약을 배포하고 일반적인 계약과 같이 해당 엔트리 포인트를 호출하여 컴포넌트에 대한 테스트를 작성할 수 있습니다.

source: Testing components without deploying a contract
ko: 계약을 배포하지 않고 구성 요소를 테스트하기

source: In [Components under the hood](./ch99-01-05-01-components-under-the-hood.md), we saw that components leveraged genericity to define storage and logic that could be embedded in multiple contracts. If a contract embeds a component, a `HasComponent` trait is created in this contract, and the component methods are made available.
ko: [Components under the hood](./ch99-01-05-01-components-under-the-hood.md)에서 우리는 컴포넌트가 일반성을 활용하여 여러 계약에 임베드될 수 있는 저장소와 논리를 정의했다는 것을 보았습니다. 계약이 컴포넌트를 임베드하면 이 계약에 `HasComponent` 트레이트가 생성되고 컴포넌트 메소드가 사용 가능해집니다.

source: This informs us that if we can provide a concrete `TContractState` that implements the `HasComponent` trait to the `ComponentState` struct, should be able to directly invoke the methods of the component using this concrete `ComponentState` object, without having to deploy a mock.
ko: 이는 `HasComponent` 트레이트를 구현하는 구체적인 `TContractState`를 `ComponentState` 구조체에 제공할 수 있다면, 이 구체적인 `ComponentState` 객체를 사용하여 컴포넌트의 메서드를 직접 호출할 수 있어야 하며, 목을 배포할 필요 없이 가능함을 알려줍니다.

source: Let's see how we can do that by using type aliases. We still need to define a mock contract - let's use the same as above - but this time, we won't need to deploy it.
ko: 우리가 타입 별칭을 사용하여 그것을 어떻게 할 수 있는지 살펴보겠습니다. 여전히 목 계약을 정의해야 합니다 - 위에서와 같이 사용하겠습니다 - 하지만 이번에는 배포할 필요가 없을 것입니다.

source: First, we need to define a concrete implementation of the generic `ComponentState` type using a type alias. We will use the `MockContract::ContractState` type to do so.
ko: 먼저, 우리는 일반적인 `ComponentState` 유형의 구체적인 구현을 유형 별칭을 사용하여 정의해야 합니다. 이를 위해 `MockContract::ContractState` 유형을 사용할 것입니다.

source: // You can derive even `Default` on this type alias
ko: 이 타입 별칭에 대해서도 `Default`를 유도할 수 있습니다.

source: We defined the `TestingState` type as an alias of the `CounterComponent::ComponentState<MockContract::ContractState>` type. By passing the `MockContract::ContractState` type as a concrete type for `ComponentState`, we aliased a concrete implementation of the `ComponentState` struct to `TestingState`.
ko: 우리는 `TestingState` 유형을 `CounterComponent::ComponentState<MockContract::ContractState>` 유형의 별칭으로 정의했습니다. `MockContract::ContractState` 유형을 `ComponentState`의 구체적인 유형으로 전달함으로써, `ComponentState` 구조체의 구체적인 구현을 `TestingState`로 별칭 지정했습니다.

source: Because `MockContract` embeds `CounterComponent`, the methods of `CounterComponent` defined in the `CounterImpl` block can now be used on a `TestingState` object.
ko: `MockContract`이 `CounterComponent`를 포함하고 있기 때문에, `CounterImpl` 블록에서 정의된 `CounterComponent`의 메서드들이 이제 `TestingState` 객체에서 사용될 수 있습니다.

source: Now that we have made these methods available, we need to instantiate an object of type `TestingState`, that we will use to test the component. We can do so by calling the `component_state_for_testing` function, which automatically infers that it should return an object of type `TestingState`.
ko: 이러한 방법을 사용할 수 있게 되었으므로, `TestingState` 유형의 객체를 인스턴스화해야 합니다. 이 객체는 컴포넌트를 테스트하는 데 사용될 것입니다. `component_state_for_testing` 함수를 호출하여 이를 수행할 수 있습니다. 이 함수는 자동으로 `TestingState` 유형의 객체를 반환해야 한다는 것을 추론합니다.

source: We can even implement this as part of the `Default` trait, which allows us to return an empty `TestingState` with the `Default::default()` syntax.
ko: 우리는 심지어 `Default` 트레이트의 일부로 이를 구현할 수 있습니다. 이는 `Default::default()` 구문을 사용하여 빈 `TestingState`을 반환할 수 있게 해줍니다.

source: Let's summarize what we've done so far:
ko: 지금까지 한 일을 요약해 봅시다.

source: We defined a mock contract that embeds the component we want to test.
ko: 우리는 테스트하고 싶은 컴포넌트를 내장한 가짜 계약을 정의했습니다.

source: We defined a concrete implementation of `ComponentState<TContractState>` using a type alias with `MockContract::ContractState`, that we named `TestingState`.
ko: 우리는 `MockContract::ContractState`를 사용하여 `ComponentState<TContractState>`의 구체적인 구현을 정의했고, 이를 `TestingState`라고 이름 지었습니다.

source: We defined a function that uses `component_state_for_testing` to return a `TestingState` object.
ko: `component_state_for_testing`를 사용하여 `TestingState` 객체를 반환하는 함수를 정의했습니다.

source: We can now write tests for the component by calling its functions directly, without having to deploy a mock contract. This approach is more lightweight than the previous one, and it allows testing internal functions of the component that are not exposed to the outside world trivially.
ko: 이제 우리는 목 컨트랙트를 배포하지 않고도 컴포넌트의 함수를 직접 호출하여 테스트를 작성할 수 있습니다. 이 접근 방식은 이전 것보다 가벼우며, 외부 세계에 노출되지 않은 컴포넌트의 내부 함수를 쉽게 테스트할 수 있습니다.

source: Starknet contracts: ABIs and cross-contract interactions
id: Starknet contracts: ABIs dan cross-contract interactions
ko: Starknet 계약: ABIs 및 계약 간 상호 작용

source: Interactions between smart contracts are an important feature when creating complex decentralized applications, as it allows for composability and separation of concerns. This chapter sheds light on how to make contracts interact with each other.
id: Interaksi antara smart contract adalah fitur penting saat membuat aplikasi terdesentralisasi yang kompleks, karena ini memungkinkan untuk komposabilitas dan pemisahan kepentingan. Bab ini memberikan pandangan tentang cara membuat kontrak berinteraksi satu sama lain.
ko: 스마트 계약 간 상호 작용은 복잡한 분산 애플리케이션을 만들 때 중요한 기능이며, 이를 통해 구성 가능성과 관심사의 분리가 가능합니다. 이 장은 계약이 서로 상호 작용하는 방법에 대해 밝혀줍니다.
zh_cn: 在创建复杂的去中心化应用程序时，智能合约之间的交互是一项重要功能，因为它可以实现可组合性和关注点分离。本章将介绍如何实现合约之间的交互。

source: Specifically, you'll learn about ABIs, contract interfaces, the contract and library dispatchers and their low-level system call equivalents!
id: Secara khusus, Anda akan mempelajari tentang ABIs, antarmuka kontrak, dispatcher kontrak dan perpustakaan, serta setara panggilan sistem tingkat rendah mereka!
ko: 구체적으로는 ABIs, 계약 인터페이스, 계약 및 라이브러리 디스패처 및 그들의 저수준 시스템 호출 동등물에 대해 배우게 됩니다!
zh_cn: 具体来说，您将了解 ABI、合约接口、合约和库调度程序及其与底层系统调用等同程序！

source: ABIs and Contract Interfaces
id: ABIs dan Antarmuka kontrak
ko: ABIs 및 계약 인터페이스

source: Cross-contract interactions between smart contracts on a blockchain is a common practice which enables us to build flexible contracts that can speak with each other.
es: Las interacciones entre contratos inteligentes en una cadena de bloques, también conocidas como "cross-contract", son una práctica común que nos permite construir contratos flexibles que puedan comunicarse entre sí.
id: Interaksi Cross-contract pintar di sebuah blockchain adalah praktik umum yang memungkinkan kita membangun kontrak yang fleksibel dan dapat berkomunikasi satu sama lain.
ko: 블록체인 상의 스마트 계약 간 교차 계약 상호 작용은 서로 대화할 수 있는 유연한 계약을 구축할 수 있도록 하는 일반적인 실천법입니다.
zh_cn: 区块链上的智能合约之间的跨合约互动是一种常见的做法，它使我们能够建立灵活的合约，相互对话。

source: Achieving this on Starknet requires something we call an interface.
es: Para lograr esto en Starknet, se requiere algo que llamamos una interfaz.
id: Mencapai hal ini di Starknet membutuhkan sesuatu yang kita sebut sebagai antarmuka.
ko: 스타크넷에서 이를 달성하려면 우리가 인터페이스라고 부르는 것이 필요합니다.
zh_cn: 在Starknet上实现这一点需要我们称之为接口的东西。

source: ABI - Application Binary Interface
ko: ABI - 응용 프로그램 이진 인터페이스

source: On Starknet, the ABI of a contract is a JSON representation of the contract's functions and structures, giving anyone (or any other contract) the ability to form encoded calls to it. It is a blueprint that instructs how functions should be called, what input parameters they expect, and in what format.
id: Pada Starknet, ABI dari sebuah kontrak adalah representasi JSON dari fungsi dan struktur kontrak, memberikan kemampuan kepada siapa saja (atau kontrak lain) untuk membentuk panggilan yang dienkripsi kepadanya. Ini adalah panduan yang memberitahu cara fungsi harus dipanggil, parameter input apa yang diharapkan, dan dalam format apa.
ko: 스타크넷에서 계약의 ABI는 계약의 함수와 구조의 JSON 표현이며, 누구든지 (또는 다른 계약)이 인코딩된 호출을 형성할 수 있는 능력을 제공합니다. 이는 함수가 어떻게 호출되어야 하는지, 어떤 입력 매개변수를 예상하는지, 그리고 어떤 형식으로 하는지를 지시하는 청사진입니다.
zh_cn: 在Starknet上，合约的 ABI 是合约函数和结构的 JSON 表示，使任何人（或任何其他合约）都能对其进行编码调用。它是一个蓝图，指示如何调用函数、以及它们所需的输入参数和格式。

source: While we write our smart contract logics in high-level Cairo, they are stored on the VM as executable bytecodes which are in binary formats. Since this bytecode is not human readable, it requires interpretation to be understood. This is where ABIs come into play, defining specific methods which can be called to a smart contract for execution. Without an ABI, it becomes practically impossible for external actors to understand how to interact with a contract.
id: Meskipun kita menulis logika kontrak pintar kita dalam bahasa Cairo tingkat tinggi, mereka disimpan di VM sebagai bytecodes eksekusi yang berbentuk biner. Karena bytecode ini tidak dapat dibaca oleh manusia, diperlukan interpretasi untuk bisa dimengerti. Di sinilah ABIs berperan, dengan mendefinisikan metode-metode tertentu yang dapat dipanggil untuk menjalankan kontrak pintar. Tanpa ABI, menjadi praktis tidak mungkin bagi pelaku eksternal untuk memahami cara berinteraksi dengan kontrak.
ko: 우리가 스마트 계약 논리를 고수준의 카이로로 작성하는 동안, 이들은 이진 형식의 실행 가능한 바이트 코드로 VM에 저장됩니다. 이 바이트 코드는 사람이 읽을 수 없기 때문에 해석이 필요합니다. 여기서 ABI가 등장하여 실행을 위해 스마트 계약에 호출할 수 있는 특정 메서드를 정의합니다. ABI가 없으면 외부 주체가 계약과 상호 작용하는 방법을 이해하는 것이 사실상 불가능해집니다.
zh_cn: 虽然我们用高级Cairo语言编写智能合约逻辑，但它们在虚拟机上存储为二进制格式的可执行字节码。由于这种字节码不是人类可读的，因此需要解释才能理解。这就是 ABI 的作用所在，它定义了可以调用智能合约执行的特定方法。如果没有 ABI，外部参与者几乎不可能理解如何与合约交互。

source: ABIs are typically used in dApps frontends, allowing it to format data correctly, making it understandable by the smart contract and vice versa. When you interact with a smart contract through a block explorer like [Voyager](https://voyager.online/) or [Starkscan](https://starkscan.co/), they use the contract's ABI to format the data you send to the contract and the data it returns.
id: ABIs umumnya digunakan dalam frontend dApps, memungkinkannya memformat data dengan benar sehingga dapat dimengerti oleh kontrak pintar dan sebaliknya. Ketika Anda berinteraksi dengan kontrak pintar melalui penjelajah blok seperti [Voyager](https://voyager.online/) atau [Starkscan](https://starkscan.co/), mereka menggunakan ABI kontrak untuk memformat data yang Anda kirimkan ke kontrak dan data yang dikembalikan olehnya.
ko: ABIs는 일반적으로 dApps 프론트엔드에서 사용되며, 데이터를 올바르게 형식화하여 스마트 계약이 이해할 수 있도록 하고 그 반대로도 가능하게 합니다. [Voyager](https://voyager.online/)나 [Starkscan](https://starkscan.co/)과 같은 블록 익스플로러를 통해 스마트 계약과 상호 작용할 때, 그들은 계약의 ABI를 사용하여 보내는 데이터와 반환되는 데이터를 형식화합니다.
zh_cn: ABI 通常用于 dApps 前端，使其能够正确格式化数据，使智能合约能够理解数据，反之亦然。当你通过 [Voyager](https://voyager.online/) 或 [Starkscan](https://starkscan.co/) 等区块资源管理器与智能合约交互时，它们会使用合约的 ABI 来格式化你发送给合约的数据以及合约返回的数据。

source: Interface
ko: 인터페이스

source: The interface of a contract is a list of the functions it exposes publicly. It specifies the function signatures (name, parameters, visibility and return value) contained in a smart contract without including the function body.
id: Antarmuka kontrak adalah daftar fungsi yang diekspos secara publik oleh kontrak. Ini menentukan tanda tangan fungsi (nama, parameter, visibilitas, dan nilai kembalian) yang terkandung dalam kontrak pintar tanpa menyertakan tubuh fungsi.
ko: 계약의 인터페이스는 공개적으로 노출되는 함수 목록입니다. 이는 스마트 계약에 포함된 함수 시그니처(이름, 매개변수, 가시성 및 반환 값)를 함수 본문을 포함하지 않고 명시합니다.

source: Contract interfaces in Cairo are traits annotated with the `#[starknet::interface]` attribute. If you are new to traits, check out the dedicated chapter on [traits](./ch08-02-traits-in-cairo.md).
id: Antarmuka kontrak dalam Cairo adalah trait yang dianotasi dengan atribut `#[starknet::interface]`. Jika Anda baru mengenal trait, lihat bab khusus tentang [traits](./ch08-02-traits-in-cairo.md).
ko: 카이로의 계약 인터페이스는 `#[starknet::interface]` 속성이 지정된 트레이트입니다. 트레이트에 익숙하지 않은 경우 [traits](./ch08-02-traits-in-cairo.md) 전용 챕터를 확인해보세요.
zh_cn: 在Cairo中，合约接口是用 `#[starknet::interface]` 属性注解的 traits。如果你对 traits 还不熟悉，请查看专门介绍 [traits](./ch08-02-traits-in-cairo.md) 的章节。

source: One important specification is that this trait must be generic over the `TContractState` type. This is required for functions to access the contract's storage, so that they can read and write to it.
id: Spesifikasi penting adalah bahwa trait ini harus generik terhadap tipe `TContractState`. Ini diperlukan agar fungsi dapat mengakses penyimpanan kontrak, sehingga dapat membaca dan menulis ke dalamnya.
ko: 중요한 사양 중 하나는 이 특성이 `TContractState` 유형에 대해 일반적이어야 한다는 것입니다. 이는 함수가 계약의 저장소에 액세스할 수 있도록 하기 위해 필요하며, 그것을 읽고 쓸 수 있어야 합니다.
zh_cn: 一个重要的规范是，该trait必须是基于 `TContractState` 类型的泛型。函数访问想要合约存储空间必须基于此trait，这样函数才能读写合约。

source: Note: The contract constructor is not part of the interface. Nor are internal functions part of the interface.
id: Catatan: Konstruktor kontrak tidak termasuk dalam antarmuka. Begitu juga dengan fungsi internal yang bukan bagian dari antarmuka.
ko: 참고: 계약 생성자는 인터페이스의 일부가 아닙니다. 내부 함수도 인터페이스의 일부가 아닙니다.
