Repository: cairo-book/cairo-book
Catalog: po/*.po
Languages: es, id, ko, zh_cn

source: Before the loop, we declare a variable named `counter` and initialize it to `0`. Then we declare a variable named `result` to hold the value returned from the loop. On every iteration of the loop, we check whether the `counter` is equal to `10`, and then add `1` to the `counter` variable. When the condition is met, we use the `break` keyword with the value `counter * 2`. After the loop, we use a semicolon to end the statement that assigns the value to `result`. Finally, we print the value in `result`, which in this case is `20`.
id: Sebelum perulangan, kita mendeklarasikan variabel bernama `counter` dan menginisialisasinya dengan `0`. Kemudian kita mendeklarasikan variabel bernama `result` untuk menyimpan nilai yang dikembalikan dari perulangan. Pada setiap iterasi perulangan, kita memeriksa apakah `counter` sama dengan `10`, dan kemudian menambahkan `1` ke variabel `counter`. Ketika kondisi terpenuhi, kita menggunakan kata kunci `break` dengan nilai `counter * 2`. Setelah perulangan, kita menggunakan titik koma untuk mengakhiri pernyataan yang memberikan nilai ke `result`. Akhirnya, kita mencetak nilai dalam `result`, yang dalam hal ini adalah `20`.
ko: 루프 이전에 `counter`라는 변수를 선언하고 `0`으로 초기화합니다. 그런 다음 루프에서 반환된 값이 저장될 `result`라는 변수를 선언합니다. 루프의 각 반복에서 `counter`가 `10`과 같은지 확인한 후 `counter` 변수에 `1`을 더합니다. 조건이 충족되면 `counter * 2` 값을 사용하여 `break` 키워드를 사용합니다. 루프 이후에는 `result`에 값을 할당하는 문을 종결하는 세미콜론을 사용합니다. 마지막으로, 이 경우에는 `20`인 `result`의 값을 출력합니다.

source: Conditional Loops with `while`
ko: `while`를 사용한 조건부 루프

source: A program will often need to evaluate a condition within a loop. While the condition is `true`, the loop runs. When the condition ceases to be `true`, the program calls `break`, stopping the loop. It’s possible to implement behavior like this using a combination of `loop`, `if`, `else`, and `break`; you could try that now in a program, if you’d like. However, this pattern is so common that Cairo has a built-in language construct for it, called a `while` loop.
ko: 프로그램은 종종 루프 내에서 조건을 평가해야 할 수 있습니다. 조건이 `true`인 동안 루프가 실행됩니다. 조건이 `true`가 아니게 되면 프로그램은 `break`를 호출하여 루프를 중지합니다. `loop`, `if`, `else`, 그리고 `break`의 조합을 사용하여 이와 같은 동작을 구현하는 것이 가능합니다. 지금 프로그램에서 시도해 볼 수 있습니다. 그러나 이 패턴은 너무 흔해서 Cairo에는 `while` 루프라는 내장된 언어 구조가 있습니다.

source: In Listing 2-3, we use `while` to loop the program three times, counting down each time after printing the value of `number`, and then, after the loop, print a message and exit.
ko: 리스팅 2-3에서는 `while`을 사용하여 프로그램을 세 번 반복하며, 각 반복마다 `number`의 값을 출력한 후 카운트다운합니다. 그리고 루프 이후에 메시지를 출력하고 종료합니다.

source: "LIFTOFF!!!"
ko: "출발!!!"

source: Listing 2-3: Using a `while` loop to run code while a condition holds `true`
ko: 리스트 2-3: 조건이 참인 동안 코드를 실행하는 `while` 루프 사용하기

source: This construct eliminates a lot of nesting that would be necessary if you used `loop`, `if`, `else`, and `break`, and it’s clearer. While a condition evaluates to `true`, the code runs; otherwise, it exits the loop.
ko: 이 구조는 `loop`, `if`, `else`, `break`를 사용했을 때 필요한 중첩을 많이 제거하며 더 명확합니다. 조건이 `true`로 평가될 때 코드가 실행되고, 그렇지 않으면 루프를 종료합니다.

source: You made it! This was a sizable chapter: you learned about variables, data types, functions, comments, `if` expressions and loops! To practice with the concepts discussed in this chapter, try building programs to do the following:
id: Anda berhasil! Ini adalah bab yang cukup besar: Anda telah mempelajari tentang variabel, tipe data, fungsi, komentar, ekspresi `if`, dan perulangan! Untuk berlatih dengan konsep-konsep yang dibahas dalam bab ini, cobalah membuat program untuk melakukan hal-hal berikut:
ko: 당신이 성공했습니다! 이것은 상당한 챕터였습니다: 변수, 데이터 유형, 함수, 주석, `if` 표현식 및 루프에 대해 배웠습니다! 이 챕터에서 논의된 개념을 연습하기 위해 다음을 수행하는 프로그램을 만들어 보세요:

source: Generate the _n_\-th Fibonacci number.
id: Menghasilkan bilangan Fibonacci ke-_n_.
ko: _n_ 번째 피보나치 수를 생성하세요.

source: Compute the factorial of a number _n_.
id: Menghitung faktorial dari suatu bilangan _n_.
ko: 숫자 _n_ 의 팩토리얼을 계산하십시오.

source: Now, we’ll review the common collection types in Cairo in the next chapter.
id: Selanjutnya, kita akan meninjau jenis-jenis koleksi umum dalam Cairo pada bab berikutnya.
ko: 지금, 다음 장에서는 카이로의 일반적인 수집 유형을 검토할 것입니다.
zh_cn: 现在，我们将在下一章回顾 Cairo 中常见的集合类型。

source: Cairo provides a set of common collection types that can be used to store and manipulate data. These collections are designed to be efficient, flexible, and easy to use. This section introduces the primary collection types available in Cairo: Arrays and Dictionaries.
id: Cairo menyediakan serangkaian jenis koleksi umum yang dapat digunakan untuk menyimpan dan memanipulasi data. Koleksi-koleksi ini dirancang agar efisien, fleksibel, dan mudah digunakan. Bagian ini memperkenalkan jenis-jenis koleksi utama yang tersedia di Cairo: Array dan Dictionary.
ko: 카이로는 데이터를 저장하고 조작하는 데 사용할 수 있는 일반적인 컬렉션 유형을 제공합니다. 이러한 컬렉션은 효율적이고 유연하며 사용하기 쉽도록 설계되었습니다. 이 섹션에서는 카이로에서 사용할 수 있는 주요 컬렉션 유형인 배열과 사전을 소개합니다.
zh_cn: Cairo 提供了一组常用的集合类型，可用于存储和处理数据。这些集合设计得高效、灵活、易于使用。本节将介绍 Cairo 中可用的主要集合类型：数组和字典。

source: An array is a collection of elements of the same type. You can create and use array methods by using the `ArrayTrait` trait from the core library.
ko: 배열은 동일한 유형의 요소들의 모음입니다. 핵심 라이브러리에서 `ArrayTrait` 특성을 사용하여 배열 메서드를 생성하고 사용할 수 있습니다.

source: An important thing to note is that arrays have limited modification options. Arrays are, in fact, queues whose values can't be modified. This has to do with the fact that once a memory slot is written to, it cannot be overwritten, but only read from it. You can only append items to the end of an array and remove items from the front.
ko: 중요한 점은 배열이 수정 옵션이 제한적이라는 것입니다. 사실 배열은 값이 수정될 수 없는 큐입니다. 이는 한 번 메모리 슬롯에 쓰여지면 덮어쓸 수 없고 읽기만 가능하다는 사실과 관련이 있습니다. 배열의 끝에만 항목을 추가하고 앞에서만 항목을 제거할 수 있습니다.

source: Creating an Array
id: Membuat Array
ko: 배열 생성하기

source: Creating an array is done with the `ArrayTrait::new()` call. Here is an example of the creation of an array to which we append 3 elements:
ko: 배열을 생성하는 것은 `ArrayTrait::new()` 호출로 이루어집니다. 여기에는 3개의 요소를 추가하는 배열 생성 예제가 있습니다:

source: When required, you can pass the expected type of items inside the array when instantiating the array like this, or explicitly define the type of the variable.
id: Jika diperlukan, Anda dapat menyertakan tipe item yang diharapkan di dalam array saat menginstansiasi array seperti ini, atau secara eksplisit menentukan tipe variabel.
ko: 필요한 경우, 배열을 인스턴스화할 때 이와 같이 예상되는 항목 유형을 전달할 수 있거나 변수의 유형을 명시적으로 정의할 수 있습니다.
zh_cn: 需要时，你可以在实例化数组时像下面这样传递数组内部元素的预期类型，或者明确定义变量的类型。

source: Updating an Array
id: Memperbarui Array
ko: 배열 업데이트하기

source: Adding Elements
id: Menambahkan Elemen
ko: 요소 추가

source: To add an element to the end of an array, you can use the `append()` method:
id: Untuk menambahkan elemen ke akhir array, Anda dapat menggunakan metode `append()`:
ko: 배열 끝에 요소를 추가하려면 `append()` 메서드를 사용할 수 있습니다.
zh_cn: 要在一个数组的末尾添加一个元素，可以使用`append()`方法：

source: Removing Elements
id: Menghapus Elemen
ko: 요소 제거

source: You can only remove elements from the front of an array by using the `pop_front()` method. This method returns an `Option` that can be unwrapped, containing the removed element, or `Option::None` if the array is empty.
ko: 배열의 앞부분에서 요소를 제거하는 유일한 방법은 `pop_front()` 메서드를 사용하는 것입니다. 이 메서드는 제거된 요소를 포함하거나 배열이 비어있는 경우 `Option::None`을 반환하는 언랩될 수 있는 `Option`을 반환합니다.

source: "The first value is {}"
ko: "첫 번째 값은 {} 입니다"

source: The above code will print `The first value is 10` as we remove the first element that was added.
ko: 위의 코드는 '첫 번째 값은 10입니다'를 출력합니다. 왜냐하면 추가된 첫 번째 요소를 제거했기 때문입니다.

source: In Cairo, memory is immutable, which means that it is not possible to modify the elements of an array once they've been added. You can only add elements to the end of an array and remove elements from the front of an array. These operations do not require memory mutation, as they involve updating pointers rather than directly modifying the memory cells.
es: En Cairo, la memoria es inmutable, lo que significa que no es posible modificar los elementos de un array una vez que han sido añadidos. Sólo se pueden añadir elementos al final de un array y eliminar elementos de la parte frontal de un array. Estas operaciones no requieren mutación de memoria, ya que implican actualizar punteros en lugar de modificar directamente las celdas de memoria.
id: Dalam Cairo, memori bersifat imutabel, yang berarti bahwa tidak mungkin untuk memodifikasi elemen-elemen dari suatu array setelah mereka ditambahkan. Anda hanya dapat menambahkan elemen ke akhir array dan menghapus elemen dari depan array. Operasi-operasi ini tidak memerlukan mutasi memori, karena melibatkan pembaruan pointer daripada langsung memodifikasi sel-sel memori.
ko: 카이로에서는 메모리가 불변이기 때문에 배열 요소를 한 번 추가하면 수정할 수 없습니다. 배열의 끝에만 요소를 추가하거나 배열의 앞에서 요소를 제거할 수 있습니다. 이러한 작업은 메모리 변이를 필요로하지 않으며, 메모리 셀을 직접 수정하는 것이 아니라 포인터를 업데이트하는 것이기 때문입니다.
zh_cn: 在Cairo中，内存是不可改变的，这意味着一旦数组中的元素被添加，就不可能修改它们。你只能将元素添加到数组的末端，并从数组的前端移除元素。这些操作不需要内存突变，因为它们涉及到更新指针而不是直接修改内存单元。

source: Reading Elements from an Array
id: Membaca Elemen dari Array
ko: 배열에서 요소 읽기

source: To access array elements, you can use `get()` or `at()` array methods that return different types. Using `arr.at(index)` is equivalent to using the subscripting operator `arr[index]`.
es: Para acceder a los elementos de un array, puedes utilizar los métodos `get()` o `at()` que devuelven diferentes tipos. Utilizar `arr.at(index)` es equivalente a utilizar el operador de subíndice `arr[index]`.
id: Untuk mengakses elemen-elemen array, Anda dapat menggunakan metode array `get()` atau `at()` yang mengembalikan tipe yang berbeda. Menggunakan `arr.at(indeks)` setara dengan menggunakan operator subscripting `arr[indeks]`.
ko: 배열 요소에 액세스하려면 다른 유형을 반환하는 `get()` 또는 `at()` 배열 메서드를 사용할 수 있습니다. `arr.at(index)`를 사용하는 것은 배열 첨자 연산자 `arr[index]`를 사용하는 것과 동일합니다.
zh_cn: 为了访问数组元素，你可以使用`get()`或`at()`数组方法，它们返回不同的类型。使用`arr.at(index)`等同于使用下标操作符`arr[index]`。

source: `get()` method
ko: `get()` 메서드

source: The `get` function returns an `Option<Box<@T>>`, which means it returns an option to a Box type (Cairo's smart-pointer type) containing a snapshot to the element at the specified index if that element exists in the array. If the element doesn't exist, `get` returns `None`. This method is useful when you expect to access indices that may not be within the array's bounds and want to handle such cases gracefully without panics. Snapshots will be explained in more detail in the [References and Snapshots](ch04-02-references-and-snapshots.md) chapter.
id: Fungsi `get` mengembalikan `Option<Box<@T>>`, yang berarti ia mengembalikan opsi ke tipe Box (tipe smart-pointer Cairo) yang berisi snapshot dari elemen pada indeks yang ditentukan jika elemen tersebut ada dalam array. Jika elemennya tidak ada, `get` mengembalikan `None`. Metode ini berguna ketika Anda berharap mengakses indeks yang mungkin tidak berada dalam batas array dan ingin menangani kasus-kasus tersebut dengan lembut tanpa panic. Snapshot akan dijelaskan lebih detail dalam bab [References and Snapshots](ch04-02-references-and-snapshots.md).
ko: `get` 함수는 `Option<Box<@T>>`를 반환하며, 이는 배열에서 지정된 인덱스의 요소에 대한 스냅샷을 포함하는 상자 유형(Cairo의 스마트 포인터 유형)에 대한 옵션을 반환한다는 것을 의미합니다. 요소가 배열에 존재하는 경우 해당 요소의 스냅샷을 반환합니다. 요소가 존재하지 않는 경우 `get`은 `None`을 반환합니다. 이 메서드는 배열의 범위를 벗어날 수 있는 인덱스에 액세스할 것으로 예상되며, 패닉 없이 이러한 경우를 우아하게 처리하고 싶을 때 유용합니다. 스냅샷은 [참조 및 스냅샷](ch04-02-references-and-snapshots.md) 장에서 자세히 설명될 것입니다.
zh_cn: 函数 `get` 返回一个 `Option<Box<@T>>` ，这意味着它返回一个 Box 类型（Cairo的智能指针类型）的选项，其中包含指定索引处元素的快照（如果该元素存在于数组中）。如果元素不存在，`get`返回`None`。当你希望访问的索引可能不在数组的边界内，并希望优雅地处理这种情况而不引起panic时，该方法就非常有用。快照将在[引用和快照](ch04-02-references-and-snapshots.md)一章中详细解释。

source: Here is an example with the `get()` method:
es: He aquí un ejemplo con el método `get()`:
id: Berikut adalah contoh dengan metode `get()`:
ko: 다음은 `get()` 메서드를 사용한 예제입니다.
zh_cn: 下面是一个使用`get()`方法的例子：

source: // Change this value to see different results, what would happen if the index doesn't exist?
ko: 이 값을 변경하여 다른 결과를 확인할 수 있습니다. 인덱스가 존재하지 않는 경우에는 어떻게 될까요?

source: // Don't worry about * for now, if you are curious see Chapter 4.2 #desnap operator // It basically means "transform what get(idx) returned into a real value"
ko: // 지금은 *에 대해 걱정하지 마세요. 궁금하다면 4.2 장의 #desnap 연산자를 참조하세요. // 이는 기본적으로 "get(idx)가 반환한 것을 실제 값으로 변환"하는 것을 의미합니다.

source: "out of bounds"
ko: "out of bounds" in Korean is "경계를 넘어서다" or "경계 밖".

source: `at()` method
ko: `at()` 메소드

source: The `at` function, on the other hand, directly returns a snapshot to the element at the specified index using the `unbox()` operator to extract the value stored in a box. If the index is out of bounds, a panic error occurs. You should only use `at` when you want the program to panic if the provided index is out of the array's bounds, which can prevent unexpected behavior.
id: Fungsi `at`, di sisi lain, langsung mengembalikan snapshot dari elemen pada indeks yang ditentukan dengan menggunakan operator `unbox()` untuk mengekstrak nilai yang disimpan dalam sebuah box. Jika indeks berada di luar batas, terjadi kesalahan panic. Anda sebaiknya hanya menggunakan `at` ketika ingin program mengalami panic jika indeks yang diberikan berada di luar batas array, yang dapat mencegah perilaku yang tidak diinginkan.
ko: `at` 함수는 반면에 `unbox()` 연산자를 사용하여 상자에 저장된 값을 추출하는 방식으로 지정된 인덱스의 요소에 대한 스냅샷을 직접 반환합니다. 인덱스가 범위를 벗어나면 패닉 오류가 발생합니다. 배열의 범위를 벗어난 인덱스가 제공되면 프로그램이 패닉하도록 하려면 `at`만 사용해야 합니다. 이렇게 하면 예기치 않은 동작을 방지할 수 있습니다.
zh_cn: 另一方面，`at`函数直接返回一个快照到指定索引的元素，使用`unbox()`操作符来提取存储在一个盒子里的值。如果索引超出了范围，就会抛出错误(panic)。你应该只在希望索引超出数组的边界时抛出`panic`时，使用 `at`，这样可以防止意外的行为。

source: Here is an example with the `at()` method:
ko: 여기 `at()` 메소드를 사용한 예제가 있습니다.

source: In this example, the variable named `first` will get the value `0` because that is the value at index `0` in the array. The variable named `second` will get the value `1` from index `1` in the array.
id: Dalam contoh ini, variabel bernama `first` akan mendapatkan nilai `0` karena itu adalah nilai pada indeks `0` dalam array. Variabel bernama `second` akan mendapatkan nilai `1` dari indeks `1` dalam array.
ko: 이 예시에서 변수 `first`는 배열에서 인덱스 `0`에 있는 값인 `0`을 받게 됩니다. 변수 `second`는 배열에서 인덱스 `1`에 있는 값인 `1`을 받게 됩니다.

source: If you want to use the subscripting operator `arr[index]`, you will need to explicitly define the type of the elements of the array, otherwise it will not compile. For example:
ko: 만약 당신이 인덱싱 연산자 `arr[index]`를 사용하고 싶다면, 배열의 요소의 타입을 명시적으로 정의해야 합니다. 그렇지 않으면 컴파일되지 않습니다. 예를 들어:

source: In summary, use `at` when you want to panic on out-of-bounds access attempts, and use `get` when you prefer to handle such cases gracefully without panicking.
es: En resumen, usa `at` cuando quieras que el programa entre en pánico ante intentos de acceso fuera de los límites, y usa `get` cuando prefieras manejar estos casos con gracia sin entrar en pánico.
id: Secara ringkas, gunakan `at` ketika Anda ingin program mengalami panic pada percobaan akses di luar batas, dan gunakan `get` ketika Anda lebih suka menangani kasus-kasus tersebut dengan lembut tanpa panic.
ko: 요약하면, `at`은 경계를 벗어난 액세스 시도에 대해 패닉하고 싶을 때 사용하고, `get`은 그러한 경우를 패닉 없이 정중하게 처리하고 싶을 때 사용합니다.
zh_cn: 总之，当你想对越界访问尝试进行恐慌时，请使用`at`，而当你想优雅地处理这种情况而不恐慌时，请使用`get`。

source: Size related methods
id: Metode yang berkaitan dengan ukuran
ko: 크기 관련 메서드

source: To determine the number of elements in an array, use the `len()` method. The return value is of type `usize`.
ko: 배열의 요소 수를 결정하려면 `len()` 메서드를 사용하십시오. 반환 값은 `usize` 유형입니다.

source: If you want to check if an array is empty or not, you can use the `is_empty()` method, which returns `true` if the array is empty and `false` otherwise.
es: Si quieres comprobar si un array está vacío o no, puedes utilizar el método `is_empty()`, que devuelve `true` si el array está vacío y `false` en caso contrario.
id: Jika Anda ingin memeriksa apakah sebuah array kosong atau tidak, Anda dapat menggunakan metode `is_empty()`, yang mengembalikan nilai `true` jika array tersebut kosong dan `false` jika tidak.
ko: 배열이 비어 있는지 여부를 확인하려면 `is_empty()` 메서드를 사용할 수 있습니다. 이 메서드는 배열이 비어 있으면 `true`를 반환하고 그렇지 않으면 `false`를 반환합니다.
zh_cn: 如果你想检查一个数组是否为空，你可以使用`is_empty()`方法，如果数组为空，返回`true`，否则返回`false`。

source: `array!` macro
ko: `array!` 매크로

source: Sometimes, we need to create arrays with values that are already known at compile time. The basic way of doing that is redundant. You would first declare the array and then append each value one by one. `array!` is a simpler way of doing this task by combining the two steps. At compile-time, the compiler will expand the macro to generate the code that appends the items sequentially.
ko: 가끔은 컴파일 시 이미 알려진 값으로 배열을 생성해야 할 때가 있습니다. 이를 하는 기본적인 방법은 중복됩니다. 먼저 배열을 선언한 다음 각 값을 하나씩 추가해야 합니다. `array!`는 두 단계를 결합하여 이 작업을 더 간단하게 수행하는 방법입니다. 컴파일 시에 컴파일러는 매크로를 확장하여 항목을 순차적으로 추가하는 코드를 생성합니다.

source: Without `array!`:
ko: `array!` 없이:
zh_cn: 不使用 `array!`:

source: With `array!`:
id: Dengan `array!`:
ko: `array!`와 함께:
zh_cn: 使用 `array!`:

source: Storing multiple types with Enums
id: Menyimpan beberapa tipe data dengan Enums
ko: 열거형을 사용하여 여러 유형을 저장하기

source: If you want to store elements of different types in an array, you can use an `Enum` to define a custom data type that can hold multiple types. Enums will be explained in more detail in the [Enums and Pattern Matching](ch06-00-enums-and-pattern-matching.md) chapter.
id: Jika Anda ingin menyimpan elemen-elemen dari tipe data yang berbeda dalam sebuah array, Anda dapat menggunakan `Enum` untuk mendefinisikan tipe data kustom yang dapat menyimpan beberapa tipe. Enums akan dijelaskan lebih detail dalam bab [Enums and Pattern Matching](ch06-00-enums-and-pattern-matching.md).
ko: 다른 유형의 요소를 배열에 저장하려면 여러 유형을 보유할 수 있는 사용자 정의 데이터 유형을 정의하는 `Enum`을 사용할 수 있습니다. `Enum`은 [Enums and Pattern Matching](ch06-00-enums-and-pattern-matching.md) 장에서 자세히 설명됩니다.
zh_cn: 如果你想在一个数组中存储不同类型的元素，你可以使用`Enum`来定义一个可以容纳多种类型的自定义数据类型。更多关于Enum的细节见 [Enums and Pattern Matching](ch06-00-enums-and-pattern-matching.md) 这一章节。

source: Span
ko: 범위

source: `Span` is a struct that represents a snapshot of an `Array`. It is designed to provide safe and controlled access to the elements of an array without modifying the original array. Span is particularly useful for ensuring data integrity and avoiding borrowing issues when passing arrays between functions or when performing read-only operations (cf. [References and Snapshots](ch04-02-references-and-snapshots.md))
id: `Span` adalah sebuah struktur data yang mewakili snapshot dari sebuah `Array`. Dirancang untuk memberikan akses yang aman dan terkendali terhadap elemen-elemen dari sebuah array tanpa memodifikasi array aslinya. Span sangat berguna untuk memastikan integritas data dan menghindari masalah peminjaman ketika melewatkan array antar fungsi atau saat melakukan operasi baca saja (lihat [References and Snapshots](ch04-02-references-and-snapshots.md)).
ko: `Span`은 `Array`의 스냅샷을 나타내는 구조체입니다. 이는 원본 배열을 수정하지 않고 배열 요소에 안전하고 제어된 액세스를 제공하기 위해 설계되었습니다. Span은 특히 함수 간에 배열을 전달하거나 읽기 전용 작업을 수행할 때 데이터 무결성을 보장하고 빌림 문제를 피하기 위해 유용합니다. (참조: [참조 및 스냅샷](ch04-02-references-and-snapshots.md))
zh_cn: `Span`是一个结构，代表一个 "数组 "的快照（snapshot）。它被设计用来提供对数组元素的安全可控的访问，而不需要修改原始数组。Span对于确保数据的完整性和避免在函数间传递数组或执行只读操作时的借用问题特别有用（参见[引用和快照](ch04-02-references-and-snapshots.md))

source: All methods provided by `Array` can also be used with `Span`, with the exception of the `append()` method.
es: Todos los métodos proporcionados por `Array` también se pueden utilizar con `Span`, a excepción del método `append()`.
id: Semua metode yang disediakan oleh `Array` juga dapat digunakan dengan `Span`, kecuali metode `append()`.
ko: `Array`에서 제공하는 모든 메서드는 `Span`과 함께 사용할 수 있지만 `append()` 메서드는 예외입니다.
zh_cn: 除了 `append()`方法外，`Array`提供的其他所有方法都可以用于 `Span`。

source: Turning an Array into span
id: Mengubah sebuah Array menjadi span
ko: 배열을 span으로 변환하기

source: To create a `Span` of an `Array`, call the `span()` method:
id: Untuk membuat `Span` dari sebuah `Array`, panggil metode `span()`:
ko: `Array`의 `Span`을 만들려면 `span()` 메서드를 호출하십시오.
zh_cn: 要创建一个 `Array`的 `Span` ，请调用`span()`方法：

source: Cairo provides in its core library a dictionary-like type. The `Felt252Dict<T>` data type represents a collection of key-value pairs where each key is unique and associated with a corresponding value. This type of data structure is known differently across different programming languages such as maps, hash tables, associative arrays and many others.
id: Cairo menyediakan dalam pustaka intinya tipe data yang mirip dengan kamus (dictionary-like type). Tipe data `Felt252Dict<T>` mewakili kumpulan pasangan kunci-nilai dimana setiap kunci bersifat unik dan terkait dengan nilai yang sesuai. Jenis struktur data ini dikenal dengan berbagai istilah dalam bahasa pemrograman yang berbeda, seperti maps, hash tables, associative arrays, dan banyak yang lainnya.
ko: 카이로는 핵심 라이브러리에서 사전과 유사한 유형을 제공합니다. `Felt252Dict<T>` 데이터 유형은 각 키가 고유하고 해당 값과 연관된 키-값 쌍의 컬렉션을 나타냅니다. 이 유형의 데이터 구조는 맵, 해시 테이블, 연관 배열 등과 같이 다양한 프로그래밍 언어에서 다르게 알려져 있습니다.
zh_cn: Cairo在其核心库中提供了一个类似字典的类型。`Felt252Dict<T>` 数据类型表示键值对的集合，其中每个键都是唯一的，并与相应的值相关联。这种类型的数据结构在不同的编程语言中有不同的名称，如映射、哈希表、关联数组等。

source: The `Felt252Dict<T>` type is useful when you want to organize your data in a certain way for which using an `Array<T>` and indexing doesn't suffice. Cairo dictionaries also allow the programmer to easily simulate the existence of mutable memory when there is none.
id: Tipe `Felt252Dict<T>` berguna ketika Anda ingin mengatur data Anda dengan cara tertentu di mana penggunaan `Array<T>` dan pengindeksan tidak mencukupi. Kamus Cairo juga memungkinkan programmer untuk dengan mudah mensimulasikan keberadaan memori yang dapat diubah (mutable memory) ketika memori tersebut sebenarnya tidak ada.
ko: `Felt252Dict<T>` 유형은 `Array<T>` 및 인덱싱만으로는 충분하지 않은 특정 방식으로 데이터를 구성하고 싶을 때 유용합니다. 카이로 사전은 프로그래머가 변경 가능한 메모리의 존재를 쉽게 시뮬레이션할 수 있도록 합니다.
zh_cn: `Felt252Dict<T>` 类型在你想以某种方式组织数据而使用`Array<T>`和索引不能满足要求时非常有用。Cairo字典还允许程序员在内存非可变的情况下轻松地模拟可变内存。

source: Basic Use of Dictionaries
id: Penggunaan Dasar dari Kamus
ko: 사전의 기본 사용

source: It is normal in other languages when creating a new dictionary to define the data types of both key and value. In Cairo, the key type is restricted to `felt252`, leaving only the possibility to specify the value data type, represented by `T` in `Felt252Dict<T>`.
ko: 다른 언어에서 새로운 사전을 만들 때 키와 값의 데이터 유형을 정의하는 것은 일반적입니다. 카이로에서는 키 유형이 `felt252`로 제한되어 있어 값 데이터 유형을 지정하는 것만 가능하며, 이는 `Felt252Dict<T>`에서 `T`로 표시됩니다.

source: The core functionality of a `Felt252Dict<T>` is implemented in the trait `Felt252DictTrait` which includes all basic operations. Among them we can find:
id: Fungsi inti dari `Felt252Dict<T>` diimplementasikan dalam trait `Felt252DictTrait` yang mencakup semua operasi dasar. Di antara mereka, kita dapat menemukan:
ko: `Felt252Dict<T>`의 핵심 기능은 모든 기본 작업을 포함하는 `Felt252DictTrait` 트레이트에 구현되어 있습니다. 그 중에는 다음과 같은 것들이 있습니다:
zh_cn: `Felt252Dict<T>`的核心功能在trait `Felt252DictTrait`中实现，它包括所有的基本操作。在其中我们可以看到：

source: `insert(felt252, T) -> ()` to write values to a dictionary instance and
id: `insert(felt252, T) -> ()` untuk menulis nilai ke sebuah contoh kamus (dictionary) dan
ko: `insert(felt252, T) -> ()`을 사용하여 사전 인스턴스에 값을 작성합니다.

source: `get(felt252) -> T` to read values from it.
id: `get(felt252) -> T` untuk membaca nilai dari kamus tersebut.
ko: `get(felt252) -> T` 값을 읽어오려면 사용하세요.

source: These functions allow us to manipulate dictionaries like in any other language. In the following example, we create a dictionary to represent a mapping between individuals and their balance:
id: Fungsi-fungsi ini memungkinkan kita untuk memanipulasi kamus seperti dalam bahasa pemrograman lainnya. Pada contoh berikut, kita membuat sebuah kamus untuk merepresentasikan hubungan antara individu dan saldo mereka:
ko: 이러한 함수들을 사용하면 다른 어떤 언어에서와 마찬가지로 사전을 조작할 수 있습니다. 다음 예제에서는 개인과 그들의 잔액 간의 매핑을 나타내는 사전을 만듭니다.
zh_cn: 这些函数允许我们使用其他语言一样的方法来操作字典。在下面的示例中，我们创建一个字典来表示个体及其余额之间的映射：
