Repository: cairo-book/cairo-book
Catalog: po/*.po
Languages: es, id, ko, zh_cn

source: Writing both kinds of tests is important to ensure that the pieces of your library are doing what you expect them to, separately and together.
es: Escribir ambos tipos de pruebas es importante para asegurarse de que las piezas de su biblioteca estén haciendo lo que se espera de ellas, tanto separadas como juntas.
id: Menulis kedua jenis uji coba tersebut penting untuk memastikan bahwa bagian-bagian dari perpustakaan Anda melakukan apa yang Anda harapkan, baik secara terpisah maupun bersama-sama.
ko: 당신의 라이브러리 조각들이 당신이 기대하는 대로 개별적으로와 함께 작동하는지 확인하기 위해 두 종류의 테스트를 작성하는 것이 중요합니다.
zh_cn: 为了保证你的库能够按照你的预期运行，从独立和整体的角度编写这两类测试都是非常重要的。

source: Unit Tests
ko: 단위 테스트

source: The purpose of unit tests is to test each unit of code in isolation from the rest of the code to quickly pinpoint where code is and isn’t working as expected. You’ll put unit tests in the `src` directory in each file with the code that they’re testing.
es: El propósito de las pruebas unitarias es probar cada unidad de código en aislamiento del resto del código para identificar rápidamente dónde el código funciona y dónde no lo hace como se esperaba. Colocará las pruebas unitarias en el directorio `src` en cada archivo con el código que están probando.
id: Tujuan dari uji coba unit adalah untuk menguji setiap unit kode secara terisolasi dari bagian lain kode untuk dengan cepat menemukan di mana kode bekerja dan tidak bekerja sesuai harapan. Anda akan menempatkan uji coba unit di dalam direktori `src` pada setiap file dengan kode yang mereka uji.
ko: 단위 테스트의 목적은 코드의 각 단위를 다른 코드와 격리시켜 빠르게 코드가 예상대로 작동하지 않는 곳을 찾는 것입니다. 단위 테스트는 테스트하는 코드와 함께 각 파일의 `src` 디렉토리에 넣을 것입니다.
zh_cn: 单元测试的目的是在与其他部分隔离的环境中测试每一个单元的代码，以便于快速而准确地验证某个单元的代码功能是否符合预期。单元测试与他们要测试的代码共同存放在位于 src 目录下相同的文件中。

source: The convention is to create a module named tests in each file to contain the test functions and to annotate the module with `cfg(test)`.
es: La convención es crear un módulo llamado `tests` en cada archivo para contener las funciones de prueba y anotar el módulo con `cfg(test)`.
id: Konvensinya adalah membuat modul bernama tests di setiap file untuk menampung fungsi-fungsi uji coba dan memberi anotasi modul dengan `cfg(test)`.
ko: 관례적으로 각 파일에 테스트 함수를 포함하는 tests 모듈을 생성하고 모듈에 `cfg(test)` 주석을 달아야 합니다.
zh_cn: 规范是在每个文件中创建包含测试函数的 tests 模块，并使用 `cfg(test)` 标注模块。

source: The Tests Module and `#[cfg(test)]`
ko: 테스트 모듈과 `#[cfg(test)]`

source: The `#[cfg(test)]` annotation on the tests module tells Cairo to compile and run the test code only when you run `scarb cairo-test`, not when you run `cairo-run`. This saves compile time when you only want to build the library and saves space in the resulting compiled artifact because the tests are not included. You’ll see that because integration tests go in a different directory, they don’t need the `#[cfg(test)]` annotation. However, because unit tests go in the same files as the code, you’ll use `#[cfg(test)]` to specify that they shouldn’t be included in the compiled result.
id: Anotasi `#[cfg(test)]` pada modul uji coba memberitahu Cairo untuk mengompilasi dan menjalankan kode uji coba hanya saat Anda menjalankan `scarb cairo-test`, bukan saat Anda menjalankan `cairo-run`. Ini menghemat waktu kompilasi saat Anda hanya ingin membangun perpustakaan dan menghemat ruang dalam artefak hasil kompilasi karena uji coba tidak disertakan. Anda akan melihat bahwa karena uji coba integrasi berada di direktori yang berbeda, mereka tidak memerlukan anotasi `#[cfg(test)]`. Namun, karena uji coba unit berada dalam file yang sama dengan kode, Anda akan menggunakan `#[cfg(test)]` untuk menentukan bahwa mereka tidak harus disertakan dalam hasil yang dikompilasi.
ko: `#[cfg(test)]` 주석은 테스트 모듈에 대해 Cairo에게 `scarb cairo-test`를 실행할 때에만 테스트 코드를 컴파일하고 실행하도록 지시합니다. `cairo-run`을 실행할 때에는 실행되지 않습니다. 이는 라이브러리를 빌드할 때 컴파일 시간을 절약하고 테스트가 포함되지 않아 컴파일된 결과물의 공간을 절약합니다. 통합 테스트가 다른 디렉토리에 들어가기 때문에 `#[cfg(test)]` 주석이 필요하지 않습니다. 그러나 단위 테스트는 코드와 동일한 파일에 들어가므로 컴파일된 결과물에 포함되지 않아야 함을 지정하기 위해 `#[cfg(test)]`를 사용합니다.
zh_cn: 测试模块的 `#[cfg(test)]`注解告诉 Cairo 只在执行`scarb cairo-test` 时才编译和运行测试代码，而在运行 `cairo-run` 时不这么做。这在只希望构建库的时候可以节省编译时间，并且因为它们并没有包含测试，所以能减少编译产生的文件的大小。与之对应的集成测试因为位于另一个文件夹，所以它们并不需要 `#[cfg(test)]`注解。然而单元测试位于与源码相同的文件中，所以你需要使用 `#[cfg(test)]` 来指定他们不应该被包含进编译结果中。

source: Recall that when we created the new `adder` project in the first section of this chapter, we wrote this first test:
es: Recuerde que cuando creamos el nuevo proyecto `adder` en la primera sección de este capítulo, escribimos esta primera prueba:
id: Ingat bahwa ketika kita membuat proyek `adder` baru pada bagian pertama dari bab ini, kita menulis uji coba pertama ini:
ko: 이 장의 첫 번째 섹션에서 새 `adder` 프로젝트를 만들었을 때, 우리는 이 첫 번째 테스트를 작성했습니다.
zh_cn: 回顾一下，当我们在本章第一节创建新的`adder`项目时，我们写了这个测试：

source: The attribute `cfg` stands for configuration and tells Cairo that the following item should only be included given a certain configuration option. In this case, the configuration option is `test`, which is provided by Cairo for compiling and running tests. By using the `cfg` attribute, Cairo compiles our test code only if we actively run the tests with `scarb cairo-test`. This includes any helper functions that might be within this module, in addition to the functions annotated with `#[test]`.
id: Atribut `cfg` singkatan dari konfigurasi dan memberi tahu Cairo bahwa item berikutnya hanya akan disertakan dengan opsi konfigurasi tertentu. Dalam hal ini, opsi konfigurasinya adalah `test`, yang disediakan oleh Cairo untuk mengompilasi dan menjalankan uji coba. Dengan menggunakan atribut `cfg`, Cairo mengompilasi kode uji coba kita hanya jika kita secara aktif menjalankan uji coba dengan `scarb cairo-test`. Ini termasuk fungsi bantu apa pun yang mungkin ada dalam modul ini, selain fungsi-fungsi yang diberi anotasi `#[test]`.
ko: `cfg` 속성은 구성을 나타내며, Cairo에게 특정 구성 옵션이 주어진 경우에만 다음 항목을 포함해야 한다고 알려줍니다. 이 경우에는 구성 옵션이 `test`이며, 이는 테스트를 컴파일하고 실행하기 위해 Cairo에서 제공하는 것입니다. `cfg` 속성을 사용하여 Cairo는 `scarb cairo-test`로 테스트를 활성화한 경우에만 테스트 코드를 컴파일합니다. 이는 `#[test]`로 주석 처리된 함수뿐만 아니라 이 모듈 내에 있는 어떤 도우미 함수도 포함됩니다.
zh_cn: `cfg`属性代表配置，告诉Cairo只有在给定的配置选项的情况下才应该包含下面的项目。在本例中，配置选项是`test`，它由Cairo提供，用于编译和运行测试。通过使用`cfg`属性，Cairo只有在我们用`scarb cairo-test`主动运行测试时才会编译我们的测试代码。这包括任何可能在这个模块中的辅助函数，以及用`#[test]`标注的函数。

source: Integration Tests
ko: 통합 테스트

source: Integration tests use your library in the same way any other code would. Their purpose is to test whether many parts of your library work together correctly. Units of code that work correctly on their own could have problems when integrated, so test coverage of the integrated code is important as well. To create integration tests, you first need a `tests` directory.
es: Las pruebas de integración usan su biblioteca de la misma manera que cualquier otro código. Su propósito es probar si muchas partes de su biblioteca funcionan correctamente juntas. Las unidades de código que funcionan correctamente por sí mismas podrían tener problemas cuando se integran, por lo que también es importante tener cobertura de prueba del código integrado. Para crear pruebas de integración, primero necesita un directorio de `tests`.
id: Uji coba integrasi menggunakan perpustakaan Anda dengan cara yang sama seperti kode lainnya. Tujuan mereka adalah untuk menguji apakah banyak bagian dari perpustakaan Anda bekerja bersama dengan benar. Unit kode yang bekerja dengan benar secara independen bisa memiliki masalah saat diintegrasikan, sehingga cakupan uji dari kode terintegrasi juga penting. Untuk membuat uji coba integrasi, pertama-tama Anda memerlukan direktori `tests`.
ko: 통합 테스트는 다른 코드와 마찬가지로 라이브러리를 사용합니다. 그들의 목적은 여러 부분이 올바르게 함께 작동하는지 테스트하는 것입니다. 독립적으로 올바르게 작동하는 코드 단위들이 통합되었을 때 문제가 발생할 수 있으므로 통합된 코드의 테스트 커버리지도 중요합니다. 통합 테스트를 만들려면 먼저 `tests` 디렉토리가 필요합니다.
zh_cn: 集成测试对于你需要测试的库来说完全是外部的。同其他使用库的代码一样使用库文件，也就是说它们只能调用一部分库中的公有 API。集成测试的目的是测试库的多个部分能否一起正常工作。一些单独能正确运行的代码单元集成在一起也可能会出现问题，所以集成测试的覆盖率也是很重要的。为了创建集成测试，你需要先创建一个 `tests` 目录。

source: The `tests` Directory
id: `Tests` Directory
ko: `tests` 디렉토리

source: Filename: src/tests.cairo
ko: 파일 이름: src/tests.cairo

source: Enter the code in Listing 9-11 into the _src/tests/integration_tests.cairo_ file:
id: Masukkan kode dalam Listing 9-11 ke dalam file _src/tests/integration_tests.cairo_:
ko: 리스팅 9-11의 코드를 _src/tests/integration_tests.cairo_ 파일에 입력하세요.

source: "internal_adder failed"
ko: "내부 덧셈기 실패"

source: Filename: src/tests/integration_tests.cairo
ko: 파일 이름: src/tests/integration_tests.cairo

source: We need to bring our tested functions into each test file scope. For that reason we add `use adder::it_adds_two` at the top of the code, which we didn’t need in the unit tests.
id: Kita perlu membawa fungsi-fungsi yang diuji ke dalam ruang lingkup setiap file uji coba. Untuk alasan itu, kita tambahkan `use adder::it_adds_two` di bagian atas kode, yang tidak kita perlukan dalam uji coba unit.
ko: 우리는 각 테스트 파일 범위에 테스트된 함수를 가져와야 합니다. 이를 위해 코드 상단에 `use adder::it_adds_two`를 추가합니다. 이는 단위 테스트에서 필요하지 않았던 것입니다.
zh_cn: 我们需要在每个测试文件的作用域中引入被测试的函数。出于这个原因，我们在代码的顶部添加了`use adder::it_adds_two`，在单元测试中我们不需要这个。

source: Then, to run all of our integration tests, we can just add a filter to only run tests whose path contains "integration_tests".
id: Kemudian, untuk menjalankan semua uji coba integrasi kita, kita cukup menambahkan filter untuk hanya menjalankan uji coba yang jalurnya mengandung "integration_tests".
ko: 그럼, 모든 통합 테스트를 실행하려면, "integration_tests"를 포함하는 경로의 테스트만 실행하도록 필터를 추가할 수 있습니다.
zh_cn: 然后，为了运行我们所有的集成测试，我们可以添加一个过滤器来仅运行路径包含“integration_tests”的测试。

source: The result of the tests is the same as what we've been seeing: one line for each test.
es: El resultado de las pruebas es el mismo que hemos estado viendo: una línea por cada prueba.
id: Hasil dari uji coba tersebut sama seperti yang telah kita lihat sebelumnya: satu baris untuk setiap uji coba.
ko: 시험 결과는 우리가 계속 보던 것과 같습니다: 각 시험에 대해 한 줄씩입니다.
zh_cn: 测试的结果与我们之前看到的相同：每个测试一行。

source: Error handling
ko: 오류 처리

source: In this chapter, we will explore various error handling techniques provided by Cairo, which not only allow you to address potential issues in your code, but also make it easier to create programs that are adaptable and maintainable. By examining different approaches to managing errors, such as pattern matching with the Result enum, using the ? operator for more ergonomic error propagation, and employing the unwrap or expect methods for handling recoverable errors, you'll gain a deeper understanding of Cairo's error handling features. These concepts are crucial for building robust applications that can effectively handle unexpected situations, ensuring your code is ready for production.
es: En este capítulo, exploraremos varias técnicas de manejo de errores proporcionadas por Cairo, que no sólo te permiten tratar problemas potenciales en tu código, sino que también hacen más fácil crear programas que son adaptables y mantenibles. Examinando diferentes aproximaciones a la gestión de errores, como la concordancia de patrones con el enum Result, usando el operador ? para una propagación de errores más ergonómica, y empleando los métodos unwrap o expect para gestionar errores recuperables, obtendrá una comprensión más profunda de las características de gestión de errores de Cairo. Estos conceptos son cruciales para construir aplicaciones robustas que puedan manejar efectivamente situaciones inesperadas, asegurando que su código esté listo para producción.
id: Pada bab ini, kita akan menjelajahi berbagai teknik penanganan kesalahan yang disediakan oleh Cairo, yang tidak hanya memungkinkan Anda untuk mengatasi masalah potensial dalam kode Anda, tetapi juga membuat lebih mudah untuk membuat program yang dapat beradaptasi dan mudah dipelihara. Dengan memeriksa berbagai pendekatan dalam mengelola kesalahan, seperti pencocokan pola dengan enum Result, menggunakan operator ? untuk penyebaran kesalahan yang lebih ergonomis, dan menggunakan metode unwrap atau expect untuk penanganan kesalahan yang dapat dipulihkan, Anda akan mendapatkan pemahaman yang lebih mendalam tentang fitur penanganan kesalahan Cairo. Konsep-konsep ini penting untuk membangun aplikasi yang tangguh yang dapat mengatasi situasi yang tidak terduga dengan efektif, sehingga memastikan kode Anda siap untuk produksi.
ko: 이 장에서는 Cairo가 제공하는 다양한 오류 처리 기술을 탐색할 것입니다. 이 기술들은 당신이 코드에서 발생할 수 있는 잠재적인 문제를 해결할 뿐만 아니라, 적응 가능하고 유지보수 가능한 프로그램을 만드는 데 도움이 됩니다. Result enum을 사용한 패턴 매칭, 더 편리한 오류 전파를 위한 ? 연산자 사용, 복구 가능한 오류를 처리하기 위한 unwrap 또는 expect 메서드를 활용하는 등 다양한 오류 관리 접근 방식을 살펴봄으로써, Cairo의 오류 처리 기능에 대한 깊은 이해를 얻을 수 있을 것입니다. 이러한 개념들은 예기치 않은 상황을 효과적으로 처리할 수 있는 견고한 애플리케이션을 구축하는 데 중요하며, 코드가 프로덕션에 준비되어 있는지 확인하는 데 도움이 됩니다.
zh_cn: 在本章中，我们将探讨Cairo提供的各种错误处理技术，这些技术不仅能让你解决代码中的潜在问题，还能让你更容易创建易适应和易维护的程序。通过研究管理错误的不同方法，如用Result枚举进行模式匹配，使用 ? 操作符进行更人性化的错误传播，以及采用unwrap或expect方法来处理可恢复的错误，你将对Cairo的错误处理功能有更深入的了解。这些概念对于构建强大的应用程序至关重要，它可以有效地处理意外情况，确保你的代码可以用于生产环境。

source: In Cairo, unexpected issues may arise during program execution, resulting in runtime errors. While the panic function from the core library doesn't provide a resolution for these errors, it does acknowledge their occurrence and terminates the program. There are two primary ways that a panic can be triggered in Cairo: inadvertently, through actions causing the code to panic (e.g., accessing an array beyond its bounds), or deliberately, by invoking the panic function.
es: En Cairo, pueden surgir problemas inesperados durante la ejecución del programa, dando lugar a errores en tiempo de ejecución. Mientras que la función de pánico de la librería principal no proporciona una resolución para estos errores, sí reconoce su ocurrencia y termina el programa. Hay dos formas principales en las que se puede desencadenar un pánico en Cairo: inadvertidamente, a través de acciones que causan que el código entre en pánico (por ejemplo, acceder a un array más allá de sus límites), o deliberadamente, invocando la función de pánico.
id: Di Cairo, masalah yang tidak terduga dapat muncul selama eksekusi program, yang mengakibatkan kesalahan saat runtime. Meskipun fungsi panic dari pustaka inti tidak memberikan solusi untuk kesalahan ini, ia mengakui keberadaan kesalahan tersebut dan menghentikan program. Ada dua cara utama yang dapat menyebabkan panic terjadi di Cairo: secara tidak sengaja, melalui tindakan yang menyebabkan kode panic (misalnya, mengakses array melebihi batasnya), atau secara sengaja, dengan memanggil fungsi panic.
ko: 카이로에서 프로그램 실행 중 예기치 않은 문제가 발생하여 런타임 오류가 발생할 수 있습니다. 핵심 라이브러리의 패닉 함수는 이러한 오류에 대한 해결책을 제공하지는 않지만 발생을 인식하고 프로그램을 종료합니다. 카이로에서 패닉을 유발하는 두 가지 주요 방법이 있습니다: 우연히 코드가 패닉을 유발하는 작업을 통해(예: 배열의 범위를 벗어나 접근) 패닉이 발생하거나 의도적으로 패닉 함수를 호출함으로써 발생할 수 있습니다.
zh_cn: 在Cairo中，程序执行过程中可能会出现意外问题，导致运行时错误。虽然核心库中的panic函数并没有为这些错误提供解决方案，但它确实承认这些错误的发生并终止程序。在Cairo中，有两种主要的方式可以触发panic：无意地通过导致代码panic的行为（例如，访问一个超出其界限的数组），或故意地，通过调用panic函数。

source: When a panic occurs, it leads to an abrupt termination of the program. The `panic` function takes an array as an argument, which can be used to provide an error message and performs an unwind process where all variables are dropped and dictionaries squashed to ensure the soundness of the program to safely terminate the execution.
id: Ketika terjadi panic, itu mengakibatkan penghentian tiba-tiba dari program. Fungsi `panic` mengambil array sebagai argumen, yang dapat digunakan untuk menyediakan pesan kesalahan dan melakukan proses unwind di mana semua variabel dihapus dan kamus-kamus dirombak untuk memastikan keselamatan program agar dapat menghentikan eksekusi dengan aman.
ko: 패닉이 발생하면 프로그램이 갑작스럽게 종료됩니다. `panic` 함수는 배열을 인수로 취하며, 오류 메시지를 제공하고 프로그램의 안정성을 보장하기 위해 모든 변수가 삭제되고 딕셔너리가 압축되는 언바인드 프로세스를 수행하여 실행을 안전하게 종료합니다.
zh_cn: 当发生恐慌时，它会导致程序突然终止。`panic` 函数接受一个数组作为参数，可以用来提供错误消息，并执行一个解除过程，在这个过程中所有变量都会被丢弃，字典被压缩，以确保程序的健全性，安全地终止执行。

source: Here is how we can `panic` from inside a program and return the error code `2`:
es: Así es como podemos `panic` desde dentro de un programa y devolver el código de error `2`:
id: Berikut adalah cara kita dapat melakukan `panic` dari dalam sebuah program dan mengembalikan kode kesalahan `2`:
ko: 다음은 프로그램 내에서 `panic`을 일으키고 오류 코드 `2`를 반환하는 방법입니다:
zh_cn: 下面是我们如何在一个程序中`panic`并返回错误代码`2`：

source: "This line isn't reached"
ko: "이 줄은 도달되지 않았습니다."

source: Running the program will produce the following output:
es: La ejecución del programa producirá el siguiente resultado:
id: Menjalankan program akan menghasilkan keluaran berikut:
ko: 프로그램을 실행하면 다음과 같은 출력물이 생성됩니다.
zh_cn: 运行该程序将产生以下输出：

source: As you can notice in the output, the print statement is never reached, as the program terminates after encountering the `panic` statement.
es: Como se puede observar en la salida, la sentencia print nunca se alcanza, ya que el programa termina después de encontrar la sentencia `panic`.
id: Seperti yang dapat Anda perhatikan pada keluaran, pernyataan cetak tidak pernah tercapai, karena program berhenti setelah menemui pernyataan `panic`.
ko: 출력에서 알 수 있듯이, 프린트 문은 도달하지 않고 `panic` 문을 만나면 프로그램이 종료됩니다.
zh_cn: 正如你在输出中所注意到的，打印语句没有被执行，因为程序在遇到`panic`语句后就终止了。

source: An alternative and more idiomatic approach to panic in Cairo would be to use the `panic_with_felt252` function. This function serves as an abstraction of the array-defining process and is often preferred due to its clearer and more concise expression of intent. By using `panic_with_felt252`, developers can panic in a one-liner by providing a felt252 error message as an argument, making the code more readable and maintainable.
id: Pendekatan alternatif dan lebih idiomatik untuk panic dalam Cairo adalah dengan menggunakan fungsi `panic_with_felt252`. Fungsi ini berfungsi sebagai abstraksi dari proses definisi array dan sering dipilih karena penjelasan maksud yang lebih jelas dan ringkas. Dengan menggunakan `panic_with_felt252`, para pengembang dapat melakukan panic dalam satu baris dengan menyediakan pesan kesalahan felt252 sebagai argumen, membuat kode menjadi lebih mudah dibaca dan dipelihara.
ko: 카이로에서 패닉하는 대안적이고 더 관용적인 접근 방식은 `panic_with_felt252` 함수를 사용하는 것입니다. 이 함수는 배열 정의 프로세스의 추상화 역할을 하며 의도를 더 명확하고 간결하게 표현할 수 있어 선호됩니다. `panic_with_felt252`를 사용하면 개발자들은 felt252 오류 메시지를 인수로 제공하여 한 줄로 패닉할 수 있어 코드를 더 읽기 쉽고 유지보수하기 쉽게 만들 수 있습니다.
zh_cn: Cairo 中处理恐慌的另一种更符合习惯的方法是使用 `panic_with_felt252` 函数。这个函数作为定义数组过程的抽象，通常更受欢迎，因为它表达意图更清晰、更简洁。通过使用 `panic_with_felt252`，开发者可以通过提供一个 felt252 类型的错误消息作为参数，在一行代码中实现恐慌，使代码更易读和可维护。

source: Let's consider an example:
es: Veamos un ejemplo:
id: Mari kita pertimbangkan sebuah contoh:
ko: 예를 살펴보겠습니다:
zh_cn: 让我们来考察一个例子：

source: Executing this program will yield the same error message as before. In that case, if there is no need for an array and multiple values to be returned within the error, so `panic_with_felt252` is a more succinct alternative.
es: Ejecutando este programa se obtendrá el mismo mensaje de error que antes. En ese caso, si no hay necesidad de una matriz y múltiples valores a devolver dentro del error, por lo que `panic_with_felt252` es una alternativa más sucinta.
id: Menjalankan program ini akan menghasilkan pesan kesalahan yang sama seperti sebelumnya. Dalam kasus tersebut, jika tidak ada kebutuhan untuk sebuah array dan beberapa nilai yang akan dikembalikan dalam kesalahan, maka `panic_with_felt252` adalah alternatif yang lebih singkat.
ko: 이 프로그램을 실행하면 이전과 동일한 오류 메시지가 발생합니다. 이 경우, 오류 내에서 배열이나 여러 값이 반환될 필요가 없다면 `panic_with_felt252`가 더 간결한 대안입니다.
zh_cn: 执行这个程序会产生和之前一样的错误信息。在这种情况下，如果在返回错误是不需要一个数组和多个值，那么`panic_with_felt252`是一个更简洁的选择。

source: `panic!` macro
ko: `panic!` 매크로

source: `panic!` macro can be really helpful. The previous example returning the error code 2 shows how convenient `panic!` macro is. There is no need to create an array and pass it as argument like `panic` function.
ko: `panic!` 매크로는 정말로 유용할 수 있습니다. 이전 예제에서 오류 코드 2를 반환하는 것은 `panic!` 매크로가 얼마나 편리한지 보여줍니다. `panic` 함수처럼 배열을 생성하고 인수로 전달할 필요가 없습니다.

source: Unlike the `panic_with_felt252` function, using `panic!` allows the input, which is ultimately the panic error, to be a literal longer than 31 bytes. This is because `panic!` takes a string as parameter. For example, the following line of code will successfully compile:
ko: `panic_with_felt252` 함수와 달리 `panic!`을 사용하면 최종적으로 패닉 에러가 되는 입력이 31바이트보다 긴 글자열이 될 수 있습니다. 이는 `panic!`이 매개변수로 문자열을 받기 때문입니다. 예를 들어, 다음 코드 라인은 성공적으로 컴파일됩니다:

source: "the error for panic! macro is not limited to 31 characters anymore"
ko: "패닉! 매크로의 오류는 더 이상 31자로 제한되지 않습니다."

source: nopanic notation
ko: 노패닉 표기법

source: You can use the `nopanic` notation to indicate that a function will never panic. Only `nopanic` functions can be called in a function annotated as `nopanic`.
es: Puede utilizar la anotación `nopanic` para indicar que una función nunca entrará en pánico. Sólo las funciones `nopanic` pueden ser llamadas en una función anotada como `nopanic`.
id: Anda dapat menggunakan notasi `nopanic` untuk menunjukkan bahwa sebuah fungsi tidak akan pernah panic. Hanya fungsi-fungsi `nopanic` yang dapat dipanggil dalam sebuah fungsi yang diberi anotasi `nopanic`.
ko: `nopanic` 표기법을 사용하여 함수가 절대 패닉하지 않을 것임을 나타낼 수 있습니다. `nopanic` 함수만이 `nopanic`으로 주석이 달린 함수에서 호출될 수 있습니다.
zh_cn: 你可以使用`nopanic`记号来表示一个函数永远不会恐慌。只有 `nopanic`函数可以在标注为 `nopanic`的函数中被调用。

source: Example:
es: Ejemplo:
id: Contoh:
ko: 예시:
zh_cn: 例子:

source: Wrong example:
es: Ejemplo incorrecto:
ko: 잘못된 예시:
zh_cn: 错误的例子：

source: If you write the following function that includes a function that may panic you will get the following error:
es: Si escribes la siguiente función que incluye una función que puede entrar en pánico obtendrás el siguiente error:
id: Jika Anda menulis fungsi berikut yang mencakup sebuah fungsi yang mungkin panic, Anda akan mendapatkan pesan kesalahan berikut:
ko: 다음 함수를 작성하면 패닉을 유발할 수 있는 함수가 포함되어 있기 때문에 다음 오류가 발생합니다:
zh_cn: 如果你写了以下函数，其中包括一个可能会panic的函数，你会得到以下错误：

source: Note that there are two functions that may panic here, assert and equality.
es: Tenga en cuenta que hay dos funciones que pueden entrar en pánico aquí, assert e equality.
id: Perlu diingat bahwa ada dua fungsi yang mungkin panic di sini, yaitu assert dan equality.
ko: 여기서는 패닉할 수 있는 두 가지 함수가 있다는 점을 유의하십시오. assert 및 equality입니다.
zh_cn: 请注意，有两个函数可能会在这里发生panic，即断言和相等比较。

source: panic_with attribute
ko: 속성으로 패닉

source: You can use the `panic_with` attribute to mark a function that returns an `Option` or `Result`. This attribute takes two arguments, which are the data that is passed as the panic reason as well as the name for a wrapping function. It will create a wrapper for your annotated function which will panic if the function returns `None` or `Err`, the panic function will be called with the given data.
id: Anda dapat menggunakan atribut `panic_with` untuk menandai sebuah fungsi yang mengembalikan `Option` atau `Result`. Atribut ini mengambil dua argumen, yaitu data yang akan dipindahkan sebagai alasan panic serta nama untuk fungsi pembungkus. Ini akan membuat pembungkus untuk fungsi yang Anda anotasi yang akan panic jika fungsi tersebut mengembalikan `None` atau `Err`, fungsi panic akan dipanggil dengan data yang diberikan.
ko: `panic_with` 속성을 사용하여 `Option` 또는 `Result`를 반환하는 함수를 표시할 수 있습니다. 이 속성은 두 개의 인수를 취하는데, 이는 패닉 원인으로 전달되는 데이터와 래핑 함수의 이름입니다. 주석이 달린 함수에 대한 래퍼를 만들어주며, 만약 함수가 `None` 또는 `Err`를 반환하면 패닉이 발생하고 주어진 데이터와 함께 패닉 함수가 호출됩니다.
zh_cn: 您可以使用 `panic_with` 属性来标记返回 `Option` 或 `Result` 的函数。该属性需要两个参数，即作为 panic 原因传递的数据以及包装函数的名称。它将为您标注的函数创建一个封装函数，如果函数返回 `None` 或 `Err`，该封装函数将被调用，并使用给定的数据。

source: // this returns None
ko: // 이것은 None을 반환합니다

source: // this panics with 'value is 0'
ko: // 이것은 '값이 0입니다'로 패닉합니다.

source: Recoverable Errors with `Result`
id: Kesalahan yang Dapat Dipulihkan dengan `Result`
ko: `Result`를 사용한 복구 가능한 오류
