Repository: cairo-book/cairo-book
Catalog: po/*.po
Languages: es, id, ko, zh_cn

source: This is not an exhaustive list, but it covers some of the commonly used types and traits in contract development. For more details, refer to the official documentation and explore the available libraries and frameworks.
es: Esta no es una lista exhaustiva, pero cubre algunos de los tipos y rasgos más utilizados en el desarrollo de contratos. Para más detalles, consulta la documentación oficial y explora las bibliotecas y frameworks disponibles.
id: Ini bukan daftar lengkap, tetapi mencakup beberapa jenis dan trait yang umum digunakan dalam pengembangan kontrak. Untuk informasi lebih lanjut, lihat dokumentasi resmi dan jelajahi perpustakaan dan framework yang tersedia.
ko: 이것은 철저한 목록은 아니지만, 계약 개발에서 일반적으로 사용되는 몇 가지 유형과 특성을 다룹니다. 더 자세한 내용은 공식 문서를 참조하고 사용 가능한 라이브러리와 프레임워크를 탐색하십시오.

source: Appendix F: Installing the Cairo binaries
id: Lampiran F: Menginstal Biner Cairo
ko: 부록 F: Cairo 이진 파일 설치하기

source: If you want to have access to the Cairo binaries, for anything that you could not achieve by purely using Scarb you can install them by following the instructions below.
id: Jika Anda ingin mengakses biner Cairo, untuk hal-hal yang tidak dapat Anda capai hanya dengan menggunakan Scarb, Anda dapat menginstalnya dengan mengikuti petunjuk di bawah ini.
ko: 만약 당신이 Scarb만 사용해서 달성할 수 없는 것들을 위해 카이로 이진 파일에 접근하고 싶다면, 아래의 지시 사항을 따라 설치할 수 있습니다.
zh_cn: 如果你想访问Cairo二进制文件，以获取任何仅使用 Scarb 无法实现的功能时，可以按照下面的说明安装它们。

source: The first step is to install Cairo. We will download Cairo manually, using cairo repository or with an installation script. You’ll need an internet connection for the download.
es: El primer paso es instalar Cairo. Descargaremos Cairo manualmente, utilizando el repositorio de Cairo o un script de instalación. Necesitará una conexión a Internet para la descarga.
id: Langkah pertama adalah menginstal Cairo. Kami akan mengunduh Cairo secara manual, menggunakan repositori cairo atau dengan skrip instalasi. Anda akan memerlukan koneksi internet untuk mengunduhnya.
ko: 첫 번째 단계는 Cairo를 설치하는 것입니다. Cairo를 수동으로 다운로드하거나 cairo 저장소를 사용하거나 설치 스크립트를 사용하여 다운로드할 것입니다. 다운로드를 위해 인터넷 연결이 필요합니다.
zh_cn: 第一步是安装Cairo。我们可以手动下载Cairo（使用Cairo仓库）或使用安装脚本。下载过程需要连接互联网。 译注：如果你生活在中国大陆，你可能需要一些特殊方法来保证能够顺利安装所有的依赖包。

source: Prerequisites
ko: 필수 조건

source: First you will need to have Rust and Git installed.
es: Primero deberá tener Rust y Git instalados.
id: Pertama, Anda perlu menginstal Rust dan Git.
ko: 먼저 Rust와 Git을 설치해야 합니다.
zh_cn: 首先，你需要安装Rust和Git。

source: # Install stable Rust
ko: # 안정적인 Rust 설치

source: Install [Git](https://git-scm.com/).
ko: [Git](https://git-scm.com/)을(를) 설치하세요.
zh_cn: 安装[Git](https://git-scm.com/)。

source: Installing Cairo with a Script ([Installer](https://github.com/franalgaba/cairo-installer) by [Fran](https://github.com/franalgaba))
id: Menginstal Cairo dengan Skrip ([Installer](https://github.com/franalgaba/cairo-installer) oleh [Fran](https://github.com/franalgaba))
ko: 스크립트로 Cairo 설치하기 ([Installer](https://github.com/franalgaba/cairo-installer) by [Fran](https://github.com/franalgaba))

source: Install
ko: 설치하기

source: If you wish to install a specific release of Cairo rather than the latest head, set the `CAIRO_GIT_TAG` environment variable (e.g. `export CAIRO_GIT_TAG=v2.5.1`).
ko: 만약 최신 버전이 아닌 특정 버전의 Cairo를 설치하고 싶다면, `CAIRO_GIT_TAG` 환경 변수를 설정하세요 (예: `export CAIRO_GIT_TAG=v2.5.1`).

source: After installing, follow [these instructions](#set-up-your-shell-environment-for-cairo) to set up your shell environment.
es: Tras la instalación, sigue [estas instrucciones](#set-up-your-shell-environment-for-cairo) para configurar tu entorno shell.
id: Setelah menginstal, ikuti [instruksi ini](#set-up-your-shell-environment-for-cairo) untuk menyiapkan lingkungan shell Anda.
ko: 설치 후 [이 지침](#set-up-your-shell-environment-for-cairo)을 따라 쉘 환경을 설정하십시오.
zh_cn: 安装完毕后，按照[说明](#set-up-your-shell-environment-for-cairo)来设置你的shell环境。

source: Update
ko: 업데이트

source: Uninstall
ko: 삭제하기

source: Cairo is installed within `$CAIRO_ROOT` (default: ~/.cairo). To uninstall, just remove it:
es: Cairo se instala dentro de `$CAIRO_ROOT` (por defecto: ~/.cairo). Para desinstalarlo, basta con eliminarlo:
id: Cairo diinstal di dalam `$CAIRO_ROOT` (default: ~/.cairo). Untuk menghapusnya, cukup hapus:
ko: 카이로는 `$CAIRO_ROOT` 내에 설치되어 있습니다 (기본값: ~/.cairo). 제거하려면 그냥 삭제하면 됩니다.
zh_cn: Cairo被安装在`$CAIRO_ROOT`（默认：~/.cairo）。要卸载它，只需删除它：

source: then remove these three lines from .bashrc:
es: luego elimina estas tres líneas de .bashrc:
id: kemudian hapus tiga baris ini dari .bashrc:
ko: 그런 다음 .bashrc에서 이 세 줄을 제거하십시오.
zh_cn: 然后从.bashrc中删除这三行：

source: and finally, restart your shell:
es: y, por último, reinicia tu shell:
id: dan terakhir, restart shell Anda:
ko: 그리고 마지막으로, 쉘을 다시 시작하십시오.
zh_cn: 最后，重新启动你的shell：

source: Set up your shell environment for Cairo
id: Siapkan lingkungan shell Anda untuk Cairo
ko: 카이로를 위한 셸 환경을 설정하세요.

source: Define environment variable `CAIRO_ROOT` to point to the path where Cairo will store its data. `$HOME/.cairo` is the default. If you installed Cairo via Git checkout, we recommend to set it to the same location as where you cloned it.
id: Tentukan variabel lingkungan `CAIRO_ROOT` untuk menunjuk ke jalur tempat Cairo akan menyimpan datanya. `$HOME/.cairo` adalah nilai defaultnya. Jika Anda menginstal Cairo melalui Git checkout, kami sarankan untuk mengaturnya ke lokasi yang sama dengan tempat Anda mengkloningnya.
ko: Cairo가 데이터를 저장할 경로를 가리키도록 환경 변수 `CAIRO_ROOT`를 정의하십시오. `$HOME/.cairo`가 기본값입니다. Git checkout을 통해 Cairo를 설치한 경우, 클론한 위치와 동일한 위치로 설정하는 것을 권장합니다.

source: Add the `cairo-*` executables to your `PATH` if it's not already there
id: Tambahkan eksekutor `cairo-*` ke `PATH` Anda jika belum ada
ko: `cairo-*` 실행 파일을 `PATH`에 추가하십시오. 이미 추가되어 있지 않다면.

source: The below setup should work for the vast majority of users for common use cases.
es: La siguiente configuración debería funcionar para la gran mayoría de usuarios en casos de uso comunes.
id: Penyiapan di bawah ini seharusnya berfungsi untuk sebagian besar pengguna untuk kasus penggunaan umum.
ko: 아래 설정은 일반적인 사용 사례에 대부분의 사용자에게 적합해야 합니다.
zh_cn: 下面的设置应该适用于绝大多数用户的一般使用情况。

source: For **bash**:
id: Untuk **bash**:
ko: **bash**에 대해:

source: Stock Bash startup files vary widely between distributions in which of them source which, under what circumstances, in what order and what additional configuration they perform. As such, the most reliable way to get Cairo in all environments is to append Cairo configuration commands to both `.bashrc` (for interactive shells) and the profile file that Bash would use (for login shells).
id: File startup Bash standar bervariasi secara luas antara distribusi dalam hal sumber mana yang digunakan di bawah keadaan apa, urutan apa, dan konfigurasi tambahan apa yang mereka lakukan. Oleh karena itu, cara paling andal untuk mendapatkan Cairo di semua lingkungan adalah dengan menambahkan perintah konfigurasi Cairo ke kedua `.bashrc` (untuk shell interaktif) dan file profil yang akan digunakan Bash (untuk shell login).
ko: 주식 Bash 시작 파일은 어떤 배포판에서 어떤 것을 소스로 사용하는지, 어떤 상황에서, 어떤 순서로, 어떤 추가 구성을 수행하는지에 따라 크게 다릅니다. 따라서 모든 환경에서 Cairo를 가장 신뢰할 수 있는 방법은 `.bashrc` (대화형 셸용)과 Bash가 사용할 프로필 파일에 Cairo 구성 명령을 추가하는 것입니다.

source: First, add the commands to `~/.bashrc` by running the following in your terminal:
id: Pertama, tambahkan perintah-perintah ke `~/.bashrc` dengan menjalankan perintah berikut di terminal Anda:
ko: 먼저 터미널에서 다음을 실행하여 `~/.bashrc`에 명령을 추가하십시오:

source: Then, if you have `~/.profile`, `~/.bash_profile` or `~/.bash_login`, add the commands there as well. If you have none of these, add them to `~/.profile`.
id: Kemudian, jika Anda memiliki `~/.profile`, `~/.bash_profile`, atau `~/.bash_login`, tambahkan perintah di sana juga. Jika Anda tidak memiliki yang satupun dari ini, tambahkan ke `~/.profile`.
ko: 그런 다음, `~/.profile`, `~/.bash_profile` 또는 `~/.bash_login` 파일이 있다면 해당 파일에도 명령을 추가하십시오. 이러한 파일이 없는 경우 `~/.profile`에 추가하십시오.

source: to add to `~/.profile`:
id: untuk ditambahkan ke `~/profile`:
ko: `~/.profile`에 추가하려면:

source: to add to `~/.bash_profile`:
id: untuk ditambahkan ke `~/.bash_profile`:
ko: `~/.bash_profile`에 추가하려면:

source: For **Zsh**:
id: Untuk **Zsh**:
ko: **Zsh**에 대해:

source: If you wish to get Cairo in non-interactive login shells as well, also add the commands to `~/.zprofile` or `~/.zlogin`.
id: Jika Anda ingin mendapatkan Cairo di shell login non-interaktif juga, tambahkan perintah ke `~/.zprofile` atau `~/.zlogin` juga.
ko: 원하신다면 Cairo를 비대화식 로그인 쉘에서도 사용하려면 `~/.zprofile` 또는 `~/.zlogin`에 명령어를 추가하세요.

source: If you have Fish 3.2.0 or newer, execute this interactively:
id: Jika Anda menggunakan Fish 3.2.0 atau yang lebih baru, jalankan ini secara interaktif:
ko: Fish 3.2.0 이나 그 이상의 버전을 사용 중이라면, 이를 대화식으로 실행하십시오:

source: Otherwise, execute the snippet below:
id: Jika tidak, jalankan potongan kode di bawah ini:
ko: 그렇지 않으면, 아래 코드 조각을 실행하십시오.

source: In MacOS, you might also want to install [Fig](https://fig.io/) which provides alternative shell completions for many command line tools with an IDE-like popup interface in the terminal window. (Note that their completions are independent from Cairo's codebase so they might be slightly out of sync for bleeding-edge interface changes.)
id: Di MacOS, Anda mungkin juga ingin menginstal [Fig](https://fig.io/) yang menyediakan kelengkapan shell alternatif untuk banyak perangkat baris perintah dengan antarmuka popup mirip IDE di jendela terminal. (Perhatikan bahwa kelengkapannya independen dari kode sumber Cairo sehingga mungkin sedikit tidak sinkron untuk perubahan antarmuka terbaru.)
ko: 맥OS에서는 터미널 창에서 IDE와 유사한 팝업 인터페이스로 많은 명령 줄 도구에 대한 대체 쉘 완성을 제공하는 [Fig](https://fig.io/)를 설치할 수도 있습니다. (그들의 완성은 카이로의 코드베이스와 독립적이므로 최신 인터페이스 변경 사항에 대해 약간 동기화되지 않을 수 있음에 유의하십시오.)

source: Restart your shell
id: Mulai ulang shell Anda
ko: 셸을 다시 시작하세요.

source: for the `PATH` changes to take effect.
es: para que los cambios en el `PATH` surtan efecto.
id: agar perubahan pada `PATH` dapat berlaku.
ko: `PATH` 변경 사항이 적용되려면.
zh_cn: 以使 `PATH`的改变生效。

source: Installing Cairo Manually ([Guide](https://github.com/auditless/cairo-template) by [Abdel](https://github.com/abdelhamidbakhta))
id: Memasang Cairo secara Manual ([Panduan](https://github.com/auditless/cairo-template) oleh [Abdel](https://github.com/abdelhamidbakhta))
ko: 수동으로 Cairo 설치하기 ([가이드](https://github.com/auditless/cairo-template) by [Abdel](https://github.com/abdelhamidbakhta))

source: Step 1: Install Cairo 1.0
id: Langkah 1: Pasang Cairo 1.0
ko: 단계 1: Cairo 1.0 설치하기

source: If you are using an x86 Linux system and can use the release binary, download Cairo here: <https://github.com/starkware-libs/cairo/releases>.
es: Si utiliza un sistema Linux x86 y puede utilizar el binario de lanzamiento, descargue Cairo aquí:<https://github.com/starkware-libs/cairo/releases>.
id: Jika Anda menggunakan sistem x86 Linux dan dapat menggunakan biner rilis, unduh Cairo di sini: <https://github.com/starkware-libs/cairo/releases>.
ko: 만약 x86 리눅스 시스템을 사용하고 릴리즈 바이너리를 사용할 수 있다면, Cairo를 다운로드하십시오: <https://github.com/starkware-libs/cairo/releases>.
zh_cn: 如果你使用的是 x86 Linux 系统，并且可以使用发布的二进制文件，请在这里下载Cairo：<https://github.com/starkware-libs/cairo/releases>。

source: For everyone else, we recommend compiling Cairo from source as follows:
es: Para todos los demás, recomendamos compilar Cairo desde el código fuente de la siguiente manera:
id: Bagi semua orang lainnya, kami sarankan untuk mengompilasi Cairo dari sumber sebagai berikut:
ko: 다른 모든 사람들에게는, Cairo를 다음과 같이 소스에서 컴파일하는 것을 권장합니다.
zh_cn: 对于其他用户，我们建议从源码编译 Cairo，如下所示：

source: # Start by defining environment variable CAIRO_ROOT
id: # Mulai dengan mendefinisikan variabel lingkungan CAIRO_ROOT
ko: # CAIRO_ROOT 환경 변수를 정의하여 시작하세요.

source: # Create .cairo folder if it doesn't exist yet
id: # Buat folder .cairo jika belum ada
ko: # 아직 존재하지 않는 경우 .cairo 폴더를 만듭니다.

source: # Clone the Cairo compiler in $CAIRO_ROOT (default root)
id: # Clone kompilator Cairo di $CAIRO_ROOT (root default)
ko: # Cairo 컴파일러를 $CAIRO_ROOT(기본 루트)에 복제합니다.

source: # OPTIONAL/RECOMMENDED: If you want to install a specific version of the compiler # Fetch all tags (versions)
id: # OPSIONAL/Disarankan: Jika Anda ingin menginstal versi tertentu dari kompilator # Ambil semua tag (versi)
ko: # 선택 사항/권장 사항: 특정 버전의 컴파일러를 설치하려면 # 모든 태그(버전)을 가져옵니다

source: # View tags (you can also do this in the cairo compiler repository)
id: # Lihat tag (Anda juga dapat melakukannya di repositori kompilator Cairo)
ko: # 태그 보기 (카이로 컴파일러 저장소에서도 이 작업을 수행할 수 있습니다)

source: # Checkout the version you want
id: # Periksa versi yang Anda inginkan
ko: 당신이 원하는 버전을 확인하세요.

source: # Generate release binaries
id: # Menghasilkan Biner Rilis
ko: 릴리스 이진 파일 생성

source: **NOTE: Keeping Cairo up to date**
es: **NOTA: Mantener Cairo actualizado**
id: **CATATAN: Menjaga Cairo Tetap di versi Terbaru**
ko: **참고: 카이로 최신 상태 유지하기**
zh_cn: **注意：保持Cairo已更新到最新版本**

source: Now that your Cairo compiler is in a cloned repository, all you will need to do is pull the latest changes and rebuild as follows:
id: Sekarang kompilator Cairo Anda berada di dalam repositori yang telah di-kloning, yang perlu Anda lakukan adalah menarik perubahan terbaru dan membangun kembali seperti berikut:
ko: 이제 카이로 컴파일러가 복제된 저장소에 있으므로, 당신이 해야 할 일은 최신 변경 사항을 가져오고 다음과 같이 다시 빌드하는 것뿐입니다:

source: Step 2: Add Cairo 1.0 executables to your path
id: Langkah 2: Tambahkan eksekutor Cairo 1.0 ke path Anda
ko: 단계 2: 카이로 1.0 실행 파일을 경로에 추가하세요.

source: **NOTE: If installing from a Linux binary, adapt the destination path accordingly.**
es: **NOTA: Si instala desde un binario Linux, adapte la ruta de destino en consecuencia
id: **CATATAN: Jika menginstal dari sebuah biner Linux, sesuaikan jalur tujuan (destination path) sesuai kebutuhan.**
ko: **참고: Linux 바이너리에서 설치하는 경우, 대상 경로를 적절히 조정하십시오.**
zh_cn: **注意：如果你是在Linux编译的二进制文件，请相应调整目标路径**

source: Step 3: Setup Language Server
id: Langkah 3: Menyiapkan Language Server
ko: 3단계: 언어 서버 설정

source: VS Code Extension
ko: VS Code 확장 프로그램

source: If you have the previous Cairo 0 extension installed, you can disable/uninstall it.
id: Jika Anda sudah menginstal ekstensi Cairo 0 sebelumnya, Anda dapat menonaktifkannya/menghapusnya.
ko: 이전 Cairo 0 확장 프로그램을 설치했을 경우, 비활성화/제거할 수 있습니다.

source: Install the Cairo 1 extension for proper syntax highlighting and code navigation. You can find the link to the extension [here](https://marketplace.visualstudio.com/items?itemName=starkware.cairo1&ssr=false), or just search for "Cairo 1.0" in the VS Code marketplace.
id: Instal ekstensi Cairo 1 untuk penyorotan sintaks yang tepat dan navigasi kode yang baik. Anda dapat menemukan tautan ke ekstensi [di sini](https://marketplace.visualstudio.com/items?itemName=starkware.cairo1&ssr=false), atau cukup cari "Cairo 1.0" di marketplace VS Code.
ko: 올바른 구문 강조와 코드 탐색을 위해 Cairo 1 확장 프로그램을 설치하세요. 확장 프로그램 링크는 [여기](https://marketplace.visualstudio.com/items?itemName=starkware.cairo1&ssr=false)에서 찾을 수 있습니다. 또는 VS Code Marketplace에서 "Cairo 1.0"을 검색하세요.

source: The extension will work out of the box once you will have [Scarb](./ch01-03-hello-scarb.md) installed.
id: Ekstensi ini akan berfungsi secara langsung begitu Anda telah menginstal [Scarb](./ch01-03-hello-scarb.md).
ko: 확장 프로그램은 설치된 후 즉시 작동합니다.

source: Cairo Language Server without Scarb
id: Cairo Language Server tanpa Scarb
ko: Scarb 없는 카이로 언어 서버

source: If you don't want to depend on Scarb, you can still use the Cairo Language Server with the compiler binary. From [Step 1](#installing-cairo-with-a-script-installer-by-fran), the `cairo-language-server` binary should be built and executing this command will copy its path into your clipboard.
id: Jika Anda tidak ingin bergantung pada Scarb, Anda masih dapat menggunakan Cairo Language Server dengan biner kompilator. Dari [Langkah 1](#installing-cairo-with-a-script-installer-by-fran), biner `cairo-language-server` seharusnya sudah dibangun dan mengeksekusi perintah ini akan menyalin jalurnya ke clipboard Anda.
ko: Scarb에 의존하고 싶지 않다면, 컴파일러 이진 파일과 함께 카이로 언어 서버를 사용할 수 있습니다. [단계 1](#installing-cairo-with-a-script-installer-by-fran)에서 `cairo-language-server` 이진 파일을 빌드해야 하며, 이 명령을 실행하면 해당 경로가 클립보드에 복사됩니다.

source: Update the `cairo1.languageServerPath` of the Cairo 1.0 extension by pasting the path.
es: Actualiza la `cairo1.languageServerPath` de la extensión Cairo 1.0 pegando la ruta.
id: Perbarui `cairo1.languageServerPath` dari ekstensi Cairo 1.0 dengan cara menempelkan jalur yang dimaksud.
ko: 카이로 1.0 확장 프로그램의 `cairo1.languageServerPath`를 업데이트하려면 경로를 붙여넣으세요.
zh_cn: 将上面复制的路径更新到Cairo 1.0扩展的`cairo1.languageServerPath`中。

source: System Calls
ko: 시스템 호출

source: This chapter is based on the StarkNet documentation available at [StarkNet Docs](https://docs.starknet.io/documentation/architecture_and_concepts/Smart_Contracts/system-calls-cairo1/).
ko: 이 장은 [StarkNet Docs](https://docs.starknet.io/documentation/architecture_and_concepts/Smart_Contracts/system-calls-cairo1/)에서 제공하는 StarkNet 문서를 기반으로 합니다.

source: Writing smart contracts requires various associated operations, such as calling another contract or accessing the contract’s storage, that standalone programs do not require.
ko: 스마트 계약을 작성하려면 다른 계약을 호출하거나 계약의 저장소에 액세스하는 등의 여러 관련 작업이 필요합니다. 독립 실행 프로그램에서는 필요하지 않은 작업들입니다.

source: The Starknet contract language supports these operations by using system calls. System calls enable a contract to require services from the Starknet OS. You can use system calls in a function to get information that depends on the broader state of Starknet, which would otherwise be inaccessible, rather than local variables that appear in the function’s scope.
ko: 스타크넷 계약 언어는 시스템 호출을 사용하여 이러한 작업을 지원합니다. 시스템 호출을 통해 계약은 스타크넷 OS에서 서비스를 요청할 수 있습니다. 함수 내에서 시스템 호출을 사용하여 스타크넷의 더 넓은 상태에 따라 접근할 수 없는 정보를 얻을 수 있습니다. 이는 함수 범위에 나타나는 로컬 변수가 아닌 것입니다.

source: Here is a list of the system calls available in Cairo 1.0:
ko: 카이로 1.0에서 사용 가능한 시스템 호출 목록입니다.

source: [call_contract](#call_contract)
ko: [call_contract](#call_contract) -> [call_contract](#call_contract)

source: [deploy](#deploy)
ko: [배포](#deploy)

source: Syntax
ko: 구문론

source: Description
ko: 설명

source: Gets the hash of a specific StarkNet block within the range of `[first_v0_12_0_block, current_block - 10]`.
ko: `[first_v0_12_0_block, current_block - 10]` 범위 내의 특정 StarkNet 블록의 해시를 가져옵니다.

source: Return values
ko: 반환 값

source: Returns the hash of the given block.
ko: 주어진 블록의 해시를 반환합니다.

source: Error messages
ko: 에러 메시지

source: `Block number out of range`: `block_number` is greater than _`current_block`_`- 10`.
ko: `블록 번호가 범위를 벗어났습니다`: `block_number`이 _`current_block`_`- 10`보다 큽니다.

source: `0`: `block_number` is less than the first block number of v0.12.0.
ko: `0`: `block_number`가 v0.12.0의 첫 번째 블록 번호보다 작습니다.

source: Common library
ko: 공용 도서관

source: Gets information about the original transaction.
ko: 원래 거래에 대한 정보를 얻습니다.

source: In Cairo 1.0, all block/transaction/execution context getters are batched into this single system call.
ko: 카이로 1.0에서는 모든 블록/트랜잭션/실행 컨텍스트 게터가 이 단일 시스템 호출로 일괄 처리됩니다.

source: Arguments
ko: 논쟁

source: None.
ko: 없음.

source: Returns a [struct](https://github.com/starkware-libs/cairo/blob/efbf69d4e93a60faa6e1363fd0152b8fcedbb00a/corelib/src/starknet/info.cairo#L8) containing the execution info.
ko: 실행 정보를 포함하는 [struct](https://github.com/starkware-libs/cairo/blob/efbf69d4e93a60faa6e1363fd0152b8fcedbb00a/corelib/src/starknet/info.cairo#L8)를 반환합니다.

source: `call_contract`
ko: `계약 호출`

source: Calls a given contract. This system call expects the address of the called contract, a selector for a function within that contract, and call arguments.
ko: 주어진 계약을 호출합니다. 이 시스템 호출은 호출된 계약의 주소, 해당 계약 내의 함수를 위한 셀렉터 및 호출 인수를 기대합니다.

source: **Note:**
ko: **참고:**

source: An internal call can’t return Err(\_) as this is not handled by the sequencer and the Starknet OS.
ko: 내부 호출은 시퀀서와 Starknet OS에서 처리되지 않기 때문에 Err(\_)을 반환할 수 없습니다.

source: If call_contract_syscall fails, this can’t be caught and will therefore result in the entire transaction being reverted.
ko: call_contract_syscall이 실패하면 이를 잡을 수 없으며, 따라서 전체 거래가 되돌아가게 됩니다.

source: _`address`_: The address of the contract you want to call.
ko: _`주소`_: 호출하려는 계약의 주소.

source: _`entry_point_selector`_: A selector for a function within that contract.
ko: _`entry_point_selector`_: 해당 계약 내의 함수를 선택하는 선택기입니다.

source: _`calldata`_: The calldata array.
ko: _`calldata`_: calldata 배열.

source: The call response, of type `SyscallResult<Span<felt252>>`.
ko: `SyscallResult<Span<felt252>>` 유형의 호출 응답.

source: **Note:** This is considered a lower-level syntax for calling contracts. If the interface of the called contract is available, then you can use a more straightforward syntax.
ko: **참고:** 이는 계약을 호출하는 더 낮은 수준의 구문으로 간주됩니다. 호출된 계약의 인터페이스가 사용 가능하다면 더 직접적인 구문을 사용할 수 있습니다.

source: `deploy`
ko: 배포

source: Deploys a new instance of a previously declared class.
ko: 이전에 선언된 클래스의 새 인스턴스를 배포합니다.

source: _`class_hash`_: The class hash of the contract to be deployed.
ko: _`class_hash`_: 배포할 계약의 클래스 해시입니다.

source: _`contract_address_salt`_: The salt, an arbitrary value provided by the sender, used in the computation of the contract’s address.
ko: `contract_address_salt`: 컨트랙트 주소 계산에 사용되는 보내는 사람이 제공한 임의의 값인 솔트.

source: _`calldata`_: The constructor’s calldata. An array of felts.
ko: _`calldata`_: 생성자의 calldata. 펠트들의 배열.

source: _`deploy_from_zero`_: A flag used for the contract address computation. If not set, the caller address will be used as the new contract’s deployer address, otherwise 0 is used.
ko: `deploy_from_zero`: 계약 주소 계산에 사용되는 플래그입니다. 설정되지 않으면 호출자 주소가 새 계약의 배포자 주소로 사용되고, 그렇지 않으면 0이 사용됩니다.

source: A tuple wrapped with SyscallResult where:
ko: SyscallResult로 래핑된 튜플:

source: The first element is the address of the deployed contract, of type `ContractAddress`.
ko: 배포된 계약의 주소인 `ContractAddress` 유형의 첫 번째 요소입니다.

source: The second element is the response array from the contract’s constructor, of type `Span::<felt252>`.
ko: 두 번째 요소는 `Span::<felt252>` 유형의 계약 생성자로부터의 응답 배열입니다.

source: `emit_event`
ko: 이벤트 발생

source: Emits an event with a given set of keys and data.
ko: 지정된 키와 데이터 세트로 이벤트를 발생시킵니다.

source: For more information, and for a higher-level syntax for emitting events, see [Starknet events](https://docs.starknet.io/documentation/architecture_and_concepts/Smart_Contracts/starknet-events/).
ko: 더 많은 정보 및 이벤트를 발생시키는 더 높은 수준의 구문에 대한 자세한 내용은 [Starknet 이벤트](https://docs.starknet.io/documentation/architecture_and_concepts/Smart_Contracts/starknet-events/)를 참조하십시오.

source: _`keys`_: The event’s keys. These are analogous to Ethereum’s event topics, you can use the starknet_getEvents method to filter by these keys.
ko: _keys_: 이벤트의 키입니다. 이는 이더리움의 이벤트 주제와 유사하며, starknet_getEvents 메서드를 사용하여 이러한 키로 필터링할 수 있습니다.

source: _`data`_: The event’s data.
ko: _`data`_: 이벤트 데이터.

source: The following example emits an event with two keys, the strings `status` and `deposit` and three data elements: `1`, `2`, and `3`.
ko: 다음 예제는 두 개의 키, 문자열 'status'와 'deposit' 및 세 개의 데이터 요소 '1', '2' 및 '3'을 포함하는 이벤트를 발생시킵니다.

source: Calls the requested function in any previously declared class. The class is only used for its logic.
ko: 이전에 선언된 클래스에서 요청된 함수를 호출합니다. 이 클래스는 그 논리만을 위해 사용됩니다.

source: This system call replaces the known delegate call functionality from Ethereum, with the important difference that there is only one contract involved.
ko: 이 시스템 호출은 이더리움의 알려진 대리자 호출 기능을 대체하며, 중요한 차이점은 관련된 계약이 하나뿐이라는 것입니다.

source: _`class_hash`_: The hash of the class you want to use.
ko: _`class_hash`_: 사용하고 싶은 클래스의 해시입니다.

source: _`function_selector`_: A selector for a function within that class.
ko: `function_selector`: 해당 클래스 내의 함수를 선택하는 선택기.

source: _`calldata`_: The calldata.
ko: _`calldata`_: 콜데이터.

source: `send_message_to_L1`
ko: `L1에 메시지를 보내기`

source: Sends a message to L1.
ko: L1에 메시지를 보냅니다.
