Repository: cairo-book/cairo-book
Catalog: po/*.po
Languages: es, id, ko, zh_cn

source: Most errors aren’t serious enough to require the program to stop entirely. Sometimes, when a function fails, it’s for a reason that you can easily interpret and respond to. For example, if you try to add two large integers and the operation overflows because the sum exceeds the maximum representable value, you might want to return an error or a wrapped result instead of causing undefined behavior or terminating the process.
es: La mayoría de los errores no son lo suficientemente graves como para que el programa se detenga por completo. A veces, cuando una función falla, es por una razón que usted puede interpretar fácilmente y a la que puede responder. Por ejemplo, si intenta sumar dos enteros grandes y la operación se desborda porque la suma excede el valor máximo representable, es posible que desee devolver un error o un resultado envuelto en lugar de causar un comportamiento indefinido o terminar el proceso.
id: Kebanyakan kesalahan tidak serius sehingga memerlukan program untuk berhenti sepenuhnya. Terkadang, ketika sebuah fungsi gagal, itu karena alasan yang dapat Anda terjemahkan dan tanggapi dengan mudah. Sebagai contoh, jika Anda mencoba untuk menambahkan dua bilangan bulat besar dan operasinya melebihi kapasitas maksimum yang dapat direpresentasikan sehingga terjadi overflow, Anda mungkin ingin mengembalikan kesalahan atau hasil yang dibungkus daripada menyebabkan perilaku yang tidak terdefinisi atau menghentikan proses.
ko: 대부분의 오류는 프로그램을 완전히 중지시킬만큼 심각하지 않습니다. 때로는 함수가 실패하는 경우가 있지만, 그 이유를 쉽게 해석하고 대응할 수 있습니다. 예를 들어, 두 큰 정수를 더하려고 시도하면 합이 표현 가능한 최대 값을 초과하여 오버플로우가 발생하는 경우, 정의되지 않은 동작이나 프로세스 종료 대신 오류를 반환하거나 래핑된 결과를 반환하는 것이 좋을 수 있습니다.
zh_cn: 大多数错误并没有严重到需要程序完全停止的程度。有时，当一个函数失败时，它的原因是你可以很容易地解释和应对的。例如，如果你试图将两个大的整数相加，而操作溢出，因为总和超过了最大的可表示值，你可能想返回一个错误或一个包装好的结果，而不是引起未定义行为或终止程序。

source: The `Result` enum
id: `Result` enum
ko: `Result` 열거형

source: Recall from [“Generic data types”](ch08-01-generic-data-types.md#enums) in Chapter 8 that the `Result` enum is defined as having two variants, `Ok` and `Err`, as follows:
id: Ingat dari [“Tipe data generik”](ch08-01-generic-data-types.md#enums) dalam Bab 8 bahwa enum `Result` didefinisikan memiliki dua varian, `Ok` dan `Err`, sebagai berikut:
ko: 8장의 [“일반 데이터 유형”](ch08-01-generic-data-types.md#enums)에서 `Result` 열거형이 `Ok`와 `Err` 두 가지 변형으로 정의된 것을 상기해보십시오.
zh_cn: 回顾第8章中的[“通用数据类型”](ch08-01-generic-data-types.md#enums) 一节中，`Result` 枚举被定义为具有两个变体，即 `Ok` 和 `Err`，如下所示：

source: The `ResultTrait`
id: `ResultTrait`
ko: `ResultTrait`

source: The `ResultTrait` trait provides methods for working with the `Result<T, E>` enum, such as unwrapping values, checking whether the `Result` is `Ok` or `Err`, and panicking with a custom message. The `ResultTraitImpl` implementation defines the logic of these methods.
es: El rasgo `ResultTrait` proporciona métodos para trabajar con el enum `Result<T, E>`, como desenvolver valores, comprobar si el `Result` es `Ok` o `Err`, y entrar en pánico con un mensaje personalizado. La implementación de `ResultTraitImpl` define la lógica de estos métodos.
id: Trait `ResultTrait` menyediakan metode-metode untuk bekerja dengan enum `Result<T, E>`, seperti membuka nilai-nilai, memeriksa apakah `Result` adalah `Ok` atau `Err`, dan melakukan panic dengan pesan kustom. Implementasi `ResultTraitImpl` mendefinisikan logika dari metode-metode ini.
ko: `ResultTrait` 트레이트는 `Result<T, E>` enum과 함께 작업하는 메서드를 제공합니다. 값 언래핑, `Result`가 `Ok`인지 `Err`인지 확인, 그리고 사용자 정의 메시지와 함께 패닉하는 등의 기능을 수행할 수 있습니다. `ResultTraitImpl` 구현은 이러한 메서드의 로직을 정의합니다.
zh_cn: `ResultTrait`trait提供了处理`Result<T, E>`枚举的方法，例如解包值，检查`Result`是`Ok`还是`Err`，以及用自定义的消息进行panic。`ResultTraitImpl`实现定义了这些方法的逻辑。

source: The `expect` and `unwrap` methods are similar in that they both attempt to extract the value of type `T` from a `Result<T, E>` when it is in the `Ok` variant. If the `Result` is `Ok(x)`, both methods return the value `x`. However, the key difference between the two methods lies in their behavior when the `Result` is in the `Err` variant. The `expect` method allows you to provide a custom error message (as a `felt252` value) that will be used when panicking, giving you more control and context over the panic. On the other hand, the `unwrap` method panics with a default error message, providing less information about the cause of the panic.
es: Los métodos `expect` y `unwrap` se parecen en que ambos intentan extraer el valor de tipo `T` de un `Resultado<T, E>` cuando está en la variante `Ok`. Si el `Resultado` es `Ok(x)`, ambos métodos devuelven el valor `x`. Sin embargo, la diferencia clave entre los dos métodos radica en su comportamiento cuando el `Result` está en la variante `Err`. El método `expect` te permite proporcionar un mensaje de error personalizado (como un valor `felt252`) que se utilizará cuando se produzca el pánico, dándote más control y contexto sobre el pánico. Por otro lado, el método `unwrap` entra en pánico con un mensaje de error por defecto, proporcionando menos información sobre la causa del pánico.
id: Metode `expect` dan `unwrap` mirip dalam hal keduanya mencoba mengekstrak nilai tipe `T` dari sebuah `Result<T, E>` saat berada dalam varian `Ok`. Jika `Result` adalah `Ok(x)`, kedua metode mengembalikan nilai `x`. Namun, perbedaan utama antara kedua metode tersebut terletak pada perilaku mereka saat `Result` berada dalam varian `Err`. Metode `expect` memungkinkan Anda untuk memberikan pesan kesalahan kustom (sebagai nilai `felt252`) yang akan digunakan saat terjadi panic, memberikan lebih banyak kontrol dan konteks atas panic tersebut. Di sisi lain, metode `unwrap` akan panic dengan pesan kesalahan default, memberikan informasi yang lebih sedikit tentang penyebab dari panic.
ko: `expect` 및 `unwrap` 메소드는 둘 다 `Ok` 변형에 있을 때 `Result<T, E>` 유형의 값을 추출하려고 시도한다는 점에서 유사합니다. `Result`가 `Ok(x)`인 경우, 두 메소드는 모두 값 `x`를 반환합니다. 그러나 두 메소드 간의 주요 차이점은 `Result`가 `Err` 변형에 있을 때의 동작에 있습니다. `expect` 메소드는 패닉 시 사용될 사용자 정의 오류 메시지(`felt252` 값)를 제공할 수 있도록 하며, 패닉 시 제어 및 컨텍스트를 더 많이 제공합니다. 반면, `unwrap` 메소드는 기본 오류 메시지로 패닉을 유발하며, 패닉의 원인에 대한 정보를 적게 제공합니다.
zh_cn: `expect`和`unwrap`方法类似，它们都试图从`Result<T, E>`中提取`T`类型的值，当它处于`Ok`变体时。如果`Result`是 `Ok(x)`，两个方法都返回值 "x"。然而，这两个方法的关键区别在于当`Result`是`Err`变量时的行为。`expect`方法允许你提供一个自定义的错误信息（作为`felt252`值）在panic时使用，从而让你获取更多对panic相关的控制和上下文。另一方面，`unwrap`方法用一个默认的错误信息进行panic，提供的关于panic原因的信息较少。

source: The `expect_err` and `unwrap_err` have the exact opposite behavior. If the `Result` is `Err(x)`, both methods return the value `x`. However, the key difference between the two methods is in case of `Result::Ok()`. The `expect_err` method allows you to provide a custom error message (as a `felt252` value) that will be used when panicking, giving you more control and context over the panic. On the other hand, the `unwrap_err` method panics with a default error message, providing less information about the cause of the panic.
es: Los métodos `expect_err` y `unwrap_err` tienen el comportamiento exactamente opuesto. Si el `Result` es `Err(x)`, ambos métodos devuelven el valor `x`. Sin embargo, la diferencia clave entre los dos métodos está en el caso de `Result::Ok()`. El método `expect_err` te permite proporcionar un mensaje de error personalizado (como un valor `felt252`) que se utilizará cuando se produzca el pánico, dándote más control y contexto sobre el pánico. Por otro lado, el método `unwrap_err` entra en pánico con un mensaje de error por defecto, proporcionando menos información sobre la causa del pánico.
id: Metode `expect_err` dan `unwrap_err` memiliki perilaku yang sama sekali berlawanan. Jika `Result` adalah `Err(x)`, kedua metode mengembalikan nilai `x`. Namun, perbedaan utama antara kedua metode tersebut terletak pada kasus `Result::Ok()`. Metode `expect_err` memungkinkan Anda untuk memberikan pesan kesalahan kustom (sebagai nilai `felt252`) yang akan digunakan saat terjadi panic, memberikan lebih banyak kontrol dan konteks atas panic tersebut. Di sisi lain, metode `unwrap_err` akan panic dengan pesan kesalahan default, memberikan informasi yang lebih sedikit tentang penyebab dari panic.
ko: `expect_err`와 `unwrap_err`는 정반대의 동작을 합니다. 만약 `Result`가 `Err(x)`인 경우, 두 메서드는 모두 값 `x`를 반환합니다. 그러나 두 메서드의 주요 차이점은 `Result::Ok()`인 경우에 있습니다. `expect_err` 메서드는 패닉이 발생할 때 사용될 사용자 정의 오류 메시지(`felt252` 값)를 제공할 수 있게 해주어 패닉에 대한 더 많은 제어와 컨텍스트를 제공합니다. 반면, `unwrap_err` 메서드는 기본 오류 메시지로 패닉을 발생시키며, 패닉의 원인에 대한 정보를 덜 제공합니다.
zh_cn: `expect_err`和`unwrap_err`的行为完全相反。如果`Result`是`Err(x)`，两个方法都返回值`x`。然而，这两个方法的关键区别是在`Result::Ok()`的情况下。`expect_err`方法允许你提供一个自定义的错误信息（作为`felt252`值），在panic时使用，从而让你获取更多对panic相关的控制和上下文。另一方面，`unwrap_err`方法用一个默认的错误信息进行panic，提供的关于panic原因的信息较少。

source: A careful reader may have noticed the `<+Drop<T>>` and `<+Drop<E>>` in the first four methods signatures. This syntax represents generic type constraints in the Cairo language. These constraints indicate that the associated functions require an implementation of the `Drop` trait for the generic types `T` and `E`, respectively.
ko: 세심한 독자는 첫 네 가지 메서드 시그니처에서 `<+Drop<T>>`와 `<+Drop<E>>`를 주목했을 수 있습니다. 이 구문은 카이로 언어에서 일반적인 유형 제약을 나타냅니다. 이 제약은 관련 함수가 각각 일반 유형 `T`와 `E`에 대한 `Drop` 트레이트의 구현을 필요로 함을 나타냅니다.

source: Finally, the `is_ok` and `is_err` methods are utility functions provided by the `ResultTrait` trait to check the variant of a `Result` enum value.
es: Por último, los métodos `is_ok` y `is_err` son funciones de utilidad proporcionadas por el rasgo `ResultTrait` para comprobar la variante de un valor del enum `Result`.
id: Akhirnya, metode `is_ok` dan `is_err` adalah fungsi utilitas yang disediakan oleh trait `ResultTrait` untuk memeriksa varian dari nilai enumerasi `Result`.
ko: 마지막으로, `is_ok` 및 `is_err` 메서드는 `ResultTrait` 트레이트에서 제공되는 유틸리티 함수로, `Result` 열거형 값의 변형을 확인하는 데 사용됩니다.
zh_cn: 最后，`is_ok`和`is_err`方法是`ResultTrait`trait提供的实用函数，用于检查`Result`枚举值的成员。

source: `is_ok` takes a snapshot of a `Result<T, E>` value and returns `true` if the `Result` is the `Ok` variant, meaning the operation was successful. If the `Result` is the `Err` variant, it returns `false`.
es: `is_ok` toma una instantánea de un valor `Result<T, E>` y devuelve `true` si el `Result` es la variante `Ok`, lo que significa que la operación se ha realizado correctamente. Si el `Resultado` es la variante `Err`, devuelve `false`.
id: `is_ok` mengambil gambaran (snapshot) dari nilai `Result<T, E>` dan mengembalikan `true` jika `Result` merupakan varian `Ok`, yang berarti operasi berhasil. Jika `Result` merupakan varian `Err`, maka mengembalikan `false`.
ko: `is_ok`는 `Result<T, E>` 값을 스냅샷으로 촬영하고, `Result`가 `Ok` 변형인 경우 작업이 성공했음을 의미하므로 `true`를 반환합니다. `Result`가 `Err` 변형인 경우 `false`를 반환합니다.
zh_cn: `is_ok`获取一个`Result<T, E>`值的快照，如果`Result`是`Ok`成员，则返回`true`，意味着操作成功。如果`Result`是`Err`成员，则返回`false`。

source: `is_err` takes a snapshot to a `Result<T, E>` value and returns `true` if the `Result` is the `Err` variant, meaning the operation encountered an error. If the `Result` is the `Ok` variant, it returns `false`.
ko: `is_err`는 `Result<T, E>` 값에 대한 스냅샷을 취하고, 해당 `Result`가 `Err` 변형인 경우에는 `true`를 반환하여 작업이 오류를 만났음을 나타냅니다. `Result`가 `Ok` 변형인 경우에는 `false`를 반환합니다.

source: These methods are helpful when you want to check the success or failure of an operation without consuming the Result value, allowing you to perform additional operations or make decisions based on the variant without unwrapping it.
es: Estos métodos son útiles cuando se desea comprobar el éxito o el fracaso de una operación sin consumir el valor del Resultado, lo que permite realizar operaciones adicionales o tomar decisiones basadas en la variante sin desenvolverla.
id: Metode-metode ini berguna ketika Anda ingin memeriksa keberhasilan atau kegagalan suatu operasi tanpa mengonsumsi nilai Result, memungkinkan Anda untuk melakukan operasi tambahan atau membuat keputusan berdasarkan varian tanpa meng-unwrap (membuka) nilainya.
ko: 이러한 방법들은 결과 값을 소비하지 않고 작업의 성공 또는 실패를 확인하고, 해당 변형을 풀지 않고도 추가 작업을 수행하거나 해당 변형을 기반으로 결정을 내릴 수 있도록 도와줍니다.
zh_cn: 当你想在不消耗结果值的情况下检查一个操作的成功或失败时，这些方法很有帮助，允许你执行额外的操作或根据枚举成员做出决定，而不用解开（unwrap）它。

source: You can find the implementation of the `ResultTrait` [here](https://github.com/starkware-libs/cairo/blob/main/corelib/src/result.cairo#L20).
id: Anda dapat menemukan implementasi dari `ResultTrait` [di sini](https://github.com/starkware-libs/cairo/blob/main/corelib/src/result.cairo#L20).
ko: `ResultTrait`의 구현은 [여기](https://github.com/starkware-libs/cairo/blob/main/corelib/src/result.cairo#L20)에서 찾을 수 있습니다.
zh_cn: 你可以在[这里](https://github.com/starkware-libs/cairo/blob/main/corelib/src/result.cairo#L20)找到 `ResultTrait` 的实现。

source: It is always easier to understand with examples.
es: Siempre es más fácil entender con ejemplos.
id: Selalu lebih mudah dipahami dengan contoh.
ko: 예시를 통해 이해하는 것이 항상 더 쉽습니다.
zh_cn: 有例子总是更容易理解。

source: Have a look at this function signature:
es: Eche un vistazo a la firma de esta función:
id: Lihatlah tanda tangan fungsi ini:
ko: 이 함수 서명을 살펴보세요.
zh_cn: 请看一下这个函数签名：

source: It takes two u128 integers, a and b, and returns a `Result<u128, u128>` where the `Ok` variant holds the sum if the addition does not overflow, and the `Err` variant holds the overflowed value if the addition does overflow.
es: Toma dos enteros u128, a y b, y devuelve un `Result<u128, u128>` donde la variante `Ok` contiene la suma si la suma no se desborda, y la variante `Err` contiene el valor desbordado si la suma se desborda.
id: Fungsi ini menerima dua bilangan bulat u128, a dan b, dan mengembalikan `Result<u128, u128>` di mana varian `Ok` berisi hasil penjumlahan jika tidak terjadi overflow, dan varian `Err` berisi nilai yang mengalami overflow jika penjumlahan mengalami overflow.
ko: 두 개의 u128 정수, a와 b를 가져와서 덧셈이 오버플로우되지 않을 경우 합계를 보유하는 `Result<u128, u128>`를 반환합니다. 덧셈이 오버플로우되면 오버플로우된 값을 보유하는 `Err` 변형이 반환됩니다.
zh_cn: 它接收两个u128整数，a和b，并返回一个`Result<u128, u128>`，如果加法没有溢出，`Ok`成员存储加法的和，如果加法溢出，`Err’成员存储溢出的值。

source: Now, we can use this function elsewhere. For instance:
es: Ahora, podemos utilizar esta función en otros lugares. Por ejemplo:
id: Sekarang, kita dapat menggunakan fungsi ini di tempat lain. Misalnya:
ko: 이제, 우리는 이 기능을 다른 곳에서도 사용할 수 있습니다. 예를 들어:
zh_cn: 现在，我们可以在其他地方使用这个函数。比如说：

source: Here, it accepts two u128 integers, a and b, and returns an `Option<u128>`. It uses the `Result` returned by `u128_overflowing_add` to determine the success or failure of the addition operation. The match expression checks the `Result` from `u128_overflowing_add`. If the result is `Ok(r)`, it returns `Option::Some(r)` containing the sum. If the result is `Err(r)`, it returns `Option::None` to indicate that the operation has failed due to overflow. The function does not panic in case of an overflow.
id: Di sini, fungsi ini menerima dua bilangan bulat u128, a dan b, dan mengembalikan `Option<u128>`. Fungsi ini menggunakan `Result` yang dikembalikan oleh `u128_overflowing_add` untuk menentukan keberhasilan atau kegagalan operasi penjumlahan. Ekspresi match memeriksa `Result` dari `u128_overflowing_add`. Jika hasilnya adalah `Ok(r)`, maka mengembalikan `Option::Some(r)` yang berisi hasil penjumlahan. Jika hasilnya adalah `Err(r)`, maka mengembalikan `Option::None` untuk menunjukkan bahwa operasi gagal karena overflow. Fungsi ini tidak memunculkan panic dalam kasus overflow.
ko: 여기서는 두 개의 u128 정수, a와 b를 받아 `Option<u128>`을 반환합니다. `u128_overflowing_add`에 의해 반환된 `Result`를 사용하여 덧셈 작업의 성공 또는 실패를 결정합니다. match 표현식은 `u128_overflowing_add`에서 반환된 `Result`를 확인합니다. 결과가 `Ok(r)`인 경우 합계를 포함하는 `Option::Some(r)`을 반환합니다. 결과가 `Err(r)`인 경우 오버플로우로 작업이 실패했음을 나타내기 위해 `Option::None`을 반환합니다. 이 함수는 오버플로우 발생 시 패닉하지 않습니다.
zh_cn: 这里，它接受两个 u128 整数，a 和 b，返回一个 `Option<u128>`。它使用 `u128_overflowing_add` 返回的 `Result` 来确定加法操作的成功或失败。匹配表达式检查 `u128_overflowing_add` 的 `Result`。如果结果是 `Ok(r)`，它返回 `Option::Some(r)`，其中包含求和结果。如果结果是 `Err(r)`，它返回 `Option::None`，表示操作因为溢出而失败。如果发生溢出，该函数不会引发恐慌。

source: Let's take another example demonstrating the use of `unwrap`.
ko: `unwrap`의 사용을 보여주는 또 다른 예제를 살펴보겠습니다.

source: Listing 10-1: Using the Result type
id: Listing 10-1: Menggunakan tipe Result
ko: 리스트 10-1: 결과 유형 사용하기

source: In this example, the `parse_u8` function takes a `felt252` integer and tries to convert it into a `u8` integer using the `try_into` method. If successful, it returns `Result::Ok(value)`, otherwise it returns `Result::Err('Invalid integer')`.
es: En este ejemplo, la función `parse_u8` toma un entero `felt252` e intenta convertirlo en un entero `u8` utilizando el método `try_into`. Si tiene éxito, devuelve `Result::Ok(value)`, en caso contrario devuelve `Result::Err('Invalid integer')`.
id: Dalam contoh ini, fungsi `parse_u8` menerima bilangan bulat `felt252` dan mencoba mengonversinya menjadi bilangan bulat `u8` menggunakan metode `try_into`. Jika berhasil, fungsi mengembalikan `Result::Ok(value)`, sebaliknya mengembalikan `Result::Err('Angka tidak valid')`.
ko: 이 예제에서 `parse_u8` 함수는 `felt252` 정수를 가져와 `try_into` 메서드를 사용하여 `u8` 정수로 변환하려고 시도합니다. 성공하면 `Result::Ok(value)`를 반환하고, 그렇지 않으면 `Result::Err('잘못된 정수')`를 반환합니다.
zh_cn: 在这个例子中，`parse_u8`函数接收一个`felt252`的整数，并尝试用`try_into`方法将其转换为`u8`的整数。如果成功，它返回`Result::Ok(value)`，否则它返回`Result::Err('Invalid integer')`。

source: Our two test cases are:
es: Nuestros dos casos de prueba son:
id: Dua kasus uji kita adalah:
ko: 우리의 두 가지 테스트 케이스는:
zh_cn: 我们的两个测试案例是：

source: // should not panic
ko: // 동요하지 말아야 합니다

source: // should panic
ko: 패닉해야 함

source: The first one tests a valid conversion from `felt252` to `u8`, expecting the `unwrap` method not to panic. The second test function attempts to convert a value that is out of the `u8` range, expecting the `unwrap` method to panic with the error message 'Invalid integer'.
es: La primera prueba una conversión válida de `felt252` a `u8`, esperando que el método `unwrap` no entre en pánico. La segunda función de prueba intenta convertir un valor que está fuera del rango `u8`, esperando que el método `unwrap` entre en pánico con el mensaje de error 'Invalid integer'.
id: Yang pertama menguji konversi valid dari `felt252` menjadi `u8`, mengharapkan metode `unwrap` tidak menimbulkan panic. Fungsi uji kedua mencoba mengonversi nilai yang berada di luar jangkauan `u8`, mengharapkan metode `unwrap` menimbulkan panic dengan pesan kesalahan 'Angka tidak valid'.
ko: 첫 번째 테스트는 `felt252`에서 `u8`로의 유효한 변환을 시도하며, `unwrap` 메서드가 패닉하지 않는 것을 기대합니다. 두 번째 테스트 함수는 `u8` 범위를 벗어나는 값을 변환하려고 시도하며, 'Invalid integer' 오류 메시지와 함께 `unwrap` 메서드가 패닉할 것으로 예상합니다.
zh_cn: 第一个测试函数是测试从`felt252`到`u8`的有效转换，期望`unwrap`方法不要panic。第二个测试函数试图转换一个超出`u8`范围的值，期望`unwrap`方法panic，错误信息是 'Invalid integer'。

source: The `?` operator
ko: `?` 연산자

source: The last operator we will talk about is the `?` operator. The `?` operator is used for more idiomatic and concise error handling. When you use the `?` operator on a `Result` or `Option` type, it will do the following:
es: El último operador del que hablaremos es el operador `?`. El operador `?` se utiliza para un manejo de errores más idiomático y conciso. Cuando usas el operador `?` en un tipo `Result` u `Option`, hará lo siguiente:
id: Operator terakhir yang akan kita bahas adalah operator `?`. Operator `?` digunakan untuk penanganan kesalahan yang lebih idiomatik dan ringkas. Ketika Anda menggunakan operator `?` pada tipe `Result` atau `Option`, itu akan melakukan hal berikut:
ko: 다음은 `?` 연산자에 대해 이야기할 마지막 연산자입니다. `?` 연산자는 더 익숙하고 간결한 오류 처리에 사용됩니다. `Result` 또는 `Option` 유형에 `?` 연산자를 사용하면 다음을 수행합니다:
zh_cn: 我们要谈的最后一个操作符是`?`操作符。`?`运算符用于更成文和简明的错误处理。当你在 `Result`或 `Option`类型上使用`?`运算符时，它将做以下事情：

source: If the value is `Result::Ok(x)` or `Option::Some(x)`, it will return the inner value `x` directly.
id: Jika nilainya adalah `Result::Ok(x)` atau `Option::Some(x)`, maka akan mengembalikan nilai dalamnya, yaitu `x`, secara langsung.
ko: 값이 `Result::Ok(x)` 또는 `Option::Some(x)`인 경우 내부 값 `x`를 직접 반환합니다.

source: If the value is `Result::Err(e)` or `Option::None`, it will propagate the error or `None` by immediately returning from the function.
id: Jika nilainya adalah `Result::Err(e)` atau `Option::None`, maka akan menyebarkan kesalahan atau `None` dengan segera mengembalikan dari fungsi tersebut.
ko: 값이 `Result::Err(e)` 또는 `Option::None`인 경우, 해당 오류 또는 `None`을 즉시 함수에서 반환하여 전파합니다.

source: The `?` operator is useful when you want to handle errors implicitly and let the calling function deal with them.
es: El operador `?` es útil cuando se desea manejar los errores implícitamente y dejar que la función de llamada se ocupe de ellos.
id: Operator `?` berguna ketika Anda ingin menangani kesalahan secara implisit dan membiarkan fungsi pemanggil menanganinya.
ko: `?` 연산자는 오류를 암시적으로 처리하고 호출하는 함수가 그것을 처리하도록 하고 싶을 때 유용합니다.
zh_cn: 当你想隐式处理错误并让调用函数处理它们时，`?`操作符很有用。

source: Here is an example.
es: Aquí un ejemplo.
id: Berikut adalah contohnya.
ko: 여기 예시가 있습니다.
zh_cn: 下面是一个例子。

source: // DO SOMETHING
ko: // 무언가를 하다

source: Listing 10-1: Using the `?` operator
id: Listing 10-1: Menggunakan operator "?"
ko: 리스트 10-1: `?` 연산자 사용하기

source: `do_something_with_parse_u8` function takes a `felt252` value as input and calls `parse_u8`. The `?` operator is used to propagate the error, if any, or unwrap the successful value.
es: La función `do_something_with_parse_u8` toma un valor `felt252` como entrada y llama a `parse_u8`. El operador `?` se utiliza para propagar el error, si lo hay, o desenvolver el valor correcto.
id: Fungsi `do_something_with_parse_u8` mengambil nilai `felt252` sebagai masukan dan memanggil `parse_u8`. Operator `?` digunakan untuk menyebarkan kesalahan, jika ada, atau membuka nilai yang berhasil.
ko: `do_something_with_parse_u8` 함수는 `felt252` 값이 입력으로 전달되고 `parse_u8`를 호출합니다. `?` 연산자는 오류를 전파하거나 성공적인 값으로 언래합니까.
zh_cn: `do_something_with_parse_u8`函数接收一个`felt252`值作为输入并调用`parse_u8`。`?`操作符用来传播错误，如果有的话，或者unwrap成功的值。

source: And with a little test case:
es: Y con un pequeño caso de prueba:
id: Dan dengan sedikit kasus uji:
ko: 그리고 작은 테스트 케이스로:
zh_cn: 这里还有一个小的测试案例：

source: "Result: {}"
ko: "결과: {}"

source: "Error: {}"
ko: "에러: {}"

source: The console will print the error "Invalid Integer".
es: La consola mostrará el error "Invalid Integer".
id: Konsol akan mencetak kesalahan "Integer Tidak Valid".
ko: 콘솔은 "잘못된 정수" 오류를 출력할 것입니다.
zh_cn: 控制台将打印错误 “Invalid Integer”。
