Repository: cairo-book/cairo-book
Catalog: po/*.po
Languages: es, id, ko, zh_cn

source: On L1, the important part is to build the same payload as on L2. Then you call `consumeMessageFromL2` by passing the L2 contract address and the payload. Please be aware that the L2 contract address expected by the `consumeMessageFromL2` is the contract address of the account that sends the transaction on L2, and not the address of the contract executing the `send_message_to_l1_syscall`.
id: Pada L1, bagian pentingnya adalah membangun payload yang sama seperti pada L2. Kemudian Anda memanggil `consumeMessageFromL2` dengan meneruskan alamat kontrak L2 dan payload. Harap diingat bahwa alamat kontrak L2 yang diharapkan oleh `consumeMessageFromL2` adalah alamat kontrak dari akun yang mengirim transaksi di L2, bukan alamat kontrak yang menjalankan `send_message_to_l1_syscall`.

source: which will be serialized as **TWO** felts, one for the `low`, and one for the `high`. This means that to send only one `u256` to Cairo, you'll need to send a paylaod from L1 with **TWO** values.
id: yang akan diserialisasikan sebagai **DUA** felt, satu untuk `low`, dan satu untuk `high`. Ini berarti bahwa untuk mengirim hanya satu `u256` ke Cairo, Anda perlu mengirimkan payload dari L1 dengan **DUA** nilai.

source: Cairo is a highly safe language inspired by Rust. It is designed in a way that forces you to cover all possible cases. Security issues on Starknet mostly arise from the way smart contract flows are designed, not much from the language itself.
id: Cairo adalah bahasa yang sangat aman terinspirasi dari Rust. Dirancang sedemikian rupa sehingga memaksa Anda untuk menutupi semua kasus yang mungkin. Masalah keamanan pada Starknet kebanyakan muncul dari cara alur kontrak pintar dirancang, bukan begitu banyak dari bahasa itu sendiri.

source: Think of smart contracts as state machines: they have a set of initial states defined by the constructor constraints, and external functions represent a set of possible state transitions. A transaction is nothing more than a state transition.
id: Pikirkan kontrak pintar sebagai mesin keadaan: mereka memiliki serangkaian keadaan awal yang ditentukan oleh batasan konstruktor, dan fungsi eksternal mewakili serangkaian transisi keadaan yang mungkin. Sebuah transaksi tidak lebih dari sekadar transisi keadaan.

source: Built-in functions
id: Fungsi Built-in

source: Specifies parameters to generic type, function, or method in an expression; often referred to as turbofish
id: Menentukan parameter ke tipe generik, fungsi, atau metode dalam suatu ekspresi; sering disebut sebagai turbofish

source: The core library prelude is defined in the [lib.cairo](https://github.com/starkware-libs/cairo/blob/v2.2.0/corelib/src/lib.cairo) file of the corelib crate and contains Cairo's primitive data types, traits, operators, and utility functions. This includes: Data types - felts, bools, arrays, dicts, etc. Traits - behaviors for arithmetic, comparison, serialization Operators - arithmetic, logical, bitwise Utility functions - helpers for arrays, maps, boxing, etc. The core library prelude delivers the fundamental programming constructs and operations needed for basic Cairo programs, without requiring the explicit import of elements. Since the core library prelude is automatically imported, its contents are available for use in any Cairo crate without explicit imports. This prevents repetition and provides a better devX. This is what allows you to use `ArrayTrait::append()` or the `Default` trait without bringing them explicitly into scope.
id: Prelude pustaka inti didefinisikan dalam file [lib.cairo](https://github.com/starkware-libs/cairo/blob/v2.2.0/corelib/src/lib.cairo) dari kerangka kerja corelib dan berisi jenis data primitif, trait, operator, dan fungsi utilitas Cairo. Ini mencakup: Jenis data - felts, bools, arrays, dicts, dll. Trait - perilaku untuk aritmatika, perbandingan, serialisasi Operator - aritmatika, logika, bitwise Fungsi utilitas - pembantu untuk array, peta, boxing, dll. Prelude pustaka inti menyediakan konstruk dan operasi pemrograman dasar yang diperlukan untuk program Cairo dasar, tanpa memerlukan impor eksplisit dari elemen-elemen tersebut. Karena prelude pustaka inti diimpor secara otomatis, isinya dapat digunakan di setiap kerangka kerja Cairo tanpa impor eksplisit. Ini mencegah pengulangan dan memberikan pengalaman pengembangan yang lebih baik. Ini memungkinkan Anda menggunakan `ArrayTrait::append()` atau trait `Default` tanpa membawanya secara eksplisit ke dalam cakupan.

source: For **Fish shell**:
id: Untuk **shell Fish**:

source: Hello, World!
es: ¡Hola, mundo!

source: Hello, Scarb!
es: ¡Hola, Scarb!

source: Writing Starknet Contracts
es: Escribiendo Contratos en Starknet

source: E - Cairo Most Common Types and Traits
es: E - Tipos y Traits más comunes en Cairo

source: This version of the text assumes you’re using Cairo v1.1.0. See the “Installation” section of Chapter 1 to install or update Cairo.
es: Esta versión del texto asume que estás usando Cairo v1.1.0. Consulte la sección "Instalación" del Capítulo 1 para instalar o actualizar Cairo.

source: If you wish to install a specific release of Cairo rather than the latest head, set the `CAIRO_GIT_TAG` environment variable (e.g. `export CAIRO_GIT_TAG=v1.1.0`).
es: Si deseas instalar una versión específica de Cairo en lugar de la última versión disponible, puedes establecer la variable de entorno `CAIRO_GIT_TAG` (por ejemplo, `export CAIRO_GIT_TAG=v1.1.0`).

source: ## Hello, World
es: ## Hola, Mundo

source: Now that you’ve installed Cairo, it’s time to write your first Cairo program. It’s traditional when learning a new language to write a little program that prints the text `Hello, world!` to the screen, so we’ll do the same here!
es: Ahora que has instalado Cairo, es hora de escribir tu primer programa Cairo. Es tradicional cuando se aprende un nuevo lenguaje escribir un pequeño programa que imprima el texto `¡Hola, mundo!` en la pantalla, ¡así que haremos lo mismo aquí!

source: ### Writing and Running a Cairo Program
es: ### Escribiendo y Ejecutando un Programa Cairo

source: Next, make a new source file and call it _main.cairo_. Cairo files always end with the _.cairo_ extension. If you’re using more than one word in your filename, the convention is to use an underscore to separate them. For example, use _hello_world.cairo_ rather than _helloworld.cairo_.
es: A continuación, crea un nuevo archivo fuente y llámalo _main.cairo_. Los archivos Cairo siempre terminan con la extensión _.cairo_. Si usas más de una palabra en tu nombre de archivo, la convención es usar un guión bajo para separarlas. Por ejemplo_, hello_mundo.cairo_ en lugar de _helloworld.cairo_.

source: Now open the _main.cairo_ file you just created and enter the code in Listing 1-1.
es: Ahora abre el archivo _main.cairo_ que acabas de crear e introduce el código del Listado 1-1.

source: <span class="caption">Listing 1-1: A program that prints `Hello, world!`</span>
es: <span class="caption">Listing 1-1: Un programa que imprime `Hello, world!`</span>

source: Save the file and go back to your terminal window in the _~/cairo_projects/hello_world_ directory. Enter the following commands to compile and run the file:
es: Guarde el archivo y vuelva a su ventana de terminal en el directorio _~/cairo_projects/hello_world_. Introduzca los siguientes comandos para compilar y ejecutar el archivo:

source: > Note: If you want to stick to a standard style across Cairo projects, you can > use the automatic formatter tool called `cairo-format` to format your code in a > particular style (more on `cairo-format` in > [Appendix D][devtools]). The Cairo team has included this tool > with the standard Cairo distribution, as `cairo-run` is, so it should already be > installed on your computer!
es: > Nota: Si quieres mantener un estilo estándar en todos los proyectos de El Cairo, puedes > usar la herramienta de formateo automático llamada `cairo-format` para formatear tu código en un > estilo particular (más sobre `cairo-format` en > [Apéndice D][devtools]). El equipo de Cairo ha incluido esta herramienta > con la distribución estándar de Cairo, como lo es `cairo-run`, así que ya debería estar > ¡instalada en tu ordenador!

source: Third, you see the `'Hello, world!'` short string. We pass this short string as an argument to `print()`, and the short string is printed to the screen.
es: En tercer lugar, ves la cadena corta `'Hello, world!'` Pasamos esta cadena corta como argumento a `print()`, y la cadena corta se imprime en la pantalla.

source: Just running with `cairo-run` is fine for simple programs, but as your project grows, you’ll want to manage all the options and make it easy to share your code. Next, we’ll introduce you to the Scarb tool, which will help you write real-world Cairo programs.
es: Sólo ejecutar con `cairo-run` está bien para programas simples, pero a medida que tu proyecto proyecto crezca, querrá manejar todas las opciones y hacer fácil compartir su código. código. A continuación, te presentaremos la herramienta Scarb, que te ayudará a escribir programas Cairo del mundo real.

source: # Hello, Scarb
es: # Hola, Scarb

source: Scarb is the Cairo package manager and heavily inspired by [Cargo](https://doc.rust-lang.org/cargo/), Rust’s build system and package manager.
es: Scarb es el gestor de paquetes de Cairo y está fuertemente inspirado en [Cargo](https://doc.rust-lang.org/cargo/), el sistema de construcción y gestor de paquetes de Rust.

source: If we were to build the 'Hello, world!' project using Scarb, only the part of Scarb that handles building the code would be utilized, since the program doesn't require any external dependencies. As you write more complex Cairo programs, you’ll add dependencies, and if you start a project using Scarb, adding dependencies will be much easier to do.
es: Si fuéramos a construir el proyecto `Hello, world!` usando Scarb, sólo la parte de Scarb que maneja la construcción del código sería utilizada, ya que el programa no requiere ninguna dependencia externa. A medida que escriba programas Cairo más complejos, agregará dependencias, y si inicia un proyecto utilizando Scarb, agregar dependencias será mucho más fácil de hacer.

source: To install Scarb, please refer to the [installation instructions](https://docs.swmansion.com/scarb/download.html). You can simply run the following command in your terminal, then follow the onscreen instructions. This will install the latest stable release.
es: Para instalar Scarb, por favor consulta las [instrucciones de instalación](https://docs.swmansion.com/scarb/docs/install.html). Simplemente ejecuta el siguiente comando en tu terminal y sigue las instrucciones en pantalla. Esto instalará la última versión estable.

source: Let’s create a new project using Scarb and look at how it differs from our original “Hello, world!” project.
es: Vamos a crear un nuevo proyecto utilizando Scarb y ver en qué se diferencia de nuestro proyecto original “Hello, world!”.

source: Navigate back to your projects directory (or wherever you decided to store your code). Then run the following:
es: Navegue de nuevo a su directorio de proyectos (o donde haya decidido almacenar su código). Luego ejecute lo siguiente:

source: It creates a new directory and project called hello_scarb. We’ve named our project hello_scarb, and Scarb creates its files in a directory of the same name.
es: Crea un nuevo directorio y proyecto llamado hello_scarb. Hemos llamado a nuestro proyecto hello_scarb, y Scarb crea sus archivos en un directorio con el mismo nombre.

source: Go into the hello_scarb directory with the command `cd hello_scarb`. You’ll see that Scarb has generated two files and one directory for us: a `Scarb.toml` file and a src directory with a `lib.cairo` file inside.
es: Entre en el directorio hello_scarb con el comando `cd hello_scarb`.Verás que Scarb ha generado dos archivos y un directorio para nosotros: un archivo `Scarb.toml` y un directorio src con un archivo `lib.cairo` dentro.

source: ```toml [package] name = "hello_scarb" version = "0.1.0" # See more keys and their definitions at https://docs.swmansion.com/scarb/docs/reference/manifest.html [dependencies] # foo = { path = "vendor/foo" } ```
es: ```toml [package] name = "hello_scarb" version = "0.1.0" # Vea más claves y sus definiciones en https://docs.swmansion.com/scarb/docs/reference/manifest.html [dependencies] # foo = { path = "vendor/foo" } ```

source: > Note: If you're building contracts for Starknet, you will need to add the `starknet` dependency as mentioned in the [Scarb documentation](https://docs.swmansion.com/scarb/docs/starknet/starknet-package.html).
es: > Nota: Si estás construyendo contratos para Starknet, deberás agregar la dependencia `starknet` como se menciona en la [documentación de Scarb](https://docs.swmansion.com/scarb/docs/starknet/starknet-package.html).

source: Then create a new file called `src/hello_scarb.cairo` and put the following code in it:
es: A continuación, cree un nuevo archivo llamado `src/hello_scarb.cairo` y ponle el siguiente código:

source: We have just created a file called `lib.cairo`, which contains a module declaration referencing another module named "hello_scarb", as well as the file `hello_scarb.cairo`, containing the implementation details of the "hello_scarb" module.
es: Acabamos de crear un archivo llamado `lib.cairo`, que contiene una declaración de módulo que hace referencia a otro módulo llamado "hello_scarb", así como el archivo `hello_scarb.cairo`, que contiene los detalles de implementación del módulo "hello_scarb".

source: Scarb requires your source files to be located within the src directory.
es: Scarb requiere que sus archivos fuente se encuentren dentro del directorio src.

source: If you started a project that doesn’t use Scarb, as we did with the “Hello, world!” project, you can convert it to a project that does use Scarb. Move the project code into the src directory and create an appropriate `Scarb.toml` file.
es: Si ha iniciado un proyecto que no utiliza Scarb, como hicimos con el proyecto “Hello, world!”, puede convertirlo en un proyecto que utilice Scarb. Mueva el código del proyecto al directorio src y cree un archivo `Scarb.toml` apropiado.

source: From your hello_scarb directory, build your project by entering the following command:
es: Desde su directorio hello_scarb, construya su proyecto introduciendo el siguiente comando:

source: This command creates a `sierra` file in `target/release`, let's ignore the `sierra` file for now.
es: Este comando crea un archivo `sierra` en `target/release`, ignoremos el archivo `sierra` por ahora.

source: > Note: You will notice here that we didn't use a Scarb command, but rather a command from the Cairo binaries directly. > As Scarb doesn't have a command to execute Cairo code yet, we have to use the `cairo-run` command directly. > We will use this command in the rest of the tutorial, but we will also use Scarb commands to initialize projects.
es: > Nota: Notarás aquí que no usamos un comando de Scarb, sino un comando de los binarios de Cairo directamente. > Como Scarb no tiene un comando para ejecutar código de Cairo, tenemos que usar el comando `cairo-run` directamente. > Usaremos este comando en el resto del tutorial, pero también usaremos comandos de Scarb para inicializar proyectos.

source: ### Defining Custom Scripts
es: ### Definición de scripts personalizados

source: We can define Scarb scripts in `Scarb.toml` file, which can be used to execute custom shell scripts. Add the following line to your `Scarb.toml` file:
es: Podemos definir scripts scarb en el archivo `Scarb.toml`, que puede ser usado para ejecutar scripts shell personalizados. Añada la siguiente línea a su fichero `Scarb.toml`:

source: Now you can run the following command to run the project:
es: Ahora puede ejecutar el siguiente comando para ejecutar el proyecto:

source: Using `scarb run` is a convenient way to run custom shell scripts that can be useful to run files and test your project.
es: Usar `scarb run` es una forma conveniente de ejecutar scripts de shell personalizados que pueden ser útiles para ejecutar archivos y probar su proyecto.

source: - We can create a project using `scarb new`. - We can build a project using `scarb build` to generate the compiled Sierra code. - We can define custom scripts in `Scarb.toml` and call them with the `scarb run` command.
es: - Podemos crear un proyecto usando `scarb new`. - Podemos construir un proyecto usando `scarb build` para generar el código Sierra compilado. - Podemos definir scripts personalizados en `Scarb.toml` y llamarlos con el comando `scarb run`.

source: - Install the latest stable version of Cairo - Write and run a “Hello, world!” program using `cairo-run` directly - Create and run a new project using the conventions of Scarb
es: - Instalar la última versión estable de Cairo - Escribir y ejecutar un programa " Hello, world!" usando `cairo-run` directamente - Crear y ejecutar un nuevo proyecto usando las convenciones de Scarb

source: Save and run the program using `cairo-run src/lib.cairo`. You should receive an error message regarding an immutability error, as shown in this output:
es: Guarde y ejecute el programa utilizando `cairo-run src/lib.cairo`. Debería recibir un mensaje de error relativo a un error de inmutabilidad, como se muestra en esta salida:

source: Let’s try running this code. Replace the program currently in your _functions_ project’s _src/lib.cairo_ file with the preceding example and run it using `cairo-run src/lib.cairo`:
es: Intentemos ejecutar este código. Sustituye el programa que actualmente está en tu proyecto _functions_ de tu proyecto _src/lib.cairo_ con el ejemplo anterior y ejecútalo usando `cairo-run src/lib.cairo`:

source: When this program executes, it checks each `if` expression in turn and executes the first body for which the condition evaluates to `true`. Note that even though `number - 2 == 1` is `true`, we don’t see the output `number minus 2 is 1'.print()`, nor do we see the `number not found` text from the `else` block. That’s because Cairo only executes the block for the first true condition, and once it finds one, it doesn’t even check the rest. Using too many `else if` expressions can clutter your code, so if you have more than one, you might want to refactor your code. Chapter 5 describes a powerful Cairo branching construct called `match` for these cases.
es: Cuando este programa se ejecuta, verifica cada expresión `if` en orden y ejecuta el primer cuerpo para el cual la condición se evalúa como verdadera. Es importante destacar que aunque `number - 2 == 1` es verdadero, no vemos la salida `number minus 2 is 1'.print()`, ni tampoco vemos el texto `number is not divisible by 4, 3, or 2` del bloque `else`. Esto se debe a que Cairo solo ejecuta el bloque correspondiente a la primera condición verdadera que encuentra, y una vez que la encuentra, no verifica las demás. Usar demasiadas expresiones `else if` puede desordenar el código, por lo que si tienes más de una, es posible que desees refactorizar el código. El capítulo 5 describe una poderosa estructura de control de flujo de Cairo llamada `match` para estos casos.

source: > Note: Cairo prevents us from running program with infinite loops by including a gas meter. The gas meter is a mechanism that limits the amount of computation that can be done in a program. By setting a value to the `--available-gas` flag, we can set the maximum amount of gas available to the program. Gas is a unit of measurements that expresses the computation cost of an instruction. When the gas meter runs out, the program will stop. In this case, the program panicked because it ran out of gas, as the stop condition was never reached. > It is particularly important in the context of smart contracts deployed on Starknet, as it prevents from running infinite loops on the network. > If you're writing a program that needs to run a loop, you will need to execute it with the `--available-gas` flag set to a value that is large enough to run the program.
es: > Nota: Cairo nos previene de ejecutar programas con bucles infinitos incluyendo un contador de gas. El contador de gas es un mecanismo que limita la cantidad de computación que se puede hacer en un programa. Estableciendo un valor a la bandera `--available-gas`, podemos establecer la cantidad máxima de gas disponible para el programa. El gas es una unidad de medida que expresa el coste de cálculo de una instrucción. Cuando el contador de gas se agote, el programa se detendrá. En este caso, el programa entró en pánico porque se quedó sin gas, ya que nunca se alcanzó la condición de parada. > Es particularmente importante en el contexto de los contratos inteligentes desplegados en Starknet, ya que evita que se ejecuten bucles infinitos en la red. > Si estás escribiendo un programa que necesita ejecutar un bucle, tendrás que ejecutarlo con la bandera `--available-gas` establecida en un valor que sea lo suficientemente grande como para ejecutar el programa.

source: Cairo1 provides a set of common collection types that can be used to store and manipulate data. These collections are designed to be efficient, flexible, and easy to use. This section introduces the primary collection types available in Cairo1: `Array` and `Felt252Dict` (coming soon).
es: Cairo1 proporciona un conjunto de tipos de colecciones comunes que pueden utilizarse para almacenar y manipular datos. Estas colecciones están diseñadas para ser eficientes, flexibles y fáciles de usar. Esta sección presenta los principales tipos de colecciones disponibles en Cairo1: `Array` y `Felt252Dict` (próximamente).

source: An important thing to note is that arrays have limited modifications options. Arrays are, in fact, queues whose values can't be modified. This has to do with the fact that once a memory slot is written to, it cannot be overwritten, but only read from it. You can only append items to the end of an array and remove items from the front using `pop_front`.
es: Algo importante a tener en cuenta es que las arrays tienen opciones de modificación limitadas. Las arrays son, de hecho, colas cuyos valores no pueden modificarse. Esto tiene que ver con el hecho de que una vez que se escribe en un espacio de memoria, no se puede sobrescribir, sino sólo leer de él. Sólo se pueden añadir elementos al final de un array y eliminar elementos de la parte delantera utilizando `pop_front`.

source: #### Creating an Array
es: #### Crear un Array

source: You can pass the expected type of items inside the array when instantiating the array like this
es: Puede pasar el tipo esperado de elementos dentro de la array al instanciar la array de la siguiente manera

source: #### Updating an Array
es: #### Actualizar un Array

source: ##### Adding Elements
es: ##### Añadir Elementos

source: ##### Removing Elements
es: ##### Eliminar Elementos

source: #### Reading Elements from an Array
es: #### Lectura de Elementos de un Array
