Repository: cairo-book/cairo-book
Catalog: po/*.po
Languages: es, id, ko, zh_cn

source: To install Scarb, please refer to the [installation instructions](https://docs.swmansion.com/scarb/download). We strongly recommend that you install Scarb [via asdf](https://docs.swmansion.com/scarb/download.html#install-via-asdf), a CLI tool that can manage multiple language runtime versions on a per-project basis. This will ensure that the version of Scarb you use to work on a project always matches the one defined in the project settings, avoiding problems lead to version mismatch. Otherwise, you can simply run the following command in your terminal, and follow the onscreen instructions. This will install the latest stable release of Scarb.
id: Untuk menginstal Scarb, silakan lihat [petunjuk instalasi](https://docs.swmansion.com/scarb/download). Kami sangat menyarankan Anda untuk menginstal Scarb [melalui asdf](https://docs.swmansion.com/scarb/download.html#install-via-asdf), sebuah alat CLI yang dapat mengelola beberapa versi runtime bahasa pada basis proyek tertentu. Ini akan memastikan bahwa versi Scarb yang Anda gunakan untuk bekerja pada suatu proyek selalu sesuai dengan yang ditentukan dalam pengaturan proyek, menghindari masalah yang disebabkan oleh ketidakcocokan versi. Atau, Anda dapat menjalankan perintah berikut di terminal Anda, dan ikuti petunjuk yang muncul di layar. Ini akan menginstal rilis stabil terbaru dari Scarb.

source: Verify installation by running the following command in new terminal session, it should print both Scarb and Cairo language versions, e.g:
id: Verifikasi instalasi dengan menjalankan perintah berikut dalam sesi terminal baru, seharusnya akan mencetak versi dari Scarb dan bahasa Cairo, contohnya:

source: Note: This book assumes basic familiarity with the command line. Cairo makes no specific demands about your editing or tooling or where your code lives, so if you prefer to use an integrated development environment (IDE) instead of the command line, feel free to use your favorite IDE. The Cairo team has developed a VSCode extension for the Cairo language that you can use to get the features from the language server and code highlighting. See [Appendix D](appendix-04-useful-development-tools.md) for more details.
id: Catatan: Buku ini mengasumsikan pengetahuan dasar tentang baris perintah. Cairo tidak membuat persyaratan khusus tentang pengeditan atau alat bantu Anda atau di mana kode Anda berada, jadi jika Anda lebih memilih untuk menggunakan lingkungan pengembangan terpadu (IDE) daripada baris perintah, silakan gunakan IDE favorit Anda. Tim Cairo telah mengembangkan ekstensi VSCode untuk bahasa Cairo yang dapat Anda gunakan untuk mendapatkan fitur dari server bahasa dan penyorotan kode. Lihat [Lampiran D](appendix-04-useful-development-tools.md) untuk lebih banyak detail.

source: Open a terminal and enter the following commands to make a _cairo_projects_ directory and a directory for the “Hello, world!” project within the _cairo_projects_ directory.
id: Buka terminal dan masukkan perintah-perintah berikut untuk membuat direktori cairo_projects dan sebuah direktori untuk proyek “Hello, world!” di dalam direktori _cairo_projects_.

source: Note: Git is a common version control system. You can stop using version control system by using the `--vcs` flag. Run `scarb new -help` to see the available options.
id: Catatan: Git adalah sistem kontrol versi yang umum digunakan. Anda dapat berhenti menggunakan sistem kontrol versi dengan menggunakan opsi `--vcs`. Jalankan `scarb new -help` untuk melihat opsi yang tersedia.

source: ```toml [package] name = "hello_world" version = "0.1.0" # See more keys and their definitions at https://docs.swmansion.com/scarb/docs/reference/manifest [dependencies] # foo = { path = "vendor/foo" } ```
id: ```toml [package] name = "hello_world" version = "0.1.0" # Lihat definisi lebih lanjut di https://docs.swmansion.com/scarb/docs/reference/manifest [dependencies] # foo = { path = "vendor/foo" } ```

source: Listing 1-2: Contents of Scarb.toml generated by `scarb new`
id: Listing 1-2: Konten dari Scarb.toml yang digenerate dengan `scarb new`

source: Third, you see the `'Hello, World!'` short string. We pass this short string as an argument to `print()`, and the short string is printed to the screen.
id: Ketiga, Anda melihat string pendek `'Hello, World!'`. Kita meneruskan string pendek inisebagai argumen untuk `print()`, dan string pendek dicetak ke layar.

source: Running tests
id: Menjalankan uji coba

source: To run all the tests associated with a particular package, you can use the `scarb test` command. It is not a test runner by itself, but rather delegates work to a testing solution of choice. Scarb comes with preinstalled `scarb cairo-test` extension, which bundles Cairo's native test runner. It is the default test runner used by scarb test. To use third-party test runners, please refer to [Scarb's documentation](https://docs.swmansion.com/scarb/docs/extensions/testing.html#using-third-party-test-runners).
id: Untuk menjalankan semua tes yang terkait dengan paket tertentu, Anda dapat menggunakan Perintah "`scarb test`. Ini bukan test runner itu sendiri, melainkan delegasi bekerja untuk solusi pengujian pilihan. Scarb hadir dengan ekstensi `scarb cairo-test` yang telah diinstal sebelumnya, menggabungkan pengujian asli Cairo runner. Ini adalah test runner default yang digunakan oleh scarb test. Untuk menggunakan pihak ketiga test runner, silakan merujuk ke [dokumentasi Scarb](https://docs.swmansion.com/scarb/docs/extensions/testing.html#using-third-party-test-runners).

source: We can define custom scripts in `Scarb.toml` and call them with the `scarb run` command.
id: Kita dapat menentukan skrip khusus di `Scarb.toml` dan memanggilnya dengan `scarb run`.

source: We can run tests using the `scarb test` command.
id: Kita dapat menjalankan pengujian menggunakan perintah `scarb test`.

source: Install the latest stable version of Cairo
id: Instal versi stabil terbaru dari Cairo

source: Write and run a “Hello, Scarb!” program using `scarb` directly
id: Menulis dan menjalankan program "Hello, Scarb!" menggunakan `scarb` langsung

source: Create and run a new project using the conventions of Scarb
id: Membuat dan menjalankan proyek baru menggunakan konvensi Scarb

source: Execute tests using the `scarb test` command
id: Melakukan pengujian menggunakan perintah `scarb test`

source: This example shows how the compiler helps you find errors in your programs. Compiler errors can be frustrating, but really they only mean your program isn’t safely doing what you want it to do yet; they do _not_ mean that you’re not a good programmer! Experienced Caironautes still get compiler errors.
id: Contoh ini menunjukkan bagaimana kompiler membantu Anda menemukan kesalahan dalam program Anda. Kesalahan kompiler bisa membuat frustrasi, namun sebenarnya hal itu hanya berarti program Anda belum secara aman melakukan apa yang Anda inginkan; itu _bukan_ berarti Anda bukan seorang programmer yang baik! Para pengguna Cairo berpengalaman pun masih mendapatkan kesalahan kompiler.

source: It’s important that we get compile-time errors when we attempt to change a value that’s designated as immutable because this specific situation can lead to bugs. If one part of our code operates on the assumption that a value will never change and another part of our code changes that value, it’s possible that the first part of the code won’t do what it was designed to do. The cause of this kind of bug can be difficult to track down after the fact, especially when the second piece of code changes the value only _sometimes_. The Cairo compiler guarantees that when you state that a value won’t change, it really won’t change, so you don’t have to keep track of it yourself. Your code is thus easier to reason through.
id: Sangat penting bagi kita untuk mendapatkan kesalahan pada waktu kompilasi ketika kita mencoba untuk mengubah nilai yang ditetapkan sebagai immutable karena situasi ini dapat menyebabkan bug. Jika satu bagian dari kode kita beroperasi dengan asumsi bahwa nilai tidak akan pernah berubah dan bagian lain dari kode kita mengubah nilai tersebut, ada kemungkinan bahwa bagian pertama dari kode tidak akan melakukan apa yang dirancang untuk dilakukan. Penyebab bug semacam ini dapat sulit dilacak setelahnya, terutama ketika potongan kode kedua mengubah nilai hanya _terkadang_. Kompilator Cairo menjamin bahwa ketika Anda menyatakan bahwa sebuah nilai tidak akan berubah, nilai tersebut benar-benar tidak akan berubah, sehingga Anda tidak perlu melacaknya sendiri. Kode Anda menjadi lebih mudah untuk dipahami.

source: But mutability can be very useful, and can make code more convenient to write. Although variables are immutable by default, you can make them mutable by adding `mut` in front of the variable name. Adding `mut` also conveys intent to future readers of the code by indicating that other parts of the code will be changing this variable’s value.
id: Namun, mutabilitas bisa sangat berguna dan membuat kode lebih nyaman untuk ditulis. Meskipun variabel secara default bersifat immutable, Anda dapat membuatnya menjadi mutable dengan menambahkan `mut` di depan nama variabel. Menambahkan `mut` juga menyampaikan niat kepada pembaca kode di masa mendatang dengan menunjukkan bahwa bagian lain dari kode akan mengubah nilai variabel ini.

source: However, you might be wondering at this point what exactly happens when a variable is declared as `mut`, as we previously mentioned that Cairo's memory is immutable. The answer is that Cairo's memory is immutable, but the memory address the variable points to can be changed. Upon examining the low-level Cairo Assembly code, it becomes clear that variable mutation is implemented as syntactic sugar, which translates mutation operations into a series of steps equivalent to variable shadowing. The only difference is that at the Cairo level, the variable is not redeclared so its type cannot change.
id: Namun, pada saat ini Anda mungkin bertanya-tanya apa yang sebenarnya terjadi ketika sebuah variabel dideklarasikan sebagai `mut`, mengingat kami sebelumnya menyebutkan bahwa memori Cairo bersifat immutable. Jawabannya adalah bahwa memori Cairo bersifat immutable, namun alamat memori yang ditunjuk oleh variabel dapat diubah. Setelah memeriksa kode Assembly Cairo yang tingkat rendah, menjadi jelas bahwa mutasi variabel diimplementasikan sebagai sintaks gula, yang menerjemahkan operasi mutasi menjadi serangkaian langkah yang setara dengan variabel shadowing. Satu-satunya perbedaan adalah bahwa pada tingkat Cairo, variabel tidak dideklarasikan ulang sehingga tipe variabelnya tidak dapat berubah.

source: The last difference is that constants may be set only to a constant expression, not the result of a value that could only be computed at runtime. Only literal constants are currently supported.
id: Perbedaan terakhir adalah bahwa konstan hanya dapat diatur ke dalam ekspresi konstan, bukan hasil dari nilai yang hanya dapat dihitung pada waktu runtime. Saat ini, hanya konstan literal yang didukung.

source: In Cairo, if you don't specify the type of a variable or argument, its type defaults to a field element, represented by the keyword `felt252`. In the context of Cairo, when we say “a field element” we mean an integer in the range `0 <= x < P`, where `P` is a very large prime number currently equal to `P = 2^{251} + 17 * 2^{192}+1`. When adding, subtracting, or multiplying, if the result falls outside the specified range of the prime number, an overflow occurs, and an appropriate multiple of P is added or subtracted to bring the result back within the range (i.e., the result is computed modulo P).
id: Dalam Cairo, jika Anda tidak menentukan jenis variabel atau argumen, jenisnya secara default menjadi elemen lapangan, yang direpresentasikan oleh kata kunci `felt252`. Dalam konteks Cairo, ketika kita mengatakan "elemen lapangan," kami mengacu pada bilangan bulat dalam rentang `0 <= x < P`, di mana `P` adalah bilangan prima sangat besar yang saat ini setara dengan `P = 2^{251} + 17 * 2^{192} + 1`. Ketika melakukan penjumlahan, pengurangan, atau perkalian, jika hasilnya berada di luar rentang yang ditentukan oleh bilangan prima tersebut, maka akan terjadi overflow, dan kelipatan yang sesuai dari P akan ditambahkan atau dikurangkan untuk membawa hasil kembali dalam rentang tersebut (yaitu, hasilnya dihitung modulo P).

source: The most important difference between integers and field elements is division: Division of field elements (and therefore division in Cairo) is unlike regular CPUs division, where integer division `x / y` is defined as `[x/y]` where the integer part of the quotient is returned (so you get `7 / 3 = 2`) and it may or may not satisfy the equation `(x / y) * y == x`, depending on the divisibility of `x` by `y`.
id: Perbedaan paling penting antara bilangan bulat dan elemen lapangan terletak pada pembagian: Pembagian elemen lapangan (dan oleh karena itu pembagian di Cairo) berbeda dengan pembagian pada CPU biasa, di mana pembagian bilangan bulat `x / y` didefinisikan sebagai `[x/y]` di mana bagian bilangan bulat dari hasil bagi dikembalikan (sehingga Anda mendapatkan `7 / 3 = 2`) dan mungkin atau mungkin tidak memenuhi persamaan `(x / y) * y == x`, tergantung pada kelipatan `x` oleh `y`.

source: In Cairo, the result of `x/y` is defined to always satisfy the equation `(x / y) * y == x`. If y divides x as integers, you will get the expected result in Cairo (for example `6 / 2` will indeed result in `3`). But when y does not divide x, you may get a surprising result: For example, since `2 * ((P+1)/2) = P+1 ≡ 1 mod[P]`, the value of `1 / 2` in Cairo is `(P+1)/2` (and not 0 or 0.5), as it satisfies the above equation.
id: Dalam Cairo, hasil dari `x/y` didefinisikan untuk selalu memenuhi persamaan `(x / y) * y == x`. Jika y membagi x sebagai bilangan bulat, Anda akan mendapatkan hasil yang diharapkan di Cairo (misalnya `6 / 2` memang menghasilkan `3`). Tetapi ketika y tidak membagi x, Anda mungkin mendapatkan hasil yang mengejutkan: Sebagai contoh, karena `2 * ((P+1)/2) = P+1 ≡ 1 mod[P]`, nilai dari `1 / 2` di Cairo adalah `(P+1)/2` (dan bukan 0 atau 0.5), karena memenuhi persamaan di atas.

source: The felt252 type is a fundamental type that serves as the basis for creating all types in the core library. However, it is highly recommended for programmers to use the integer types instead of the `felt252` type whenever possible, as the `integer` types come with added security features that provide extra protection against potential vulnerabilities in the code, such as overflow checks. By using these integer types, programmers can ensure that their programs are more secure and less susceptible to attacks or other security threats. An _integer_ is a number without a fractional component. This type declaration indicates the number of bits the programmer can use to store the integer. Table 3-1 shows the built-in integer types in Cairo. We can use any of these variants to declare the type of an integer value.
id: Jenis data `felt252` adalah jenis data dasar yang berfungsi sebagai dasar untuk membuat semua jenis data dalam pustaka inti. Namun, sangat disarankan bagi para pemrogram untuk menggunakan jenis data bilangan bulat daripada jenis `felt252` sebisa mungkin, karena jenis data `integer` dilengkapi dengan fitur keamanan tambahan yang memberikan perlindungan ekstra terhadap potensi kerentanan dalam kode, seperti pemeriksaan overflow. Dengan menggunakan jenis data bilangan bulat ini, para pemrogram dapat memastikan bahwa program-program mereka lebih aman dan kurang rentan terhadap serangan atau ancaman keamanan lainnya. Sebuah _integer_ adalah angka tanpa komponen pecahan. Deklarasi jenis data ini menunjukkan jumlah bit yang dapat digunakan oleh pemrogram untuk menyimpan bilangan bulat. Tabel 3-1 menunjukkan jenis data bilangan bulat bawaan dalam Cairo. Kita dapat menggunakan salah satu varian ini untuk mendeklarasikan jenis data dari nilai bilangan bulat.

source: You can write integer literals in any of the forms shown in Table 3-2. Note that number literals that can be multiple numeric types allow a type suffix, such as `57_u8`, to designate the type.
id: Anda dapat menulis literal bilangan bulat dalam salah satu bentuk yang ditunjukkan dalam Tabel 3-2. Perlu diperhatikan bahwa literal angka yang dapat menjadi beberapa jenis numerik memungkinkan adanya akhiran jenis, seperti `57_u8`, untuk menunjukkan jenisnya.

source: As in most other programming languages, a Boolean type in Cairo has two possible values: `true` and `false`. Booleans are one felt252 in size. The Boolean type in Cairo is specified using `bool`. For example:
id: Seperti dalam kebanyakan bahasa pemrograman lainnya, tipe data Boolean dalam Cairo memiliki dua nilai yang mungkin: `true` dan `false`. Booleans memiliki ukuran satu `felt252`. Tipe data Boolean dalam Cairo ditentukan menggunakan `bool`. Sebagai contoh:

source: We can also declare the tuple with value and types at the same time. For example:
id: Kita juga dapat mendeklarasikan tupel dengan nilai dan tipe pada saat yang bersamaan. Sebagai contoh:

source: The declaration of `another_function` has one parameter named `x`. The type of `x` is specified as `felt252`. When we pass `5` in to `another_function`, the `.print()` function outputs `5` in the console.
id: Deklarasi `another_function` memiliki satu parameter bernama `x`. Tipe data dari `x` ditentukan sebagai `felt252`. Ketika kita memasukkan `5` ke dalam `another_function`, fungsi `.print()` mengeluarkan output `5` di konsol.

source: This example creates a function named `another_function` with two parameters. The first parameter is named `x` and is an `felt252`. The second is named `y` and is type `felt252` too. The function then prints the content of the felt `x` and then the content of the felt `y`.
id: Contoh ini membuat sebuah fungsi bernama `another_function` dengan dua parameter. Parameter pertama dinamai `x` dan memiliki tipe data `felt252`. Yang kedua dinamai `y` dan juga memiliki tipe data `felt252`. Fungsi kemudian mencetak isi dari felt `x` dan kemudian isi dari felt `y`.

source: Because we called the function with `5` as the value for `x` and `6` as the value for `y`, the program output contains those values.
id: Karena kita memanggil fungsi dengan `5` sebagai nilai untuk `x` dan `6` sebagai nilai untuk `y`, output program berisi nilai-nilai tersebut.

source: Expressions evaluate to a value and make up most of the rest of the code that you’ll write in Cairo. Consider a math operation, such as `5 + 6`, which is an expression that evaluates to the value `11`. Expressions can be part of statements: in Listing 2-1, the `6` in the statement `let y = 6;` is an expression that evaluates to the value `6`. Calling a function is an expression. A new scope block created with curly brackets is an expression, for example:
id: Expression mengevaluasi menjadi suatu nilai dan membentuk sebagian besar kode yang akan Anda tulis di Cairo. Pertimbangkan operasi matematika, seperti `5 + 6`, yang merupakan ekspresi yang mengevaluasi menjadi nilai `11`. Ekspresi dapat menjadi bagian dari pernyataan: dalam Listing 2-1, `6` dalam pernyataan `let y = 6;` adalah ekspresi yang mengevaluasi menjadi nilai `6`. Memanggil fungsi adalah sebuah ekspresi. Blok cakupan baru yang dibuat dengan kurung kurawal adalah ekspresi, sebagai contoh:

source: Running this code will print `[DEBUG] (raw: 6)`. But if we place a semicolon at the end of the line containing `x + 1`, changing it from an expression to a statement, we’ll get an error:
id: Menjalankan kode ini akan mencetak `[DEBUG] (raw: 6)`. Tetapi jika kita menempatkan titik koma di akhir baris yang berisi `x + 1`, mengubahnya dari suatu ekspresi menjadi suatu pernyataan, kita akan mendapatkan sebuah kesalahan:

source: When we run this program, we’ll see `again!` printed over and over continuously until we stop the program manually, because the stop condition is never reached. While the compiler prevents us from writing programs without a stop condition (`break` statement), the stop condition might never be reached, resulting in an infinite loop. Most terminals support the keyboard shortcut
id: Ketika kita menjalankan program ini, kita akan melihat `again!` dicetak terus-menerus secara terus menerus sampai kita menghentikan program secara manual, karena kondisi berhenti tidak pernah tercapai. Meskipun kompiler mencegah kita menulis program tanpa kondisi berhenti (`break` statement), kondisi berhenti mungkin tidak pernah tercapai, mengakibatkan perulangan tak terbatas. Sebagian besar terminal mendukung pintasan keyboard

source: to interrupt a program that is stuck in a continual loop. Give it a try:
id: untuk menghentikan sebuah program yang terjebak dalam perulangan berkelanjutan. Coba saja:

source: Note: Cairo prevents us from running program with infinite loops by including a gas meter. The gas meter is a mechanism that limits the amount of computation that can be done in a program. By setting a value to the `--available-gas` flag, we can set the maximum amount of gas available to the program. Gas is a unit of measurement that expresses the computation cost of an instruction. When the gas meter runs out, the program will stop. In this case, the program panicked because it ran out of gas, as the stop condition was never reached. It is particularly important in the context of smart contracts deployed on Starknet, as it prevents from running infinite loops on the network. If you're writing a program that needs to run a loop, you will need to execute it with the `--available-gas` flag set to a value that is large enough to run the program.
id: Catatan: Cairo mencegah kita untuk menjalankan program dengan perulangan tak terbatas dengan menyertakan pengukur gas. Pengukur gas adalah mekanisme yang membatasi jumlah komputasi yang dapat dilakukan dalam sebuah program. Dengan mengatur nilai untuk opsi `--available-gas`, kita dapat menetapkan jumlah maksimum gas yang tersedia untuk program. Gas adalah satuan pengukuran yang mengungkapkan biaya komputasi dari sebuah instruksi. Ketika pengukur gas habis, program akan berhenti. Dalam kasus ini, program mengalami panic karena kehabisan gas, karena kondisi berhenti tidak pernah tercapai. Ini sangat penting dalam konteks kontrak pintar yang diimplementasikan di Starknet, karena mencegah dari perulangan tak terbatas di jaringan. Jika Anda menulis program yang perlu menjalankan suatu perulangan, Anda perlu menjalankannya dengan opsi `--available-gas` diatur ke nilai yang cukup besar untuk menjalankan program.

source: To break out of a loop, you can place the `break` statement within the loop to tell the program when to stop executing the loop. Let's fix the infinite loop by adding a making the stop condition `i > 10` reachable.
id: Untuk keluar dari suatu perulangan, Anda dapat menempatkan pernyataan `break` dalam perulangan untuk memberi tahu program kapan harus berhenti menjalankan perulangan. Mari perbaiki perulangan tak terbatas dengan membuat kondisi berhenti `i > 10` dapat dicapai.

source: An important thing to note is that arrays have limited modification options. Arrays are, in fact, queues whose values can't be modified. This has to do with the fact that once a memory slot is written to, it cannot be overwritten, but only read from it. You can only append items to the end of an array and remove items from the front using `pop_front`.
id: Hal penting yang perlu dicatat adalah bahwa array memiliki opsi modifikasi yang terbatas. Array sebenarnya adalah antrian nilai yang tidak dapat diubah. Hal ini terkait dengan fakta bahwa begitu suatu slot memori ditulis, tidak dapat ditimpa, tetapi hanya bisa dibaca. Anda hanya dapat menambahkan item ke akhir array dan menghapus item dari depan menggunakan `pop_front`.
