Repository: cairo-book/cairo-book
Catalog: po/*.po
Languages: es, id, ko, zh_cn

source: To verify that the proof generated by a Cairo program execution that used a `Felt252Dict<T>` is correct we need to check that there wasn't any illegal tampering with the dictionary. This is done through a method called `squash_dict` that reviews each entry of the entry list and checks that access to the dictionary remains coherent throughout the execution.
id: Untuk memverifikasi bahwa bukti yang dihasilkan oleh eksekusi program Cairo yang menggunakan `Felt252Dict<T>` adalah benar, kita perlu memeriksa bahwa tidak ada tindakan pemalsuan yang ilegal terhadap kamus. Hal ini dilakukan melalui metode yang disebut `squash_dict` yang meninjau setiap entri dari daftar entri dan memeriksa bahwa akses ke kamus tetap konsisten sepanjang eksekusi.
zh_cn: 为了验证使用`Felt252Dict<T>`的Cairo程序执行所生成的证明是否正确，我们需要检查字典是否被非法篡改。这是通过一个名为`squash_dict`的方法来完成的，这个方法会审查条目列表中的每一个条目，并检查字典的访问在整个执行过程中是否保持一致。

source: ### Dictionary Destruction
zh_cn: #### 字典的析构

source: If you run the examples from [Basic Use of Dictionaries](#basic-use-of-dictionaries) you'd notice that there was never a call to squash dictionary, but the program compiled successfully nonetheless. What happened behind the scene was that squash was called automatically via the `Felt252Dict<T>` implementation of the `Destruct<T>` trait. This call occurred just before the `balance` dictionary went out of scope.
id: Jika Anda menjalankan contoh-contoh dari [Basic Use of Dictionaries](#basic-use-of-dictionaries), Anda akan melihat bahwa tidak pernah ada pemanggilan untuk merenggut kamus, namun program berhasil dikompilasi. Yang terjadi di balik layar adalah bahwa merenggut (squash) dipanggil secara otomatis melalui implementasi `Felt252Dict<T>` dari trait `Destruct<T>`. Panggilan ini terjadi tepat sebelum kamus `balance` keluar dari cakupan (out of scope).
zh_cn: 如果你运行[字典的基本用法](#basic-use-of-dictionaries)中的示例，你会发现那些例子从来没有调用过字典压缩，但程序还是编译成功了。这是因为在背后，squash通过`Destruct<T>` trait的`Felt252Dict<T>`实现了被自动调用。这个调用发生在`balance`字典离开作用域之前。

source: ### More Dictionaries
zh_cn: ### 更多字典范例

source: We will start by explaining the `entry` method which is part of a dictionary basic functionality included in `Felt252DictTrait<T>` which we didn't mention at the beginning. Soon after, we will see examples of how `Felt252Dict<T>` [interacts](#dictionaries-of-complex-types) with other complex types such as `Array<T>` and how to [implement](#dictionaries-as-struct-members) a struct with a dictionary as a member.
id: Kami akan memulai dengan menjelaskan metode `entry` yang merupakan bagian dari fungsi dasar kamus yang disertakan dalam `Felt252DictTrait<T>` yang tidak kami sebutkan di awal. Segera setelah itu, kita akan melihat contoh bagaimana `Felt252Dict<T>` [berinteraksi](#dictionaries-of-complex-types) dengan jenis-jenis kompleks lainnya seperti `Array<T>` dan bagaimana cara [mengimplementasikan](#dictionaries-as-struct-members) sebuah struktur dengan kamus sebagai anggotanya.
zh_cn: 我们将首先解释`entry`方法，它是`Felt252DictTrait<T>`中包含的字典基本功能的一部分，我们在开始时没有提到。很快，我们将看到`Felt252Dict<T>`如何与其他复杂类型如`Array<T>`[交互](#dictionaries-of-complex-types)的例子，以及如何[实现](#dictionaries-as-struct-members)一个以字典为成员的结构体。

source: ### Entry and Finalize
zh_cn: ### 条目(Entry)和最终确定(Finalize)

source: The first input parameter takes ownership of the dictionary while the second one is used to create the appropriate entry. It returns a tuple containing a `Felt252DictEntry<T>`, which is the type used by Cairo to represent dictionary entries, and a `T` representing the value held previously.
id: Parameter input pertama mengambil kepemilikan dari kamus sedangkan yang kedua digunakan untuk membuat entri yang sesuai. Metode ini mengembalikan sebuah tuple yang berisi `Felt252DictEntry<T>`, yang merupakan tipe yang digunakan oleh Cairo untuk mewakili entri kamus, dan `T` yang mewakili nilai yang dipegang sebelumnya.
zh_cn: 第一个输入参数获得字典的所有权，第二个参数用于创建相应的条目。它返回一个元组，包含一个`Felt252DictEntry<T>`，这是Cairo用来表示字典条目的类型，和一个`T`，代表之前持有的值。

source: This method receives the entry and the new value as a parameter and returns the updated dictionary.
id: Metode ini menerima entri dan nilai baru sebagai parameter, lalu mengembalikan kamus yang telah diperbarui.
zh_cn: 该方法接收条目和新值作为参数，并返回更新后的字典。

source: 1. Create the new entry to add using the `entry` method 2. Insert back the entry where the `new_value` equals the `previous_value`. 3. Return the value.
zh_cn: 1.使用`entry`方法创建要添加的新条目 2.插入`new_value`等于`previous_value`的条目。 3.返回值。

source: ### Dictionaries of types not supported natively
zh_cn: ### 非远胜支持类型的字典

source: One restriction of `Felt252Dict<T>` that we haven't talked about is the trait `Felt252DictValue<T>`. This trait defines the `zero_default` method which is the one that gets called when a value does not exist in the dictionary. This is implemented by some common data types, such as most unsigned integers, `bool` and `felt252` - but it is not implemented for more complex ones types such as arrays, structs (including `u256`), and other types from the core library. This means that making a dictionary of types not natively supported is not a straightforward task, because you would need to write a couple of trait implementations in order to make the data type a valid dictionary value type. To compensate this, you can wrap your type inside a `Nullable<T>`.
zh_cn: `Felt252Dict<T>`的一个限制我们还没有讨论过，那就是 `Felt252DictValue<T>` trait。 该trait定义了 `zero_default` 方法，当字典中不存在某个值时，就会调用该方法。 一些常见的数据类型（如大多数无符号整数、`bool` 和 `felt252`）实现了该方法，但更复杂的数据类型，如数组、结构体（包括 `u256`）和核心库中的其他类型，则没有实现该方法。 这就意味着，将不受原生支持的类型封装成字典并不是一件简单的事情，因为您需要编写一些trait的实现，才能使这些数据类型成为有效的字典值类型。 为了弥补这一不足，您可以将您的类型封装在 `Nullable<T>`中。

source: 1. We wrapped the array inside a `Box` using the `new` method from `BoxTrait`. 2. We wrapped the `Box` inside a nullable using the `nullable_from_box` function. 3. Finally, we inserted the result.
zh_cn: 1.我们使用`BoxTrait`中的`new`方法将数组封装在`Box`中。 2.我们使用`nullable_from_box`函数将`Box`封装在nullable中。 3.最后，我们插入了上面的结果。

source: 1. Read the value using `get`. 2. Verified it is non-null using the `match_nullable` function. 3. Unwrapped the value inside the box and asserted it was correct.
zh_cn: 1.使用`get`读取值。 2.使用`match_nullable`函数验证其为非空值。 3.解压缩Box内的值，并断言它是正确的。

source: ### Dictionaries as Struct Members
zh_cn: ### 作为结构体成员的字典

source: - `users_amount`, the number of users currently inserted and - `balances`, a mapping of each user to its balance.
zh_cn: - `users_amount`，当前插入的用户数量。 - `balances`，每个用户与其余额的映射。

source: - `new` for easily creating new `UserDatabase` types. - `add_user` to insert users in the database. - `get_balance` to find user's balance in the database.
zh_cn: - `new`用于方便创建新的`UserDatabase`类型。 - `add_user`用于在数据库中插入用户。 - `get_balance`用于在数据库中查找用户的余额。

source: 1. `T` should implement the `Copy<T>` since it's required for getting values from a `Felt252Dict<T>`. 2. All value types of a dictionary implement the `Felt252DictValue<T>`, our generic type should do as well. 3. To insert values, `Felt252DictTrait<T>` requires all value types to be destructible.
zh_cn: 1.`T` 应该实现 `Copy<T>`，因为从 `Felt252Dict<T>` 获取值需要它。 2.所有字典的值类型都实现了 `Felt252DictValue<T>`，我们的泛型也应该实现。 3.为了插入值，`Felt252DictTrait<T>`要求所有的值类型都是可析构的。

source: The implementation, with all restriction in place, would be as follow:
id: Implementasinya, dengan semua batasan yang ada, akan seperti berikut:
zh_cn: 在所有限制条件均已实现的情况下，执行情况如下：

source: Our database implementation is almost complete, except for one thing: the compiler doesn't know how to make a `UserDatabase<T>` go out of scope, since it doesn't implement the `Drop<T>` trait, nor the `Destruct<T>` trait. Since it has a `Felt252Dict<T>` as a member, it cannot be dropped, so we are forced to implement the `Destruct<T>` trait manually (refer to the [Ownership](ch04-01-what-is-ownership.md#the-drop-trait) chapter for more information). Using `#[derive(Destruct)]` on top of the `UserDatabase<T>` definition won't work because of the use of [genericity](/src/ch08-00-generic-types-and-traits.md) in the struct definition. We need to code the `Destruct<T>` trait implementation by ourselves:
zh_cn: 我们的数据库实现几乎已经完成，除了一点：编译器不知道如何让 `UserDatabase<T>` 脱离作用域，因为它没有实现 `Drop<T>` 特性，也没有实现 `Destruct<T>` 特性。 由于它有一个 `Felt252Dict<T>` 作为成员，它不能被丢弃，所以我们不得不手动实现 `Destruct<T>` 特性（更多信息请参阅 [所有权](ch04-01-what-is-ownership.md#the-drop-trait) 章节）。 在 `UserDatabase<T>` 定义之上使用 `#[derive(Destruct)]`是行不通的，因为在 struct 定义中使用了 [泛型](/src/ch08-00-generic-types-and-traits.md) 。我们需要自己编写实现 `Destruct<T>` trait的代码：

source: Well done! You finished this chapter on arrays and dictionaries in Cairo. These data structures may be a bit challenging to grasp, but they are really useful.
id: Selamat! Anda telah menyelesaikan bab ini tentang array dan kamus di Cairo. Struktur data ini mungkin agak sulit dipahami, tetapi mereka benar-benar berguna.
zh_cn: 干得好！你已经完成了Cairo中关于数组和字典的章节。要掌握这些数据结构可能有点难度，但它们确实非常有用。

source: When you’re ready to move on, we’ll talk about a concept that Cairo shares with Rust and that _doesn’t_ commonly exist in other programming languages: ownership.
id: Ketika Anda siap melanjutkan, kita akan membahas sebuah konsep yang Cairo bagikan dengan Rust dan _tidak_ umum ada dalam bahasa pemrograman lain: kepemilikan.
zh_cn: 当你准备好继续前进时，我们将讨论一个Cairo与Rust共有，而在其他编程语言中通常 _不存在_ 的概念：所有权。

source: # Custom Data Structures
zh_cn: # 自定义数据结构

source: When you first start programming in Cairo, you'll likely want to use arrays (`Array<T>`) to store collections of data. However, you will quickly realize that arrays have one big limitation - the data stored in them is immutable. Once you append a value to an array, you can't modify it.
zh_cn: 当你第一次在开罗开始编程时，你可能想要使用数组（'Array<T>'） 来存储数据集合。但是，您很快就会意识到 数组有一个很大的限制 - 存储在其中的数据是不可变的。一旦将值附加到数组中，则无法对其进行修改。

source: This can be frustrating when you want to use a mutable data structure. For example, say you're making a game where the players have a level, and they can level up. You might try to store the level of the players in an array:
zh_cn: 当您想要使用可变数据结构时，这可能会令人沮丧。 例如，假设你正在制作一个游戏，玩家有一个等级属性，他们可以升级。 您可以尝试将玩家的等级存储在数组中：

source: But then you realize you can't increase the level at a specific index once it's set. If a player dies, you cannot remove it from the array unless he happens to be in the first position.
zh_cn: 但是接下来你会发觉，一旦给某个特定的索引中玩家设置了等级，它的等级就无法再次提升。 如果玩家死亡，你也无法将它移出数组，除非他碰巧排在第一位。

source: Fortunately, Cairo provides a handy built-in [dictionary type](./ch03-02-dictionaries.md) called `Felt252Dict<T>` that allows us to simulate the behavior of mutable data structures. Let's first explore how to use it to create a dynamic array implementation.
zh_cn: 幸运的是，Cairo 提供了一个方便的内置 [字典类型]（./ch03-02-dictionaries.md） 称为 `Felt252Dict<T>`， 允许我们模拟可变数据结构的行为。我们先来探讨一下如何使用它来创建一个动态数组实现。

source: Note: Several concepts used in this chapter are presented in later parts of the book. We recommend you to check out the following chapter first: [Structs](ch05-00-using-structs-to-structure-related-data), [Methods](./ch05-03-method-syntax.md), [Generic types](./ch08-00-generic-types-and-traits.md), [Traits](./ch08-02-traits-in-cairo.md)
zh_cn: 注意：本章中使用的几个概念将在后面几个章节里详细解释。 我们建议您先查看以下章节： [结构体]（./ch05-00-using-structs-to-structure-related-data）， [方法]（./ch05-03-method-syntax.md）、 [泛型]（./ch08-00-generic-types-and-traits.md）， [Traits]（./ch08-02-traits-in-cairo.md）

source: ## Simulating a dynamic array with dicts
zh_cn: ## 使用字典模拟动态数组

source: First, let's think about how we want our mutable dynamic array to behave. What operations should it support?
zh_cn: 首先，让我们考虑一下我们希望可变动态数组的行为方式。它需要支持哪些操作？

source: - Allow us to append items at the end - Let us access any item by index - Allow setting the value of an item at a specific index - Return the current length
zh_cn: - 允许我们在末尾附加项 - 让我们按索引访问任何项 - 允许在特定索引处设置项的值 - 返回当前长度

source: This provides a blueprint for the implementation of our dynamic array. We named it Vec as it is similar to the `Vec<T>` data structure in Rust.
zh_cn: 这为我们的动态数组的实现提供了蓝图。 我们命名它为Vec，因为它类似于 Rust 中的`Vec<T>` 数据结构。

source: ### Implementing a dynamic array in Cairo
zh_cn: ## 在Cairo中实现���态数组

source: To store our data, we'll use a `Felt252Dict<T>` which maps index numbers (felts) to values. We'll also store a separate `len` field to track the length.
zh_cn: 为了存储我们的数据，我们将使用`Felt252Dict<T>` 来映射索引号（felt）到值。 我们还将存储一个单独的`len`字段来跟踪长度。

source: Here is what our struct looks like. We wrap the type `T` inside `Nullable` pointer to allow using any type `T` in our data structure, as explained in the [Dictionaries](./ch03-02-dictionaries.md#dictionaries-of-types-not-supported-natively) section:
zh_cn: 下面是我们的结构体的样子。我们将类型`T`包装在`Nullable`指针中，这使得在我们的数据结构中可以使用任何类型的 `T` ， 如[词典](./ch03-02-dictionaries.md#dictionaries-of-types-not-supported-natively) ：

source: The key thing that makes this vector mutable is that we can insert values into the dictionary to set or update values in our data structure. For example, to update a value at a specific index, we do:
zh_cn: 使这个向量可变的关键是我们可以将值插入到用于在数据结构中设置或更新值的字典。 例如，要更新特定索引处的值，我们执行以下操作：

source: While arrays are immutable, dictionaries provide the flexibility we need for modifiable data structures like vectors.
zh_cn: 虽然数组是不可变的，但字典提供了我们的可修改的数据结构（如向量）所需要的灵活性。

source: The implementation of the rest of the interface is straightforward. The implementation of all the methods defined in our interface can be done as follow :
zh_cn: 接口其余部分的实现非常简单。 在我们的接口中定义的所有方法的实现可以按如下方式完成:

source: The full implementation of the `Vec` structure can be found in the community-maintained library [Alexandria](https://github.com/keep-starknet-strange/alexandria/tree/main/src/data_structures).
zh_cn: “Vec”结构的完整实现可以在社区维护的库 [Alexandria](https://github.com/keep-starknet-strange/alexandria/tree/main/src/data_structures)里找到。

source: ## Simulating a Stack with dicts
zh_cn: ## 使用字典模拟堆栈

source: A Stack is a LIFO (Last-In, First-Out) collection. The insertion of a new element and removal of an existing element takes place at the same end, represented as the top of the stack.
zh_cn: 堆栈是 LIFO（后进先出）集合。插入新的元素和现有元素的删除发生在同一端， 表示为堆栈的顶部。

source: - Push an item to the top of the stack - Pop an item from the top of the stack - Check whether there are still any elements in the stack.
zh_cn: - 将项推到堆栈的顶部 - 从堆栈顶部弹出一个项 - 检查堆栈中是否还有元素。

source: ### Implementing a Mutable Stack in Cairo
zh_cn: ### 在Cairo实现可变堆栈

source: To create a stack data structure in Cairo, we can again use a `Felt252Dict<T>` to store the values of the stack along with a `usize` field to keep track of the length of the stack to iterate over it.
zh_cn: 要在Cairo创建堆栈数据结构，我们可以再次使用`Felt252Dict<T>` 将堆栈的值与`usize`字段一起存储，以跟踪堆栈的长度来迭代它。

source: The code uses the `insert` and `get` methods to access the values in the `Felt252Dict<T>`. To push an element at the top of the stack, the `push` function inserts the element in the dict at index `len` - and increases the `len` field of the stack to keep track of the position of the stack top. To remove a value, the `pop` function retrieves the last value at position `len-1` and then decreases the value of `len` to update the position of the stack top accordingly.
zh_cn: 该代码使用 `insert`和 `get`方法访问`Felt252Dict<T>`。 要将元素推送到堆栈顶部，使用`push`函数将元素插入字典中的索引 'len' - 并增加 堆栈的 'len' 字段来跟踪堆栈顶部的位置。 要删除一个值，使用`pop`函数检索位置`len-1`处的最后一个值 然后减小 'len' 的值以更新堆栈顶部的位置。

source: The full implementation of the Stack, along with more data structures that you can use in your code, can be found in the community-maintained [Alexandria](https://github.com/keep-starknet-strange/alexandria/tree/main/src/data_structures) library, in the "data_structures" crate.
zh_cn: 堆栈的完整实现，以及您拥有的更多数据结构 可以在你的代码中使用，可以在社区维护中的 [Alexandria](https://github.com/keep-starknet-strange/alexandria/tree/main/src/data_structures) 库中的`data_structures` crate中找到。

source: While Cairo's memory model is immutable and can make it difficult to implement mutable data structures, we can fortunately use the `Felt252Dict<T>` type to simulate mutable data structures. This allows us to implement a wide range of data structures that are useful for many applications, effectively hiding the complexity of the underlying memory model.
zh_cn: 虽然 Cairo 的内存模型是不可变的，使其难以实现可变的数据结构， 但幸运的是，我们可以使用 'Felt252Dict<T>' 类型来模拟可变数据结构。 这使我们能够实现通用的对应用程序有用的数据结构，有效地隐藏了底层内存模型的复杂性。

source: # Understanding Cairo's Ownership system
es: # Entendiendo el Ownership de Cairo
zh_cn: # 了解Cairo的所有权制度

source: Cairo is a language built around a linear type system that allows us to statically ensure that in every Cairo program, a value is used exactly once. This linear type system helps preventing runtime errors by ensuring that operations that could cause such errors, such as writing twice to a memory cell, are detected at compile time. This is achieved by implementing an ownership system and forbidding copying and dropping values by default. In this chapter, we’ll talk about Cairo's ownership system as well as references and snapshots.
es: Cairo es un lenguaje construido alrededor de un sistema de tipos lineales que nos permite asegurarnos estáticamente de que en cada programa de Cairo, un valor se utiliza exactamente una vez. Este sistema de tipos lineales ayuda a prevenir errores en tiempo de ejecución asegurando que las operaciones que podrían causar dichos errores, como escribir dos veces en una celda de memoria, se detecten en tiempo de compilación. Esto se logra implementando un Ownership y prohibiendo la copia y eliminación de valores por defecto. En este capítulo, hablaremos sobre el Ownership de Cairo, así como sobre las referencias y snapshots.
zh_cn: Cairo是一种围绕着线性类型系统建立的语言，它允许我们 静态地确保在每个Cairo程序中，一个值只被使用一次。 这种线性类型系统有助于防止运行时错误，因为它可以确保在编译时检测到可能导致这种错误的操作，如向一个内存单元写两次。 这是通过实施一个所有权系统来实现的 并在默认情况下禁止复制和丢弃数值。在本章中，我们将 讨论Cairo的所有权系统以及引用和快照（snapshot）。

source: ## What Is Ownership?
es: ## ¿Qué es Ownership?
zh_cn: ## 什么是所有权？

source: Cairo implements an ownership system to ensure the safety and correctness of its compiled code. The ownership mechanism complements the linear type system, which enforces that objects are used exactly once. This helps prevent common operations that can produce runtime errors, such as illegal memory address references or multiple writes to the same memory address, and ensures the soundness of Cairo programs by checking at compile time that all the dictionaries are squashed.
es: Cairo implementa un sistema de propiedad para garantizar la seguridad y corrección de su código compilado. El mecanismo de propiedad complementa el sistema de tipos lineales, que obliga a que los objetos se usen exactamente una vez. Esto ayuda a prevenir operaciones comunes que pueden producir errores en tiempo de ejecución, como referencias ilegales de direcciones de memoria o múltiples escrituras en la misma dirección de memoria, y garantiza la corrección de los programas de Cairo comprobando en tiempo de compilación que todos los diccionarios están aplastados.
zh_cn: Cairo实现了一个所有权系统以确保其编译代码的安全性和正确性。 所有权机制是对线性类型系统的补充，该系统规定对象只能使用一次。 这有助于防止可能产生运行时错误的常见操作，如非法的内存地址引用或对同一内存地址的多次写入， 并通过在编译时检查所有的字典是否被压缩（squash）来确保Cairo程序的正确性。

source: Now that we’re past basic Cairo syntax, we won’t include all the `fn main() {` code in examples, so if you’re following along, make sure to put the following examples inside a `main` function manually. As a result, our examples will be a bit more concise, letting us focus on the actual details rather than boilerplate code.
es: Ahora que hemos pasado la sintaxis básica de Cairo, no incluiremos todo el código `fn main() {` en los ejemplos, así que si estás siguiendo, asegúrate de colocar los siguientes ejemplos dentro de una función `main` manualmente. Como resultado, nuestros ejemplos serán un poco más concisos, lo que nos permitirá enfocarnos en los detalles reales en lugar del código de plantilla.
zh_cn: 既然我们已经掌握了Cairo基本语法，我们将不会在之后的例子中包含 `fn main() {` 代码， 所以如果你是一路跟过来的，必须手动将之后例子的代码放入一个 `main` 函数中。 这样，例子将显得更加简明，使我们可以关注实际细节而不是样板代码。

source: ### Ownership Rules
es: ### Reglas de Ownership
zh_cn: ### 所有权规则

source: First, let’s take a look at the ownership rules. Keep these rules in mind as we work through the examples that illustrate them:
es: En primer lugar, echemos un vistazo a las reglas de propiedad. Mantenga estas reglas en mente mientras trabajamos a través de los ejemplos que las ilustran:
zh_cn: 首先，让我们看一下所有权规则。请牢记这些规则，我们将通过例子来说明它们：

source: - Each value in Cairo has an _owner_. - There can only be one owner at a time. - When the owner goes out of scope, the value will be _dropped_.
es: - Cada valor en Cairo tiene un _propietario_. - Solo puede haber un propietario a la vez. - Cuando el propietario sale del ámbito, el valor será _descartado_.
zh_cn: - Cairo的每个值都有一个 _所有者_ 。 - 在同一时间只能有一个所有者。 - 当所有者超出作用域（scope）时，该值将被 _丢弃_ 。

source: ### Variable Scope
es: ### Ámbito de Variables
zh_cn: ### 变量作用域

source: As a first example of ownership, we’ll look at the _scope_ of some variables. A scope is the range within a program for which an item is valid. Take the following variable:
es: Como primer ejemplo de propiedad, veremos el _ámbito_ de algunas variables. Un ámbito es el alcance dentro de un programa para el cual un elemento es válido. Tomemos la siguiente variable:
zh_cn: 在所有权的第一个例子中，我们看看一些变量的 作用域（ _scope_ ）。作用域是一个项（item）在程序中有效的范围。假设有这样一个变量：

source: The variable `s` refers to a short string, where the value of the string is hardcoded into the text of our program. The variable is valid from the point at which it’s declared until the end of the current _scope_. Listing 4-1 shows a program with comments annotating where the variable `s` would be valid.
zh_cn: 变量`s`指的是一个短字符串，字符串的值被硬编码到我们的程序文本中。 这个变量从它被声明的那一刻起，一直到当前 _scope_ 的结束，都是有效的。 示例4-1的程序中的注释标明了变量 `s` 在何处是有效的。

source: <span class="caption">Listing 4-1: A variable and the scope in which it is valid</span>
zh_cn: <span class="caption">示例4-1：一个变量和其有效的作用域</span>

source: - When `s` comes _into_ scope, it is valid. - It remains valid until it goes _out of_ scope.
es: - Cuando `s` entra en el _ámbito_, es válida. - Permanece válida hasta que sale del _ámbito_.
zh_cn: - 当`s`进入 _进入作用域_ 时，它就是有效的。 - 这一直持续到它 _离开_ 作用域 为止。

source: At this point, the relationship between scopes and when variables are valid is similar to that in other programming languages. Now we’ll build on top of this understanding by using the `Array` type we introduced in the [previous chapter](./ch03-01-arrays.md).
zh_cn: 目前为止，变量是否有效与作用域的关系跟其他编程语言是类似的。 现在我们在此基础上通过在[前一章](./ch03-01-arrays.md)中介绍的`Array`类型进一步理解。

source: ### Ownership with the `Array` Type
es: ### Ownership con el tipo `Array
zh_cn: ### `Array` 类型的所有权

source: To illustrate the rules of ownership, we need a data type that is more complex. The types covered in the [Data Types][data-types]<!-- ignore --> section of Chapter 2 are of a known size, can be quickly and trivially copied to make a new, independent instance if another part of code needs to use the same value in a different scope, and can easily be dropped when they're no longer used. But what is the behavior with the `Array` type whose size is unknown at compile time and which can't be trivially copied?
zh_cn: 为了演示所有权的规则，我们需要一个比第二章 [数据类型][data-types]<!-- ignore --> 中讲到的类型都要复杂的数据类型。 前面介绍的类型都是已知大小的，如果代码的另一部分需要在不同的作用域中使用相同的值，可以快速简单地复制它们来创建一个新的独立实例，并且当离开作用域时被丢弃。 那么那些在编译时大小未知，且无法被简单复制的`Array`会怎么样呢？

source: Here is a short reminder of what an array looks like:
es: Aquí tienes un breve recordatorio de cómo es un array:
id: Berikut adalah pengingat singkat tentang bagaimana penampilan dari sebuah array:
zh_cn: 这里简单回忆一下数组的样子：

source: So, how does the ownership system ensure that each cell is never written to more than once? Consider the following code, where we try to pass the same instance of an array in two consecutive function calls:
es: Entonces, ¿cómo garantiza el sistema de propiedad que nunca se escriba en cada celda más de una vez? Consideremos el siguiente código, en el que intentamos pasar la misma instancia de un array en dos llamadas consecutivas a la función consecutivas:
zh_cn: 那么，所有权系统如何确保每个内存单元不会被写入超过一次？ 考虑一下下面的代码，我们试图在两个连续的函数调用中传递同一个数组实例：
