Repository: cairo-book/cairo-book
Catalog: po/*.po
Languages: es, id, ko, zh_cn

source: Implementing `Destruct<T>` for `UserDatabase` was our last step to get a fully functional database. We can now try it out:
id: Mengimplementasikan `Destruct<T>` untuk `UserDatabase` adalah langkah terakhir kita untuk mendapatkan basis data yang sepenuhnya fungsional. Sekarang kita bisa mencobanya:
ko: `UserDatabase`에 대한 `Destruct<T>`를 구현하는 것은 완전히 기능하는 데이터베이스를 얻기 위한 마지막 단계였습니다. 이제 우리는 이를 시도해 볼 수 있습니다.
zh_cn: 为`UserDatabase`实现`Destruct<T>`是我们得到一个功能齐全的数据库的最后一步。现在我们可以试试了：

source: "Expected 40"
ko: 예상 40

source: "Expected 0"
ko: 예상 0

source: Simulating a dynamic array with dicts
id: Mensimulasikan array dinamis dengan kamus
ko: 딕셔너리로 동적 배열 시뮬레이션하기

source: First, let's think about how we want our mutable dynamic array to behave. What operations should it support?
id: Pertama, mari pertimbangkan bagaimana kita ingin array dinamis yang dapat diubah kita berperilaku. Operasi apa yang seharusnya didukungnya?
ko: 먼저, 우리가 원하는 가변 동적 배열의 동작에 대해 생각해 봅시다. 어떤 작업을 지원해야 할까요?

source: It should:
id: Seharusnya:
ko: 그것은 해야합니다.
zh_cn: 它应该：

source: Allow us to append items at the end.
ko: 우리에게 항목을 끝에 추가할 수 있게 해주세요.

source: Let us access any item by index.
ko: 우리는 색인을 통해 모든 항목에 액세스할 수 있습니다.

source: Allow setting the value of an item at a specific index.
ko: 특정 인덱스에 항목의 값을 설정할 수 있도록 허용합니다.

source: Return the current length.
ko: 현재 길이를 반환합니다.

source: We can define this interface in Cairo like:
id: Kita dapat mendefinisikan antarmuka ini di Cairo seperti:
ko: 우리는 카이로에서 이 인터페이스를 정의할 수 있습니다.
zh_cn: 我们可以在Cairo中定义这个接口，如下所示：

source: This provides a blueprint for the implementation of our dynamic array. We named it _Vec_ as it is similar to the `Vec<T>` data structure in Rust.
ko: 이것은 우리의 동적 배열 구현을 위한 청사진을 제공합니다. 우리는 Rust의 `Vec<T>` 데이터 구조와 유사하기 때문에 이를 _Vec_ 이라고 이름 지었습니다.

source: Implementing a dynamic array in Cairo
id: Mengimplementasikan array dinamis di Cairo
ko: 카이로에서 동적 배열 구현하기

source: To store our data, we'll use a `Felt252Dict<T>` which maps index numbers (felts) to values. We'll also store a separate `len` field to track the length.
id: Untuk menyimpan data kita, kita akan menggunakan `Felt252Dict<T>` yang memetakan nomor indeks (felt) ke nilai. Kita juga akan menyimpan bidang terpisah `len` untuk melacak panjangnya.
ko: 저희 데이터를 저장하기 위해 색인 번호(felts)를 값에 매핑하는 `Felt252Dict<T>`를 사용할 것입니다. 또한 길이를 추적하기 위해 별도의 `len` 필드를 저장할 것입니다.

source: Here is what our struct looks like. We wrap the type `T` inside `Nullable` pointer to allow using any type `T` in our data structure, as explained in the [Dictionaries](./ch03-02-dictionaries.md#dictionaries-of-types-not-supported-natively) section:
id: Berikut tampilan struktur kita. Kami melingkupi tipe `T` dalam pointer `Nullable` untuk memungkinkan penggunaan setiap tipe `T` dalam struktur data kami, seperti dijelaskan dalam bagian [Kamus](./ch03-02-dictionaries.md#dictionaries-of-types-not-supported-natively):
ko: 다음은 우리의 구조가 어떻게 보이는지에 대한 설명입니다. 우리는 `Nullable` 포인터 내부에 유형 `T`를 감싸 사용자가 [Dictionaries](./ch03-02-dictionaries.md#dictionaries-of-types-not-supported-natively) 섹션에서 설명된대로 데이터 구조에서 어떤 유형 `T`를 사용할 수 있도록 합니다.

source: The key thing that makes this vector mutable is that we can insert values into the dictionary to set or update values in our data structure. For example, to update a value at a specific index, we do:
id: Hal kunci yang membuat vektor ini dapat diubah adalah kita dapat menyisipkan nilai ke dalam kamus untuk mengatur atau memperbarui nilai dalam struktur data kita. Sebagai contoh, untuk memperbarui nilai pada indeks tertentu, kita lakukan:
ko: 이 벡터를 가변적으로 만드는 주요한 점은 딕셔너리에 값을 삽입하여 데이터 구조 내의 값을 설정하거나 업데이트할 수 있다는 것입니다. 예를 들어, 특정 인덱스의 값을 업데이트하려면 다음을 수행합니다:

source: "Index out of bounds"
ko: "인덱스가 범위를 벗어남"

source: This overwrites the previously existing value at that index in the dictionary.
id: Ini menimpa nilai yang sudah ada sebelumnya pada indeks tersebut dalam kamus.
ko: 이것은 사전에서 해당 인덱스의 이전에 존재하던 값을 덮어씁니다.
zh_cn: 这将覆盖字典中该索引处先前存在的值。

source: While arrays are immutable, dictionaries provide the flexibility we need for modifiable data structures like vectors.
id: Meskipun array bersifat tidak dapat diubah, kamus memberikan fleksibilitas yang kita butuhkan untuk struktur data yang dapat dimodifikasi seperti vektor.
ko: 배열은 변경할 수 없지만, 사전은 벡터와 같은 수정 가능한 데이터 구조에 필요한 유연성을 제공합니다.

source: The implementation of the rest of the interface is straightforward. The implementation of all the methods defined in our interface can be done as follow :
id: Implementasi sisa antarmukanya cukup langsung. Implementasi semua metode yang didefinisikan dalam antarmuka kita dapat dilakukan sebagai berikut:
ko: 인터페이스의 나머지 부분 구현은 간단합니다. 우리 인터페이스에 정의된 모든 메소드의 구현은 다음과 같이 할 수 있습니다:

source: The full implementation of the `Vec` structure can be found in the community-maintained library [Alexandria](https://github.com/keep-starknet-strange/alexandria/tree/main/src/data_structures).
id: Implementasi lengkap struktur `Vec` dapat ditemukan di perpustakaan yang dikelola oleh komunitas [Alexandria](https://github.com/keep-starknet-strange/alexandria/tree/main/src/data_structures).
ko: `Vec` 구조체의 전체 구현은 커뮤니티가 유지보수하는 라이브러리 [Alexandria](https://github.com/keep-starknet-strange/alexandria/tree/main/src/data_structures)에서 찾을 수 있습니다.

source: Simulating a Stack with dicts
id: Mensimulasikan Stack dengan kamus
ko: 사전을 사용하여 스택 시뮬레이션하기

source: We will now look at a second example and its implementation details: a Stack.
id: Sekarang kita akan melihat contoh kedua dan detail implementasinya: sebuah Stack.
ko: 우리는 이제 두 번째 예제와 그 구현 세부사항을 살펴볼 것입니다: 스택(Stack).
zh_cn: 现在，我们将查看第二个示例及其实现细节：堆栈。

source: A Stack is a LIFO (Last-In, First-Out) collection. The insertion of a new element and removal of an existing element takes place at the same end, represented as the top of the stack.
id: Sebuah Stack adalah koleksi LIFO (Last-In, First-Out). Penyisipan elemen baru dan penghapusan elemen yang sudah ada terjadi di ujung yang sama, yang direpresentasikan sebagai puncak tumpukan.
ko: 스택은 LIFO(Last-In, First-Out) 컬렉션입니다. 새로운 요소의 삽입과 기존 요소의 제거는 동일한 끝에서 발생하며, 이는 스택의 맨 위로 표시됩니다.

source: Let us define what operations we need to create a stack :
id: Mari tentukan operasi apa yang kita butuhkan untuk membuat sebuah stack:
ko: 저희가 스택을 만들기 위해 필요한 작업을 정의해 봅시다.
zh_cn: 让我们定义创建堆栈所需的操作：

source: Push an item to the top of the stack.
ko: 스택의 맨 위에 항목을 밀어 넣으세요.

source: Pop an item from the top of the stack.
ko: 스택의 맨 위에 있는 항목을 꺼내세요.

source: Check whether there are still any elements in the stack.
id: Memeriksa apakah masih ada elemen di dalam stack.
ko: 스택에 아직 요소가 있는지 확인하십시오.

source: From these specifications we can define the following interface :
id: Dari spesifikasi ini, kita dapat mendefinisikan antarmuka berikut:
ko: 이 명세서를 토대로 다음과 같은 인터페이스를 정의할 수 있습니다:
zh_cn: 根据这些规则我们可以定义以下接口：

source: Implementing a Mutable Stack in Cairo
id: Menerapkan Stack Yang Dapat Diubah di Cairo
ko: 카이로에서 가변 스택 구현하기

source: To create a stack data structure in Cairo, we can again use a `Felt252Dict<T>` to store the values of the stack along with a `usize` field to keep track of the length of the stack to iterate over it.
id: Untuk membuat struktur data tumpukan (stack) di Cairo, kita dapat lagi menggunakan `Felt252Dict<T>` untuk menyimpan nilai-nilai tumpukan beserta sebuah bidang `usize` untuk melacak panjang tumpukan agar dapat melakukan iterasi atasnya.
ko: 카이로에서 스택 데이터 구조를 만들기 위해, 우리는 다시 `Felt252Dict<T>`를 사용하여 스택의 값들을 저장하고 `usize` 필드를 사용하여 스택의 길이를 추적하여 반복할 수 있습니다.

source: The Stack struct is defined as:
id: Struktur data Stack didefinisikan sebagai berikut:
ko: 스택 구조체는 다음과 같이 정의됩니다:
zh_cn: 堆栈结构定义如下：

source: Next, let's see how our main functions `push` and `pop` are implemented.
id: Selanjutnya, mari kita lihat bagaimana fungsi utama kami, `push` dan `pop`, diimplementasikan.
ko: 다음으로, 주요 기능 'push'와 'pop'이 어떻게 구현되었는지 살펴봅시다.
zh_cn: 接下来，让我们看看我们的主要功能`push`和`pop` 是如何实现的。

source: The code uses the `insert` and `get` methods to access the values in the `Felt252Dict<T>`. To push an element to the top of the stack, the `push` function inserts the element in the dict at index `len` and increases the `len` field of the stack to keep track of the position of the stack top. To remove a value, the `pop` function retrieves the last value at position `len-1` and then decreases the value of `len` to update the position of the stack top accordingly.
ko: 해당 코드는 `Felt252Dict<T>`에서 값을 액세스하기 위해 `insert` 및 `get` 메서드를 사용합니다. 스택의 맨 위에 요소를 푸시하려면 `push` 함수는 요소를 인덱스 `len`에 삽입하고 스택의 `len` 필드를 증가시켜 스택 맨 위의 위치를 추적합니다. 값을 제거하려면 `pop` 함수가 `len-1` 위치의 마지막 값을 검색한 다음 `len` 값을 감소시켜 스택 맨 위의 위치를 업데이트합니다.

source: The full implementation of the Stack, along with more data structures that you can use in your code, can be found in the community-maintained [Alexandria](https://github.com/keep-starknet-strange/alexandria/tree/main/src/data_structures) library, in the "data_structures" crate.
id: Implementasi lengkap dari Struktur Data Stack, bersama dengan lebih banyak struktur data yang dapat Anda gunakan dalam kode Anda, dapat ditemukan dalam perpustakaan yang dipelihara oleh komunitas [Alexandria](https://github.com/keep-starknet-strange/alexandria/tree/main/src/data_structures), di dalam kumpulan "data_structures" crate.
ko: 스택의 완전한 구현과 코드에서 사용할 수 있는 더 많은 데이터 구조는 커뮤니티가 유지하는 [Alexandria](https://github.com/keep-starknet-strange/alexandria/tree/main/src/data_structures) 라이브러리에서 "data_structures" 크레이트에서 찾을 수 있습니다.

source: Well done! Now you have knowledge of arrays, dictionaries and even custom data structures. While Cairo's memory model is immutable and can make it difficult to implement mutable data structures, we can fortunately use the `Felt252Dict<T>` type to simulate mutable data structures. This allows us to implement a wide range of data structures that are useful for many applications, effectively hiding the complexity of the underlying memory model.
ko: 잘 했어요! 이제 배열, 딕셔너리, 심지어 사용자 정의 데이터 구조에 대한 지식을 갖게 되었습니다. 카이로의 메모리 모델은 불변이기 때문에 가변 데이터 구조를 구현하기 어려울 수 있지만, 다행히도 `Felt252Dict<T>` 유형을 사용하여 가변 데이터 구조를 시뮬레이션할 수 있습니다. 이를 통해 많은 응용 프로그램에 유용한 다양한 데이터 구조를 구현할 수 있으며, 기본 메모리 모델의 복잡성을 효과적으로 숨길 수 있습니다.

source: When you’re ready to move on, we’ll talk about a concept that Cairo shares with Rust and that doesn’t commonly exist in other programming languages: ownership.
ko: 당신이 다음으로 넘어갈 준비가 되면, 카이로가 러스트와 공유하는 개념에 대해 이야기해 보겠습니다. 이것은 다른 프로그래밍 언어에서 흔히 존재하지 않는 소유권입니다.

source: Understanding Cairo's Ownership system
id: Memahami Cairo's Ownership system
ko: 카이로의 소유권 시스템 이해하기

source: Cairo is a language built around a linear type system that allows us to statically ensure that in every Cairo program, a value is used exactly once. This linear type system helps preventing runtime errors by ensuring that operations that could cause such errors, such as writing twice to a memory cell, are detected at compile time. This is achieved by implementing an ownership system and forbidding copying and dropping values by default. In this chapter, we’ll talk about Cairo's ownership system as well as references and snapshots.
id: Cairo adalah bahasa yang dibangun di sekitar sistem tipe linear yang memungkinkan kita untuk memastikan secara statis bahwa dalam setiap program Cairo, sebuah nilai digunakan tepat satu kali. Sistem tipe linear ini membantu mencegah kesalahan saat runtime dengan memastikan bahwa operasi yang dapat menyebabkan kesalahan tersebut, seperti menulis dua kali ke sel memori, terdeteksi pada waktu kompilasi. Hal ini dicapai dengan menerapkan sistem kepemilikan dan melarang penggandaan serta penghapusan nilai secara default. Pada bab ini, kita akan membahas sistem kepemilikan Cairo serta referensi dan snapshot.
ko: 카이로는 선형 유형 시스템을 중심으로 구축된 언어로, 모든 카이로 프로그램에서 값이 정확히 한 번 사용되도록 정적으로 보장할 수 있습니다. 이 선형 유형 시스템은 런타임 오류를 방지하기 위해 도와주며, 메모리 셀에 두 번 쓰기와 같은 오류를 일으킬 수 있는 작업이 컴파일 시간에 감지되도록 합니다. 이는 소유권 시스템을 구현하고 기본적으로 값의 복사 및 삭제를 금지함으로써 달성됩니다. 이 장에서는 카이로의 소유권 시스템과 참조 및 스냅샷에 대해 이야기하겠습니다.

source: Ownership Using a Linear Type System
ko: 소유권 선형 유형 시스템 사용

source: Cairo uses a linear type system. In such a type system, any value (a basic type, a struct, an enum) must be used and must only be used once. 'Used' here means that the value is either _destroyed_ or _moved_.
ko: 카이로는 선형 유형 시스템을 사용합니다. 이러한 유형 시스템에서는 모든 값(기본 유형, 구조체, 열거형)은 사용되어야 하며 한 번만 사용되어야 합니다. 여기서 '사용된다'는 값이 _파괴_ 되거나 _이동_ 된다는 것을 의미합니다.

source: _Destruction_ can happen in several ways:
ko: "파괴"는 여러 가지 방법으로 일어날 수 있습니다:

source: a variable goes out of scope.
ko: 변수가 스코프를 벗어납니다.

source: a struct is destructured.
ko: 구조체가 해체되었습니다.

source: explicit destruction using `destruct()`.
ko: `destruct()`를 사용한 명시적인 파괴.

source: _Moving_ a value simply means passing that value to another function.
ko: 값을 _이동_ 한다는 것은 단순히 해당 값을 다른 함수에 전달하는 것을 의미합니다.

source: This results in somewhat similar constraints to the Rust ownership model, but there are some differences. In particular, the Rust ownership model exists (in part) to avoid data races and concurrent mutable access to a memory value. This is obviously impossible in Cairo since the memory is immutable. Instead, Cairo leverages its linear type system for two main purposes:
ko: 이는 러스트 소유권 모델과 어느 정도 유사한 제약 조건을 초래하지만, 몇 가지 차이점이 있습니다. 특히, 러스트 소유권 모델은 데이터 레이스와 메모리 값에 대한 동시적인 가변 액세스를 피하기 위해 존재합니다. 이는 명백히 Cairo에서는 불가능합니다. 대신, Cairo는 선형 유형 시스템을 두 가지 주요 목적으로 활용합니다:

source: Ensuring that all code is provable and thus verifiable.
ko: 모든 코드가 증명 가능하고 따라서 검증 가능하도록 보장하는 것.

source: Abstracting away the immutable memory of the Cairo VM.
ko: 카이로 VM의 불변 메모리를 추상화합니다.

source: Ownership
ko: 소유권

source: In Cairo, ownership applies to _variables_ and not to _values_. A value can safely be referred to by many different variables (even if they are mutable variables), as the value itself is always immutable. Variables however can be mutable, so the compiler must ensure that constant variables aren't accidentally modified by the programmer. This makes it possible to talk about ownership of a variable: the owner is the code that can read (and write if mutable) the variable.
ko: 카이로에서 소유권은 _변수(variables)_ 에 적용되며 _값(values)_ 에는 적용되지 않습니다. 값은 항상 불변하기 때문에 많은 다른 변수에서 안전하게 참조할 수 있습니다(가변 변수라도). 그러나 변수는 가변일 수 있으므로 컴파일러는 상수 변수가 프로그래머에 의해 실수로 수정되지 않도록 보장해야 합니다. 이로써 변수의 소유권에 대해 이야기할 수 있게 되었습니다: 소유자는 변수를 읽을 수 있는(가변일 경우 쓸 수 있는) 코드입니다.

source: This means that variables (not values) follow similar rules to Rust values:
ko: 이는 변수(값이 아닌)가 러스트 값과 유사한 규칙을 따른다는 것을 의미합니다.

source: Each variable in Cairo has an owner.
ko: 카이로의 각 변수는 소유자가 있습니다.

source: There can only be one owner at a time.
id: Hanya boleh ada satu pemilik pada suatu waktu.
ko: 한 번에 한 명의 소유자만 있을 수 있습니다.

source: When the owner goes out of scope, the variable is destroyed.
ko: 소유자가 범위를 벗어나면 변수가 파괴됩니다.

source: Now that we’re past basic Cairo syntax, we won’t include all the `fn main() {` code in examples, so if you’re following along, make sure to put the following examples inside a main function manually. As a result, our examples will be a bit more concise, letting us focus on the actual details rather than boilerplate code.
ko: 기본 카이로 구문을 넘어섰으므로, 예제에서는 모든 `fn main() {` 코드를 포함하지 않을 것이므로, 따라오고 있다면 다음 예제를 main 함수 내에 수동으로 넣어야 합니다. 결과적으로, 우리의 예제는 조금 더 간결해지며, 보일러플레이트 코드 대신 실제 세부 사항에 집중할 수 있게 될 것입니다.

source: Variable Scope
id: Lingkup Variabel
ko: 변수 범위

source: As a first example of the linear type system, we’ll look at the _scope_ of some variables. A scope is the range within a program for which an item is valid. Take the following variable:
ko: 선형 유형 시스템의 첫 번째 예로, 일부 변수의 _범위_ 를 살펴보겠습니다. 범위는 항목이 유효한 프로그램 내의 범위를 의미합니다. 다음 변수를 살펴보세요:

source: The variable `s` refers to a short string. The variable is valid from the point at which it’s declared until the end of the current _scope_. Listing 4-1 shows a program with comments annotating where the variable `s` would be valid.
ko: 변수 `s`는 짧은 문자열을 가리킵니다. 이 변수는 선언된 지점부터 현재 _스코프_ 의 끝까지 유효합니다. 4-1 목록은 변수 `s`가 유효한 위치를 주석으로 설명한 프로그램을 보여줍니다.

source: //TAG: ignore_fmt
ko: //TAG: ignore_fmt //TAG: 형식 무시

source: // s is not valid here, it’s not yet declared
ko: 여기서 s는 유효하지 않습니다. 아직 선언되지 않았습니다.

source: // s is valid from this point forward // do stuff with s
ko: // s는 이 지점부터 유효합니다 // s와 관련된 작업을 수행합니다

source: // this scope is now over, and s is no longer valid
ko: 이 범위는 이제 끝났으며, s는 더 이상 유효하지 않습니다.

source: Listing 4-1: A variable and the scope in which it is valid
id: Listing 4-1: Sebuah variabel dan lingkup di mana variabel tersebut valid
ko: 리스트 4-1: 변수와 해당 변수가 유효한 범위

source: In other words, there are two important points in time here:
es: En otras palabras, hay dos puntos importantes en el tiempo aquí:
id: Dengan kata lain, ada dua titik waktu penting di sini:
ko: 다시 말해, 여기에는 두 가지 중요한 시점이 있습니다.
zh_cn: 换句话说，这里有两个重要的时间点：

source: When `s` comes _into_ scope, it is valid.
id: Ketika `s` masuk ke dalam _lingkup_, itu valid.
ko: `s`가 범위에 들어오면 유효합니다.

source: It remains valid until it goes _out of_ scope.
id: Itu tetap valid sampai keluar dari _lingkup_.
ko: 그것은 범위를 벗어날 때까지 유효합니다.

source: At this point, the relationship between scopes and when variables are valid is similar to that in other programming languages. Now we’ll build on top of this understanding by using the `Array` type we introduced in the [previous chapter](./ch03-01-arrays.md).
id: Pada titik ini, hubungan antara lingkup dan kapan variabel valid mirip dengan dalam bahasa pemrograman lain. Sekarang kita akan memperluas pemahaman ini dengan menggunakan tipe `Array` yang kita perkenalkan dalam [bab sebelumnya](./ch03-01-arrays.md).
ko: 이 시점에서, 스코프와 변수의 유효성이 언제인지에 대한 관계는 다른 프로그래밍 언어와 유사합니다. 이제 우리는 [이전 장](./ch03-01-arrays.md)에서 소개한 `Array` 타입을 사용하여 이해를 더 확장해 나갈 것입니다.

source: Moving values - example with Array
ko: 값 이동 - 배열을 사용한 예제

source: As said earlier, _moving_ a value simply means passing that value to another function. When that happens, the variable referring to that value in the original scope is destroyed and can no longer be used, and a new variable is created to hold the same value.
ko: 이전에 말했듯이, _이동_ 이란 단순히 그 값을 다른 함수로 전달하는 것을 의미합니다. 그렇게 되면 원래 범위에서 그 값을 가리키는 변수가 파괴되어 더 이상 사용할 수 없게 되며, 동일한 값을 보유하기 위해 새 변수가 생성됩니다.

source: Arrays are an example of a complex type that is moved when passing it to another function. Here is a short reminder of what an array looks like:
ko: 배열은 다른 함수에 전달될 때 이동되는 복잡한 유형의 예입니다. 배열이 어떻게 생겼는지 간단히 상기시켜드리겠습니다:

source: How does the type system ensure that the Cairo program never tries to write to the same memory cell twice? Consider the following code, where we try to remove the front of the array twice:
ko: 타입 시스템은 카이로 프로그램이 동일한 메모리 셀에 두 번 쓰려고 시도하지 않도록 어떻게 보장합니까? 다음 코드를 고려해보십시오. 여기서 우리는 배열의 맨 앞을 두 번 제거하려고 시도합니다:

source: In this case, we try to pass the same value (the array in the `arr` variable) to both function calls. This means our code tries to remove the first element twice, which would try to write to the same memory cell twice - which is forbidden by the Cairo VM, leading to a runtime error. Thankfully, this code does not actually compile. Once we have passed the array to the `foo` function, the variable `arr` is no longer usable. We get this compile-time error, telling us that we would need Array to implement the Copy Trait:
ko: 이 경우에는 동일한 값을 (변수 `arr`에 있는 배열) 두 함수 호출에 모두 전달하려고 시도합니다. 이는 코드가 첫 번째 요소를 두 번 제거하려고 시도하므로 동일한 메모리 셀에 두 번 쓰려고 하기 때문에 Cairo VM에서 금지된 런타임 오류가 발생할 것입니다. 다행히도, 이 코드는 실제로 컴파일되지 않습니다. 배열을 `foo` 함수에 전달한 후에는 변수 `arr`을 더 이상 사용할 수 없습니다. 우리는 Array가 Copy Trait을 구현해야 한다는 컴파일 시간 오류를 받게 됩니다.

source: The Copy trait
ko: 복사 특성

source: If a type implements the `Copy` trait, passing a value of that type to a function does not move the value. Instead, a new variable is created, referring to the same value. The important thing to note here is that this is a completely free operation, because variables are a cairo abstraction only and because _values_ in Cairo are always immutable. This, in particular, conceptually differs from the Rust version of the `Copy` trait, where the value is potentially copied in memory.
ko: 만약 타입이 `Copy` 트레이트를 구현한다면, 해당 타입의 값을 함수에 전달해도 값이 이동하지 않습니다. 대신, 동일한 값을 참조하는 새 변수가 생성됩니다. 여기서 주목해야 할 중요한 점은 변수가 카이로 추상화일 뿐이며, 카이로의 값은 항상 불변이기 때문에 이것이 완전히 무료 작업이라는 것입니다. 특히 이는 러스트 버전의 `Copy` 트레이트와 개념적으로 다르며, 러스트 버전에서는 값이 메모리에 복사될 수 있습니다.

source: All basic types previously described in [data types chapter](ch02-02-data-types.md) implement by default the `Copy` trait.
ko: 이전에 설명된 [데이터 유형 장](ch02-02-data-types.md)에 있는 모든 기본 유형은 기본적으로 `Copy` 특성을 구현합니다.

source: While Arrays and Dictionaries can't be copied, custom types that don't contain either of them can be. You can implement the `Copy` trait on your type by adding the `#[derive(Copy)]` annotation to your type definition. However, Cairo won't allow a type to be annotated with Copy if the type itself or any of its components doesn't implement the Copy trait.
ko: 배열과 사전은 복사할 수 없지만, 둘 중 어느 하나도 포함하지 않는 사용자 정의 타입은 복사할 수 있습니다. 타입 정의에 `#[derive(Copy)]` 주석을 추가하여 타입에 `Copy` 트레이트를 구현할 수 있습니다. 그러나 Cairo는 타입 자체나 그 구성 요소 중 하나라도 `Copy` 트레이트를 구현하지 않은 경우에는 타입에 Copy 주석을 달 수 없습니다.

source: // do something with p
ko: // p와 무언가를 수행합니다.

source: In this example, we can pass `p1` twice to the foo function because the `Point` type implements the `Copy` trait. This means that when we pass `p1` to `foo`, we are actually passing a copy of `p1`, so `p1` remains valid. In ownership terms, this means that the ownership of `p1` remains with the `main` function. If you remove the `Copy` trait derivation from the `Point` type, you will get a compile-time error when trying to compile the code.
ko: 이 예시에서 `Point` 타입이 `Copy` 트레이트를 구현했기 때문에 `p1`을 foo 함수에 두 번 전달할 수 있습니다. 이는 `p1`을 `foo`에 전달할 때 사실은 `p1`의 복사본을 전달하므로 `p1`이 유효한 상태로 남아있게 됩니다. 소유권 관점에서 이는 `p1`의 소유권이 `main` 함수에 남아있음을 의미합니다. 만약 `Point` 타입에서 `Copy` 트레이트를 제거하면 코드를 컴파일하려고 할 때 컴파일 타임 에러가 발생합니다.

source: _Don't worry about the `Struct` keyword. We will introduce this in [Chapter 5](ch05-00-using-structs-to-structure-related-data.md)._
id: _Jangan khawatir tentang kata kunci `Struct`. Kami akan memperkenalkan ini dalam [Bab 5](ch05-00-using-structs-to-structure-related-data.md)._
ko: `Struct` 키워드에 대해 걱정하지 마십시오. 우리는 [5장](ch05-00-using-structs-to-structure-related-data.md)에서 이에 대해 소개할 것입니다.
zh_cn: _不要担心`Struct`关键字。我们将在[第五章](ch05-00-using-structs-to-structure-related-data.md)中介绍_

source: Destroying values - example with FeltDict
ko: 가치 파괴 - FeltDict를 사용한 예제

source: The other way linear types can be _used_ is by being destroyed. Destruction must ensure that the 'resource' is now correctly released. In Rust for example, this could be closing the access to a file, or locking a mutex. In Cairo, one type that has such behaviour is `Felt252Dict`. For provability, dicts must be 'squashed' when they are destructed. This would be very easy to forget, so it is enforced by the type system and the compiler.
ko: 다른 방법으로 선형 유형을 _사용_ 할 수 있는 방법은 파괴되는 것입니다. 파괴는 이제 '자원'이 올바르게 해제되었음을 보장해야 합니다. 예를 들어 Rust에서는 파일에 대한 액세스를 닫거나 뮤텍스를 잠그는 것이 될 수 있습니다. Cairo에서 이와 같은 동작을 가진 하나의 유형은 `Felt252Dict`입니다. 증명 가능성을 위해 딕셔너리는 파괴될 때 '압축'되어야 합니다. 이것은 매우 쉽게 잊을 수 있기 때문에 유형 시스템과 컴파일러에서 강제됩니다.

source: No-op destruction: the `Drop` Trait
ko: No-op 파괴: `Drop` 트레잇

source: You may have noticed that the `Point` type in the previous example also implements the `Drop` trait. For example, the following code will not compile, because the struct `A` is not moved or destroyed before it goes out of scope:
ko: 이전 예제에서 `Point` 타입도 `Drop` 트레이트를 구현했음을 알아차릴 수 있습니다. 예를 들어, 다음 코드는 컴파일되지 않습니다. 왜냐하면 구조체 `A`가 스코프를 벗어나기 전에 이동되거나 파괴되지 않았기 때문입니다:

source: // error: Value not dropped.
ko: // 오류: 값이 삭제되지 않았습니다.
