Repository: cairo-book/cairo-book
Catalog: po/*.po
Languages: es, id, ko, zh_cn

source: Functions can return values to the code that calls them. We don’t name return values, but we must declare their type after an arrow (`->`). In Cairo, the return value of the function is synonymous with the value of the final expression in the block of the body of a function. You can return early from a function by using the `return` keyword and specifying a value, but most functions return the last expression implicitly. Here’s an example of a function that returns a value:
id: Fungsi dapat mengembalikan nilai kepada kode yang memanggilnya. Kita tidak memberi nama pada nilai-nilai kembalian, tetapi kita harus mendeklarasikan tipe mereka setelah panah (`->`). Di Cairo, nilai kembalian fungsi bersinonim dengan nilai dari ekspresi terakhir dalam blok tubuh fungsi. Anda dapat mengembalikan nilai sebelumnya dari sebuah fungsi dengan menggunakan kata kunci `return` dan menentukan sebuah nilai, tetapi sebagian besar fungsi mengembalikan ekspresi terakhir secara implisit. Berikut adalah contoh fungsi yang mengembalikan nilai:
ko: 함수는 호출하는 코드에 값을 반환할 수 있습니다. 반환 값을 이름 지정하지 않지만 화살표(`->`) 뒤에 타입을 선언해야 합니다. Cairo에서 함수의 반환 값은 함수 몸체 블록의 마지막 표현식의 값과 동의어입니다. `return` 키워드를 사용하여 값을 지정하여 함수를 일찍 종료할 수 있지만 대부분의 함수는 마지막 표현식을 암시적으로 반환합니다. 값이 반환되는 함수의 예시는 다음과 같습니다:

source: There are no function calls, or even `let` statements in the `five` function—just the number `5` by itself. That’s a perfectly valid function in Cairo. Note that the function’s return type is specified too, as `-> u32`. Try running this code; the output should look like this:
id: Tidak ada panggilan fungsi, atau bahkan pernyataan `let` dalam fungsi `five` — hanya angka `5` itu sendiri. Itu adalah fungsi yang sepenuhnya valid dalam bahasa Cairo. Perhatikan bahwa tipe pengembalian fungsi juga ditentukan, yaitu `-> u32`. Cobalah menjalankan kode ini; keluarannya seharusnya terlihat seperti ini:
ko: `five` 함수에는 함수 호출이나 심지어 `let` 문도 없습니다. 그냥 숫자 `5`만 있습니다. 이것은 카이로에서 완벽히 유효한 함수입니다. 함수의 반환 유형이 `-> u32`로 지정되어 있음에 유의하십시오. 이 코드를 실행해보세요. 출력은 다음과 같아야 합니다:

source: The `5` in `five` is the function’s return value, which is why the return type is `u32`. Let’s examine this in more detail. There are two important bits: first, the line `let x = five();` shows that we’re using the return value of a function to initialize a variable. Because the function `five` returns a `5`, that line is the same as the following:
id: Angka `5` dalam `five` adalah nilai kembalian fungsi, itulah mengapa tipe pengembalian adalah `u32`. Mari kita periksa ini lebih detail. Ada dua bagian penting: pertama, baris `let x = five();` menunjukkan bahwa kita menggunakan nilai kembalian suatu fungsi untuk menginisialisasi variabel. Karena fungsi `five` mengembalikan `5`, baris tersebut sama dengan yang berikut:
ko: `five` 함수에서의 `5`는 함수의 반환 값이며, 이에 따라 반환 형식은 `u32`입니다. 이를 더 자세히 살펴봅시다. 두 가지 중요한 점이 있습니다. 먼저, `let x = five();` 라인은 함수의 반환 값을 변수를 초기화하는 데 사용한다는 것을 보여줍니다. `five` 함수가 `5`를 반환하기 때문에 해당 라인은 다음과 같습니다:

source: Second, the `five` function has no parameters and defines the type of the return value, but the body of the function is a lonely `5` with no semicolon because it’s an expression whose value we want to return. Let’s look at another example:
id: Kedua, fungsi `five` tidak memiliki parameter dan menentukan tipe nilai kembalian, tetapi tubuh fungsi tersebut hanya berisi angka `5` tanpa titik koma karena itu adalah suatu ekspresi yang nilainya ingin kita kembalikan. Mari kita lihat contoh lain:
ko: 두 번째로, `five` 함수는 매개변수가 없으며 반환 값의 유형을 정의하지만 함수의 본문은 `5`만 있는데 세미콜론이 없습니다. 왜냐하면 반환하려는 값의 표현식이기 때문입니다. 다른 예제를 살펴보겠습니다:

source: Running this code will print `x = 6`. But if we place a semicolon at the end of the line containing `x + 1`, changing it from an expression to a statement, we’ll get an error:
ko: 이 코드를 실행하면 `x = 6`이 출력됩니다. 그러나 `x + 1`을 포함하는 줄 끝에 세미콜론을 넣어 표현식을 문으로 변경하면 오류가 발생합니다.

source: ```shell error: Unexpected return type. Expected: "core::integer::u32", found: "()". ```
ko: ```shell 에러: 예상하지 못한 반환 형식. 예상: "core::integer::u32", 발견: "()". ```

source: The main error message, `Unexpected return type`, reveals the core issue with this code. The definition of the function `plus_one` says that it will return an `u32`, but statements don’t evaluate to a value, which is expressed by `()`, the unit type. Therefore, nothing is returned, which contradicts the function definition and results in an error.
id: Pesan kesalahan utama, `Unexpected return type`, mengungkapkan masalah inti dengan kode ini. Definisi fungsi `plus_one` menyatakan bahwa itu akan mengembalikan `u32`, tetapi pernyataan tidak dievaluasi menjadi suatu nilai, yang diwakili oleh `()`, yaitu tipe unit. Oleh karena itu, tidak ada yang dikembalikan, yang bertentangan dengan definisi fungsi dan menyebabkan kesalahan.
ko: 주요 오류 메시지인 `예상치 못한 반환 유형`은 이 코드의 핵심 문제를 드러냅니다. 함수 `plus_one`의 정의는 `u32`를 반환할 것이라고 말하지만, 문장은 값으로 평가되지 않습니다. 값으로 평가되지 않는 것은 `()`로 표현되는 단위 유형입니다. 따라서 아무것도 반환되지 않으며, 이는 함수 정의와 모순되어 오류를 발생시킵니다.

source: All programmers strive to make their code easy to understand, but sometimes extra explanation is warranted. In these cases, programmers leave comments in their source code that the compiler will ignore but people reading the source code may find useful.
ko: 모든 프로그래머들은 코드를 이해하기 쉽게 만들기 위해 노력하지만 때로는 추가 설명이 필요할 수 있습니다. 이러한 경우에 프로그래머들은 소스 코드에 주석을 남기는데, 컴파일러는 무시하지만 소스 코드를 읽는 사람들에게 유용할 수 있습니다.

source: Here’s a simple comment:
ko: 여기 간단한 코멘트가 있습니다:

source: In Cairo, the idiomatic comment style starts a comment with two slashes, and the comment continues until the end of the line. For comments that extend beyond a single line, you’ll need to include `//` on each line, like this:
ko: 카이로에서는 관용적인 주석 스타일이 두 개의 슬래시로 시작하여 주석이 라인의 끝까지 계속됩니다. 한 줄을 넘어가는 주석의 경우 각 줄마다 `//`를 포함해야 합니다. 이렇게요:

source: // So we’re doing something complicated here, long enough that we need // multiple lines of comments to do it! Whew! Hopefully, this comment will // explain what’s going on.
ko: // 우리는 여기서 복잡한 작업을 수행하고 있습니다. 이 작업은 너무 길어서 여러 줄의 주석이 필요합니다! 휴! 이 주석이 무슨 일이 일어나고 있는지 설명해줄 것입니다.

source: Comments can also be placed at the end of lines containing code:
ko: 주석은 코드를 포함하는 줄의 끝에도 배치할 수 있습니다.

source: // return the sum of 1 and 4
ko: // 1과 4의 합을 반환합니다.

source: But you’ll more often see them used in this format, with the comment on a separate line above the code it’s annotating:
ko: 그러나 더 자주 이 형식으로 사용되는 것을 볼 수 있습니다. 주석이 주석 처리하는 코드 위에 별도의 줄로 작성되어 있습니다.

source: // this function performs a simple addition
ko: 이 함수는 간단한 덧셈을 수행합니다.

source: The ability to run some code depending on whether a condition is true and to run some code repeatedly while a condition is true are basic building blocks in most programming languages. The most common constructs that let you control the flow of execution of Cairo code are if expressions and loops.
es: La capacidad de ejecutar cierto código dependiendo de si una condición es verdadera y de ejecutar código repetidamente mientras una condición es verdadera son bloques de construcción básicos en la mayoría de los lenguajes de programación. Las construcciones más comunes que le permiten controlar el flujo de ejecución del código en Cairo son las expresiones if y los bucles.
id: Kemampuan untuk menjalankan beberapa kode tergantung pada apakah suatu kondisi benar, dan untuk menjalankan beberapa kode secara berulang selama suatu kondisi benar adalah blok dasar dalam sebagian besar bahasa pemrograman. Konstruksi yang paling umum yang memungkinkan Anda mengendalikan alur eksekusi kode Cairo adalah ekspresi if dan loop.
ko: 대부분의 프로그래밍 언어에서 조건이 참인 경우 일부 코드를 실행하고 조건이 참인 동안 일부 코드를 반복해서 실행할 수 있는 능력은 가장 기본적인 구성 요소입니다. Cairo 코드의 실행 흐름을 제어할 수 있는 가장 일반적인 구조는 if 표현식과 루프입니다.
zh_cn: 根据条件是否为真来决定是否执行某些代码，以及根据条件是否为真来重复运行一段 代码的能力是大部分编程语言的基本组成部分。Cairo 代码中最常见的用来控制执行 流的结构是 `if` 表达式和循环。

source: `if` Expressions
ko: `if` 표현

source: An if expression allows you to branch your code depending on conditions. You provide a condition and then state, “If this condition is met, run this block of code. If the condition is not met, do not run this block of code.”
es: Una expresión if le permite ramificar su código según condiciones. Proporciona una condición y luego establece: "Si se cumple esta condición, ejecute este bloque de código. Si no se cumple la condición, no ejecute este bloque de código".
id: Ekspresi if memungkinkan Anda bercabang dalam kode Anda tergantung pada kondisi. Anda memberikan suatu kondisi dan kemudian menyatakan, "Jika kondisi ini terpenuhi, jalankan blok kode ini. Jika kondisinya tidak terpenuhi, jangan jalankan blok kode ini."
ko: if 표현식을 사용하면 조건에 따라 코드를 분기할 수 있습니다. 조건을 제공한 다음 "이 조건이 충족되면 이 코드 블록을 실행합니다. 조건이 충족되지 않으면 이 코드 블록을 실행하지 마십시오." 라고 명시합니다.
zh_cn: `if` 表达式允许根据条件执行不同的代码分支。你提供一个条件并表示 “如果条件满 足，运行这段代码；如果条件不满足，不运行这段代码。”

source: Create a new project called _branches_ in your _cairo_projects_ directory to explore the `if` expression. In the _src/lib.cairo_ file, input the following:
ko: `if` 표현식을 탐색하기 위해 _cairo_projects_ 디렉토리에 _branches_ 라는 새 프로젝트를 생성하십시오. _src/lib.cairo_ 파일에 다음을 입력하십시오:

source: "condition was true and number = {}"
ko: "조건이 참이고 숫자 = {}"

source: "condition was false and number = {}"
ko: "condition was false and number = {}" "조건이 거짓이고 숫자 = {}"

source: All `if` expressions start with the keyword `if`, followed by a condition. In this case, the condition checks whether or not the variable `number` has a value equal to 5. We place the block of code to execute if the condition is `true` immediately after the condition inside curly brackets.
es: Todos las expresiones `if` comienzan con la palabra clave `if`, seguido de una condición. En este caso, la condición verifica si la variable `number` tiene un valor igual a 5. Colocamos el bloque de código a ejecutar si la condición es `true` inmediatamente después de la condición dentro de llaves.
id: Semua ekspresi `if` dimulai dengan kata kunci `if`, diikuti oleh suatu kondisi. Dalam kasus ini, kondisinya memeriksa apakah variabel `number` memiliki nilai yang sama dengan 5. Kami menempatkan blok kode untuk dijalankan jika kondisinya `true` langsung setelah kondisi di dalam kurung kurawal.
ko: 모든 `if` 표현식은 `if` 키워드로 시작하고 조건이 이어집니다. 이 경우에는 조건이 변수 `number`의 값이 5와 같은지 확인합니다. 조건이 `true`인 경우 실행할 코드 블록을 중괄호 안에 조건 바로 뒤에 배치합니다.
zh_cn: 所有的 `if` 表达式都以关键字 `if` 开始，其后跟一个条件。在这个例子中，条件检查 变量 `number` 的值是否等于 5。在条件为 `true` 时希望执行的代码块位于紧跟条件 之后的大括号中。

source: Optionally, we can also include an `else` expression, which we chose to do here, to give the program an alternative block of code to execute should the condition evaluate to `false`. If you don’t provide an `else` expression and the condition is `false`, the program will just skip the `if` block and move on to the next bit of code.
es: Opcionalmente, también podemos incluir una expresión `else`, que elegimos hacer aquí, para dar al programa un bloque de código alternativo para ejecutar si la condición se evalúa como `false`. Si no proporciona una expresión `else` y la condición es `false`, el programa simplemente omitirá el bloque `if` y pasará al siguiente fragmento de código.
id: Opsionalnya, kita juga dapat menyertakan ekspresi `else`, seperti yang kita pilih di sini, untuk memberikan program blok kode alternatif yang akan dijalankan jika kondisi dinilai `false`. Jika Anda tidak menyediakan ekspresi `else` dan kondisinya `false`, program akan melewati blok `if` dan melanjutkan ke bagian kode berikutnya.
ko: 선택적으로, 우리는 `else` 표현식을 포함할 수도 있는데, 여기서는 그렇게 선택했고, 조건이 `false`로 평가될 경우 실행할 대체 코드 블록을 프로그램에 제공합니다. 만약 `else` 표현식을 제공하지 않고 조건이 `false`인 경우, 프로그램은 `if` 블록을 건너뛰고 다음 코드 조각으로 넘어갈 것입니다.
zh_cn: 另外，我们也可以包含一个可选的 `else` 表达式来提供一个在条件为 `false` 时应当执行的代码块，这里我们就这么做了。如果不提供 `else` 表达式并且条件为 `false` 时，程序会直接忽略 `if` 代码块并继续执行下面的代码。

source: Try running this code; you should see the following output:
es: Intente ejecutar este código; debería ver la siguiente salida:
id: Coba jalankan kode ini; Anda seharusnya melihat keluaran berikut:
ko: 이 코드를 실행해보세요; 다음 출력을 볼 수 있어야 합니다:
zh_cn: 尝试运行这段代码；你应该看到以下输出：

source: Let’s try changing the value of `number` to a value that makes the condition `true` to see what happens:
es: Intentaré cambiar el valor de number por uno que haga que la condición sea verdadera para ver qué sucede:
id: Mari mencoba mengubah nilai `number` menjadi suatu nilai yang membuat kondisinya menjadi `true` untuk melihat apa yang terjadi:
ko: `number`의 값을 'true'로 만드는 값으로 변경해 보겠습니다. 결과가 어떻게 되는지 확인해 봅시다.
zh_cn: 让我们试着改变 `number` 的值使条件为 `true` 时看看会发生什么：

source: It’s also worth noting that the condition in this code must be a `bool`. If the condition isn’t a `bool`, we’ll get an error. For example, try running the following code:
ko: 이 코드에서 조건은 `bool`이어야 한다는 점도 주목할 가치가 있습니다. 조건이 `bool`이 아니면 오류가 발생합니다. 예를 들어, 다음 코드를 실행해 보세요:

source: "number was three"
ko: "숫자는 세였다"

source: The `if` condition evaluates to a value of 3 this time, and Cairo throws an error:
ko: 이번에 `if` 조건은 값 3으로 평가되고, 카이로가 오류를 발생시킵니다.

source: The error indicates that Cairo inferred the type of `number` to be a `bool` based on its later use as a condition of the `if` statement. It tries to create a `bool` from the value `3`, but Cairo doesn't support instantiating a `bool` from a numeric literal anyway - you can only use `true` or `false` to create a `bool`. Unlike languages such as Ruby and JavaScript, Cairo will not automatically try to convert non-Boolean types to a Boolean. If we want the `if` code block to run only when a number is not equal to 0, for example, we can change the if expression to the following:
ko: 오류는 Cairo가 `number`의 유형을 `if` 문의 조건으로 나중에 사용하여 `bool`로 추론했다는 것을 나타냅니다. `3` 값을 기반으로 `bool`을 만들려고 시도하지만 Cairo는 숫자 리터럴에서 `bool`을 인스턴스화하는 것을 지원하지 않습니다 - `true` 또는 `false`만 사용하여 `bool`을 만들 수 있습니다. 루비나 자바스크립트와 같은 언어와 달리 Cairo는 자동으로 비부울 유형을 부울로 변환하지 않습니다. 예를 들어 숫자가 0이 아닐 때에만 `if` 코드 블록을 실행하려면 if 표현식을 다음과 같이 변경할 수 있습니다:

source: "number was something other than zero"
ko: "숫자는 영(0)이 아닌 다른 것이었습니다."

source: Running this code will print `number was something other than zero`.
ko: 이 코드를 실행하면 `number was something other than zero`가 출력됩니다.

source: Handling Multiple Conditions with `else if`
id: Menangani Beberapa Kondisi dengan `else if`
ko: `else if`를 사용하여 여러 조건 처리하기

source: You can use multiple conditions by combining `if` and `else` in an `else if` expression. For example:
ko: `if`와 `else`를 결합하여 `else if` 표현식에서 여러 조건을 사용할 수 있습니다. 예를 들어:

source: "number is 12"
ko: "숫자는 12입니다"

source: "number is 3"
ko: "숫자는 3입니다"

source: "number minus 2 is 1"
ko: "숫자에서 2를 빼면 1이 됩니다."

source: "number not found"
ko: "번호를 찾을 수 없습니다"

source: This program has four possible paths it can take. After running it, you should see the following output:
es: Este programa tiene cuatro posibles caminos que puede seguir. Después de ejecutarlo, debería ver la siguiente salida:
id: Program ini memiliki empat jalur yang mungkin diambil. Setelah dijalankan, Anda seharusnya melihat keluaran berikut:
ko: 이 프로그램은 취할 수 있는 네 가지 가능한 경로가 있습니다. 실행한 후에는 다음 출력을 볼 수 있어야 합니다:
zh_cn: 这个程序有四种可能的路径。运行后，你应该看到以下输出：

source: When this program executes, it checks each `if` expression in turn and executes the first body for which the condition evaluates to `true`. Note that even though `number - 2 == 1` is `true`, we don’t see the output `number minus 2 is 1` nor do we see the `number not found` text from the `else` block. That’s because Cairo only executes the block for the first true condition, and once it finds one, it doesn’t even check the rest. Using too many `else if` expressions can clutter your code, so if you have more than one, you might want to refactor your code. [Chapter 6](./ch06-02-the-match-control-flow-construct.md) describes a powerful Cairo branching construct called `match` for these cases.
ko: 이 프로그램이 실행되면 각 `if` 표현식을 차례로 확인하고 조건이 `true`로 평가되는 첫 번째 본문을 실행합니다. `number - 2 == 1`이 `true`이지만 `number minus 2 is 1` 출력이나 `else` 블록에서 `number not found` 텍스트를 볼 수 없습니다. 이는 Cairo가 첫 번째 true 조건에 대해 블록을 실행하고, 한 번 찾으면 나머지를 심지도 않기 때문입니다. 너무 많은 `else if` 표현식을 사용하면 코드가 혼란스러워질 수 있으므로 하나 이상이 있는 경우 코드를 다시 작성하는 것이 좋습니다. [6장](./ch06-02-the-match-control-flow-construct.md)에서는 이러한 경우에 대해 강력한 Cairo 분기 구조인 `match`를 설명합니다.

source: Using `if` in a `let` statement
id: Menggunakan `if` dalam sebuah pernyataan `let`
ko: `let` 문에서 `if`를 사용하기

source: Because `if` is an expression, we can use it on the right side of a `let` statement to assign the outcome to a variable.
ko: `if`가 표현식이기 때문에, `let` 문의 오른쪽에 사용하여 결과를 변수에 할당할 수 있습니다.

source: "condition was true and number is {}"
ko: "조건이 참이고 숫자는 {}입니다."

source: The `number` variable will be bound to a value based on the outcome of the `if` expression, which will be 5 here.
ko: `number` 변수는 `if` 표현식의 결과에 따라 값에 바인딩될 것이며, 여기서는 5가 될 것입니다.

source: Repetition with Loops
id: Pengulangan dengan Loop
ko: 반복문을 사용한 반복

source: It’s often useful to execute a block of code more than once. For this task, Cairo provides a simple loop syntax, which will run through the code inside the loop body to the end and then start immediately back at the beginning. To experiment with loops, let’s create a new project called _loops_.
ko: 코드 블록을 한 번 이상 실행하는 것이 종종 유용합니다. 이 작업을 위해, 카이로는 간단한 루프 구문을 제공합니다. 이 구문은 루프 본문 내의 코드를 끝까지 실행한 다음 즉시 다시 처음부터 시작합니다. 루프를 실험해 보기 위해 _loops_ 라는 새 프로젝트를 만들어 봅시다.

source: Cairo has two kinds of loops: `loop` and `while`.
ko: 카이로에는 `loop`와 `while` 두 종류의 루프가 있습니다.

source: Repeating Code with `loop`
id: Mengulang Kode dengan `loop`
ko: `loop`를 사용하여 코드 반복하기

source: The `loop` keyword tells Cairo to execute a block of code over and over again forever or until you explicitly tell it to stop.
id: Kata kunci `loop` memberitahu Cairo untuk menjalankan suatu blok kode berulang kali selamanya atau sampai Anda secara eksplisit memberi tahu untuk berhenti.
ko: `loop` 키워드는 카이로에게 코드 블록을 영원히 반복하거나 명시적으로 중지하라고 할 때까지 계속 실행하도록 지시합니다.

source: As an example, change the _src/lib.cairo_ file in your _loops_ directory to look like this:
id: Sebagai contoh, ubah file _src/lib.cairo_ di direktori _loops_ Anda sehingga terlihat seperti ini:
ko: 예를 들어, _loops_ 디렉토리의 _src/lib.cairo_ 파일을 다음과 같이 변경하십시오:

source: "again!"
ko: "다시!"

source: Note: This program would not compile without a break condition. For the purpose of the example, we added a `break` statement that will never be reached, but satisfies the compiler.
ko: 참고: 이 프로그램은 중단 조건 없이는 컴파일되지 않습니다. 예제를 위해 절대 도달되지 않지만 컴파일러를 만족시키는 `break` 문을 추가했습니다.

source: When we run this program, we’ll see again! printed over and over continuously until either the program runs out of gas or we stop the program manually. Most terminals support the keyboard shortcut ctrl-c to interrupt a program that is stuck in a continual loop. Give it a try:
ko: 이 프로그램을 실행하면 계속해서 "we’ll see again!"가 출력됩니다. 프로그램이 연료를 다 써버리거나 우리가 프로그램을 수동으로 중지할 때까지 계속 반복됩니다. 대부분의 터미널은 계속된 루프에 갇힌 프로그램을 중단하는 키보드 단축키인 ctrl-c를 지원합니다. 한 번 시도해보세요.

source: The symbol `^C` represents where you pressed ctrl-c. You may or may not see the word `again!` printed after the ^C, depending on where the code was in the loop when it received the interrupt signal.
ko: 심볼 `^C`는 당신이 ctrl-c를 누른 곳을 나타냅니다. 인터럽트 신호를 받은 코드가 루프 어디에 있었느냐에 따라 `again!`이라는 단어가 ^C 뒤에 출력되었을 수도 있고 아닐 수도 있습니다.

source: Note: Cairo prevents us from running program with infinite loops by including a gas meter. The gas meter is a mechanism that limits the amount of computation that can be done in a program. By setting a value to the `--available-gas` flag, we can set the maximum amount of gas available to the program. Gas is a unit of measurement that expresses the computation cost of an instruction. When the gas meter runs out, the program will stop. In the previous case, we set the gas limit high enough for the the program to run for quite some time.
ko: 참고: 카이로는 무한 루프로 인한 프로그램 실행을 방지하기 위해 가스 미터를 포함합니다. 가스 미터는 프로그램에서 수행할 수 있는 계산 양을 제한하는 메커니즘입니다. `--available-gas` 플래그에 값을 설정하여 프로그램에 사용 가능한 최대 가스 양을 설정할 수 있습니다. 가스는 명령의 계산 비용을 표현하는 측정 단위입니다. 가스 미터가 소진되면 프로그램이 중지됩니다. 이전 경우에는 프로그램이 상당한 시간 동안 실행되도록 가스 한도를 충분히 설정했습니다.

source: It is particularly important in the context of smart contracts deployed on Starknet, as it prevents from running infinite loops on the network. If you're writing a program that needs to run a loop, you will need to execute it with the `--available-gas` flag set to a value that is large enough to run the program.
ko: 스마트 계약이 Starknet에 배포될 때 특히 중요한데, 이는 네트워크에서 무한 루프를 실행하는 것을 방지합니다. 루프를 실행해야 하는 프로그램을 작성 중이라면, 프로그램을 실행하기 위해 `--available-gas` 플래그를 사용하여 충분히 큰 값으로 설정해야 합니다.

source: Now, try running the same program again, but this time with the `--available-gas` flag set to `200000` instead of `2000000000000`. You will see the program only prints `again!` 3 times before it stops, as it ran out of gas to keep executing the loop.
ko: 이제 동일한 프로그램을 다시 실행해보세요. 이번에는 `--available-gas` 플래그를 `2000000000000` 대신 `200000`으로 설정해보세요. 루프를 계속 실행할 가스가 부족하여 프로그램이 멈추기 전에 `again!`을 3번만 출력하는 것을 볼 수 있을 겁니다.

source: Fortunately, Cairo also provides a way to break out of a loop using code. You can place the `break` keyword within the loop to tell the program when to stop executing the loop.
ko: 다행히도, 카이로는 코드를 사용하여 루프를 탈출하는 방법을 제공합니다. 루프 내에 `break` 키워드를 배치하여 프로그램에게 루프 실행을 중지할 때를 알릴 수 있습니다.

source: The `continue` keyword tells the program to go to the next iteration of the loop and to skip the rest of the code in this iteration. Let's add a `continue` statement to our loop to skip the `print` statement when `i` is equal to `5`.
ko: `continue` 키워드는 프로그램에게 루프의 다음 반복으로 이동하고 이 반복에서의 나머지 코드를 건너뛰도록 지시합니다. `i`가 `5`와 같을 때 `print` 문을 건너뛰기 위해 루프에 `continue` 문을 추가해 봅시다.

source: Executing this program will not print the value of `i` when it is equal to `5`.
es: Al ejecutar este programa, no se imprimirá el valor de `i` cuando sea igual a `5`.
id: Menjalankan program ini tidak akan mencetak nilai dari `i` ketika nilainya sama dengan `5`.
ko: 이 프로그램을 실행하면 `i`가 `5`와 같을 때 그 값을 출력하지 않습니다.
zh_cn: 当`i`等于`5`时，执行这个程序将不会打印`i`的值。

source: Returning Values from Loops
id: Mengembalikan Nilai dari Loop
ko: 루프에서 값을 반환하기

source: One of the uses of a `loop` is to retry an operation you know might fail, such as checking whether an operation has succeeded. You might also need to pass the result of that operation out of the loop to the rest of your code. To do this, you can add the value you want returned after the `break` expression you use to stop the loop; that value will be returned out of the loop so you can use it, as shown here:
id: Salah satu penggunaan dari `loop` adalah untuk mencoba operasi yang mungkin gagal, seperti memeriksa apakah suatu operasi berhasil. Anda mungkin juga perlu meneruskan hasil dari operasi tersebut keluar dari perulangan ke sisa kode Anda. Untuk melakukannya, Anda dapat menambahkan nilai yang ingin Anda kembalikan setelah ekspresi `break` yang Anda gunakan untuk menghentikan perulangan; nilai tersebut akan dikembalikan keluar dari perulangan sehingga Anda dapat menggunakannya, seperti yang ditunjukkan di sini:
ko: `loop`의 한 가지 용도는 작업이 실패할 수 있다는 것을 알고 있는 작업을 다시 시도하는 것입니다. 예를 들어 작업이 성공했는지 확인하는 것입니다. 또한 해당 작업의 결과를 루프 외부로 전달해야 할 수도 있습니다. 이를 위해 루프를 중지하는 데 사용하는 `break` 표현식 뒤에 반환하려는 값을 추가할 수 있습니다. 그 값은 루프 외부로 반환되어 사용할 수 있습니다.

source: "The result is {}"
ko: 결과는 {} 입니다.
