Repository: cairo-book/cairo-book
Catalog: po/*.po
Languages: es, id, ko, zh_cn

source: Cairo's naming convention for constants is to use all uppercase with underscores between words.
id: Konvensi penamaan konstan dalam Cairo adalah menggunakan huruf kapital semua dengan garis bawah di antara kata-kata.
ko: 카이로의 상수 명명 규칙은 모든 대문자를 사용하고 단어 사이에 밑줄을 넣는 것입니다.

source: Constants are valid for the entire time a program runs, within the scope in which they were declared. This property makes constants useful for values in your application domain that multiple parts of the program might need to know about, such as the maximum number of points any player of a game is allowed to earn, or the speed of light.
id: Konstan valid untuk seluruh waktu program berjalan, dalam cakupan di mana mereka dideklarasikan. Properti ini membuat konstan berguna untuk nilai-nilai dalam domain aplikasi Anda yang mungkin dibutuhkan oleh beberapa bagian dari program, seperti jumlah maksimum poin yang diizinkan oleh pemain dalam permainan, atau kecepatan cahaya.
ko: 상수는 프로그램이 실행되는 동안 유효하며 선언된 범위 내에서 유효합니다. 이 특성은 상수를 응용 프로그램 도메인의 값에 유용하게 만들어줍니다. 프로그램의 여러 부분이 알아야 할 수도 있는 값들에 대해, 예를 들어 게임의 플레이어가 획득할 수 있는 최대 점수 또는 빛의 속도와 같은 값들입니다.

source: Naming hardcoded values used throughout your program as constants is useful in conveying the meaning of that value to future maintainers of the code. It also helps to have only one place in your code you would need to change if the hardcoded value needed to be updated in the future.
id: Memberi nama pada nilai-nilai yang telah diatur secara kaku (hardcoded) yang digunakan di seluruh program Anda sebagai konstan berguna untuk menyampaikan makna dari nilai tersebut kepada pemelihara kode di masa mendatang. Hal ini juga membantu agar hanya ada satu tempat dalam kode Anda yang perlu diubah jika nilai yang diatur secara kaku tersebut perlu diperbarui di masa mendatang.
ko: 프로그램 전체에서 사용되는 하드코딩된 값에 상수로 명명하는 것은 코드를 유지보수하는 사람들에게 그 값의 의미를 전달하는 데 유용합니다. 또한, 앞으로 하드코딩된 값이 업데이트되어야 하는 경우 코드를 변경해야 하는 곳이 하나뿐이라는 것도 도움이 됩니다.

source: Shadowing
ko: 그림자 따라가기

source: Variable shadowing refers to the declaration of a new variable with the same name as a previous variable. Caironautes say that the first variable is _shadowed_ by the second, which means that the second variable is what the compiler will see when you use the name of the variable. In effect, the second variable overshadows the first, taking any uses of the variable name to itself until either it itself is shadowed or the scope ends. We can shadow a variable by using the same variable’s name and repeating the use of the `let` keyword as follows:
id: Shadowing variabel merujuk pada deklarasi variabel baru dengan nama yang sama dengan variabel sebelumnya. Caironautes mengatakan bahwa variabel pertama "tershadow" oleh variabel kedua, yang berarti bahwa variabel kedua yang akan dilihat oleh kompiler saat Anda menggunakan nama variabel tersebut. Pada dasarnya, variabel kedua menggantikan variabel pertama, mengambil penggunaan nama variabel itu sendiri hingga entah itu sendiri yang ter-"shadow" atau cakupan berakhir. Kita dapat "membayangi" (shadow) sebuah variabel dengan menggunakan nama variabel yang sama dan mengulangi penggunaan kata kunci `let` seperti berikut:
ko: 변수 그림자화는 이전 변수와 동일한 이름으로 새 변수를 선언하는 것을 의미합니다. 카이로나우트들은 첫 번째 변수가 두 번째 변수에 의해 "가려진다"고 말합니다. 이는 두 번째 변수가 컴파일러가 변수 이름을 사용할 때 볼 것이라는 것을 의미합니다. 사실, 두 번째 변수가 첫 번째 변수를 가려서 변수 이름을 사용할 때 자신을 보게 만들며, 그 자신이 가려지거나 범위가 끝날 때까지 변수 이름의 사용을 가져갑니다. 우리는 동일한 변수 이름을 사용하여 변수를 그림자화할 수 있으며 `let` 키워드의 사용을 반복하여 다음과 같이 할 수 있습니다:

source: "Inner scope x value is: {}"
ko: "내부 범위 x 값은: {}"

source: "Outer scope x value is: {}"
ko: "외부 범위 x 값은: {}"

source: This program first binds `x` to a value of `5`. Then it creates a new variable `x` by repeating `let x =`, taking the original value and adding `1` so the value of `x` is then `6`. Then, within an inner scope created with the curly brackets, the third `let` statement also shadows `x` and creates a new variable, multiplying the previous value by `2` to give `x` a value of `12`. When that scope is over, the inner shadowing ends and `x` returns to being `6`. When we run this program, it will output the following:
id: Program ini pertama mengikat `x` pada nilai `5`. Kemudian membuat variabel baru `x` dengan mengulangi `let x =`, mengambil nilai aslinya dan menambahkan `1` sehingga nilai dari `x` kemudian menjadi `6`. Kemudian, dalam sebuah cakupan dalam dengan menggunakan kurung kurawal, pernyataan `let` yang ketiga juga melakukan shadowing terhadap `x` dan membuat variabel baru, mengalikan nilai sebelumnya dengan `2` sehingga `x` memiliki nilai `12`. Ketika cakupan itu selesai, shadowing internal berakhir dan `x` kembali menjadi `6`. Ketika program ini dijalankan, akan menghasilkan keluaran berikut:
ko: 이 프로그램은 먼저 `x`를 `5`의 값에 바인딩합니다. 그런 다음 `let x =`를 반복하여 새 변수 `x`를 만들어 원래 값에 `1`을 더하여 `x`의 값이 `6`이 되도록합니다. 그런 다음 중괄호로 생성된 내부 스코프 내에서 세 번째 `let` 문도 `x`를 가려서 새 변수를 만들어 이전 값에 `2`를 곱하여 `x`의 값이 `12`가 되도록합니다. 그 스코프가 끝나면 내부 가려짐이 종료되고 `x`는 다시 `6`이 됩니다. 이 프로그램을 실행하면 다음이 출력됩니다:

source: Shadowing is different from marking a variable as `mut` because we’ll get a compile-time error if we accidentally try to reassign to this variable without using the `let` keyword. By using `let`, we can perform a few transformations on a value but have the variable be immutable after those transformations have been completed.
id: Shadowing berbeda dengan menandai variabel sebagai `mut` karena kita akan mendapatkan kesalahan pada waktu kompilasi jika secara tidak sengaja mencoba untuk menetapkan kembali (reassign) pada variabel ini tanpa menggunakan kata kunci `let`. Dengan menggunakan `let`, kita dapat melakukan beberapa transformasi pada sebuah nilai tetapi membuat variabel menjadi tidak dapat diubah setelah transformasi tersebut selesai dilakukan.
ko: 섀도잉은 변수를 `mut`으로 표시하는 것과 다릅니다. 왜냐하면 `let` 키워드를 사용하지 않고 이 변수에 다시 할당하려고 하면 컴파일 시간 오류가 발생하기 때문입니다. `let`을 사용하면 값에 대해 몇 가지 변환을 수행할 수 있지만 이러한 변환을 완료한 후에는 변수를 불변하게 만들 수 있습니다.

source: Another distinction between `mut` and shadowing is that when we use the `let` keyword again, we are effectively creating a new variable, which allows us to change the type of the value while reusing the same name. As mentioned before, variable shadowing and mutable variables are equivalent at the lower level. The only difference is that by shadowing a variable, the compiler will not complain if you change its type. For example, say our program performs a type conversion between the `u64` and `felt252` types.
id: Perbedaan lain antara `mut` dan shadowing adalah bahwa ketika kita menggunakan kata kunci `let` lagi, kita secara efektif membuat variabel baru, yang memungkinkan kita untuk mengubah tipe nilai sambil menggunakan kembali nama yang sama. Seperti yang disebutkan sebelumnya, variabel shadowing dan variabel mutable setara pada tingkat yang lebih rendah. Satu-satunya perbedaan adalah bahwa dengan melakukan shadowing pada sebuah variabel, kompiler tidak akan mengeluh jika Anda mengubah tipe variabel tersebut. Sebagai contoh, katakanlah program kita melakukan konversi tipe antara tipe `u64` dan `felt252`.
ko: `mut`와 섀도잉 사이의 또 다른 차이점은 `let` 키워드를 다시 사용할 때 새 변수를 효과적으로 생성한다는 것입니다. 이는 동일한 이름을 재사용하면서 값의 유형을 변경할 수 있게 합니다. 앞서 언급했듯이 변수 섀도잉과 가변 변수는 하위 수준에서 동등합니다. 유일한 차이점은 변수를 섀도잉하면 컴파일러가 유형을 변경해도 불평하지 않는다는 것입니다. 예를 들어, 프로그램이 `u64`와 `felt252` 유형 사이의 유형 변환을 수행한다고 가정해 봅시다.

source: "The value of x is {} of type u64"
ko: "x의 값은 u64 타입입니다"

source: // converts x to a felt, type annotation is required.
id: // mengubah x menjadi felt, annotasi tipe diperlukan.
ko: // x를 felt로 변환합니다. 타입 주석이 필요합니다.

source: "The value of x is {} of type felt252"
ko: "x의 값은 felt252 유형의 {}입니다"

source: The first `x` variable has a `u64` type while the second `x` variable has a `felt252` type. Shadowing thus spares us from having to come up with different names, such as `x_u64` and `x_felt252`; instead, we can reuse the simpler `x` name. However, if we try to use `mut` for this, as shown here, we’ll get a compile-time error:
id: Variabel `x` pertama memiliki tipe `u64` sedangkan variabel `x` kedua memiliki tipe `felt252`. Dengan demikian, shadowing menghemat kita dari harus menggunakan nama yang berbeda, seperti `x_u64` dan `x_felt252`; sebaliknya, kita dapat menggunakan kembali nama yang lebih sederhana yaitu `x`. Namun, jika kita mencoba menggunakan `mut` untuk ini, seperti yang ditunjukkan di sini, kita akan mendapatkan kesalahan pada waktu kompilasi:
ko: 첫 번째 `x` 변수는 `u64` 유형을 가지고 있고 두 번째 `x` 변수는 `felt252` 유형을 가지고 있습니다. 이러한 그림자화는 `x_u64` 및 `x_felt252`와 같은 다른 이름을 생각해 내지 않아도 되게 해줍니다. 대신 더 간단한 `x` 이름을 재사용할 수 있습니다. 그러나 여기에 표시된 것처럼 이를 위해 `mut`을 사용하려고 하면 컴파일 시간 오류가 발생합니다.

source: The error says we were expecting a `u64` (the original type) but we got a different type:
es: El error indica que se esperaba un `u64` (el tipo original), pero se obtuvo un tipo diferente:
id: Kesalahan tersebut menyatakan bahwa kita mengharapkan tipe `u64` (tipe asli) tetapi kita mendapatkan tipe yang berbeda:
ko: 에러는 우리가 `u64` (원래의 타입)을 기대했지만 다른 타입을 받았다고 말합니다.
zh_cn: 这个错误表示我们预期得到一个 `u64` 类型（原始类型），但实际得到了不同的类型：

source: Now that we’ve explored how variables work, let’s look at more data types they can have.
id: Setelah kita menjelajahi bagaimana variabel bekerja, mari kita lihat lebih banyak jenis data yang bisa mereka miliki.
ko: 이제 변수가 어떻게 작동하는지 살펴보았으니, 그들이 가질 수 있는 더 많은 데이터 유형을 살펴봅시다.

source: Every value in Cairo is of a certain _data type_, which tells Cairo what kind of data is being specified so it knows how to work with that data. This section covers two subsets of data types: scalars and compounds.
id: Setiap nilai di Cairo memiliki _jenis data_ tertentu, yang memberi tahu Cairo jenis data apa yang sedang ditentukan sehingga Cairo tahu cara bekerja dengan data tersebut. Bagian ini mencakup dua subset jenis data: skalar dan compound.
ko: 카이로의 모든 값은 특정 _데이터 유형_ 을 가지고 있으며, 이는 카이로에게 어떤 종류의 데이터가 지정되었는지를 알려주어 해당 데이터를 처리하는 방법을 알 수 있게 합니다. 이 섹션은 스칼라와 복합 데이터 유형 두 가지 하위 집합을 다룹니다.

source: Keep in mind that Cairo is a _statically typed_ language, which means that it must know the types of all variables at compile time. The compiler can usually infer the desired type based on the value and its usage. In cases when many types are possible, we can use a conversion method where we specify the desired output type.
id: Ingatlah bahwa Cairo adalah bahasa _berjenis statis_, yang berarti bahwa ia harus mengetahui jenis-jenis semua variabel pada waktu kompilasi. Kompiler biasanya dapat menyimpulkan jenis yang diinginkan berdasarkan nilai dan penggunaannya. Dalam kasus-kasus di mana banyak jenis mungkin terjadi, kita dapat menggunakan metode konversi (cast) di mana kita menentukan jenis keluaran yang diinginkan.
ko: 기억해야 할 점은 카이로는 _정적으로 타입이 지정된_ 언어이며, 이는 컴파일 시간에 모든 변수의 타입을 알아야 한다는 것을 의미합니다. 컴파일러는 일반적으로 값과 사용 방법을 기반으로 원하는 타입을 추론할 수 있습니다. 여러 타입이 가능한 경우, 우리는 원하는 출력 타입을 지정하는 캐스트 방법을 사용할 수 있습니다.

source: You’ll see different type annotations for other data types.
es: Verá diferentes anotaciones de tipo para otros tipos de datos.
id: Anda akan melihat anotasi jenis yang berbeda untuk jenis data lainnya.
ko: 다른 데이터 유형에 대한 다른 유형 주석을 볼 수 있습니다.
zh_cn: 你会看到其它数据类型的各种类型注解。

source: Scalar Types
id: Tipe Scalar
ko: 스칼라 유형

source: A _scalar_ type represents a single value. Cairo has three primary scalar types: felts, integers, and booleans. You may recognize these from other programming languages. Let’s jump into how they work in Cairo.
id: Jenis data _scalar_ mewakili sebuah nilai tunggal. Cairo memiliki tiga jenis skalar utama: felts, bilangan bulat, dan boolean. Anda mungkin mengenali ini dari bahasa pemrograman lain. Mari kita lihat bagaimana cara kerjanya di Cairo.
ko: 스칼라 유형은 단일 값 하나를 나타냅니다. 카이로에는 세 가지 주요 스칼라 유형이 있습니다: 펠트, 정수 및 부울린입니다. 이러한 유형들을 다른 프로그래밍 언어에서 알아볼 수 있을 것입니다. 이제 카이로에서 이들이 어떻게 작동하는지 알아보겠습니다.

source: Felt Type
id: Tipe Felt
ko: 펠트 유형

source: In Cairo, if you don't specify the type of a variable or argument, its type defaults to a field element, represented by the keyword `felt252`. In the context of Cairo, when we say “a field element” we mean an integer in the range \\( 0 \leq x \< P \\), where `P` is a very large prime number currently equal to \\( {2^{251}} + 17 \cdot {2^{192}} + 1 \\). When adding, subtracting, or multiplying, if the result falls outside the specified range of the prime number, an overflow (or underflow) occurs, and an appropriate multiple of P is added or subtracted to bring the result back within the range (i.e., the result is computed modulo P).
ko: 카이로에서 변수나 인수의 유형을 지정하지 않으면 해당 유형은 키워드 `felt252`로 표시되는 필드 요소로 기본 설정됩니다. 카이로의 맥락에서 "필드 요소"라고 말할 때는 \\( 0 \leq x \< P \\) 범위의 정수를 의미하며, 여기서 `P`는 현재 \\( {2^{251}} + 17 \cdot {2^{192}} + 1 \\)과 같은 매우 큰 소수입니다. 더하거나 빼거나 곱할 때, 결과가 지정된 소수의 범위를 벗어나면 오버플로우(또는 언더플로우)가 발생하고, 결과를 다시 범위 내로 가져오기 위해 P의 적절한 배수가 추가되거나 빼집니다(즉, 결과는 P로 모듈로 계산됩니다).

source: The most important difference between integers and field elements is division: Division of field elements (and therefore division in Cairo) is unlike regular CPUs division, where integer division \\( \frac{x}{y} \\) is defined as \\( \left\lfloor \frac{x}{y} \right\rfloor \\) where the integer part of the quotient is returned (so you get \\( \frac{7}{3} = 2 \\)) and it may or may not satisfy the equation \\( \frac{x}{y} \cdot y == x \\), depending on the divisibility of `x` by `y`.
ko: 정수와 필드 요소 사이의 가장 중요한 차이점은 나눗셈입니다: 필드 요소의 나눗셈(따라서 카이로의 나눗셈)은 정규 CPU의 나눗셈과 달리 정의됩니다. 여기서 정수 나눗셈 \\( \frac{x}{y} \\)은 \\( \left\lfloor \frac{x}{y} \right\rfloor \\)로 정의되며 몫의 정수 부분이 반환됩니다(따라서 \\( \frac{7}{3} = 2 \\)가 됩니다). 그리고 이는 `x`를 `y`로 나눌 때 \\( \frac{x}{y} \cdot y == x \\) 방정식을 만족할 수도, 만족하지 않을 수도 있습니다.

source: In Cairo, the result of \\( \frac{x}{y} \\) is defined to always satisfy the equation \\( \frac{x}{y} \cdot y == x \\). If y divides x as integers, you will get the expected result in Cairo (for example \\( \frac{6}{2} \\) will indeed result in `3`). But when y does not divide x, you may get a surprising result: for example, since \\( 2 \cdot \frac{P + 1}{2} = P + 1 \equiv 1 \mod P \\), the value of \\( \frac{1}{2} \\) in Cairo is \\( \frac{P + 1}{2} \\) (and not 0 or 0.5), as it satisfies the above equation.
ko: 카이로에서는 \\( \frac{x}{y} \\)의 결과가 항상 \\( \frac{x}{y} \cdot y == x \\) 방정식을 항상 만족하도록 정의됩니다. y가 x를 정수로 나누면 카이로에서 예상한 결과를 얻을 수 있습니다 (예를 들어 \\( \frac{6}{2} \\)는 실제로 `3`이 됩니다). 그러나 y가 x를 나누지 않을 때는 놀라운 결과를 얻을 수도 있습니다: 예를 들어, \\( 2 \cdot \frac{P + 1}{2} = P + 1 \equiv 1 \mod P \\)이므로, 카이로에서 \\( \frac{1}{2} \\)의 값은 \\( \frac{P + 1}{2} \\)입니다 (0 또는 0.5가 아닌) 위의 방정식을 만족하기 때문입니다.

source: Integer Types
id: Tipe Integer
ko: 정수형 데이터 유형

source: The felt252 type is a fundamental type that serves as the basis for creating all types in the core library. However, it is highly recommended for programmers to use the integer types instead of the `felt252` type whenever possible, as the `integer` types come with added security features that provide extra protection against potential vulnerabilities in the code, such as overflow and underflow checks. By using these integer types, programmers can ensure that their programs are more secure and less susceptible to attacks or other security threats. An `integer` is a number without a fractional component. This type declaration indicates the number of bits the programmer can use to store the integer. Table 3-1 shows the built-in integer types in Cairo. We can use any of these variants to declare the type of an integer value.
ko: felt252 유형은 핵심 라이브러리의 모든 유형을 생성하는 기초로 작용하는 기본 유형입니다. 그러나 프로그래머들이 가능한 경우 `felt252` 유형 대신 정수 유형을 사용하는 것이 매우 권장됩니다. 왜냐하면 `integer` 유형은 코드 내의 잠재적인 취약점에 대한 추가 보호 기능을 제공하는 오버플로 및 언더플로 검사와 함께 제공되기 때문입니다. 이 정수 유형을 사용함으로써 프로그래머들은 프로그램이 더 안전하고 공격이나 다른 보안 위협에 덜 취약하도록 할 수 있습니다. `integer`은 소수점 구성 요소가 없는 숫자입니다. 이 유형 선언은 프로그래머가 정수를 저장하는 데 사용할 수 있는 비트 수를 나타냅니다. 표 3-1은 Cairo에 내장된 정수 유형을 보여줍니다. 이러한 변형 중 어느 것이든 사용하여 정수 값의 유형을 선언할 수 있습니다.

source: Table 3-1: Integer Types in Cairo
id: Tabel 3-1: Jenis Data Bilangan Bulat di Cairo
ko: 표 3-1: 카이로의 정수 유형

source: Length
id: Panjang
ko: 길이

source: Unsigned
id: Tidak bertanda
ko: 미서명

source: 8-bit
ko: 8비트

source: 16-bit
ko: 16비트

source: 32-bit
ko: 32비트

source: 64-bit
ko: 64비트

source: 128-bit
ko: 128비트

source: 256-bit
ko: 256비트

source: Each variant has an explicit size. Note that for now, the `usize` type is just an alias for `u32`; however, it might be useful when in the future Cairo can be compiled to MLIR. As variables are unsigned, they can't contain a negative number. This code will cause the program to panic:
id: Setiap varian memiliki ukuran yang eksplisit. Perlu diperhatikan bahwa untuk saat ini, jenis data `usize` hanyalah alias untuk `u32`; namun, ini mungkin berguna jika di masa depan Cairo dapat dikompilasi ke MLIR. Karena variabel-variabel bersifat tidak bertanda, mereka tidak dapat berisi angka negatif. Kode ini akan menyebabkan program mengalami panic:
ko: 각 변형에는 명시적인 크기가 있습니다. 지금은 `usize` 타입이 단순히 `u32`의 별칭일 뿐이지만, 나중에 Cairo가 MLIR로 컴파일될 수 있을 때 유용할 수 있습니다. 변수가 부호 없는 정수이기 때문에 음수를 포함할 수 없습니다. 이 코드는 프로그램이 패닉 상태에 빠지게 할 것입니다.

source: All integer types previously mentioned fit into a `felt252`, except for `u256` which needs 4 more bits to be stored. Under the hood, `u256` is basically a struct with 2 fields: `u256 {low: u128, high: u128}`.
ko: 이전에 언급된 모든 정수 유형은 `felt252`에 들어갑니다. `u256`는 저장되기 위해 4개의 비트가 더 필요합니다. `u256`는 기본적으로 `u256 {low: u128, high: u128}`라는 2개의 필드가 있는 구조체입니다.

source: Cairo also provides support for signed integers, starting with the prefix `i`. These integers can represent both positive and negative values, with sizes ranging from `i8` to `i128`. Each signed variant can store numbers from \\( -({2^{n - 1}}) \\) to \\( {2^{n - 1}} - 1 \\) inclusive, where `n` is the number of bits that variant uses. So an i8 can store numbers from \\( -({2^7}) \\) to \\( {2^7} - 1 \\), which equals `-128` to `127`.
ko: 카이로는 `i` 접두어로 시작하는 부호 있는 정수를 지원합니다. 이 정수들은 양수와 음수 값을 나타낼 수 있으며, `i8`부터 `i128`까지의 크기를 가집니다. 각 부호 있는 변형은 해당 변형이 사용하는 비트 수인 `n`에 따라 \\( -({2^{n - 1}}) \\)에서 \\( {2^{n - 1}} - 1 \\)까지의 숫자를 저장할 수 있습니다. 따라서 i8은 \\( -({2^7}) \\)에서 \\( {2^7} - 1 \\)까지의 숫자를 저장할 수 있으며, 이는 `-128`부터 `127`까지의 값을 나타냅니다.

source: You can write integer literals in any of the forms shown in Table 3-2. Note that number literals that can be multiple numeric types allow a type suffix, such as `57_u8`, to designate the type. It is also possible to use a visual separator `_` for number literals, in order to improve code readability.
ko: 표 3-2에 표시된 형식 중 어떤 형태로든 정수 리터럴을 작성할 수 있습니다. 여러 숫자 유형을 가질 수 있는 숫자 리터럴은 `57_u8`와 같이 유형 접미사를 허용합니다. 또한 코드 가독성을 높이기 위해 숫자 리터럴에 시각적 구분자 `_`를 사용하는 것도 가능합니다.

source: Table 3-2: Integer Literals in Cairo
id: Tabel 3-2: Literal Bilangan Bulat di Cairo
ko: 표 3-2: 카이로의 정수 리터럴

source: Numeric literals
id: Literal Numerik
ko: 숫자 리터럴

source: Example
id: Contoh
ko: 예시

source: Decimal
ko: 십진법

source: Hex
ko: 16진수

source: Octal
ko: 8진수

source: Binary
ko: 이진

source: So how do you know which type of integer to use? Try to estimate the max value your int can have and choose the good size. The primary situation in which you’d use `usize` is when indexing some sort of collection.
id: Jadi, bagaimana Anda tahu jenis bilangan bulat mana yang harus digunakan? Cobalah untuk memperkirakan nilai maksimum yang dapat dimiliki oleh integer Anda dan pilih ukuran yang sesuai. Situasi utama di mana Anda akan menggunakan `usize` adalah saat mengindeks suatu jenis koleksi.
ko: 어떤 종류의 정수를 사용해야 하는지 어떻게 알 수 있을까요? int가 가질 수 있는 최대값을 추정해보고 적절한 크기를 선택해보세요. `usize`를 사용하는 기본적인 상황은 어떤 종류의 컬렉션을 인덱싱할 때입니다.

source: Numeric Operations
id: Operasi Numerik
ko: 숫자 연산

source: Cairo supports the basic mathematical operations you’d expect for all the integer types: addition, subtraction, multiplication, division, and remainder. Integer division truncates toward zero to the nearest integer. The following code shows how you’d use each numeric operation in a `let` statement:
id: Cairo mendukung operasi matematika dasar yang dapat Anda harapkan untuk semua jenis bilangan bulat: penambahan, pengurangan, perkalian, pembagian, dan sisa. Pembagian bilangan bulat memutuskan ke nol ke bilangan bulat terdekat. Kode berikut menunjukkan bagaimana Anda akan menggunakan setiap operasi numerik dalam pernyataan `let`:
ko: 카이로는 모든 정수 유형에 대해 기대할 수 있는 기본 수학 연산을 지원합니다: 덧셈, 뺄셈, 곱셈, 나눗셈 및 나머지. 정수 나눗셈은 가장 가까운 정수로 소수점을 버립니다. 다음 코드는 각 숫자 연산을 `let` 문에서 사용하는 방법을 보여줍니다:

source: // addition
ko: // 덧셈

source: // subtraction
ko: 뺄셈

source: // multiplication
ko: 곱셈

source: // division
ko: 분할

source: //result is 1
ko: 결과는 1입니다.

source: //result is 2
ko: 결과는 2입니다.

source: // remainder
ko: 나머지

source: // result is 3
ko: 결과는 3입니다.

source: Each expression in these statements uses a mathematical operator and evaluates to a single value, which is then bound to a variable.
id: Setiap ekspresi dalam pernyataan ini menggunakan operator matematika dan dievaluasi menjadi nilai tunggal, yang kemudian diikat ke dalam suatu variabel.
ko: 이 문장들의 각 표현은 수학 연산자를 사용하고 단일 값으로 평가되며, 그 값은 변수에 바인딩됩니다.

source: [Appendix B](appendix-02-operators-and-symbols.md#operators) contains a list of all operators that Cairo provides.
id: [Bagian Lampiran B](appendix-02-operators-and-symbols.md#operators) berisi daftar semua operator yang disediakan oleh Cairo.
ko: [부록 B](appendix-02-operators-and-symbols.md#operators)에는 카이로가 제공하는 모든 연산자 목록이 포함되어 있습니다.

source: The Boolean Type
id: Tipe Data Boolean
ko: 부울 자료형

source: As in most other programming languages, a Boolean type in Cairo has two possible values: `true` and `false`. Booleans are one `felt252` in size. The Boolean type in Cairo is specified using `bool`. For example:
ko: 대부분의 다른 프로그래밍 언어와 마찬가지로, 카이로의 부울 유형에는 `true`와 `false`라는 두 가지 가능한 값이 있습니다. 부울은 `felt252` 크기입니다. 카이로의 부울 유형은 `bool`을 사용하여 지정됩니다. 예를 들어:

source: // with explicit type annotation
id: // dengan anotasi tipe eksplisit
ko: 명시적인 유형 주석이 있는 경우

source: When declaring a `bool` variable, it is mandatory to use either `true` or `false` literals as value. Hence, it is not allowed to use integer literals (i.e. `0` instead of false) for `bool` declarations.
ko: `bool` 변수를 선언할 때는 `true` 또는 `false` 리터럴을 값으로 사용해야 합니다. 따라서 `bool` 선언에 정수 리터럴(예: `0` 대신에 false)을 사용하는 것은 허용되지 않습니다.

source: The main way to use Boolean values is through conditionals, such as an `if` expression. We’ll cover how `if` expressions work in Cairo in the [“Control Flow”](ch02-05-control-flow.md) section.
id: Cara utama menggunakan nilai Boolean adalah melalui kondisional, seperti ekspresi `if`. Kami akan menjelaskan bagaimana ekspresi `if` bekerja di Cairo pada bagian ["Alur Kontrol"](ch02-05-control-flow.md).
ko: 부울 값 사용하는 주요 방법은 조건문을 통해 하는 것입니다. 예를 들어 `if` 표현식을 통해 사용합니다. 카이로에서 `if` 표현식이 어떻게 작동하는지는 [“제어 흐름”](ch02-05-control-flow.md) 섹션에서 다룰 것입니다.

source: The Short String Type
id: Tipe Data String Pendek
ko: 짧은 문자열 유형

source: Cairo doesn't have a native type for strings, but you can store characters forming what we call a "short string" inside `felt252`s. A short string has a max length of 31 chars. This is to ensure that it can fit in a single felt (a felt is 252 bits, one ASCII char is 8 bits). Here are some examples of declaring values by putting them between single quotes:
id: Cairo tidak memiliki tipe data asli untuk string, tetapi Anda dapat menyimpan karakter yang membentuk apa yang kami sebut sebagai "string pendek" di dalam `felt252`. Sebuah string pendek memiliki panjang maksimal 31 karakter. Hal ini dilakukan untuk memastikan bahwa string tersebut dapat muat dalam satu felt (satu felt adalah 252 bit, satu karakter ASCII adalah 8 bit). Berikut adalah beberapa contoh mendeklarasikan nilai dengan menempatkannya di antara tanda kutip satu:
ko: 카이로에는 문자열을 위한 기본 타입이 없지만, 'felt252' 안에 형성된 문자들을 저장할 수 있습니다. 짧은 문자열은 최대 31자까지입니다. 이는 한 개의 felt(한 개의 felt는 252비트이며, 한 개의 ASCII 문자는 8비트입니다)에 들어갈 수 있도록 보장하기 위한 것입니다. 작은 따옴표 사이에 값을 넣어 선언하는 예시는 다음과 같습니다:

source: Type Conversion
id: Tipe Data casting
ko: 형 변환
