Repository: cairo-book/cairo-book
Catalog: po/*.po
Languages: es, id, ko, zh_cn

source: Re-exporting is useful when the internal structure of your code is different from how programmers calling your code would think about the domain. For example, in this restaurant metaphor, the people running the restaurant think about “front of house” and “back of house.” But customers visiting a restaurant probably won’t think about the parts of the restaurant in those terms. With `use`, we can write our code with one structure but expose a different structure. Doing so makes our library well organized for programmers working on the library and programmers calling the library.
es: La Re-exportación es útil cuando la estructura interna de su código es diferente de cómo los programadores que llaman a su código pensarían sobre el dominio. En ejemplo, en esta metáfora del restaurante, las personas que lo dirigen piensan piensan en "la parte delantera" y "la parte trasera". Pero los clientes que visitan un restaurante probablemente no piensen en las partes del restaurante en esos términos. Con `use`, podemos escribir nuestro código con una estructura pero exponer una estructura diferente. Esto hace que nuestra biblioteca esté bien organizada para los programadores que trabajan en ella y para los programadores que la llaman.
zh_cn: 当你代码的内部结构与调用你代码的程序员所想象的结构不同时，重导出会很有用。 例如，在这个餐馆的比喻中，经营餐馆的人会想到“前台”和“后台”。但顾客在光顾一家餐馆时，可能不会以这些术语来考虑餐馆的各个部分。 使用 `use`，我们可以使用一种结构编写代码，却将不同的结构形式暴露出来。这样做使我们的库井井有条，也使开发这个库的程序员和调用这个库的程序员都更加方便。

source: ## Using External Packages in Cairo with Scarb
es: ## Usando Paquetes Externos en Cairo con Scarb
zh_cn: ## 在Cairo使用外部包与Scarb

source: > The dependencies system is still a work in progress. You can check the official [documentation](https://docs.swmansion.com/scarb/docs/guides/dependencies.html).
es: > El sistema de dependencias es todavía un trabajo en curso. Puede consultar la [documentación oficial](https://docs.swmansion.com/scarb/docs/guides/dependencies.html).
zh_cn: > 依赖关系系统仍然是一项正在进行的工作。你可以查看官方的[文档](https://docs.swmansion.com/scarb/docs/guides/dependencies.html)。

source: ## Separating Modules into Different Files
es: ## Separar Módulos en Archivos Diferentes
zh_cn: ## 将模块拆分成多个文件

source: So far, all the examples in this chapter defined multiple modules in one file. When modules get large, you might want to move their definitions to a separate file to make the code easier to navigate.
es: Hasta ahora, todos los ejemplos de este capítulo definían varios módulos en un solo archivo. Cuando los módulos se hacen grandes, es posible que desee mover sus definiciones a una separada para facilitar la navegación por el código.
zh_cn: 到目前为止，本章所有的例子都在一个文件中定义多个模块。当模块变得更大时，你可能想要将它们的定义移动到单独的文件中，从而使代码更容易阅读。

source: For example, let’s start from the code in Listing 7-11 that had multiple restaurant modules. We’ll extract modules into files instead of having all the modules defined in the crate root file. In this case, the crate root file is _src/lib.cairo_.
zh_cn: 例如，我们从示例7-11中的代码开始，我们会将模块的代码提取到各自的文件中，而不是将所有模块都定义到 crate 根文件中。在这里，crate 根文件是 _src/lib.cairo_ 。

source: First, we’ll extract the `front_of_house` module to its own file. Remove the code inside the curly brackets for the `front_of_house` module, leaving only the `mod front_of_house;` declaration, so that _src/lib.cairo_ contains the code shown in Listing 7-12. Note that this won’t compile until we create the _src/front_of_house.cairo_ file in Listing 7-13.
zh_cn: 首先将 `front_of_house` 模块提取到其自己的文件中。删除 `front_of_house` 模块的大括号中的代码，只留下 `mod front_of_house;` 声明，这样 _src/lib.cairo_ 就包含了代码 如示例7-12所示。注意直到创建示例 7-13 中的 _src/front_of_house.cairo_ 文件之前代码都不能编译。

source: <span class="caption">Listing 7-12: Declaring the `front_of_house` module whose body will be in _src/front_of_house.cairo_</span>
zh_cn: <span class="caption">示例7-12：声明`front_of_house` 模块，其主体代码将存放在 _src/front_of_house.cairo_ 中。</span>

source: Next, place the code that was in the curly brackets into a new file named _src/front_of_house.cairo_, as shown in Listing 7-13. The compiler knows to look in this file because it came across the module declaration in the crate root with the name `front_of_house`.
zh_cn: 接下来将之前大括号内的代码放入一个名叫 _src/front_of_house.cairo_ 的新文件中，如示例 7-13所示。因为编译器找到了 crate 根中名叫 `front_of_house` 的模块声明，它就知道去查看这个文件。

source: <span class="filename">Filename: src/front_of_house.cairo</span>
zh_cn: <span class="filename">文件名： src/front_of_house.cairo</span>

source: <span class="caption">Listing 7-13: Definitions inside the `front_of_house` module in _src/front_of_house.cairo_</span>
zh_cn: <span class="caption">示例 7-13：在 _src/front_of_house.cairo_ 中定义 `front_of_house` 模块。</span>

source: Note that you only need to load a file using a `mod` declaration _once_ in your module tree. Once the compiler knows the file is part of the project (and knows where in the module tree the code resides because of where you’ve put the `mod` statement), other files in your project should refer to the loaded file’s code using a path to where it was declared, as covered in the [“Paths for Referring to an Item in the Module Tree”][paths]<!-- ignore --> section. In other words, `mod` is _not_ an “include” operation that you may have seen in other programming languages.
es: Tenga en cuenta que sólo es necesario cargar un archivo mediante una declaración `mod` _una vez_ en su árbol de módulos. Una vez que el compilador sabe que el archivo es parte del proyecto (y sabe donde en el árbol de módulos reside el código debido a donde has puesto la declaración `mod` ), otros archivos en su proyecto debe hacer referencia al código del archivo cargado cargado utilizando una ruta hacia el lugar donde se declaró, como se explica en la sección ["Rutas para Referirse a un elemento en el árbol de módulos"][rutas]<!-- ignorar --> sección. En otras palabras, `mod` no es una operación "include" que pueda haber visto en otros lenguajes de programación.
zh_cn: 注意你只需在模块树中的某处使用一次 mod 声明就可以加载这个文件。 一旦编译器知道了这个文件是项目的一部分（并且通过 mod 语句的位置知道了代码在模块树中的位置），项目中的其他文件应该使用其所声明的位置的路径来引用那个文件的代码， 这在 [引用模块项目的路径](ch06-03-paths-for-referring-to-an-item-in-the-module-tree.md)部分有讲到。 换句话说，mod 不是 你可能会在其他编程语言中看到的 “include” 操作。

source: Next, we’ll extract the `hosting` module to its own file. The process is a bit different because `hosting` is a child module of `front_of_house`, not of the root module. We’ll place the file for `hosting` in a new directory that will be named for its ancestors in the module tree, in this case _src/front_of_house/_.
es: A continuación, extraeremos el módulo `hosting` a su propio archivo. El proceso es un poco diferente porque `hosting` es un módulo hijo de `front_of_house`, no del módulo raíz. Colocaremos el archivo para `hosting` en un nuevo directorio que será nombre de sus antepasados en el árbol de módulos, en este caso _src/front_of_house/_.
zh_cn: 接下来我们同样将 `hosting` 模块提取到自己的文件中。这个过程会有所不同，因为 `hosting` 是 `front_of_house` 的子模块而不是根模块。我们将 `hosting` 的文件放在与模块树中它的父级模块同名的目录中，在这里是 _src/front_of_house/_ 。

source: To start moving `hosting`, we change _src/front_of_house.cairo_ to contain only the declaration of the `hosting` module:
es: Para empezar a mover `hosting`, cambiamos _src/front_of_house.cairo_ para que contenga sólo la declaración del módulo `hosting`:
zh_cn: 为了移动 `hosting`，修改 _src/front_of_house.cairo_ 使之仅包含 `hosting` 模块的声明：

source: Then we create a _src/front_of_house_ directory and a file _hosting.cairo_ to contain the definitions made in the `hosting` module:
es: Luego creamos un directorio _src/front_of_house_ y un archivo _hosting.cairo_ para contener las definiciones hechas en el módulo `hosting`:
zh_cn: 接着我们创建一个 _src/front_of_house_ 目录和一个包含 `hosting` 模块定义的 _hosting.cairo_ 文件：

source: <span class="filename">Filename: src/front_of_house/hosting.cairo</span>
zh_cn: <span class="filename">文件名： src/front_of_house/hosting.cairo</span>

source: If we instead put _hosting.cairo_ in the _src_ directory, the compiler would expect the _hosting.cairo_ code to be in a `hosting` module declared in the crate root, and not declared as a child of the `front_of_house` module. The compiler’s rules for which files to check for which modules’ code means the directories and files more closely match the module tree.
es: Si en su lugar ponemos _hosting.cairo_ en el directorio _src_, el compilador esperaría que el código _hosting.cairo_ estuviera en un módulo `hosting` declarado en el crate y no declarado como hijo del módulo `front_of_house`. Las reglas del compilador de reglas del compilador sobre qué archivos comprobar para qué código de los módulos significa que los directorios y archivos se ajustan más al árbol de módulos.
zh_cn: 如果将 _hosting.cairo_ 放在 _src_ 目录，编译器会认为 `hosting` 模块中的 _hosting.cairo_ 的代码声明于 crate 根，而不是声明为 `front_of_house` 的子模块。 编译器所遵循的哪些文件对应哪些模块的代码的规则，意味着目录和文件更接近于模块树。

source: We’ve moved each module’s code to a separate file, and the module tree remains the same. The function calls in `eat_at_restaurant` will work without any modification, even though the definitions live in different files. This technique lets you move modules to new files as they grow in size.
es: Hemos movido el código de cada módulo a un archivo separado, y el árbol de módulos sigue siendo el mismo. Las llamadas a funciones en `eat_at_restaurant` funcionarán sin ninguna aunque las definiciones estén en archivos diferentes. Esta técnica le permite mover módulos a nuevos archivos a medida que crecen en tamaño.
zh_cn: 我们将各个模块的代码移动到独立文件了，同时模块树依旧相同。 `eat_at_restaurant` 中的函数调用也无需修改继续保持有效，即便其定义存在于不同的文件中。 这个技巧让你可以在模块代码增长时，将它们移动到新文件中。

source: Note that the `use restaurant::front_of_house::hosting` statement in _src/lib.cairo_ also hasn’t changed, nor does `use` have any impact on what files are compiled as part of the crate. The `mod` keyword declares modules, and Cairo looks in a file with the same name as the module for the code that goes into that module.
es: Tenga en cuenta que la declaración `use restaurant::front_of_house::hosting` en _src/lib.cairo_ tampoco ha cambiado, ni `use` tiene ningún impacto sobre qué archivos se compilan como parte de la caja. La palabra clave `mod` declara módulos, y Cairo busca en un fichero con el mismo nombre que el módulo el código que va en ese módulo.
zh_cn: 注意，_src/lib.cairo_中的 `use restaurant::front_of_house::hosting` 语句是没有改变的，在文件作为 crate 的一部分而编译时，`use` 不会有任何影响。 `mod` 关键字声明了模块，Cairo 会在与模块同名的文件中查找模块的代码。

source: Cairo lets you split a package into multiple crates and a crate into modules so you can refer to items defined in one module from another module. You can do this by specifying absolute or relative paths. These paths can be brought into scope with a `use` statement so you can use a shorter path for multiple uses of the item in that scope. Module code is public by default.
es: Cairo le permite dividir un paquete en múltiples crates y un crate en módulos para que pueda referirse a elementos definidos en un módulo desde otro módulo. Puede hacer esto esto especificando rutas absolutas o relativas. Estas rutas pueden ser con una sentencia `use` para que pueda utilizar una ruta más corta para múltiples usos del elemento en ese ámbito. El código del módulo es público por defecto.
zh_cn: Cairo 提供了将包分成多个 crate，将 crate 分成模块，以及通过指定绝对或相对路径从一个模块引用另一个模块中定义的项的方式。 你可以通过使用 `use` 语句将路径引入作用域，这样在多次使用时可以使用更短的路径。模块定义的代码默认是公有的。

source: # Generic Types and Traits
es: # Tipos Genéricos y Traits
zh_cn: # 泛型和Trait

source: # Generic Data Types
es: # Tipos de Datos Genéricos
zh_cn: # 泛型数据类型

source: ## Generic Functions
es: ## Funciones Genéricas
zh_cn: ## 在函数定义中使用泛型

source: ### Constraints for Generic Types
es: ### Restricciones para Tipos Genéricos
zh_cn: ### 范型的约束

source: ## Structs
es: ## Structs (Estructuras)
zh_cn: ## 结构体定义中的泛型

source: ## Enums
es: ## Enums (Enumeraciones)
zh_cn: ## 枚举定义中的泛型

source: ## Generic Methods
es: ## Métodos Genéricos
zh_cn: ## 方法定义中的泛型

source: # Traits in Cairo
es: # Traits en Cairo
zh_cn: # Cairo中的Trait

source: Traits specify functionality blueprints that can be implemented. The blueprint specification includes a set of function signatures containing type annotations for the parameters and return value. This sets a standard to implement the specific functionality.
es: Los traits especifican plantillas de funcionalidad que pueden ser implementadas. La especificación de la plantilla incluye un conjunto de firmas de funciones que contienen anotaciones de tipos para los parámetros y el valor de retorno. Esto establece un estándar para implementar la funcionalidad específica.
id: Trait menentukan rancangan fungsionalitas yang dapat diimplementasikan. Spesifikasi rancangan tersebut mencakup serangkaian tanda tangan fungsi yang berisi anotasi tipe untuk parameter dan nilai kembalian. Ini menetapkan standar untuk mengimplementasikan fungsionalitas tertentu.
zh_cn: Trait（译注：也被称为特性，但本译文中将跟随rust中文的习惯，直接使用英文原单词）定义了可以实现的功能蓝图的规范。蓝图规范包括一组包含参数和返回值类型注释的函数签名。这为实现特定的功能设定了一个标准。（译注：trait 类似于其他语言中的常被称为 接口（interfaces）的功能，虽然有一些不同。）

source: ## Defining a Trait
es: ## Definiendo un Trait
zh_cn: ## 定义一个Trait

source: To define a trait, you use the keyword `trait` followed by the name of the trait in `PascalCase` then the function signatures in a pair of curly braces.
es: Para definir un trait, se utiliza la palabra clave `trait` seguida del nombre del trait en `PascalCase` y luego las firmas de funciones dentro de un par de llaves.
id: Untuk mendefinisikan sebuah trait, Anda menggunakan kata kunci `trait` diikuti oleh nama trait dalam `PascalCase` dan tanda kurung kurawal yang berisi tanda tangan fungsi.
zh_cn: 要定义一个Trait，你可以使用关键字`trait`，后面是以`PascalCase`书写的trait名称，然后是一对大括号内的函数签名。

source: For example, let's say that we have multiple structs representing shapes. We want our application to be able to perform geometry operations on these shapes, So we define a trait `ShapeGeometry` that contains a blueprint to implement geometry operations on a shape like this:
es: Por ejemplo, supongamos que tenemos múltiples estructuras que representan formas. Queremos que nuestra aplicación pueda realizar operaciones de geometría en estas formas, por lo que definimos un trait `ShapeGeometry` que contiene una plantilla para implementar operaciones de geometría en una forma de esta manera:
id: Sebagai contoh, misalkan kita memiliki beberapa struct yang mewakili bentuk-bentuk. Kita ingin aplikasi kita dapat melakukan operasi geometri pada bentuk-bentuk tersebut. Jadi, kita mendefinisikan sebuah trait `ShapeGeometry` yang berisi rancangan untuk mengimplementasikan operasi geometri pada suatu bentuk seperti ini:
zh_cn: 例如，假设我们有多个代表形状的结构体。我们希望我们的应用程序能够对这些形状进行几何操作，所以我们定义了一个trait`ShapeGeometry`，它包含一个蓝图来实现对形状的几何操作：

source: Here our trait `ShapeGeometry` declares signatures for two methods `boundary` and `area`. When implemented, both these functions should return a `u64` and accept parameters as specified by the trait.
es: Aquí nuestro trait `ShapeGeometry` declara las firmas de dos métodos `boundary` y `area`. Cuando se implementen, ambas funciones deben devolver un `u64` y aceptar parámetros tal como se especifica en el trait.
id: Di sini, trait `ShapeGeometry` mendeklarasikan tanda tangan untuk dua metode, yaitu `boundary` dan `area`. Ketika diimplementasikan, kedua fungsi ini harus mengembalikan nilai `u64` dan menerima parameter sesuai yang dijelaskan oleh trait.
zh_cn: 这里我们的trait `ShapeGeometry`声明了两个方法的签名`boundary`和`area`。当编写实现时，这两个函数都应该返回一个`u64`，并接受trait所规定的参数。

source: ## Implementing a Trait
es: ## Implementando un Trait
zh_cn: ## 实现一个trait

source: A trait can be implemented using `impl` keyword with the name of your implementation followed by `of` then the name of trait being implemented. Here's an example implementing `ShapeGeometry` trait.
es: Un trait puede ser implementado usando la palabra clave `impl` seguida del nombre de la implementación y la palabra `of`, seguida del nombre del trait que está siendo implementado. Aquí hay un ejemplo de cómo implementar el trait `ShapeGeometry`.
id: Sebuah trait dapat diimplementasikan menggunakan kata kunci `impl` dengan nama implementasi yang diikuti oleh `of` dan kemudian nama trait yang diimplementasikan. Berikut adalah contoh mengimplementasikan trait `ShapeGeometry`.
zh_cn: 一个trait可以用`impl`关键字来实现，在你的实现名称后面加上`of`，然后是被实现的trait的名称。下面是一个实现`ShapeGeometry`trait的例子。

source: In the code above, `RectangleGeometry` implements the trait `ShapeGeometry` defining what the methods `boundary` and `area` should do. Note that the function parameters and return value types are identical to the trait specification.
es: En el código anterior, `RectangleGeometry` implementa el trait `ShapeGeometry` definiendo lo que deben hacer los métodos `boundary` y `area`. Note que los tipos de los parámetros de las funciones y los valores de retorno son idénticos a los especificados en el trait.
id: Dalam kode di atas, `RectangleGeometry` mengimplementasikan trait `ShapeGeometry` dengan mendefinisikan apa yang seharusnya dilakukan oleh metode `boundary` dan `area`. Perhatikan bahwa tipe parameter fungsi dan nilai kembalian identik dengan spesifikasi trait.
zh_cn: 在上面的代码中，`RectangleGeometry`实现了`ShapeGeometry`的trait，定义了`boundary`和`area`方法应该做什么。请注意，函数参数和返回值的类型与trait所定义的规范是相同的。

source: ## Implementing a trait, without writing its declaration.
zh_cn: ## trait的无声明实现。

source: ## Parameter `self`
es: ## Parámetro `self`
zh_cn: ## 参数 `self`

source: In the example above, `self` is a special parameter. When a parameter with name `self` is used, the implemented functions are also [attached to the instances of the type as methods](ch05-03-method-syntax.md#defining-methods). Here's an illustration,
id: Dalam contoh di atas, `self` adalah parameter khusus. Ketika sebuah parameter dengan nama `self` digunakan, fungsi-fungsi yang diimplementasikan juga [terlampir pada instansi dari tipe tersebut sebagai metode](ch05-03-method-syntax.md#defining-methods). Berikut adalah ilustrasinya,
zh_cn: 在上面的例子中，`self`是一个特殊参数。当使用名称为`self`的���数时，实现的函数也会[作为方法附加到类型的实例上](ch05-03-method-syntax.md#defining-methods)。下面是一个演示、

source: When the `ShapeGeometry` trait is implemented, the function `area` from the `ShapeGeometry` trait can be called in two ways:
es: Cuando se implementa el trait `ShapeGeometry`, la función `area` del trait `ShapeGeometry` se puede llamar de dos maneras:
id: Ketika trait `ShapeGeometry` diimplementasikan, fungsi `area` dari trait `ShapeGeometry` dapat dipanggil dengan dua cara:
zh_cn: 当 "ShapeGeometry "trait被实现时，"ShapeGeometry "trait中的函数 "area "可以通过两种方式被调用：

source: And the implementation of the `area` method will be accessed via the `self` parameter.
es: Y se accederá a la implementación del método `area` a través del parámetro `self`.
id: Dan implementasi metode `area` akan diakses melalui parameter `self`.
zh_cn: 之后我们可以通过 `self`参数访问`area`方法的实现。

source: ## Generic Traits
es: ## Traits Genéricos
zh_cn: ## 泛型Traits

source: Usually we want to write a trait when we want multiple types to implement a functionality in a standard way. However, in the example above the signatures are static and cannot be used for multiple types. To do this, we use generic types when defining traits.
es: Por lo general, queremos escribir un trait cuando queremos que múltiples tipos implementen una funcionalidad de una manera estándar. Sin embargo, en el ejemplo anterior, las firmas son estáticas y no se pueden usar para múltiples tipos. Para hacer esto, usamos tipos genéricos al definir traits.
id: Biasanya kita ingin menulis sebuah trait ketika kita ingin banyak tipe mengimplementasikan sebuah fungsionalitas dengan cara standar. Namun, dalam contoh di atas, tanda tangan statis dan tidak dapat digunakan untuk banyak tipe. Untuk melakukannya, kita menggunakan tipe generik saat mendefinisikan trait.
zh_cn: 通常情况下，当我们希望多个类型以标准的方式实现一个功能时，我们要写一个trait。然而，在上面的例子中，签名是静态的，不能用于多种类型。为了做到这一点，我们在定义trait时使用泛型。

source: In the example below, we use generic type `T` and our method signatures can use this alias which can be provided during implementation.
es: En el siguiente ejemplo, usamos el tipo genérico `T` y nuestras firmas de métodos pueden usar este alias que se puede proporcionar durante la implementación.
id: Pada contoh di bawah, kita menggunakan tipe generik `T` dan tanda tangan metode kita dapat menggunakan alias ini yang dapat diberikan selama implementasi.
zh_cn: 在下面的例子中，我们使用泛型`T`，我们的方法签名可以使用由实现提供这个别名。

source: ## Managing and using external trait implementations
es: ## Administrando y usando implementaciones de traits externos
zh_cn: ## 管理和使用外部trait的实现

source: To use traits methods, you need to make sure the correct traits/implementation(s) are imported. In the code above we imported `PrintTrait` from `debug` with `use debug::PrintTrait;` to use the `print()` methods on supported types.
es: Para utilizar los métodos traits, necesitas asegurarte de que se importan los traits/implementaciones correctos. En el código anterior importamos `PrintTrait` de `debug` con `use debug::PrintTrait;` para usar los métodos `print()` en los tipos soportados.
id: Untuk menggunakan metode-metode dari trait, Anda perlu memastikan bahwa trait/implementasi yang benar telah diimpor. Pada kode di atas, kita mengimpor `PrintTrait` dari `debug` dengan `use debug::PrintTrait;` untuk menggunakan metode `print()` pada tipe-tipe yang didukung.
zh_cn: 要使用trait的方法，你需要确保导入了正确的 traits以及它的实现。在上面的代码中，我们从`debug`中导入了`PrintTrait`，并使用`use debug::PrintTrait;`以在支持的类型上使用`print()`方法。

source: In some cases you might need to import not only the trait but also the implementation if they are declared in separate modules. If `CircleGeometry` was in a separate module/file `circle` then to use `boundary` on `circ: Circle`, we'd need to import `CircleGeometry` in addition to `ShapeGeometry`.
es: En algunos casos, puede ser necesario importar no solo el trait, sino también la implementación si están declarados en módulos separados. Si `CircleGeometry` estuviera en un módulo/archivo separado `circle`, entonces para usar `boundary` en `circ: Circle`, necesitaríamos importar `CircleGeometry` además de `ShapeGeometry`.
zh_cn: 在某些情况下，如果它们被声明在不同的模块中，你可能不仅需要导入trait，还需要导入实现。 如果`CircleGeometry`是在一个单独的模块/文件`circle`中，那么要在`circ: Circle`上使用`boundary`，我们就需要在 `ShapeGeometry`之外再导入 `CircleGeometry`。

source: # Testing Cairo Programs
es: # Testing de Programas en Cairo
zh_cn: # 测试Cairo 程序

source: # How To Write Tests
es: # Cómo Escribir Test
zh_cn: # 如何编写测试

source: ## The Anatomy of a Test Function
es: ## La Anatomía de una Función de Testing
zh_cn: ## 测试函数的剖析

source: - Set up any needed data or state. - Run the code you want to test. - Assert the results are what you expect.
es: - Configuran cualquier dato o estado necesario. - Ejecutan el código que se desea probar. - Verifican que los resultados sean los esperados.
zh_cn: - 设置任何需要的数据或状态。 - 运行你想测试的代码。 - 断言结果与你期望的一样。

source: Let’s look at the features Cairo provides specifically for writing tests that take these actions, which include the `test` attribute, the `assert` function, and the `should_panic` attribute.
es: Veamos las características específicas que Cairo proporciona para escribir pruebas que realizan estas acciones, que incluyen el atributo `test`, la función `assert` y el atributo `should_panic`.
id: Mari kita lihat fitur-fitur yang disediakan oleh Cairo khusus untuk menulis pengujian yang melakukan tiga tindakan ini, termasuk atribut `test`, fungsi `assert`, dan atribut `should_panic`.
zh_cn: 让我们看看Cairo专门为编写执行这些动作的测试所提供的功能，其中包括`test`属性、`assert`函数和`should_panic`属性。

source: ### The Anatomy of a Test Function
es: ### La anatomía de una Función Test
zh_cn: ### 一个测试函数的剖析

source: <span class="caption">Listing 9-1: A test module and function</span>
zh_cn: <span class="caption">示例9-1：一个测试模块和其函数</span>
