Repository: cairo-book/cairo-book
Catalog: po/*.po
Languages: es, id, ko, zh_cn

source: The `#[embeddable_as]` attribute is used to mark the impl as embeddable inside a contract. It allows us to specify the name of the impl that will be used in the contract to refer to this component. In this case, the component will be referred to as `Ownable` in contracts embedding it.
id: Atribut `#[embeddable_as]` digunakan untuk menandai impl sebagai yang dapat disematkan di dalam sebuah kontrak. Ini memungkinkan kita untuk menentukan nama impl yang akan digunakan dalam kontrak untuk merujuk ke komponen ini. Dalam kasus ini, komponen ini akan dirujuk sebagai `Ownable` dalam kontrak yang menanamkannya.
ko: `#[embeddable_as]` 속성은 impl을 계약 내에서 임베드 가능하다고 표시하는 데 사용됩니다. 이를 통해 계약에서 이 구성 요소를 참조하기 위해 사용할 impl의 이름을 지정할 수 있습니다. 이 경우, 해당 구성 요소는 이를 임베드하는 계약에서 `Ownable`로 참조될 것입니다.

source: The implementation itself is generic over `ComponentState<TContractState>`, with the added restriction that `TContractState` must implement the `HasComponent<T>` trait. This allows us to use the component in any contract, as long as the contract implements the `HasComponent` trait. Understanding this mechanism in details is not required to use components, but if you're curious about the inner workings, you can read more in the [Components under the hood](./ch99-01-05-01-components-under-the-hood.md) section.
id: Implementasi itu sendiri generik terhadap `ComponentState<TContractState>`, dengan pembatasan tambahan bahwa `TContractState` harus mengimplementasikan trait `HasComponent<T>`. Ini memungkinkan kita untuk menggunakan komponen dalam setiap kontrak, selama kontrak tersebut mengimplementasikan trait `HasComponent`. Memahami mekanisme ini secara detail tidak diperlukan untuk menggunakan komponen, tetapi jika Anda penasaran tentang cara kerjanya, Anda dapat membaca lebih lanjut di bagian [Komponen di Balik Layar](./ch99-01-05-01-components-under-the-hood.md).
ko: 구현 자체는 `ComponentState<TContractState>`에 대해 일반적이며, 추가 제한 사항은 `TContractState`가 `HasComponent<T>` 트레이트를 구현해야 한다는 것입니다. 이를 통해 계약이 `HasComponent` 트레이트를 구현하는 한 어떤 계약에서도 구성 요소를 사용할 수 있습니다. 이 메커니즘을 자세히 이해하는 것은 구성 요소를 사용하는 데 필수적이지는 않지만, 내부 작동에 대해 궁금하다면 [Components under the hood](./ch99-01-05-01-components-under-the-hood.md) 섹션에서 더 읽을 수 있습니다.

source: One of the major differences from a regular smart contract is that access to storage and events is done via the generic `ComponentState<TContractState>` type and not `ContractState`. Note that while the type is different, accessing storage or emitting events is done similarly via `self.storage_var_name.read()` or `self.emit(...).`
id: Salah satu perbedaan utama dari sebuah kontrak pintar reguler adalah bahwa akses ke penyimpanan dan peristiwa dilakukan melalui tipe generik `ComponentState<TContractState>` dan bukan `ContractState`. Perhatikan bahwa meskipun tipe ini berbeda, akses penyimpanan atau pengeluaran peristiwa dilakukan secara serupa melalui `self.storage_var_name.read()` atau `self.emit(...).`
ko: 일반적인 스마트 계약과의 주요 차이점 중 하나는 저장소 및 이벤트에 대한 액세스가 일반적인 `ComponentState<TContractState>` 유형을 통해 이루어지며 `ContractState`가 아닌 것입니다. 유형이 다르더라도 저장소에 액세스하거나 이벤트를 발생시키는 방법은 `self.storage_var_name.read()` 또는 `self.emit(...)`를 통해 유사하게 수행됩니다.

source: Note: To avoid the confusion between the embeddable name and the impl name, we recommend keeping the suffix `Impl` in the impl name.
id: Catatan: Untuk menghindari kebingungan antara nama yang dapat disematkan dan nama impl, kami merekomendasikan untuk tetap menyisipkan akhiran `Impl` dalam nama impl.
ko: 참고: 임베디드 이름과 구현 이름 사이의 혼란을 피하기 위해, 구현 이름에는 접미사 `Impl`을 유지하는 것을 권장합니다.

source: Migrating a Contract to a Component
id: Migrasi Kontrak ke Komponen
ko: 계약을 구성 요소로 이동하기

source: Since both contracts and components share a lot of similarities, it's actually very easy to migrate from a contract to a component. The only changes required are:
id: Karena kedua kontrak dan komponen memiliki banyak kesamaan, sebenarnya sangat mudah untuk bermigrasi dari sebuah kontrak ke sebuah komponen. Satu-satunya perubahan yang diperlukan adalah:
ko: 계약과 구성 요소 모두 많은 유사성을 공유하기 때문에 계약에서 구성 요소로 이주하는 것은 실제로 매우 쉽습니다. 필요한 변경 사항은 다음과 같습니다:

source: Adding the `#[starknet::component]` attribute to the module.
id: Menambahkan atribut `#[starknet::component]` ke modul.
ko: 모듈에 `#[starknet::component]` 속성을 추가합니다.

source: Adding the `#[embeddable_as(name)]` attribute to the `impl` block that will be embedded in another contract.
id: Menambahkan atribut `#[embeddable_as(name)]` ke blok `impl` yang akan disematkan dalam kontrak lain.
ko: 다른 계약에 임베드될 `impl` 블록에 `#[embeddable_as(name)]` 속성을 추가합니다.

source: Adding generic parameters to the `impl` block:
id: Menambahkan parameter generik ke blok `impl`:
ko: `impl` 블록에 일반 매개변수 추가하기:

source: Adding `TContractState` as a generic parameter.
id: Menambahkan `TContractState` sebagai parameter generik.
ko: `TContractState`를 일반 매개변수로 추가합니다.

source: Adding `+HasComponent<TContractState>` as an impl restriction.
id: Menambahkan `+HasComponent<TContractState>` sebagai batasan impl.
ko: `+HasComponent<TContractState>`를 구현 제한으로 추가합니다.

source: Changing the type of the `self` argument in the functions inside the `impl` block to `ComponentState<TContractState>` instead of `ContractState`.
id: Mengubah tipe argumen `self` dalam fungsi-fungsi di dalam blok `impl` menjadi `ComponentState<TContractState>` alih-alih `ContractState`.
ko: `impl` 블록 내부의 함수들의 `self` 인자의 유형을 `ContractState` 대신에 `ComponentState<TContractState>`로 변경합니다.

source: For traits that do not have an explicit definition and are generated using `#[generate_trait]`, the logic is the same - but the trait is generic over `TContractState` instead of `ComponentState<TContractState>`, as demonstrated in the example with the `InternalTrait`.
id: Untuk trait yang tidak memiliki definisi eksplisit dan dihasilkan menggunakan `#[generate_trait]`, logikanya sama - tetapi trait tersebut bersifat generic terhadap `TContractState` alih-alih `ComponentState<TContractState>`, seperti yang ditunjukkan dalam contoh dengan `InternalTrait`.
ko: 명시적 정의가 없는 특성 및 `#[generate_trait]`를 사용하여 생성된 특성의 경우, 로직은 동일하지만 `ComponentState<TContractState>` 대신 `TContractState`에 대해 일반화된 특성입니다. `InternalTrait` 예제에서 보여주었습니다.

source: Using components inside a contract
id: Menggunakan komponen di dalam kontrak
ko: 계약 내부에서 구성 요소를 사용하기

source: The major strength of components is how it allows reusing already built primitives inside your contracts with a restricted amount of boilerplate. To integrate a component into your contract, you need to:
id: Kekuatan utama dari komponen adalah bagaimana ia memungkinkan penggunaan kembali primitif-primitif yang sudah dibangun di dalam kontrak Anda dengan jumlah boilerplate yang terbatas. Untuk mengintegrasikan sebuah komponen ke dalam kontrak Anda, Anda perlu:
ko: 컴포넌트의 주요 강점은 이미 구축된 기본 구성 요소를 제한된 양의 보일러플레이트와 함께 계약 내에서 재사용할 수 있도록 하는 데 있습니다. 컴포넌트를 계약에 통합하려면 다음을 수행해야 합니다:

source: Declare it with the `component!()` macro, specifying
id: Deklarasikan dengan menggunakan macro `component!()`, dengan menentukan
ko: `component!()` 매크로를 사용하여 선언하세요.

source: The path to the component `path::to::component`.
id: Jalur ke komponen `path::to::component`.
ko: 구성 요소 `path::to::component`로의 경로.

source: The name of the variable in your contract's storage referring to this component's storage (e.g. `ownable`).
id: Nama variabel dalam penyimpanan kontrak Anda yang merujuk pada penyimpanan komponen ini (misalnya, `ownable`).
ko: 이 구성 요소의 저장소를 가리키는 계약의 저장소에 대한 변수 이름 (예: `ownable`).

source: The name of the variant in your contract's event enum referring to this component's events (e.g. `OwnableEvent`).
id: Nama varian dalam enumerasi acara kontrak Anda yang merujuk pada acara komponen ini (misalnya, `OwnableEvent`).
ko: 이 구성 요소의 이벤트를 참조하는 계약의 이벤트 열거형에서 변형의 이름 (예: `OwnableEvent`).

source: Add the path to the component's storage and events to the contract's `Storage` and `Event`. They must match the names provided in step 1 (e.g. `ownable: ownable_component::Storage` and `OwnableEvent: ownable_component::Event`).
id: Tambahkan jalur penyimpanan dan acara komponen ke `Storage` dan `Event` kontrak. Mereka harus sesuai dengan nama-nama yang diberikan pada langkah 1 (misalnya, `ownable: ownable_component::Storage` dan `OwnableEvent: ownable_component::Event`).
ko: 컴포넌트의 저장소 및 이벤트 경로를 계약의 `Storage` 및 `Event`에 추가하십시오. 이들은 단계 1에서 제공된 이름과 일치해야 합니다 (예: `ownable: ownable_component::Storage` 및 `OwnableEvent: ownable_component::Event`).

source: The storage variable **MUST** be annotated with the `#[substorage(v0)]` attribute.
id: Variabel penyimpanan **HARUS** diberi anotasi dengan atribut `#[substorage(v0)]`.
ko: 저장 변수는 `#[substorage(v0)]` 어트리뷰트로 주석 처리되어야 **합니다**.

source: Embed the component's logic defined inside your contract, by instantiating the component's generic impl with a concrete `ContractState` using an impl alias. This alias must be annotated with `#[abi(embed_v0)]` to externally expose the component's functions.
id: Sematkan logika komponen yang didefinisikan di dalam kontrak Anda, dengan menginstansiasi impl generic komponen dengan `ContractState` konkret menggunakan alias impl. Alias ini harus dianotasi dengan `#[abi(embed_v0)]` untuk mengekspos secara eksternal fungsi-fungsi komponen.
ko: 계약 내에서 구성 요소의 로직을 정의하고, 구성 요소의 일반적인 구현을 구체적인 `ContractState`를 사용하여 인스턴스화하여 내장합니다. 이 별칭은 구성 요소의 함수를 외부에 노출하기 위해 `#[abi(embed_v0)]`로 주석 처리되어야 합니다.

source: As you can see, the InternalImpl is not marked with `#[abi(embed_v0)]`. Indeed, we don't want to expose externally the functions defined in this impl. However, we might still want to access them internally.
id: Seperti yang dapat Anda lihat, InternalImpl tidak ditandai dengan `#[abi(embed_v0)]`. Memang, kita tidak ingin mengekspos secara eksternal fungsi-fungsi yang didefinisikan dalam impl ini. Namun, kita mungkin masih ingin mengaksesnya secara internal.
ko: 보시다시피, InternalImpl은 `#[abi(embed_v0)]`로 표시되어 있지 않습니다. 실제로, 이 impl에 정의된 함수들을 외부에 노출하고 싶지 않습니다. 그러나 내부적으로는 여전히 이에 접근하고 싶을 수도 있습니다.

source: For example, to embed the `Ownable` component defined above, we would do the following:
id: Sebagai contoh, untuk menyematkan komponen `Ownable` yang didefinisikan di atas, kita akan melakukan hal berikut:
ko: 예를 들어, 위에서 정의한 `Ownable` 구성 요소를 포함시키려면 다음을 수행해야 합니다.

source: The component's logic is now seamlessly part of the contract! We can interact with the components functions externally by calling them using the `IOwnableDispatcher` instantiated with the contract's address.
id: Logika komponen sekarang secara mulus menjadi bagian dari kontrak! Kami dapat berinteraksi dengan fungsi-fungsi komponen secara eksternal dengan memanggilnya menggunakan `IOwnableDispatcher` yang diinstansiasi dengan alamat kontrak.
ko: 구성 요소의 논리는 이제 계약의 일부로 완벽하게 통합되었습니다! 우리는 `IOwnableDispatcher`를 사용하여 계약 주소로 인스턴스화하여 외부에서 구성 요소 함수와 상호 작용할 수 있습니다.

source: Stacking Components for Maximum Composability
id: Menumpuk Komponen untuk Komposabilitas Maksimum
ko: 최대 구성 가능성을 위한 구성 요소 쌓기

source: The composability of components really shines when combining multiple of them together. Each adds its features onto the contract. You will be able to rely on [Openzeppelin's](https://github.com/OpenZeppelin/cairo-contracts) future implementation of components to quickly plug-in all the common functionalities you need a contract to have.
id: Kemampuan komposabilitas dari komponen benar-benar bersinar ketika menggabungkan beberapa di antaranya bersama-sama. Setiap komponen menambahkan fiturnya ke kontrak. Anda akan dapat mengandalkan implementasi komponen [OpenZeppelin's](https://github.com/OpenZeppelin/cairo-contracts) di masa mendatang untuk dengan cepat menyematkan semua fungsionalitas umum yang Anda perlukan pada kontrak.
ko: 구성 요소의 조합성은 여러 개를 함께 결합할 때 정말 빛을 발합니다. 각각이 계약에 기능을 추가합니다. [Openzeppelin](https://github.com/OpenZeppelin/cairo-contracts)의 미래 구성 요소 구현을 신뢰하고, 계약이 가져야 하는 모든 공통 기능을 빠르게 플러그인할 수 있습니다.

source: Developers can focus on their core contract logic while relying on battle-tested and audited components for everything else.
id: Pengembang dapat fokus pada logika inti kontrak mereka sambil mengandalkan komponen yang telah diuji pertempuran dan diaudit untuk segala hal lainnya.
ko: 개발자들은 핵심 계약 논리에 집중할 수 있으면서 다른 모든 것에 대해 검증된 구성 요소에 의존할 수 있습니다.

source: Components can even [depend](./ch99-01-05-02-component-dependencies.md) on other components by restricting the `TContractstate` they're generic on to implement the trait of another component. Before we dive into this mechanism, let's first look at [how components work under the hood](./ch99-01-05-01-components-under-the-hood).
id: Komponen bahkan dapat [menggantungkan diri](./ch99-01-05-02-component-dependencies.md) pada komponen lain dengan membatasi `TContractstate` yang mereka generic pada untuk mengimplementasikan trait dari komponen lain. Sebelum kita mendalami mekanisme ini, mari kita lihat terlebih dahulu [bagaimana komponen bekerja di balik layar](./ch99-01-05-01-components-under-the-hood).
ko: 구성 요소는 다른 구성 요소에 의존할 수도 있습니다. 이는 제네릭한 `TContractstate`가 다른 구성 요소의 특성을 구현하도록 제한함으로써 이루어집니다. 이 메커니즘에 대해 자세히 알아보기 전에, 먼저 [구성 요소가 어떻게 작동하는지 살펴보겠습니다](./ch99-01-05-01-components-under-the-hood).

source: Troubleshooting
ko: 문제 해결

source: You might encounter some errors when trying to implement components. Unfortunately, some of them lack meaningful error messages to help debug. This section aims to provide you with some pointers to help you debug your code.
id: Anda mungkin mengalami beberapa kesalahan saat mencoba mengimplementasikan komponen. Sayangnya, beberapa di antaranya tidak memiliki pesan kesalahan yang bermakna untuk membantu debug. Bagian ini bertujuan untuk memberikan beberapa petunjuk untuk membantu Anda debug kode Anda.
ko: 구성 요소를 구현하려고 할 때 오류가 발생할 수 있습니다. 불행하게도 그 중 일부는 디버깅을 돕는 의미 있는 오류 메시지가 부족합니다. 이 섹션은 코드 디버깅을 돕기 위한 몇 가지 지침을 제공하는 것을 목표로 합니다.

source: `Trait not found. Not a trait.`
ko: `특성을 찾을 수 없습니다. 특성이 아닙니다.`

source: This error can occur when you're not importing the component's impl block correctly in your contract. Make sure to respect the following syntax:
id: Kesalahan ini dapat terjadi ketika Anda tidak mengimpor blok impl komponen dengan benar dalam kontrak Anda. Pastikan untuk mengikuti sintaks berikut:
ko: 이 오류는 컨트랙트에서 구성 요소의 구현 블록을 올바르게 가져오지 않을 때 발생할 수 있습니다. 다음 구문을 준수하는지 확인하십시오:

source: Referring to our previous example, this would be:
id: Mengacu pada contoh sebelumnya kita, ini akan menjadi:
ko: 이전 예시를 참조하면, 이것은 다음과 같을 것입니다:

source: `Plugin diagnostic: name is not a substorage member in the contract's Storage. Consider adding to Storage: (...)`
id: `Plugin diagnostic: nama bukanlah anggota substorage dalam penyimpanan Storage kontrak. Pertimbangkan untuk menambahkannya ke dalam Storage: (...)`
ko: 플러그인 진단: 이름은 계약의 저장소의 하위 저장소 멤버가 아닙니다. 저장소에 추가하는 것을 고려해보세요: (...)

source: The compiler helps you a lot debugging this by giving you recommendation on the action to take. Basically, you forgot to add the component's storage to your contract's storage. Make sure to add the path to the component's storage annotated with the `#[substorage(v0)]` attribute to your contract's storage.
id: Kompilator membantu Anda banyak dalam debug ini dengan memberikan rekomendasi tentang tindakan yang harus diambil. Pada dasarnya, Anda lupa menambahkan penyimpanan komponen ke penyimpanan kontrak Anda. Pastikan untuk menambahkan jalur penyimpanan komponen yang dianotasi dengan atribut `#[substorage(v0)]` ke penyimpanan kontrak Anda.
ko: 컴파일러는 귀하가 하는 작업에 대한 권장 사항을 제공하여 이를 디버깅하는 데 많은 도움을 줍니다. 기본적으로 컨트랙트의 저장소에 구성 요소의 저장소를 추가하는 것을 잊었습니다. 컨트랙트의 저장소에 `#[substorage(v0)]` 속성으로 주석이 달린 구성 요소의 저장소 경로를 추가해야 합니다.

source: `Plugin diagnostic: name is not a nested event in the contract's Event enum. Consider adding to the Event enum:`
id: `Plugin diagnostic: nama bukanlah acara bersarang dalam enumerasi Event kontrak. Pertimbangkan untuk menambahkannya ke dalam enumerasi Event:`
ko: 플러그인 진단: 이름은 계약의 이벤트 열거형에 중첩된 이벤트가 아닙니다. 이벤트 열거형에 추가하는 것을 고려해보세요:

source: Similar to the previous error, the compiler, you forgot to add the component's events to your contract's events. Make sure to add the path to the component's events to your contract's events.
id: Seperti kesalahan sebelumnya, kompilator menyatakan bahwa Anda lupa menambahkan acara-acara komponen ke acara-acara kontrak Anda. Pastikan untuk menambahkan jalur acara-acara komponen ke acara-acara kontrak Anda.
ko: 이전 오류와 유사하게, 컴파일러에서 컴포넌트의 이벤트를 계약의 이벤트에 추가하는 것을 잊었습니다. 컴포넌트의 이벤트 경로를 계약의 이벤트에 추가해야 합니다.

source: Components functions are not accessible externally
id: Fungsi-fungsi komponen tidak dapat diakses secara eksternal
ko: 구성 요소 기능은 외부에서 접근할 수 없습니다.

source: This can happen if you forgot to annotate the component's impl block with `#[abi(embed_v0)]`. Make sure to add this annotation when embedding the component's impl in your contract.
id: Ini dapat terjadi jika Anda lupa memberi anotasi blok impl komponen dengan `#[abi(embed_v0)]`. Pastikan untuk menambahkan anotasi ini saat menyematkan blok impl komponen ke dalam kontrak Anda.
ko: 이는 구성 요소의 impl 블록에 `#[abi(embed_v0)]` 주석을 잊어버렸을 때 발생할 수 있습니다. 계약에 구성 요소의 impl을 포함할 때 이 주석을 추가해야 합니다.

source: Components under the hood
id: Komponen di Balik Layar
ko: 후드 아래 구성 요소

source: Components provide powerful modularity to Starknet contracts. But how does this magic actually happen behind the scenes?
id: Komponen memberikan modularitas yang kuat untuk kontrak Starknet. Tetapi bagaimana sebenarnya keajaiban ini terjadi di balik layar?
ko: 구성 요소는 Starknet 계약에 강력한 모듈성을 제공합니다. 그러나 실제로 이 마법은 어떻게 이루어지는 걸까요?

source: This chapter will dive deep into the compiler internals to explain the mechanisms that enable component composability.
id: Bab ini akan menyelami ke dalam internal kompilator untuk menjelaskan mekanisme yang memungkinkan komposabilitas komponen.
ko: 이 장에서는 컴파일러 내부로 깊이 파고들어 구성 요소 조합이 가능하게 하는 메커니즘을 설명할 것입니다.

source: A Primer on Embeddable Impls
id: Pengantar Mengenai Implementasi yang Dapat Disematkan
ko: 임베디 블 수행에 대한 기본 안내서

source: Before digging into components, we need to understand _embeddable impls_.
id: Sebelum menggali ke dalam komponen, kita perlu memahami _implementasi yang dapat disematkan_ (embeddable impls).
ko: 구성 요소를 파헤치기 전에 _embeddable impls_ 를 이해해야 합니다.
zh_cn: 在深入研究组件之前，我们需要了解 _embeddable impls_ 。

source: An impl of a Starknet interface trait (marked with `#[starknet::interface]`) can be made embeddable. Embeddable impls can be injected into any contract, adding new entry points and modifying the ABI of the contract.
id: Implementasi dari trait antarmuka Starknet (ditandai dengan `#[starknet::interface]`) dapat dibuat embeddable. Implementasi yang dapat disematkan ini dapat disisipkan ke dalam kontrak apa pun, menambahkan titik masuk baru dan memodifikasi ABI dari kontrak tersebut.
ko: `#[starknet::interface]`로 표시된 Starknet 인터페이스 트레이트의 구현체는 임베드 가능합니다. 임베드 가능한 구현체는 어떤 계약에도 주입될 수 있으며, 새로운 진입점을 추가하고 계약의 ABI를 수정할 수 있습니다.

source: Let's look at an example to see this in action:
id: Mari lihat contoh untuk melihat ini dalam aksi:
ko: 이를 실제로 확인하기 위해 예시를 살펴봅시다.
zh_cn: 让我们看一个示例来看看这个实际运作的过程：

source: By embedding `SimpleImpl`, we externally expose `ret4` in the contract's ABI.
id: Dengan menyematkan `SimpleImpl`, kita secara eksternal mengungkapkan `ret4` dalam ABI kontrak.
ko: `SimpleImpl`를 임베드하여 contract의 ABI에서 `ret4`를 외부로 노출합니다.
zh_cn: 通过嵌入 `SimpleImpl`，我们在合约的 ABI 中向外部公开 `ret4` 。

source: Now that we’re more familiar with the embedding mechanism, we can now see how components build on this.
id: Sekarang setelah kita lebih familiar dengan mekanisme penyematan, kita dapat melihat bagaimana komponen membangun dari ini.
ko: 이제 임베딩 메커니즘에 더 익숙해졌으니, 이제 구성 요소가 이를 기반으로 어떻게 구축되는지 볼 수 있습니다.

source: Inside Components: Generic Impls
id: Di Dalam Komponen: Implementasi Generik
ko: 내부 구성 요소: 일반 구현체

source: Recall the impl block syntax used in components:
id: Ingatlah sintaks blok impl yang digunakan dalam komponen:
ko: 구성 요소에서 사용된 impl 블록 구문을 상기하십시오.
zh_cn: 回想一下组件中使用的 impl 块的语法：

source: The key points:
id: Key points:
ko: 주요 요점:
zh_cn: 关键点：

source: `OwnableImpl` requires the implementation of the `HasComponent<TContractState>` trait by the underlying contract, which is automatically generated with the `component!()` macro when using a component inside a contract.
id: `OwnableImpl` memerlukan implementasi dari trait `HasComponent<TContractState>` oleh kontrak yang mendasarinya, yang secara otomatis dihasilkan dengan makro `component!()` ketika menggunakan komponen di dalam kontrak.
ko: `OwnableImpl`는 기본 계약에 의해 `HasComponent<TContractState>` 특성의 구현을 요구하며, 계약 내에서 구성 요소를 사용할 때 `component!()` 매크로로 자동으로 생성됩니다.

source: The compiler will generate an impl that wraps any function in `OwnableImpl`, replacing the `self: ComponentState<TContractState>` argument with `self: TContractState`, where access to the component state is made via the `get_component` function in the `HasComponent<TContractState>` trait.
id: Kompiler akan menghasilkan impl yang membungkus setiap fungsi dalam `OwnableImpl`, menggantikan argumen `self: ComponentState<TContractState>` dengan `self: TContractState`, di mana akses ke status komponen dilakukan melalui fungsi `get_component` dalam trait `HasComponent<TContractState>`.
ko: 컴파일러는 `OwnableImpl`에 있는 모든 함수를 래핑하는 impl을 생성합니다. 이때 `self: ComponentState<TContractState>` 인자를 `self: TContractState`로 대체하며, 컴포넌트 상태에 접근은 `HasComponent<TContractState>` 트레이트의 `get_component` 함수를 통해 이루어집니다.

source: For each component, the compiler generates a `HasComponent` trait. This trait defines the interface to bridge between the actual `TContractState` of a generic contract, and `ComponentState<TContractState>`.
id: Untuk setiap komponen, kompiler menghasilkan trait `HasComponent`. Trait ini mendefinisikan antarmuka untuk menjembatani antara `TContractState` aktual dari kontrak generik dan `ComponentState<TContractState>`.
ko: 각 구성 요소에 대해 컴파일러는 `HasComponent` 트레이트를 생성합니다. 이 트레이트는 일반 계약의 실제 `TContractState`와 `ComponentState<TContractState>` 사이의 인터페이스를 정의합니다.

source: // generated per component
ko: // 구성 요소별로 생성됨

source: In our context `ComponentState<TContractState>` is a type specific to the ownable component, i.e. it has members based on the storage variables defined in `ownable_component::Storage`. Moving from the generic `TContractState` to `ComponentState<TContractState>` will allow us to embed `Ownable` in any contract that wants to use it. The opposite direction (`ComponentState<TContractState>` to `ContractState`) is useful for dependencies (see the `Upgradeable` component depending on an `IOwnable` implementation example in the [Components dependencies ](./ch99-01-05-02-component-dependencies.md) section.
id: Dalam konteks kita, `ComponentState<TContractState>` adalah tipe yang spesifik untuk komponen ownable, yaitu memiliki anggota berdasarkan variabel penyimpanan yang didefinisikan dalam `ownable_component::Storage`. Berpindah dari generic `TContractState` ke `ComponentState<TContractState>` akan memungkinkan kita menyematkan `Ownable` dalam setiap kontrak yang ingin menggunakannya. Arah sebaliknya (`ComponentState<TContractState>` ke `ContractState`) berguna untuk dependensi (lihat contoh implementasi `IOwnable` oleh komponen `Upgradeable` pada bagian [Komponen Dependensi](./ch99-01-05-02-component-dependencies.md)).
ko: 우리 맥락에서 `ComponentState<TContractState>`는 소유 가능한 컴포넌트에 특화된 유형입니다. 즉, `ownable_component::Storage`에서 정의된 저장 변수를 기반으로 하는 멤버를 가지고 있습니다. 일반적인 `TContractState`에서 `ComponentState<TContractState>`로 이동함으로써 우리는 `Ownable`을 사용하려는 모든 계약에 포함시킬 수 있게 될 것입니다. 반대 방향인 (`ComponentState<TContractState>`에서 `ContractState`로) 이는 의존성에 유용합니다 ([Components dependencies](./ch99-01-05-02-component-dependencies.md) 섹션의 `IOwnable` 구현 예제에 의존하는 `Upgradeable` 컴포넌트를 참조).
