Repository: cairo-book/cairo-book
Catalog: po/*.po
Languages: es, id, ko, zh_cn

source: You can only remove elements from the front of an array by using the `pop_front()` method. This method returns an `Option` containing the removed element, or `Option::None` if the array is empty.
id: Anda hanya dapat menghapus elemen dari depan array dengan menggunakan metode `pop_front()`. Metode ini mengembalikan `Option` yang berisi elemen yang dihapus, atau `Option::None` jika array kosong.

source: A `key` field that identifies the value for this key-value pair of the dictionary.
id: Bidang `key` yang mengidentifikasi nilai untuk pasangan kunci-nilai (key-value pair) dalam kamus ini.

source: Create the new entry to add using the `entry` method
id: Membuat entri baru yang akan ditambahkan menggunakan metode `entry`

source: `users_amount`, the number of users currently inserted and
id: `users_amount`, jumlah pengguna yang saat ini telah dimasukkan dan

source: `add_user` to insert users in the database.
id: `add_user` untuk memasukkan pengguna ke dalam basis data.

source: Fortunately, Cairo provides a handy built-in [dictionary type](./ch03-02-dictionaries.md) called `Felt252Dict<T>` that allows us to simulate the behavior of mutable data structures. Let's first explore how to use it to create a dynamic array implementation.
id: Untungnya, Cairo menyediakan tipe [kamus](./ch03-02-dictionaries.md) bawaan yang praktis disebut `Felt252Dict<T>` yang memungkinkan kita mensimulasikan perilaku struktur data yang dapat diubah. Mari pertama-tama jelajahi cara menggunakannya untuk membuat implementasi array dinamis.

source: Note: Several concepts used in this chapter are presented in later parts of the book. We recommend you to check out the following chapter first: [Structs](ch05-00-using-structs-to-structure-related-data), [Methods](./ch05-03-method-syntax.md), [Generic types](./ch08-00-generic-types-and-traits.md), [Traits](./ch08-02-traits-in-cairo.md)
id: Catatan: Beberapa konsep yang digunakan dalam bab ini disajikan dalam bagian-bagian berikutnya dari buku ini. Kami menyarankan Anda untuk mengecek bab-bab berikut terlebih dahulu: [Structs](ch05-00-using-structs-to-structure-related-data), [Methods](./ch05-03-method-syntax.md), [Generic types](./ch08-00-generic-types-and-traits.md), [Traits](./ch08-02-traits-in-cairo.md)

source: Allow us to append items at the end
id: Memungkinkan kita untuk menambahkan item di bagian akhir

source: Let us access any item by index
id: Memungkinkan kita mengakses item apa pun berdasarkan indeks

source: Allow setting the value of an item at a specific index
id: Memungkinkan penyetelan nilai item pada indeks tertentu

source: Return the current length
id: Mengembalikan panjang saat ini

source: This provides a blueprint for the implementation of our dynamic array. We named it Vec as it is similar to the `Vec<T>` data structure in Rust.
id: Ini memberikan gambaran untuk implementasi array dinamis kita. Kami menamainya Vec karena mirip dengan struktur data `Vec<T>` dalam Rust.

source: Push an item to the top of the stack
id: Mendorong sebuah item ke bagian atas stack

source: Pop an item from the top of the stack
id: Mengeluarkan sebuah item dari bagian atas stack

source: The code uses the `insert` and `get` methods to access the values in the `Felt252Dict<T>`. To push an element at the top of the stack, the `push` function inserts the element in the dict at index `len` - and increases the `len` field of the stack to keep track of the position of the stack top. To remove a value, the `pop` function retrieves the last value at position `len-1` and then decreases the value of `len` to update the position of the stack top accordingly.
id: Kode menggunakan metode `insert` dan `get` untuk mengakses nilai-nilai dalam `Felt252Dict<T>`. Untuk menambahkan elemen di bagian atas tumpukan, fungsi `push` menyisipkan elemen ke dalam dict pada indeks `len` - dan meningkatkan bidang `len` dari tumpukan untuk melacak posisi puncak tumpukan. Untuk menghapus sebuah nilai, fungsi `pop` mengambil nilai terakhir pada posisi `len-1` dan kemudian mengurangi nilai dari `len` untuk memperbarui posisi puncak tumpukan sesuai dengan yang diperlukan.

source: While Cairo's memory model is immutable and can make it difficult to implement mutable data structures, we can fortunately use the `Felt252Dict<T>` type to simulate mutable data structures. This allows us to implement a wide range of data structures that are useful for many applications, effectively hiding the complexity of the underlying memory model.
id: Meskipun model memori Cairo bersifat tak dapat diubah (immutable) dan dapat menyulitkan implementasi struktur data yang dapat diubah, untungnya kita dapat menggunakan tipe `Felt252Dict<T>` untuk mensimulasikan struktur data yang dapat diubah. Hal ini memungkinkan kita untuk mengimplementasikan beragam struktur data yang berguna untuk banyak aplikasi, efektif menyembunyikan kompleksitas dari model memori yang mendasarinya.

source: What Is Ownership?
id: Apa itu Ownership?

source: Cairo implements an ownership system to ensure the safety and correctness of its compiled code. The ownership mechanism complements the linear type system, which enforces that objects are used exactly once. This helps prevent common operations that can produce runtime errors, such as illegal memory address references or multiple writes to the same memory address, and ensures the soundness of Cairo programs by checking at compile time that all the dictionaries are squashed.
id: Cairo menerapkan sistem kepemilikan untuk memastikan keamanan dan kebenaran dari kode yang dikompilasi. Mekanisme kepemilikan melengkapi sistem tipe linear, yang menegaskan bahwa objek digunakan tepat satu kali. Hal ini membantu mencegah operasi umum yang dapat menghasilkan kesalahan saat runtime, seperti referensi alamat memori ilegal atau penulisan ganda ke alamat memori yang sama, dan memastikan kesahihan program Cairo dengan memeriksa pada waktu kompilasi bahwa semua kamus telah di-"squash".

source: Now that we’re past basic Cairo syntax, we won’t include all the `fn main() {` code in examples, so if you’re following along, make sure to put the following examples inside a `main` function manually. As a result, our examples will be a bit more concise, letting us focus on the actual details rather than boilerplate code.
id: Sekarang setelah kita melewati sintaks dasar Cairo, kita tidak akan menyertakan semua kode `fn main() {` dalam contoh, jadi jika Anda mengikuti, pastikan untuk menempatkan contoh-contoh berikut di dalam fungsi `main` secara manual. Sebagai hasilnya, contoh-contoh kita akan sedikit lebih ringkas, memungkinkan kita untuk fokus pada detail sebenarnya daripada kode boilerplate.

source: Ownership Rules
id: Peraturan Ownership

source: First, let’s take a look at the ownership rules. Keep these rules in mind as we work through the examples that illustrate them:
id: Pertama, mari kita lihat aturan-aturan kepemilikan. Ingatlah aturan-aturan ini saat kita bekerja melalui contoh-contoh yang mengilustrasikan mereka:

source: Each value in Cairo has an _owner_.
id: Setiap nilai dalam Cairo memiliki _pemilik_.

source: When the owner goes out of scope, the value will be _dropped_.
id: Ketika pemilik keluar dari lingkup, nilai akan _dihapus_ (dropped).

source: As a first example of ownership, we’ll look at the _scope_ of some variables. A scope is the range within a program for which an item is valid. Take the following variable:
id: Sebagai contoh pertama tentang kepemilikan, kita akan melihat _lingkup_ (scope) dari beberapa variabel. Lingkup adalah rentang dalam program di mana suatu item valid. Ambil variabel berikut:

source: The variable `s` refers to a short string, where the value of the string is hardcoded into the text of our program. The variable is valid from the point at which it’s declared until the end of the current _scope_. Listing 4-1 shows a program with comments annotating where the variable `s` would be valid.
id: Variabel `s` mengacu pada sebuah string pendek, di mana nilai dari string tersebut telah dimasukkan secara langsung ke dalam teks program kita. Variabel ini valid mulai dari titik di mana ia dideklarasikan hingga akhir _lingkup_ (scope) saat ini. Listing 4-1 menampilkan sebuah program dengan komentar yang menandai di mana variabel `s` akan valid.

source: Ownership with the `Array` Type
id: Kepemilikan dengan Tipe `Array`

source: To illustrate the rules of ownership, we need a data type that is more complex. The types covered in the [Data Types](ch02-02-data-types.html#data-types)
id: Untuk mengilustrasikan aturan-aturan kepemilikan, kita memerlukan tipe data yang lebih kompleks. Tipe-tipe yang dibahas dalam [Tipe Data](ch02-02-data-types.html#data-types)

source: section of Chapter 2 are of a known size, can be quickly and trivially copied to make a new, independent instance if another part of code needs to use the same value in a different scope, and can easily be dropped when they're no longer used. But what is the behavior with the `Array` type whose size is unknown at compile time and which can't be trivially copied?
id: bagaimana perilaku dengan tipe `Array` yang ukurannya tidak diketahui pada saat kompilasi dan tidak dapat dengan mudah disalin? Tipe data ini tidak dapat secara sederhana disalin untuk membuat instansi baru yang independen jika bagian lain dari kode memerlukan penggunaan nilai yang sama dalam lingkup yang berbeda, dan tidak dapat dengan mudah dihapus saat tidak lagi digunakan?

source: So, how does the ownership system ensure that each cell is never written to more than once? Consider the following code, where we try to pass the same instance of an array in two consecutive function calls:
id: Jadi, bagaimana sistem kepemilikan memastikan bahwa setiap sel tidak pernah ditulis lebih dari satu kali? Pertimbangkan kode berikut, di mana kita mencoba untuk melewati instansi yang sama dari sebuah array dalam dua pemanggilan fungsi yang berurutan:

source: In this case, we try to pass the same array instance `arr` by value to the functions `foo` and `bar`, which means that the parameter used in both function calls is the same instance of the array. If you append a value to the array in `foo`, and then try to append another value to the same array in `bar`, what would happen is that you would attempt to try to write to the same memory cell twice, which is not allowed in Cairo. To prevent this, the ownership of the `arr` variable moves from the `main` function to the `foo` function. When trying to call `bar` with `arr` as a parameter, the ownership of `arr` was already moved to the first call. The ownership system thus prevents us from using the same instance of `arr` in `foo`.
id: Dalam kasus ini, kita mencoba melewati instansi array yang sama `arr` secara nilai ke fungsi-fungsi `foo` dan `bar`, yang berarti bahwa parameter yang digunakan dalam kedua pemanggilan fungsi adalah instansi yang sama dari array. Jika Anda menambahkan sebuah nilai ke array di `foo`, dan kemudian mencoba menambahkan nilai lain ke array yang sama di `bar`, yang akan terjadi adalah upaya untuk menulis ke sel memori yang sama dua kali, yang tidak diperbolehkan dalam Cairo. Untuk mencegah hal ini, kepemilikan variabel `arr` berpindah dari fungsi `main` ke fungsi `foo`. Ketika mencoba memanggil `bar` dengan `arr` sebagai parameter, kepemilikan dari `arr` sudah dipindahkan ke panggilan pertama. Sistem kepemilikan dengan demikian mencegah kita dari menggunakan instansi yang sama dari `arr` di `foo`.

source: The `Copy` Trait
id: Trait `Copy`

source: If a type implements the `Copy` trait, passing it to a function will not move the ownership of the value to the function called, but will instead pass a copy of the value. You can implement the `Copy` trait on your type by adding the `#[derive(Copy)]` annotation to your type definition. However, Cairo won't allow a type to be annotated with Copy if the type itself or any of its components don't implement the Copy trait. While Arrays and Dictionaries can't be copied, custom types that don't contain either of them can be.
id: Jika sebuah tipe mengimplementasikan trait `Copy`, melewatinya ke fungsi tidak akan memindahkan kepemilikan dari nilai ke fungsi yang dipanggil, namun akan melewatkan salinan dari nilai tersebut. Anda dapat mengimplementasikan trait `Copy` pada tipe Anda dengan menambahkan anotasi `#[derive(Copy)]` pada definisi tipe Anda. Namun, Cairo tidak akan mengizinkan suatu tipe untuk dianotasi dengan `Copy` jika tipe itu sendiri atau salah satu komponennya tidak mengimplementasikan trait `Copy`. Meskipun Array dan Dictionary tidak dapat disalin, tipe kustom yang tidak mengandung keduanya dapat.

source: In this example, we can pass `p1` twice to the foo function because the `Point` type implements the `Copy` trait. This means that when we pass `p1` to `foo`, we are actually passing a copy of `p1`, and the ownership of `p1` remains with the main function. If you remove the `Copy` trait derivation from the `Point` type, you will get a compile-time error when trying to compile the code.
id: Dalam contoh ini, kita dapat melewati `p1` dua kali ke fungsi foo karena tipe `Point` mengimplementasikan trait `Copy`. Ini berarti bahwa ketika kita melewati `p1` ke `foo`, sebenarnya kita melewati salinan dari `p1`, dan kepemilikan dari `p1` tetap berada di dalam fungsi `main`. Jika Anda menghapus derivasi trait `Copy` dari tipe `Point`, Anda akan mendapatkan kesalahan pada waktu kompilasi saat mencoba mengompilasi kode.

source: The `Drop` Trait
id: `Drop` Trait

source: You may have noticed that the `Point` type in the previous example also implements the `Drop` trait. In Cairo, a value cannot go out of scope unless it has been previously moved. For example, the following code will not compile, because the struct `A` is not moved before it goes out of scope:
id: Anda mungkin telah memperhatikan bahwa tipe `Point` pada contoh sebelumnya juga mengimplementasikan trait `Drop`. Dalam Cairo, sebuah nilai tidak dapat keluar dari lingkup kecuali sudah dipindahkan sebelumnya. Sebagai contoh, kode berikut tidak akan bisa dikompilasi, karena struktur `A` tidak dipindahkan sebelum keluar dari lingkup:

source: This is to ensure the soundness of Cairo programs. Soundness refers to the fact that if a statement during the execution of the program is false, no cheating prover can convince an honest verifier that it is true. In our case, we want to ensure the consistency of consecutive dictionary key updates during program execution, which is only checked when the dictionaries are `squashed` - which moves the ownership of the dictionary to the `squash` method, thus allowing the dictionary to go out of scope. Unsquashed dictionaries are dangerous, as a malicious prover could prove the correctness of inconsistent updates.
id: Hal ini untuk memastikan kesahihan program-program Cairo. Kesahihan mengacu pada fakta bahwa jika suatu pernyataan selama eksekusi program adalah salah, tidak ada pemeriksa yang jujur dapat diyakinkan oleh pemeriksa yang tidak jujur bahwa itu benar. Dalam kasus kami, kami ingin memastikan konsistensi dari pembaruan kunci kamus berturut-turut selama eksekusi program, yang hanya diperiksa ketika kamus tersebut 'dipersiapkan' (squashed) - yang memindahkan kepemilikan kamus ke metode `squash`, sehingga memungkinkan kamus tersebut keluar dari lingkup. Kamus yang tidak disiapkan (unsquashed) berbahaya, karena pemeriksa yang jahat dapat membuktikan kebenaran dari pembaruan yang tidak konsisten.

source: However, types that implement the `Drop` trait are allowed to go out of scope without being explicitly moved. When a value of a type that implements the `Drop` trait goes out of scope, the `Drop` implementation is called on the type, which moves the value to the `drop` function, allowing it to go out of scope - This is what we call "dropping" a value. It is important to note that the implementation of drop is a "no-op", meaning that it doesn't perform any actions other than allowing the value to go out of scope.
id: Namun, tipe-tipe yang mengimplementasikan trait `Drop` diizinkan untuk keluar dari lingkup tanpa dipindahkan secara eksplisit. Ketika nilai dari suatu tipe yang mengimplementasikan trait `Drop` keluar dari lingkup, implementasi `Drop` dipanggil pada tipe tersebut, yang memindahkan nilai ke fungsi `drop`, memungkinkannya untuk keluar dari lingkup - Ini yang kita sebut sebagai "menghapus" (dropping) sebuah nilai. Penting untuk dicatat bahwa implementasi drop adalah "no-op", yang berarti bahwa itu tidak melakukan tindakan apa pun selain memungkinkan nilai untuk keluar dari lingkup.

source: The `Drop` implementation can be derived for all types, allowing them to be dropped when going out of scope, except for dictionaries (`Felt252Dict`) and types containing dictionaries. For example, the following code compiles:
id: Implementasi `Drop` dapat diperoleh untuk semua tipe, memungkinkan mereka untuk di-drop saat keluar dari lingkup, kecuali untuk kamus (`Felt252Dict`) dan tipe yang mengandung kamus. Sebagai contoh, kode berikut dapat dikompilasi:

source: The `Destruct` Trait
id: `Destruct` Trait

source: If we _do_ want to deeply copy the data of an `Array`, we can use a common method called `clone`. We’ll discuss method syntax in Chapter 6, but because methods are a common feature in many programming languages, you’ve probably seen them before.
id: Jika kita _ingin_ menyalin data secara mendalam dari sebuah `Array`, kita dapat menggunakan metode umum yang disebut `clone`. Kami akan membahas sintaks metode dalam Bab 6, tetapi karena metode adalah fitur umum dalam banyak bahasa pemrograman, Anda mungkin sudah pernah melihatnya sebelumnya.

source: Note: in the following example, we need to import the `Clone` trait from the corelib `clone` module, and its implementation for the array type from the `array` module.
id: Catatan: pada contoh berikut, kita perlu mengimpor trait `Clone` dari modul `clone` dalam corelib, dan implementasinya untuk tipe array dari modul `array`.

source: Note: you will need to run `scarb cairo-run` with the `--available-gas=2000000` option to run this example, because it uses a loop and must be ran with a gas limit.
id: Catatan: Anda perlu menjalankan `scarb cairo-run` dengan opsi `--available-gas=2000000` untuk menjalankan contoh ini, karena menggunakan sebuah loop dan harus dijalankan dengan batasan gas.

source: When you see a call to `clone`, you know that some arbitrary code is being executed and that code may be expensive. It’s a visual indicator that something different is going on.
id: Ketika Anda melihat panggilan ke `clone`, Anda tahu bahwa beberapa kode sembarang sedang dieksekusi dan kode tersebut mungkin memakan biaya yang mahal. Itu adalah penanda visual bahwa ada sesuatu yang berbeda sedang terjadi.

source: Ownership and Functions
id: Kepemilikan dan Fungsi

source: Listing 4-3 has an example with some annotations showing where variables go into and out of scope.
id: Listing 4-3 memiliki contoh dengan beberapa anotasi yang menunjukkan di mana variabel masuk dan keluar dari lingkup.

source: Listing 4-3: Functions with ownership and scope annotated
id: Listing 4-3: Fungsi dengan kepemilikan dan lingkup yang diberi anotasi

source: If we tried to use `my_struct` after the call to `takes_ownership`, Cairo would throw a compile-time error. These static checks protect us from mistakes. Try adding code to `main` that uses `my_struct` and `x` to see where you can use them and where the ownership rules prevent you from doing so.
id: Jika kita mencoba menggunakan `my_struct` setelah panggilan ke `takes_ownership`, Cairo akan melemparkan kesalahan pada waktu kompilasi. Pemeriksaan statis ini melindungi kita dari kesalahan. Coba tambahkan kode ke `main` yang menggunakan `my_struct` dan `x` untuk melihat di mana Anda dapat menggunakannya dan di mana aturan kepemilikan mencegah Anda melakukannya.

source: Returning values can also transfer ownership. Listing 4-4 shows an example of a function that returns some value, with similar annotations as those in Listing 4-3.
id: Value Return juga dapat mentransfer kepemilikan. Listing 4-4 menunjukkan contoh sebuah fungsi yang mengembalikan suatu nilai, dengan anotasi yang mirip dengan yang ada pada Listing 4-3.

source: Listing 4-4: Transferring ownership of return values
id: Listing 4-4: Mentransfer kepemilikan dari value return

source: While this works, taking ownership and then returning ownership with every function is a bit tedious. What if we want to let a function use a value but not take ownership? It’s quite annoying that anything we pass in also needs to be passed back if we want to use it again, in addition to any data resulting from the body of the function that we might want to return as well.
id: Meskipun ini berfungsi, mengambil kepemilikan dan kemudian mengembalikan kepemilikan setiap fungsi sedikit merepotkan. Bagaimana jika kita ingin membiarkan sebuah fungsi menggunakan sebuah nilai tetapi tidak mengambil kepemilikannya? Sangat menjengkelkan bahwa apapun yang kita lewatkan juga perlu dikembalikan jika kita ingin menggunakannya lagi, selain dari data apapun yang dihasilkan dari badan fungsi yang mungkin juga ingin kita kembalikan.

source: Listing 4-5: Returning ownership of parameters
id: Listing 4-5: Menunjukan Ownership dari parameter

source: But this is too much ceremony and a lot of work for a concept that should be common. Luckily for us, Cairo has two features for using a value without transferring ownership, called _references_ and _snapshots_.
id: Tetapi ini terlalu banyak seremoni dan pekerjaan yang berlebihan untuk konsep yang seharusnya umum. Untungnya untuk kita, Cairo memiliki dua fitur untuk menggunakan sebuah nilai tanpa mentransfer kepemilikan, yang disebut _referensi_ dan _snapshot_.

source: The issue with the tuple code in Listing 4-5 is that we have to return the `Array` to the calling function so we can still use the `Array` after the call to `calculate_length`, because the `Array` was moved into `calculate_length`.
id: Masalah dengan kode tuple pada Listing 4-5 adalah kita harus mengembalikan `Array` ke fungsi pemanggil sehingga kita masih dapat menggunakan `Array` setelah panggilan ke `calculate_length`, karena `Array` tersebut dipindahkan ke dalam `calculate_length`.

source: Instead, we can provide a _snapshot_ of the `Array` value. In Cairo, a snapshot is an immutable view of a value at a certain point in time. In the previous chapter, we talked about how Cairo's ownership system prevents us from using a value after we've moved it, protecting us from potentially writing twice to the same memory cell when appending values to arrays. However, it's not very convenient. Let's see how we can retain ownership of the value in the calling function using snapshots.
id: Sebagai gantinya, kita dapat menyediakan _snapshot_ dari nilai `Array`. Di Cairo, snapshot adalah pandangan yang tidak dapat diubah dari sebuah nilai pada titik waktu tertentu. Pada bab sebelumnya, kita membahas bagaimana sistem kepemilikan Cairo mencegah kita menggunakan sebuah nilai setelah kita telah memindahkannya, melindungi kita dari kemungkinan menulis dua kali ke sel memori yang sama saat menambahkan nilai ke array. Namun, ini tidak terlalu nyaman. Mari kita lihat bagaimana kita dapat mempertahankan kepemilikan nilai di dalam fungsi pemanggil menggunakan snapshot.
