Repository: cairo-book/cairo-book
Catalog: po/*.po
Languages: es, id, ko, zh_cn

source: Now that we have established how to verify voter eligibility, we can vote! To vote, we interact with the `vote` function, which is flagged as external, necessitating the use of the `starknet invoke` command.
id: Sekarang bahwa kita telah menetapkan cara untuk memverifikasi kelayakan pemilih, kita dapat memberikan suara! Untuk memberikan suara, kita berinteraksi dengan fungsi `vote`, yang ditandai sebagai eksternal, memerlukan penggunaan perintah `starknet invoke`.
ko: 이제 유권자 자격을 확인하는 방법을 확립했으므로 투표할 수 있습니다! 투표하려면 외부로 플래그가 지정된 `vote` 함수와 상호 작용해야 하며, 이를 위해 `starknet invoke` 명령을 사용해야 합니다.
zh_cn: 既然我们已经确定了如何验证选民资格，那么我们就可以投票了！投票时，我们要与`vote`函数交互，该函数被标记为外部函数，因此必须使用 `starknet invoke`命令。

source: The `invoke` command syntax resembles the `call` command, but for voting, we submit either `1` (for Yes) or `0` (for No) as our input. When we invoke the `vote` function, we are charged a fee, and the transaction must be signed by the voter; we are writing to the contract's storage.
id: Sintaks perintah `invoke` mirip dengan perintah `call`, tetapi untuk memberikan suara, kita mengirimkan entah `1` (untuk Ya) atau `0` (untuk Tidak) sebagai masukan kita. Saat kita memanggil fungsi `vote`, kita dikenakan biaya, dan transaksi harus ditandatangani oleh pemilih; kita sedang menulis ke penyimpanan kontrak.
ko: `invoke` 명령 구문은 `call` 명령과 유사하지만 투표할 때는 입력으로 `1` (찬성) 또는 `0` (반대)을 제출합니다. `vote` 함수를 호출할 때 수수료가 부과되며, 거래는 투표자에 의해 서명되어야 합니다. 우리는 계약의 저장소에 쓰고 있습니다.
zh_cn: `invoke`命令的语法与 `call` 命令类似，但在投票时，我们需要输入 "1"（表示 "是"）或 "0"（表示 "否"）。当我们唤起 `vote` 函数时，我们会被收取一定的费用，而且交易必须由投票人签署；我们正在向合约的存储空间写入内容。

source: You will be prompted to enter the password for the signer. Once you enter the password, the transaction will be signed and submitted to the Starknet network. You will receive the transaction hash as output. With the starkli transaction command, you can get more details about the transaction:
id: Anda akan diminta untuk memasukkan kata sandi untuk penandatangan. Setelah Anda memasukkan kata sandi, transaksi akan ditandatangani dan dikirimkan ke jaringan Starknet. Anda akan menerima hash transaksi sebagai keluaran. Dengan perintah starkli transaction, Anda dapat mendapatkan lebih banyak rincian tentang transaksi:
ko: 서명자의 비밀번호를 입력하라는 프롬프트가 표시됩니다. 비밀번호를 입력하면 거래가 서명되어 Starknet 네트워크에 제출됩니다. 거래 해시를 출력으로 받게 됩니다. starkli transaction 명령을 사용하여 거래에 대한 자세한 정보를 얻을 수 있습니다.
zh_cn: 系统将提示您输入签名者的密码。输入密码后，交易将被签署并提交到Starknet网络。你将收到交易哈希值作为输出。使用 starkli 交易命令，你可以获得更多关于交易的详细信息：

source: This returns:
ko: 이것은 다음을 반환합니다:
zh_cn: 这个会返回：

source: "max_fee"
ko: "최대 수수료"

source: "signature"
ko: "서명"

source: "nonce"
ko: "일회용"

source: "sender_address"
ko: "발신자 주소"

source: If you try to vote twice with the same signer you will get an error:
id: Jika Anda mencoba memberikan suara dua kali dengan penandatangan yang sama, Anda akan mendapatkan kesalahan:
ko: 동일한 서명자로 두 번 투표를 시도하면 오류가 발생합니다.
zh_cn: 如果您尝试用同一个签名者投票两次，则会出现错误：

source: "Contract error"
ko: "계약 오류"

source: The error is not very informative, but you can get more details when looking at the output in the terminal where you started `katana` (our local Starknet node):
id: Error ini tidak memberikan informasi yang sangat informatif, tetapi Anda dapat mendapatkan lebih banyak detail saat melihat output di terminal di mana Anda memulai `katana` (node Starknet lokal kita):
ko: 에러 메시지는 그다지 유용하지 않지만, `katana` (로컬 Starknet 노드)를 시작한 터미널 출력을 확인하면 더 많은 세부 정보를 얻을 수 있습니다.
zh_cn: 错误信息很简略，但你可以启动 `katana`（我们的本地Starknet节点）的终端中查看输出，获得更多细节：

source: "Error in the called contract (0x03ee9e18edc71a6df30ac3aca2e0b02a198fbce19b7480a63a0d71cbd76652e0): Error at pc=0:81: Got an exception while executing a hint: Custom Hint Error: Execution failed. Failure reason: \"USER_ALREADY_VOTED\". ...
ko: "호출된 계약에서 오류 발생 (0x03ee9e18edc71a6df30ac3aca2e0b02a198fbce19b7480a63a0d71cbd76652e0): pc=0:81에서 오류 발생: 힌트 실행 중 예외 발생: 사용자 지정 힌트 오류: 실행 실패. 실패 이유: \"USER_ALREADY_VOTED\". ..."

source: The key for the error is `USER_ALREADY_VOTED`.
ko: 오류의 키는 `USER_ALREADY_VOTED`입니다.
zh_cn: 错误的关键字是 `USER_ALREADY_VOTED`。

source: We can repeat the process to create Signers and Account Descriptors for the accounts we want to use for voting. Remember that each Signer must be created from a private key, and each Account Descriptor must be created from a public key, a smart wallet address, and the smart wallet class hash (which is the same for each voter).
id: Kita dapat mengulangi proses ini untuk membuat Signer dan Account Descriptor untuk akun yang ingin kita gunakan untuk memberikan suara. Ingatlah bahwa setiap Signer harus dibuat dari kunci pribadi, dan setiap Account Descriptor harus dibuat dari kunci publik, alamat smart wallet, dan hash kelas smart wallet (yang sama untuk setiap pemilih).
ko: 우리는 투표에 사용할 계정을 위해 서명자와 계정 설명자를 만들기 위한 과정을 반복할 수 있습니다. 각 서명자는 개인 키에서 생성되어야 하며, 각 계정 설명자는 공개 키, 스마트 지갑 주소 및 스마트 지갑 클래스 해시(각 투표자마다 동일함)에서 생성되어야 합니다.
zh_cn: 我们可以重复上述过程，为要将用于投票的账户创建签名者和账户描述符。请记住，每个签名者都必须用私钥创建，每个账户描述符都必须用公钥、智能钱包地址和智能钱包class hash （每个投票者的class hash 都一样）创建。

source: Visualizing Vote Outcomes
ko: 투표 결과 시각화

source: To examine the voting results, we invoke the `get_vote_status` function, another view function, through the `starknet call` command.
id: Untuk meneliti hasil pemungutan suara, kita memanggil fungsi `get_vote_status`, fungsi tampilan lain, melalui perintah `starknet call`.
ko: 투표 결과를 확인하기 위해 `starknet call` 명령어를 통해 다른 뷰 함수인 `get_vote_status` 함수를 호출합니다.
zh_cn: 为了检查投票结果，我们通过 `starknet call`命令调用另一个视图函数 `get_vote_status`。

source: The output reveals the tally of "Yes" and "No" votes along with their relative percentages.
id: Output menunjukkan jumlah suara "Ya" dan "Tidak" beserta persentasenya.
ko: 출력 결과는 "예"와 "아니요" 투표의 합계와 그에 대한 상대적인 백분율을 보여줍니다.
zh_cn: 输出结果显示了 "Yes"和 "No" 票数及其相对百分比。

source: L1-L2 Messaging
ko: L1-L2 메시징

source: A crucial feature of a Layer 2 is its ability to interact with Layer 1.
id: Fitur penting dari Layer 2 adalah kemampuannya untuk berinteraksi dengan Layer 1.
ko: Layer 2의 중요한 특징 중 하나는 Layer 1과 상호 작용할 수 있는 능력입니다.
zh_cn: Layer 2的一个重要特征是它能与Layer 1交互。

source: Starknet has its own `L1-L2` Messaging system, which is different from its consensus mechanism and the submission of state updates on L1. Messaging is a way for smart-contracts on L1 to interact with smart-contracts on L2 (or the other way around), allowing us to do "cross-chain" transactions. For example, we can do some computations on a chain and use the result of this computation on the other chain.
id: Starknet memiliki sistem Pengiriman Pesan `L1-L2` sendiri, yang berbeda dari mekanisme konsensusnya dan pengiriman pembaruan status di L1. Pengiriman pesan adalah cara bagi smart contract di L1 untuk berinteraksi dengan smart contract di L2 (atau sebaliknya), memungkinkan kita melakukan transaksi "cross-chain". Sebagai contoh, kita dapat melakukan beberapa komputasi pada suatu rantai dan menggunakan hasil komputasi ini pada rantai lain.
ko: 스타크넷은 자체 `L1-L2` 메시징 시스템을 갖고 있으며, 이는 합의 메커니즘과 L1에서 상태 업데이트를 제출하는 것과는 다릅니다. 메시징은 L1의 스마트 계약이 L2의 스마트 계약과 상호 작용하는 방법입니다(또는 그 반대로), "크로스 체인" 거래를 할 수 있게 합니다. 예를 들어, 한 체인에서 일부 계산을 수행하고 이 계산 결과를 다른 체인에서 사용할 수 있습니다.
zh_cn: Starknet拥有自己的 `L1-L2` 消息传递系统，它与其共识机制和L1上状态更新的提交方式不同。消息传递是L1上的智能合约与L2上的智能合约（或反之亦然）进行交互的一种方式，允许我们进行”跨链”交易。例如，我们可以在一个链上进行一些计算，并在另一个链上使用这个计算的结果。

source: Bridges on Starknet all use `L1-L2` messaging. Let's say that you want to bridge tokens from Ethereum to Starknet. You will simply have to deposit your tokens in the L1 bridge contract, which will automatically trigger the minting of the same token on L2. Another good use case for `L1-L2` messaging would be [DeFi pooling](https://starkware.co/resource/defi-pooling/).
id: Jembatan di Starknet semuanya menggunakan pesan `L1-L2`. Katakanlah Anda ingin menjembatani token dari Ethereum ke Starknet. Anda hanya perlu melakukan deposit token Anda ke kontrak jembatan L1, yang akan secara otomatis memicu pembuatan token yang sama di L2. Penggunaan lain yang bagus untuk pesan `L1-L2` dapat ditemukan pada [DeFi pooling](https://starkware.co/resource/defi-pooling/).
ko: 스타크넷의 모든 브릿지는 `L1-L2` 메시징을 사용합니다. 예를 들어, 이더리움에서 스타크넷으로 토큰을 브릿징하고 싶다고 가정해 봅시다. 간단히 이더리움 토큰을 L1 브릿지 계약에 예치하면, 자동으로 L2에서 동일한 토큰을 발행하게 됩니다. `L1-L2` 메시징의 또 다른 좋은 사용 사례는 [DeFi 풀링](https://starkware.co/resource/defi-pooling/)입니다.
zh_cn: 在Starknet上，所有的桥接都使用 `L1-L2` 消息传递。假设你想要将以太坊上的代币桥接到Starknet上。你只需要将代币存入L1桥接合约，这将自动触发在L2上铸造相同代币。`L1-L2` 消息传递的另一个很好的用例是[DeFi池化](https://starkware.co/resource/defi-pooling/)。

source: On Starknet, it's important to note that the messaging system is **asynchronous** and **asymmetric**.
id: Di Starknet, penting untuk dicatat bahwa sistem pesannya **asynchronous** dan **asymmetric**.
ko: 스타크넷에서는 메시징 시스템이 **비동기적**이고 **비대칭적**이라는 점을 주목해야 합니다.
zh_cn: 在Starknet上，重要的是要注意消息系统是**异步**和**非对称**。

source: **Asynchronous**: this means that in your contract code (being Solidity or Cairo), you can't wait the result of the message being sent on the other chain within your contract code execution.
id: **Asynchronous**: ini berarti bahwa dalam kode kontrak Anda (baik itu Solidity atau Cairo), Anda tidak dapat menunggu hasil dari pesan yang dikirimkan ke rantai lain dalam proses eksekusi kode kontrak Anda.
ko: **비동기적**: 이는 당신의 계약 코드(Solidity 또는 Cairo)에서 다른 체인으로 전송된 메시지의 결과를 계약 코드 실행 내에서 기다릴 수 없다는 것을 의미합니다.

source: **Asymmetric**: sending a message from Ethereum to Starknet (`L1->L2`) is fully automated by the Starknet sequencer, which means that the message is being automatically delivered to the target contract on L2. However, when sending a message from Starknet to Ethereum (`L2->L1`), only the hash of the message is sent on L1 by the Starknet sequencer. You must then consume the message manually via a transaction on L1.
ko: **비대칭**: 이더리움에서 Starknet으로 메시지를 보내는 것(`L1->L2`)은 Starknet 시퀀서에 의해 완전히 자동화되어 있어 메시지가 L2의 대상 계약에 자동으로 전달되는 것을 의미합니다. 그러나 Starknet에서 이더리움으로 메시지를 보내는 경우(`L2->L1`), Starknet 시퀀서에 의해 메시지의 해시만 L1로 전송됩니다. 그런 다음 L1에서 트랜잭션을 통해 메시지를 수동으로 소비해야 합니다.

source: Let's dive into the details.
id: Mari kita masuk ke dalam detailnya.
ko: 세부 사항에 대해 자세히 살펴봅시다.
zh_cn: 让我们来详细了解一下。

source: The StarknetMessaging Contract
ko: 스타크넷 메시징 계약

source: The crucial component of the `L1-L2` Messaging system is the [`StarknetCore`](https://etherscan.io/address/0xc662c410C0ECf747543f5bA90660f6ABeBD9C8c4) contract. It is a set of Solidity contracts deployed on Ethereum that allows Starknet to function properly. One of the contracts of `StarknetCore` is called `StarknetMessaging` and it is the contract responsible for passing messages between Starknet and Ethereum. `StarknetMessaging` follows an [interface](https://github.com/starkware-libs/cairo-lang/blob/4e233516f52477ad158bc81a86ec2760471c1b65/src/starkware/starknet/eth/IStarknetMessaging.sol#L6) with functions allowing to send message to L2, receiving messages on L1 from L2 and canceling messages.
id: Komponen penting dari sistem `L1-L2` Messaging adalah kontrak [`StarknetCore`](https://etherscan.io/address/0xc662c410C0ECf747543f5bA90660f6ABeBD9C8c4). Ini merupakan serangkaian kontrak Solidity yang dideploy di Ethereum yang memungkinkan Starknet untuk berfungsi dengan baik. Salah satu kontrak dari `StarknetCore` disebut `StarknetMessaging` dan bertanggung jawab dalam mengirim pesan antara Starknet dan Ethereum. `StarknetMessaging` mengikuti sebuah [interface](https://github.com/starkware-libs/cairo-lang/blob/4e233516f52477ad158bc81a86ec2760471c1b65/src/starkware/starknet/eth/IStarknetMessaging.sol#L6) dengan fungsi-fungsi yang memungkinkan pengiriman pesan ke L2, menerima pesan di L1 dari L2, dan membatalkan pesan.
ko: `L1-L2` 메시징 시스템의 중요한 구성 요소는 [`StarknetCore`](https://etherscan.io/address/0xc662c410C0ECf747543f5bA90660f6ABeBD9C8c4) 계약입니다. 이는 이더리움에 배포된 Solidity 계약 세트로, Starknet이 올바르게 작동할 수 있도록 합니다. `StarknetCore`의 계약 중 하나는 `StarknetMessaging`이라고 불리며, Starknet과 이더리움 간에 메시지를 전달하는 책임을 담당하는 계약입니다. `StarknetMessaging`은 [인터페이스](https://github.com/starkware-libs/cairo-lang/blob/4e233516f52477ad158bc81a86ec2760471c1b65/src/starkware/starknet/eth/IStarknetMessaging.sol#L6)를 따르며, L2로 메시지를 보내고, L1에서 L2로부터 메시지를 수신하고, 메시지를 취소하는 기능을 제공합니다.
zh_cn: `L1-L2` 消息传递系统的关键组件是[StarknetCore合约](https://etherscan.io/address/0xc662c410C0ECf747543f5bA90660f6ABeBD9C8c4)。它是部署在以太坊上的一组Solidity合约，用于使Starknet正常运行。`StarknetCore` 的合约之一被称为`StarknetMessaging`，它负责在Starknet和以太坊之间传递消息。StarknetMessaging遵循一个[接口](https://github.com/starkware-libs/cairo-lang/blob/4e233516f52477ad158bc81a86ec2760471c1b65/src/starkware/starknet/eth/IStarknetMessaging.sol#L6)，其中包含了一些函数，允许向L2发送消息，在L1上从L2接收消息以及取消消息。

source: Starknet messaging contract interface
ko: 스타크넷 메시징 계약 인터페이스

source: In the case of `L1->L2` messages, the Starknet sequencer is constantly listening to the logs emitted by the `StarknetMessaging` contract on Ethereum. Once a message is detected in a log, the sequencer prepares and executes a `L1HandlerTransaction` to call the function on the target L2 contract. This takes up to 1-2 minutes to be done (few seconds for ethereum block to be mined, and then the sequencer must build and execute the transaction).
id: Dalam kasus pesan `L1->L2`, sekuen Starknet terus-menerus mendengarkan log yang dihasilkan oleh kontrak `StarknetMessaging` di Ethereum. Begitu pesan terdeteksi dalam log, sekuen membuat dan mengeksekusi sebuah `L1HandlerTransaction` untuk memanggil fungsi pada kontrak L2 yang dituju. Proses ini membutuhkan waktu 1-2 menit untuk dilakukan (beberapa detik untuk blok Ethereum ditambang, kemudian sekuen harus membangun dan mengeksekusi transaksi).
ko: `L1->L2` 메시지의 경우, Starknet 시퀀서는 이더리움의 `StarknetMessaging` 계약이 발행한 로그를 계속 듣고 있습니다. 로그에서 메시지가 감지되면 시퀀서는 대상 L2 계약의 함수를 호출하기 위해 `L1HandlerTransaction`을 준비하고 실행합니다. 이 작업은 최대 1-2분이 소요됩니다 (이더리움 블록이 채굴되는 데 몇 초가 걸리고, 그런 다음 시퀀서가 트랜잭션을 작성하고 실행해야 합니다).

source: `L2->L1` messages are prepared by contracts execution on L2 and are part of the block produced. When the sequencer produces a block, it sends the hash of each message prepared by contracts execution to the `StarknetCore` contract on L1, where they can then be consumed once the block they belong to is proven and verified on Ethereum (which for now is around 3-4 hours).
id: Pesan `L2->L1` disiapkan oleh eksekusi kontrak di L2 dan merupakan bagian dari blok yang dihasilkan. Saat sekuen menghasilkan sebuah blok, ia mengirimkan hash dari setiap pesan yang disiapkan oleh eksekusi kontrak ke kontrak `StarknetCore` di L1, di mana pesan tersebut kemudian dapat dikonsumsi setelah blok yang mereka miliki terbukti dan diverifikasi di Ethereum (yang saat ini memakan waktu sekitar 3-4 jam).
ko: `L2->L1` 메시지는 L2에서 계약 실행에 의해 준비되며 생성된 블록의 일부입니다. 시퀀서가 블록을 생성하면, 각 메시지의 해시를 준비된 계약 실행에 의해 L1의 `StarknetCore` 계약으로 보냅니다. 해당 메시지는 해당하는 블록이 이더리움에서 증명 및 확인된 후(현재로는 약 3-4시간) 소비될 수 있습니다.

source: Sending messages from Ethereum to Starknet
ko: 이더리움에서 스타크넷으로 메시지를 보내는 중

source: If you want to send messages from Ethereum to Starknet, your Solidity contracts must call the `sendMessageToL2` function of the `StarknetMessaging` contract. To receive these messages on Starknet, you will need to annotate functions that can be called from L1 with the `#[l1_handler]` attribute.
id: Jika Anda ingin mengirim pesan dari Ethereum ke Starknet, kontrak Solidity Anda harus memanggil fungsi `sendMessageToL2` dari kontrak `StarknetMessaging`. Untuk menerima pesan-pesan ini di Starknet, Anda perlu menandai fungsi-fungsi yang dapat dipanggil dari L1 dengan atribut `#[l1_handler]`.
ko: 이더리움에서 스타크넷으로 메시지를 보내려면, 솔리디티 계약은 `StarknetMessaging` 계약의 `sendMessageToL2` 함수를 호출해야 합니다. 스타크넷에서 이러한 메시지를 받으려면, L1에서 호출할 수 있는 함수에 `#[l1_handler]` 속성을 추가해야 합니다.
zh_cn: 如果你想从 Ethereum 向 Starknet 发送消息，你的 Solidity 合约必须调用 `StarknetMessaging` 合约的 `sendMessageToL2` 函数。要在 Starknet 上接收这些消息，你需要用 `#[l1_handler]` 属性注解可从 L1 调用的函数。

source: Let's take a simple contract taken from [this tutorial](https://github.com/glihm/starknet-messaging-dev/blob/main/solidity/src/ContractMsg.sol) where we want to send a message to Starknet. The `_snMessaging` is a state variable already initialized with the address of the `StarknetMessaging` contract. You can check those addresses [here](https://docs.starknet.io/documentation/tools/important_addresses/).
id: Mari kita lihat kontrak sederhana yang diambil dari [tutorial ini](https://github.com/glihm/starknet-messaging-dev/blob/main/solidity/src/ContractMsg.sol) di mana kita ingin mengirim pesan ke Starknet. Variabel state `_snMessaging` sudah diinisialisasi dengan alamat kontrak `StarknetMessaging`. Anda dapat memeriksa alamat-alamat tersebut [di sini](https://docs.starknet.io/documentation/tools/important_addresses/).
ko: [이 튜토리얼](https://github.com/glihm/starknet-messaging-dev/blob/main/solidity/src/ContractMsg.sol)에서 가져온 간단한 계약을 살펴보겠습니다. 여기서는 Starknet에 메시지를 보내고 싶습니다. `_snMessaging`은 이미 `StarknetMessaging` 계약의 주소로 초기화된 상태 변수입니다. 해당 주소를 [여기](https://docs.starknet.io/documentation/tools/important_addresses/)에서 확인할 수 있습니다.

source: // Sends a message on Starknet with a single felt.
ko: 단일 펠트로 Starknet에 메시지를 보냅니다.

source: // We "serialize" here the felt into a payload, which is an array of uint256.
ko: 여기서는 펠트를 페이로드로 직렬화합니다. 이는 uint256 배열입니다.

source: // msg.value must always be >= 20_000 wei.
ko: // msg.value는 항상 20,000 wei 이상이어야 합니다.

source: The function sends a message with a single felt value to the `StarknetMessaging` contract. Please note that if you want to send more complex data you can. Just be aware that your Cairo contract will only understand `felt252` data type. So you must ensure that the serialization of your data into the `uint256` array follow the Cairo serialization scheme.
ko: 해당 기능은 `StarknetMessaging` 계약에 단일 felt 값으로 메시지를 보냅니다. 더 복잡한 데이터를 보내고 싶다면 가능합니다. 그러나 Cairo 계약이 `felt252` 데이터 유형만 이해한다는 점을 유의하십시오. 따라서 데이터를 `uint256` 배열로 직렬화할 때 Cairo 직렬화 체계를 따르도록 해야 합니다.

source: It's important to note that we have `{value: msg.value}`. In fact, the minimum value we've to send here is `20k wei`, due to the fact that the `StarknetMessaging` contract will register the hash of our message in the storage of Ethereum.
id: Penting untuk dicatat bahwa kita memiliki `{value: msg.value}`. Sebenarnya, nilai minimum yang harus kita kirimkan di sini adalah `20 ribu wei`, karena kontrak `StarknetMessaging` akan mendaftarkan hash pesan kita dalam penyimpanan Ethereum.
ko: 우리가 `{value: msg.value}`를 가지고 있다는 점을 주목하는 것이 중요합니다. 실제로, 여기서 보내야 하는 최소 값은 `20k wei`인데, `StarknetMessaging` 계약이 우리 메시지의 해시를 이더리움의 저장소에 등록하기 때문입니다.

source: Additionally to those `20k wei`, as the `L1HandlerTransaction` that will be executed by the sequencer is not bound to any account (the message originates from L1), you must also ensure that you pay enough fees on L1 for your message to be deserialized and processed on L2.
id: Selain dari `20 ribu wei` tersebut, karena `L1HandlerTransaction` yang akan dieksekusi oleh sekuen tidak terikat pada akun mana pun (pesan berasal dari L1), Anda juga harus memastikan membayar biaya yang cukup di L1 agar pesan Anda dapat didekripsi dan diproses di L2.
ko: 또한, 시퀀서에 의해 실행될 `L1HandlerTransaction`이 어떤 계정에도 바인딩되어 있지 않기 때문에 (메시지가 L1에서 시작되었습니다), L2에서 메시지를 역직렬화하고 처리하기 위해 충분한 수수료를 L1에 지불해야 합니다.

source: The fees of the `L1HandlerTransaction` are computed in a regular manner as it would be done for an `Invoke` transaction. For this, you can profile the gas consumption using `starkli` or `snforge` to estimate the cost of your message execution.
id: Biaya dari `L1HandlerTransaction` dihitung secara normal seperti yang dilakukan untuk transaksi `Invoke`. Untuk ini, Anda dapat memperkirakan konsumsi gas menggunakan `starkli` atau `snforge` untuk menaksir biaya eksekusi pesan Anda.
ko: `L1HandlerTransaction`의 수수료는 `Invoke` 트랜잭션에 대해 수행되는 것과 동일한 방식으로 계산됩니다. 이를 위해 `starkli` 또는 `snforge`를 사용하여 가스 소비를 프로파일링하여 메시지 실행 비용을 추정할 수 있습니다.

source: The signature of the `sendMessageToL2` is:
id: Tanda tangan dari `sendMessageToL2` adalah:
ko: `sendMessageToL2`의 서명은 다음과 같습니다:
zh_cn: `sendMessageToL2`的签名是：

source: The parameters are as follow:
id: Parameter-parameter tersebut adalah sebagai berikut:
ko: 매개변수는 다음과 같습니다:
zh_cn: 参数如下：

source: `toAddress`: The contract address on L2 that will be called.
id: `toAddress`: Alamat kontrak di L2 yang akan dipanggil.
ko: `toAddress`: 호출될 L2 계약 주소입니다.

source: `selector`: The selector of the function of this contract at `toAddress`. This selector (function) must have the `#[l1_handler]` attribute to be callable.
id: `selector `: Selector dari fungsi kontrak ini di `toAddress`. Selector (fungsi) ini harus memiliki atribut `#[l1_handler]` agar dapat dipanggil.
ko: `selector`: 이 계약의 기능 선택기는 `toAddress`에 있습니다. 이 선택기(함수)는 호출 가능하도록 `#[l1_handler]` 속성을 가져야 합니다.

source: `payload`: The payload is always an array of `felt252` (which are represented by `uint256` in Solidity). For this reason we've inserted the input `myFelt` into the array. This is why we need to insert the input data into an array.
id: `payload`: Payload selalu merupakan sebuah larik dari `felt252` (yang direpresentasikan oleh `uint256` dalam Solidity). Karena itu, kami telah memasukkan input `myFelt` ke dalam larik. Inilah sebabnya mengapa kita perlu memasukkan data input ke dalam sebuah larik.
ko: `payload`: 페이로드는 항상 `felt252`의 배열입니다 (`Solidity`에서 `uint256`로 표현됨). 이유는 우리가 입력 `myFelt`를 배열에 삽입했기 때문입니다. 그래서 입력 데이터를 배열에 삽입해야 하는 이유입니다.

source: On the Starknet side, to receive this message, we have:
id: Di sisi Starknet, untuk menerima pesan ini, kita memiliki:
ko: 스타크넷 쪽에서 이 메시지를 받으려면, 우리는:
zh_cn: 在Starknet方面，要接收这条信息，我们需要：

source: // You can now use the data, automatically deserialized from the message payload.
ko: 이제 메시지 페이로드에서 자동으로 역직렬화된 데이터를 사용할 수 있습니다.

source: We need to add the `#[l1_handler]` attribute to our function. L1 handlers are special functions that can only be executed by a `L1HandlerTransaction`. There is nothing particular to do to receive transactions from L1, as the message is relayed by the sequencer automatically. In your `#[l1_handler]` functions, it is important to verify the sender of the L1 message to ensure that our contract can only receive messages from a trusted L1 contract.
id: Kita perlu menambahkan atribut `#[l1_handler]` ke dalam fungsi kita. Handler L1 adalah fungsi-fungsi khusus yang hanya dapat dieksekusi oleh `L1HandlerTransaction`. Tidak ada yang perlu dilakukan secara khusus untuk menerima transaksi dari L1, karena pesan disalurkan oleh sekuen secara otomatis. Pada fungsi-fungsi `#[l1_handler]` Anda, penting untuk memverifikasi pengirim pesan L1 untuk memastikan bahwa kontrak kita hanya dapat menerima pesan dari kontrak L1 yang terpercaya.
ko: 우리는 함수에 `#[l1_handler]` 속성을 추가해야 합니다. L1 핸들러는 `L1HandlerTransaction`에 의해서만 실행될 수 있는 특별한 함수들입니다. L1에서 트랜잭션을 받기 위해 특별히 할 일은 없습니다. 메시지는 시퀀서에 의해 자동으로 중계됩니다. `#[l1_handler]` 함수에서는 L1 메시지의 발신자를 확인하여 우리 계약이 신뢰할 수 있는 L1 계약으로부터만 메시지를 받을 수 있도록 하는 것이 중요합니다.
zh_cn: 我们需要为我们的函数添加 `#[l1_handler]` 属性。L1处理器是一种特殊的函数，只能由`L1HandlerTransaction` 执行。接收来自L1的事务时不需要特别处理，因为消息会自动由顺序器中继。在你的 `#[l1_handler]` 函数中，重要的是要验证L1消息的发送者，以确保我们的合约只能接收来自受信任的L1合约的消息。

source: Sending messages from Starknet to Ethereum
ko: 스타크넷에서 이더리움으로 메시지를 보내는 중
