Repository: cairo-book/cairo-book
Catalog: po/*.po
Languages: es, id, ko, zh_cn

source: Smart contracts can be used to create and manage digital identities, allowing individuals to control their personal information and share it with third parties securely. The smart contract could verify the authenticity of a user's identity and automatically grant or revoke access to specific services based on the user's credentials.
es: Los smart contracts pueden utilizarse para crear y gestionar identidades digitales, permitiendo a las personas controlar su información personal y compartirla con terceros de forma segura. El smart contract podría verificar la autenticidad de la identidad de un usuario y conceder o revocar automáticamente el acceso a servicios específicos en función de sus credenciales.
id: Kontrak pintar dapat digunakan untuk membuat dan mengelola identitas digital, memungkinkan individu mengontrol informasi pribadi mereka dan membagikannya dengan pihak ketiga secara aman. Kontrak pintar dapat memverifikasi keaslian identitas pengguna dan secara otomatis memberikan atau mencabut akses ke layanan tertentu berdasarkan kredensial pengguna.
ko: 스마트 계약은 디지털 신원을 생성하고 관리하는 데 사용될 수 있으며, 개인이 개인 정보를 제어하고 안전하게 제3자와 공유할 수 있도록 합니다. 스마트 계약은 사용자의 신원의 진위를 확인하고 사용자 자격 증명에 기반하여 특정 서비스에 대한 액세스를 자동으로 부여하거나 철회할 수 있습니다.
zh_cn: 智能合约可用于创建和管理数字身份，允许个人控制其个人信息，并与第三方安全地分享。智能合约可以验证用户身份的真实性，并根据用户的凭证自动授予或撤销对特定服务的访问。

source: The rise of Starknet and Cairo
ko: 스타크넷과 카이로의 부상

source: Ethereum, being the most widely used and resilient smart-contract platform, became a victim of its own success. With the rapid adoption of some previously mentioned use cases, mainly DeFi, the cost of performing transactions became extremely high, rendering the network almost unusable. Engineers and researchers in the ecosystem began working on solutions to address this scalability issue.
id: Ethereum, sebagai platform kontrak pintar yang paling banyak digunakan dan tangguh, menjadi korban dari kesuksesannya sendiri. Dengan adopsi cepat beberapa kasus penggunaan yang telah disebutkan sebelumnya, terutama DeFi, biaya untuk melakukan transaksi menjadi sangat tinggi, membuat jaringan hampir tidak dapat digunakan. Insinyur dan peneliti di ekosistem ini mulai bekerja pada solusi untuk mengatasi masalah skalabilitas ini.
ko: 이더리움은 가장 널리 사용되는 강력한 스마트 계약 플랫폼으로, 자신의 성공의 희생자가 되었습니다. 이전에 언급된 사용 사례 중 일부, 주로 DeFi의 신속한 채택으로 인해 거래 수행 비용이 극도로 높아져 네트워크를 거의 사용할 수 없게 만들었습니다. 이 생태계의 엔지니어와 연구자들은 이 확장성 문제를 해결하기 위한 솔루션에 대해 작업하기 시작했습니다.
zh_cn: 以太坊作为应用最广泛、弹性最大的智能合约平台，成为了自身成功的牺牲品。随着前面提到的一些用例（主要是DeFi）的快速采用，执行交易的成本变得非常高，使得网络几乎无法使用。生态系统中的工程师和研究人员开始研究解决这一可扩展性问题的方案。

source: A famous trilemma ([The Blockchain Trilemma](https://vitalik.ca/general/2021/04/07/sharding.html#the-scalability-trilemma)) in the blockchain space states that it is impossible to achieve a high level of scalability, decentralization, and security simultaneously; trade-offs must be made. Ethereum is at the intersection of decentralization and security. Eventually, it was decided that Ethereum's purpose would be to serve as a secure settlement layer, while complex computations would be offloaded to other networks built on top of Ethereum. These are called Layer 2s (L2s).
id: Sebuah trilema terkenal ([The Blockchain Trilemma](https://vitalik.ca/general/2021/04/07/sharding.html#the-scalability-trilemma)) di ruang blockchain menyatakan bahwa tidak mungkin mencapai tingkat skalabilitas, desentralisasi, dan keamanan yang tinggi secara bersamaan; kompromi harus dilakukan. Ethereum berada di persimpangan desentralisasi dan keamanan. Akhirnya, diputuskan bahwa tujuan Ethereum adalah untuk berfungsi sebagai lapisan penyelesaian yang aman, sementara perhitungan kompleks akan dialihkan ke jaringan lain yang dibangun di atas Ethereum. Ini disebut sebagai Layer 2 (L2).
ko: 블록체인 분야의 유명한 삼중 딜레마([블록체인 삼중 딜레마](https://vitalik.ca/general/2021/04/07/sharding.html#the-scalability-trilemma))는 확장성, 분산화, 그리고 보안의 높은 수준을 동시에 달성하는 것은 불가능하다고 주장하며, 트레이드오프가 필요하다고 합니다. 이더리움은 분산화와 보안의 교차점에 위치해 있습니다. 결국, 이더리움의 목적은 안전한 결제 계층으로 작용하는 동시에 복잡한 계산은 이더리움 위에 구축된 다른 네트워크로 옮겨지도록 결정되었습니다. 이를 레이어 2(L2)라고 합니다.
zh_cn: 区块链领域有一个著名的不可能三角（[The Blockchain Trilemma](https://vitalik.ca/general/2021/04/07/sharding.html#the-scalability-trilemma)），即不可能同时实现高水平的可扩展性、去中心化和安全性；我们必须做出权衡。以太坊处于去中心化和安全性的交叉点。最终，人们决定以太坊的目的是作为一个安全的结算层，而复杂的计算将被卸载到建立在以太坊之上的其他网络。这些网络被称为二层网络（L2）。

source: The two primary types of L2s are optimistic rollups and validity rollups. Both approaches involve compressing and batching numerous transactions together, computing the new state, and settling the result on Ethereum (L1). The difference lies in the way the result is settled on L1. For optimistic rollups, the new state is considered valid by default, but there is a 7-day window for nodes to identify malicious transactions.
id: Dua jenis utama L2 adalah optimistic rollups dan validity rollups. Kedua pendekatan tersebut melibatkan penggabungan dan pengelompokan banyak transaksi bersama-sama, menghitung keadaan baru, dan menyelesaikan hasilnya di Ethereum (L1). Perbedaannya terletak pada cara hasilnya diselesaikan di L1. Untuk optimistic rollups, keadaan baru dianggap sah secara default, tetapi ada jendela waktu 7 hari bagi node untuk mengidentifikasi transaksi yang berbahaya.
ko: L2의 두 가지 주요 유형은 낙관롤업(optimistic rollups)과 유효성 롤업(validity rollups)입니다. 두 접근 방식 모두 많은 거래를 압축하고 일괄 처리하여 새로운 상태를 계산하고 결과를 이더리움(L1)에 결제하는 것을 포함합니다. 차이점은 결과가 L1에서 어떻게 결제되는지에 있습니다. 낙관롤업의 경우 새로운 상태는 기본적으로 유효하다고 간주되지만, 악의적인 거래를 식별할 노드에 대한 7일 윈도우가 있습니다.
zh_cn: L2的两种主要类型是乐观rollup和有效性rollup。这两种方法都涉及压缩和批量处理大量交易，计算新状态，并将结果结算在以太坊（L1）上。区别在于在L1上结算结果的方式。对于乐观rollup，默认情况下新状态被认为是有效的，但节点有7天的窗口期来识别恶意交易。

source: In contrast, validity rollups, such as Starknet, use cryptography to prove that the new state has been correctly computed. This is the purpose of STARKs, this cryptographic technology could permit validity rollups to scale significantly more than optimistic rollups. You can learn more about STARKs from Starkware's Medium [article](https://medium.com/starkware/starks-starkex-and-starknet-9a426680745a), which serves as a good primer.
id: Sebaliknya, validity rollups, seperti Starknet, menggunakan kriptografi untuk membuktikan bahwa keadaan baru telah dihitung dengan benar. Ini adalah tujuan dari STARKs, teknologi kriptografi ini dapat memungkinkan validity rollups untuk mengalami peningkatan skala yang signifikan lebih dari optimistic rollups. Anda dapat mempelajari lebih lanjut tentang STARKs dari artikel Medium [Starkware](https://medium.com/starkware/starks-starkex-and-starknet-9a426680745a), yang berfungsi sebagai panduan yang baik.
ko: 대조적으로, Starknet과 같은 유효성 롤업은 암호학을 사용하여 새 상태가 올바르게 계산되었음을 증명합니다. 이것이 STARKs의 목적이며, 이 암호 기술은 낙관적 롤업보다 유효성 롤업이 훨씬 더 확장될 수 있도록 할 수 있습니다. Starkware의 Medium [기사](https://medium.com/starkware/starks-starkex-and-starknet-9a426680745a)에서 STARKs에 대해 더 알아볼 수 있으며, 이는 좋은 입문서 역할을 합니다.
zh_cn: 与此相反，有效性rollup（如Starknet）使用加密技术来证明新状态的计算是正确的。这就是STARKs的目的，这种加密技术可以使有效性rollup的扩展能力大大超过乐观rollup。你可以从Starkware的Medium[文章](https://medium.com/starkware/starks-starkex-and-starknet-9a426680745a)中了解更多关于STARKs的信息，它是一个很好的入门读物。

source: Starknet's architecture is thoroughly described in the [Starknet Book](https://book.starknet.io/chapter_4/index.html), which is a great resource to learn more about the Starknet network.
id: Arsitektur Starknet dijelaskan secara mendalam dalam [Buku Starknet](https://book.starknet.io/chapter_4/index.html), yang merupakan sumber daya yang baik untuk mempelajari lebih lanjut tentang jaringan Starknet.
ko: Starknet의 아키텍처는 [Starknet Book](https://book.starknet.io/chapter_4/index.html)에서 상세히 설명되어 있으며, Starknet 네트워크에 대해 더 많이 알아보는 데 좋은 자료입니다.

source: Remember Cairo? It is, in fact, a language developed specifically to work with STARKs and make them general-purpose. With Cairo, we can write **provable code**. In the context of Starknet, this allows proving the correctness of computations from one state to another.
id: Ingat Cairo? Sebenarnya, itu adalah bahasa yang dikembangkan khusus untuk bekerja dengan STARKs dan membuatnya serbaguna. Dengan Cairo, kita dapat menulis **kode yang dapat dipertanggungjawabkan**. Dalam konteks Starknet, ini memungkinkan membuktikan kebenaran perhitungan dari satu keadaan ke keadaan lainnya.
ko: 카이로를 기억하시나요? 사실, STARKs와 함께 작동하도록 특별히 개발된 언어입니다. 카이로를 사용하면 **증명 가능한 코드**를 작성할 수 있습니다. Starknet의 맥락에서 이는 한 상태에서 다른 상태로의 계산의 정확성을 증명할 수 있게 합니다.
zh_cn: 还记得Cairo吗？事实上，它是一种专门为STARKs开发的语言，并使其具有通用性。使用Cairo，我们可以编写**可证明的代码**。在 Starknet 中，这可以证明从一个状态到另一个状态的计算的正确性。

source: Unlike most (if not all) of Starknet's competitors that chose to use the EVM (either as-is or adapted) as a base layer, Starknet employs its own VM. This frees developers from the constraints of the EVM, opening up a broader range of possibilities. Coupled with decreased transaction costs, the combination of Starknet and Cairo creates an exciting playground for developers. Native account abstraction enables more complex logic for accounts, that we call "Smart Accounts", and transaction flows. Emerging use cases include **transparent AI** and machine learning applications. Finally, **blockchain games** can be developed entirely **on-chain**. Starknet has been specifically designed to maximize the capabilities of STARK proofs for optimal scalability.
id: Berbeda dengan kebanyakan (jika tidak semua) pesaing Starknet yang memilih menggunakan EVM (baik itu apa adanya atau disesuaikan) sebagai lapisan dasar, Starknet menggunakan VM sendiri. Hal ini membebaskan pengembang dari batasan EVM, membuka peluang yang lebih luas. Dipadukan dengan penurunan biaya transaksi, kombinasi Starknet dan Cairo menciptakan area bermain yang menarik bagi pengembang. Abstraksi akun asli memungkinkan logika yang lebih kompleks untuk akun, yang kami sebut "Smart Accounts", dan alur transaksi. Beberapa kasus penggunaan yang muncul termasuk aplikasi **kecerdasan buatan yang transparan** dan pembelajaran mesin. Terakhir, **permainan blockchain** dapat dikembangkan sepenuhnya **on-chain**. Starknet secara khusus dirancang untuk memaksimalkan kemampuan bukti STARK untuk skalabilitas yang optimal.
ko: 스타크넷의 대부분(아니면 모두) 경쟁사들은 기본 레이어로 EVM(변형되거나 그대로 사용)을 선택했지만, 스타크넷은 자체 VM을 사용합니다. 이는 개발자들을 EVM의 제약에서 해방시켜 더 넓은 가능성을 열어줍니다. 거래 비용이 감소하면서, 스타크넷과 카이로의 조합은 개발자들을 위한 흥미로운 놀이터를 만들어냅니다. 네이티브 계정 추상화는 "스마트 계정"이라고 부르는 계정 및 거래 흐름에 대한 더 복잡한 로직을 가능하게 합니다. **투명한 AI** 및 머신 러닝 애플리케이션을 포함한 새로운 사용 사례가 등장하고 있습니다. 마지막으로, **블록체인 게임**은 완전히 **체인 상에서** 개발될 수 있습니다. 스타크넷은 최적의 확장성을 위해 STARK 증명의 능력을 극대화하기 위해 특별히 설계되었습니다.
zh_cn: 大多数（也许不是全部）Starknet的竞争对手都选择使用 EVM（原版或改版）作为基础层，而Starknet则不同，它采用了自己的虚拟机。这使开发人员摆脱了 EVM 的束缚，开辟了更广阔的可能性。加上交易成本的降低，Starknet 与 Cairo 的结合为开发人员创造了一个令人兴奋的乐园。原生账户抽象使我们称之为 "智能账户" 的账户和交易流的逻辑更加复杂。新兴用例包括 **透明人工智能** 和机器学习应用。最后，**区块链游戏** 可以完全在 **链上** 开发。Starknet 经过专门设计，可最大限度地发挥 STARK 证明的能力，实现最佳可扩展性。

source: Learn more about Account Abstraction in the [Starknet Book](https://book.starknet.io/chapter_5/index.html).
id: Pelajari lebih lanjut tentang Abstraksi Akun di [Buku Starknet](https://book.starknet.io/chapter_5/index.html).
ko: [Starknet Book](https://book.starknet.io/chapter_5/index.html)에서 Account Abstraction에 대해 더 알아보세요.

source: Cairo programs and Starknet contracts: what is the difference?
id: Program-program Cairo dan kontrak Starknet: apa perbedaannya?
ko: 카이로 프로그램과 스타크넷 계약: 차이점은 무엇인가요?

source: Starknet contracts are a special superset of Cairo programs, so the concepts previously learned in this book are still applicable to write Starknet contracts. As you may have already noticed, a Cairo program must always have a function `main` that serves as the entry point for this program:
id: Kontrak-kontrak Starknet merupakan suatu himpunan istimewa dari program-program Cairo, sehingga konsep-konsep yang telah dipelajari sebelumnya dalam buku ini masih dapat diterapkan untuk menulis kontrak-kontrak Starknet. Seperti yang mungkin sudah Anda perhatikan, suatu program Cairo harus selalu memiliki fungsi `main` yang berfungsi sebagai titik masuk untuk program ini:
ko: 스타크넷 계약은 카이로 프로그램의 특별한 슈퍼셋이므로, 이 책에서 이전에 배운 개념들은 여전히 스타크넷 계약을 작성하는 데 적용됩니다. 이미 알고 계실 것처럼, 카이로 프로그램은 항상 이 프로그램의 진입점으로 작용하는 `main` 함수를 가져야 합니다:

source: Starknet contracts are essentially programs that can run on the Starknet OS, and as such, have access to Starknet's state. For a module to be handled as a contract by the compiler, it must be annotated with the `#[starknet::contract]` attribute.
id: Kontrak-kontrak Starknet pada dasarnya adalah program-program yang dapat berjalan di sistem operasi Starknet, dan sebagai hasilnya, memiliki akses ke status Starknet. Agar suatu modul dapat dianggap sebagai kontrak oleh compiler, harus diberi anotasi dengan atribut `#[starknet::contract]`.
ko: 스타크넷 계약은 본질적으로 Starknet OS에서 실행할 수 있는 프로그램이며, 따라서 Starknet의 상태에 액세스할 수 있습니다. 컴파일러에서 모듈을 계약으로 처리하려면 `#[starknet::contract]` 속성으로 주석 처리해야 합니다.
zh_cn: Starknet合约本质上是可以在Starknet操作系统上运行的程序，因此可以访问Starknet的状态。要让编译器把一个模块当作合约来处理，就必须用 `#[starknet::contract]`属性来标注它。

source: This chapter will introduce you to the basics of Starknet contracts with an example of a basic contract. You will learn how to write a simple contract that stores a single number on the blockchain.
id: Bab ini akan memperkenalkan Anda pada dasar-dasar kontrak Starknet dengan contoh kontrak dasar. Anda akan belajar cara menulis kontrak sederhana yang menyimpan satu angka pada blockchain.
ko: 이 장에서는 기본적인 Starknet 계약의 기초를 예를 통해 소개합니다. 블록체인에 단일 숫자를 저장하는 간단한 계약을 작성하는 방법을 배우게 될 것입니다.
zh_cn: 本章将通过一个基本合约的例子向您介绍Starknet合约的基础知识。您将学习如何编写一个在区块链上存储单个数字的简单合约。

source: Anatomy of a simple Starknet Contract
id: Struktur dari Kontrak Starknet Sederhana
ko: 간단한 Starknet 계약의 해부학

source: Let's consider the following contract to present the basics of a Starknet contract. It might not be easy to understand it all at once, but we will go through it step by step:
id: Mari kita pertimbangkan kontrak berikut untuk memperkenalkan dasar-dasar kontrak Starknet. Mungkin tidak mudah untuk memahaminya sekaligus, tetapi kita akan membahasnya langkah demi langkah:
ko: 다음 계약을 고려하여 Starknet 계약의 기본을 소개해 보겠습니다. 한 번에 모두 이해하기 쉽지 않을 수 있지만, 단계별로 진행하겠습니다.
zh_cn: 让我们通过下面的合约来了解Starknet合约的基本内容。可能一下子很难理解，但是我们将一步一步地进行讲解：

source: Listing 99-1: A simple storage contract
id: Listing 99-1: Kontrak penyimpanan sederhana
ko: 리스팅 99-1: 간단한 저장 계약

source: Note: Starknet contracts are defined within [modules](./ch07-02-defining-modules-to-control-scope.md).
id: Catatan: Kontrak Starknet didefinisikan dalam [modul](./ch07-02-defining-modules-to-control-scope.md).
ko: 참고: Starknet 계약은 [모듈](./ch07-02-defining-modules-to-control-scope.md) 내에서 정의됩니다.

source: What is this contract?
ko: 이 계약서는 무엇인가요?

source: In this example, the `Storage` struct declares a storage variable called `stored_data` of type `u128` (unsigned integer of 128 bits). You can think of it as a single slot in a database that you can query and alter by calling functions of the code that manages the database. The contract defines and exposes publicly the functions `set` and `get` that can be used to modify or retrieve the value of that variable.
id: Dalam contoh ini, struktur `Storage` mendeklarasikan variabel penyimpanan yang disebut `stored_data` dengan tipe `u128` (bilangan bulat tak bertanda 128 bit). Anda dapat menganggapnya sebagai satu slot dalam database yang dapat Anda tanyakan dan ubah dengan memanggil fungsi dari kode yang mengelola database tersebut. Kontrak menentukan dan mengekspos secara publik fungsi-fungsi `set` dan `get` yang dapat digunakan untuk mengubah atau mengambil nilai dari variabel tersebut.
ko: 이 예시에서 `Storage` 구조체는 `u128` 타입(128비트의 부호 없는 정수)인 `stored_data`라는 저장 변수를 선언합니다. 이는 데이터베이스의 단일 슬롯으로 생각할 수 있으며, 데이터베이스를 관리하는 코드의 함수를 호출하여 쿼리하고 변경할 수 있습니다. 계약은 `set` 및 `get` 함수를 정의하고 공개적으로 노출하여 이 변수의 값을 수정하거나 검색하는 데 사용할 수 있습니다.

source: The Interface: the contract's blueprint
id: Antarmuka: rancangan kontrak
ko: 인터페이스: 계약의 청사진

source: The interface of a contract represents the functions this contract exposes to the outside world. Here, the interface exposes two functions: `set` and `get`. By leveraging the [traits & impls](./ch08-02-traits-in-cairo.md) mechanism from Cairo, we can make sure that the actual implementation of the contract matches its interface. In fact, you will get a compilation error if your contract doesn’t conform with the declared interface.
id: Antarmuka dari sebuah kontrak mewakili fungsi-fungsi yang kontrak tersebut ungkapkan ke dunia luar. Di sini, antarmuka mengungkapkan dua fungsi: `set` dan `get`. Dengan memanfaatkan mekanisme [traits & impls](./ch08-02-traits-in-cairo.md) dari Cairo, kita dapat memastikan bahwa implementasi sebenarnya dari kontrak sesuai dengan antarmukanya. Faktanya, Anda akan mendapatkan kesalahan kompilasi jika kontrak Anda tidak sesuai dengan antarmuka yang dideklarasikan.
ko: 계약의 인터페이스는 해당 계약이 외부 세계에 노출하는 기능을 나타냅니다. 여기서 인터페이스는 `set`과 `get` 두 가지 함수를 노출합니다. 카이로에서 [트레이트 및 임플](./ch08-02-traits-in-cairo.md) 메커니즘을 활용하여 계약의 실제 구현이 인터페이스와 일치하는지 확인할 수 있습니다. 실제로 선언된 인터페이스와 일치하지 않는 계약은 컴파일 오류가 발생합니다.
zh_cn: 合约的接口代表了该合约向外界公开的函数。在这里，接口公开了两个函数：`set` 和 `get` 。通过利用Cairo的[traits & impls](./ch08-02-traits-in-cairo.md) 机制，我们可以确保合约的实际实现与其接口匹配。事实上，如果你的合约与声明的接口不符合，将会得到编译错误。

source: Listing 99-2: A wrong implementation of the interface of the contract. This does not compile.
ko: 리스팅 99-2: 계약의 인터페이스를 잘못 구현한 것입니다. 이는 컴파일되지 않습니다.

source: In the interface, note the generic type `TContractState` of the `self` argument which is passed by reference to the `set` function. The `self` parameter represents the contract state. Seeing the `self` argument passed to `set` tells us that this function might access the state of the contract, as it is what gives us access to the contract’s storage. The `ref` modifier implies that `self` may be modified, meaning that the storage variables of the contract may be modified inside the `set` function.
id: Pada antarmuka, perhatikan tipe generik `TContractState` dari argumen `self` yang dilewatkan secara referensi ke fungsi `set`. Parameter `self` mewakili status kontrak. Melihat argumen `self` yang dilewatkan ke `set` memberi tahu kita bahwa fungsi ini mungkin mengakses status kontrak, karena itulah yang memberikan akses ke penyimpanan kontrak. Modifier `ref` mengimplikasikan bahwa `self` dapat dimodifikasi, yang berarti variabel penyimpanan kontrak dapat dimodifikasi di dalam fungsi `set`.
ko: 인터페이스에서 'set' 함수에 참조로 전달되는 'self' 인수의 일반 형식 'TContractState'을 주목하세요. 'self' 매개변수는 계약 상태를 나타냅니다. 'set'에 전달된 'self' 인수를 보면, 이 함수가 계약의 상태에 액세스할 수 있을 수도 있다는 것을 알 수 있습니다. 'ref' 수정자는 'self'가 수정될 수 있다는 것을 의미하며, 이는 'set' 함수 내에서 계약의 저장소 변수가 수정될 수 있다는 것을 의미합니다.
zh_cn: 在接口中，请注意`self`参数的通用类型`TContractState`，它通过引用传递给`set`函数。参数 `self` 代表合约状态。看到 `self` 参数传递给 `set` 告诉我们这个函数可能会访问合约的状态，因为它使我们能够访问合约的存储空间。`ref` 修饰符意味着 `self` 可以被修改，这意味着合约的存储变量可以在 `set` 函数中被修改。

source: On the other hand, `get` takes a _snapshot_ of `TContractState`, which immediately tells us that it does not modify the state (and indeed, the compiler will complain if we try to modify storage inside the `get` function).
id: Di sisi lain, `get` mengambil _snapshot_ dari `TContractState`, yang segera memberi tahu kita bahwa fungsi ini tidak memodifikasi status (dan memang, kompiler akan mengeluh jika kita mencoba memodifikasi penyimpanan di dalam fungsi `get`).
ko: 한편, `get`은 `TContractState`의 _스냅샷_ 을 취하는데, 이로써 상태를 수정하지 않음을 즉시 알 수 있습니다 (`get` 함수 내에서 저장소를 수정하려고 하면 컴파일러가 오류를 발생시킵니다).
zh_cn: 另一方面，`get`获取`TContractState`的_snapshot_，这立即告诉我们它不会修改状态（事实上，如果我们试图在`get`函数中修改存储变量，编译器会报错）。

source: Public functions are defined in an implementation block
id: Fungsi-fungsi publik didefinisikan dalam blok implementasi
ko: 공개 함수는 구현 블록에서 정의됩니다.

source: Before we explore things further down, let's define some terminology.
id: Sebelum kita menjelajahi lebih lanjut, mari tentukan beberapa terminologi.
ko: 더 깊이 탐구하기 전에, 우리는 몇 가지 용어를 정의해 봅시다.
zh_cn: 在我们进一步探讨之前，让我们先定义一些术语。

source: In the context of Starknet, a _public function_ is a function that is exposed to the outside world. In the example above, `set` and `get` are public functions. A public function can be called by anyone, and can be called from outside the contract, or from within the contract. In the example above, `set` and `get` are public functions.
id: Dalam konteks Starknet, sebuah _fungsi publik_ adalah fungsi yang terpapar ke dunia luar. Pada contoh di atas, `set` dan `get` adalah fungsi publik. Fungsi publik dapat dipanggil oleh siapa saja, dan dapat dipanggil dari luar kontrak atau dari dalam kontrak. Pada contoh di atas, `set` dan `get` adalah fungsi publik.
ko: Starknet의 맥락에서 _public function_ 은 외부 세계에 노출된 함수입니다. 위의 예에서 `set`과 `get`은 public functions입니다. public function은 누구나 호출할 수 있으며, 계약 외부 또는 내부에서 호출할 수 있습니다. 위의 예에서 `set`과 `get`은 public functions입니다.

source: What we call an _external_ function is a public function that is invoked through a transaction and that can mutate the state of the contract. `set` is an external function.
id: Apa yang kita sebut sebagai fungsi _eksternal_ adalah fungsi publik yang dipanggil melalui transaksi dan dapat mengubah status kontrak. `set` adalah fungsi eksternal.
ko: 우리가 _외부_ 함수라고 부르는 것은 트랜잭션을 통해 호출되며 계약의 상태를 변경할 수 있는 공개 함수입니다. `set`은 외부 함수입니다.

source: A _view_ function is a public function that can be called from outside the contract, but that cannot mutate the state of the contract. `get` is a view function.
id: Fungsi _view_ adalah fungsi publik yang dapat dipanggil dari luar kontrak, tetapi tidak dapat mengubah status kontrak. `get` adalah fungsi view.
ko: `view` 함수는 계약 외부에서 호출할 수 있는 공개 함수이지만 계약의 상태를 변경할 수는 없습니다. `get`은 view 함수입니다.

source: Since the contract interface is defined as the `ISimpleStorage` trait, in order to match the interface, the external functions of the contract must be defined in an implementation of this trait — which allows us to make sure that the implementation of the contract matches its interface.
id: Karena antarmuka kontrak didefinisikan sebagai trait `ISimpleStorage`, agar sesuai dengan antarmuka tersebut, fungsi eksternal dari kontrak harus didefinisikan dalam implementasi dari trait ini — yang memungkinkan kita memastikan bahwa implementasi kontrak sesuai dengan antarmuka tersebut.
ko: 계약 인터페이스가 `ISimpleStorage` 트레이트로 정의되었기 때문에 인터페이스와 일치하도록 계약의 외부 함수들은 이 트레이트의 구현에서 정의되어야 합니다. 이를 통해 계약의 구현이 인터페이스와 일치하는지 확인할 수 있습니다.

source: However, simply defining the functions in the implementation is not enough. The implementation block must be annotated with the `#[abi(embed_v0)]` attribute. This attribute exposes the functions defined in this implementation to the outside world — forget to add it and your functions will not be callable from the outside. All functions defined in a block marked as `#[abi(embed_v0)]` are consequently _public functions_.
ko: 그러나 구현에서 함수를 정의하는 것만으로는 충분하지 않습니다. 구현 블록은 `#[abi(embed_v0)]` 속성으로 주석 처리되어야 합니다. 이 속성은 이 구현에서 정의된 함수를 외부 세계에 노출시킵니다. 이 속성을 추가하지 않으면 함수가 외부에서 호출될 수 없습니다. `#[abi(embed_v0)]`로 표시된 블록에 정의된 모든 함수는 결과적으로 _공개 함수 _입니다.
