Repository: cairo-book/cairo-book
Catalog: po/*.po
Languages: es, id, ko, zh_cn

source: When `PartialEq` is derived on structs, two instances are equal only if all fields are equal, and the instances are not equal if any fields are not equal. When derived on enums, each variant is equal to itself and not equal to the other variants.
es: Cuando `PartialEq` se deriva en structs, dos instancias son iguales sólo si todos los campos son iguales, y las instancias no son iguales si algún campo no lo es. Cuando se deriva en enums, cada variante es igual a sí misma y no a las demás variantes.
id: Ketika `PartialEq` di-derive pada struktur, dua instansi dianggap sama hanya jika semua bidangnya sama, dan instansi dianggap tidak sama jika ada bidang yang tidak sama. Ketika di-derive pada enumerasi, setiap varian dianggap sama dengan dirinya sendiri dan tidak sama dengan varian lainnya.
ko: `PartialEq`가 구조체에 파생될 때 두 인스턴스는 모든 필드가 동일한 경우에만 동일하며, 어떤 필드가 동일하지 않은 경우에는 인스턴스가 동일하지 않습니다. 열거형에 파생될 때 각 변형은 자신과 동일하며 다른 변형과는 동일하지 않습니다.
zh_cn: 当`PartialEq`在结构上派生时，只有当所有字段都相等时，两个实例才相等，如果任何字段不相等，实例就不相等。当在枚举上派生时，每一个成员都和其自身相等，且和其他成员都不相等。

source: The `PartialEq` trait is required, for example, with the use of the `assert_eq!` macro, which needs to be able to compare two instances of a type for equality.
ko: `PartialEq` 트레이트는 예를 들어 `assert_eq!` 매크로를 사용할 때 필요합니다. 이 매크로는 두 인스턴스를 동등성을 비교할 수 있어야 합니다.

source: Clone and Copy for Duplicating Values
id: Clone dam Copy untuk Duplicating Values
ko: 값을 복제하고 복사하는 것에 대한 클론과 복사

source: The `Clone` trait provides the functionality to explicitly create a deep copy of a value.
es: El trait `Clone` proporciona la funcionalidad de crear explícitamente una copia profunda de un valor.
id: Trait `Clone` menyediakan fungsionalitas untuk secara eksplisit membuat salinan mendalam dari suatu nilai.
ko: `Clone` 트레이트는 값의 깊은 복사를 명시적으로 생성하는 기능을 제공합니다.
zh_cn: `Clone` trait 提供了明确创建一个值的深度拷贝的功能。

source: Deriving `Clone` implements the `clone` method, which, in turn, calls clone on each of the type's components. This means all the fields or values in the type must also implement `Clone` to derive `Clone`.
es: Derivar `Clone` implementa el método `clone`, que, a su vez, llama a clone en cada uno de los componentes del tipo. Esto significa que todos los campos o valores del tipo también deben implementar `Clone` para derivar `Clone`.
id: Menggunakan `Clone` mengimplementasikan metode `clone`, yang pada gilirannya, memanggil clone pada setiap komponen tipe tersebut. Ini berarti semua bidang atau nilai dalam tipe tersebut juga harus mengimplementasikan `Clone` untuk mendapatkan `Clone`.
ko: `Clone`를 파생하는 것은 `clone` 메서드를 구현하는 것을 의미하며, 이 메서드는 차례로 해당 유형의 각 구성 요소에 대해 clone을 호출합니다. 이는 유형의 모든 필드나 값도 `Clone`을 구현해야 한다는 것을 의미합니다.
zh_cn: 派生 `Clone` 实现了 `clone` 方法，其为整个的类型实现时，在类型的每一部分上调用了`clone` 方法。这意味着类型中所有字段或值也必须实现了 `Clone`，这样才能够派生 `Clone`。

source: The `Copy` trait allows for the duplication of values. You can derive `Copy` on any type whose parts all implement `Copy`.
es: El trait `Copy` permite la duplicación de valores. Puedes derivar `Copy` de cualquier tipo cuyas partes implementen `Copy`.
id: Trait `Copy` memungkinkan untuk duplikasi nilai. Anda dapat meng-derive `Copy` pada setiap tipe di mana semua bagian implementasikan `Copy`.
ko: `Copy` 트레이트는 값의 복제를 허용합니다. `Copy`를 어떤 타입에도 파생시킬 수 있으며, 해당 타입의 모든 부분이 `Copy`를 구현하는 경우입니다.
zh_cn: `Copy` trait 允许你复制值而不需要额外的代码。你可以在任何部分都实现了`Copy`的类型上派生`Copy`。

source: // Copy Trait prevents firs_struct from moving into second_struct
ko: // Copy Trait은 firs_struct가 second_struct로 이동되는 것을 방지합니다.

source: Serializing with Serde
id: Serialisasi dengan Serde
ko: Serde를 사용하여 직렬화하기

source: `Serde` provides trait implementations for `serialize` and `deserialize` functions for data structures defined in your crate. It allows you to transform your structure into an array (or the opposite).
es: `Serde` proporciona implementaciones trait para las funciones `serialize` y `deserialize` para estructuras de datos definidas en tu crate. Te permite transformar tu estructura en un array (o lo contrario).
id: `Serde` menyediakan implementasi trait untuk fungsi `serialize` dan `deserialize` untuk struktur data yang didefinisikan dalam kerangka kerja Anda. Ini memungkinkan Anda mengubah struktur Anda menjadi sebuah array (atau sebaliknya).
ko: `Serde`는 크레이트에서 정의된 데이터 구조에 대한 `serialize` 및 `deserialize` 함수의 트레이트 구현을 제공합니다. 이를 통해 구조체를 배열로 변환하거나 그 반대로 변환할 수 있습니다.
zh_cn: `Serde`为你的crate中定义的数据结构提供`serialize`和`deserialize`函数的trait实现。它允许你将你的结构体转化为数组（或相反）。

source: Output:
ko: 출력:
zh_cn: 输出:

source: 'c'
ko: 'c' -> '씨'

source: We can see here that our struct A has been serialized into the output array.
es: Podemos ver aquí que nuestra estructura A ha sido serializada en el array de salida.
id: Dapat kita lihat di sini bahwa struktur A kita telah diserialkan ke dalam array keluaran.
ko: 우리는 여기서 우리의 구조체 A가 출력 배열로 직렬화되었음을 볼 수 있습니다.
zh_cn: 我们在这里可以看到，我们的结构体A已经被序列化到输出数组中。

source: Also, we can use `deserialize` function to convert the serialized array back into our A struct.
es: Además, podemos utilizar la función `deserialize` para convertir el array serializado de nuevo en nuestra estructura A.
id: Selain itu, kita dapat menggunakan fungsi `deserialize` untuk mengonversi kembali array yang diserialkan menjadi struktur A kita.
ko: 또한, 우리는 `deserialize` 함수를 사용하여 직렬화된 배열을 다시 A 구조체로 변환할 수 있습니다.
zh_cn: 另外，我们可以使用`deserialize`函数将序列化的数组转换回我们的结构体A。

source: Here we are converting a serialized array span back to the struct A. `deserialize` returns an `Option` so we need to unwrap it. When using deserialize we also need to specify the type we want to deserialize into.
es: Aquí estamos convirtiendo un array span serializado de nuevo a la estructura A. `deserialize` devuelve una `Option` por lo que necesitamos desenvolverla. Cuando usamos deserialize también necesitamos especificar el tipo al que queremos deserializar.
id: Di sini kita mengonversi kembali rentang array yang telah diserialkan menjadi struktur A. `deserialize` mengembalikan `Option` sehingga kita perlu membukanya. Saat menggunakan deserialize, kita juga perlu menentukan jenis yang ingin kita deserialkan.
ko: 여기에서는 직렬화된 배열 span을 구조체 A로 다시 변환하는 중입니다. `deserialize`는 `Option`을 반환하기 때문에 언래핑이 필요합니다. deserialize를 사용할 때는 또한 어떤 유형으로 역직렬화할지 지정해주어야 합니다.
zh_cn: 这里我们要把一个序列化的数组span转换回结构体A。`deserialize`返回一个`Option`，所以我们需要把它解包。当使用deserialize时，我们还需要指定我们想要反序列化的类型。

source: Drop and Destruct
ko: 버리고 파괴하다

source: When moving out of scope, variables need to be moved first. This is where the `Drop` trait intervenes. You can find more details about its usage [here](ch04-01-what-is-ownership.md#the-drop-trait).
id: Ketika keluar dari ruang lingkup, variabel perlu dipindahkan terlebih dahulu. Di sinilah trait `Drop` berperan. Anda dapat menemukan lebih banyak detail tentang penggunaannya [di sini](ch04-01-what-is-ownership.md#the-drop-trait).
ko: 변수가 범위를 벗어날 때는 먼저 변수를 이동해야 합니다. 이것이 `Drop` 트레이트가 개입하는 곳입니다. 그 사용에 대한 자세한 내용은 [여기](ch04-01-what-is-ownership.md#the-drop-trait)에서 확인할 수 있습니다.
zh_cn: 当离开作用域时，需要先移动变量。这就是 `Drop` trait起作用的地方。你可以在[这里](ch04-01-what-is-ownership.md#the-drop-trait)找到更多关于它的用法的细节。

source: Moreover Dictionary need to be squashed before going out of scope. Calling manually the `squash` method on each of them can be quickly redundant. `Destruct` trait allows Dictionaries to be automatically squashed when they get out of scope. You can also find more information about `Destruct` [here](ch04-01-what-is-ownership.md#the-destruct-trait).
id: Selain itu, `Dictionary` perlu di-"squash" sebelum keluar dari ruang lingkup. Memanggil metode `squash` secara manual pada masing-masing dari mereka dapat dengan cepat menjadi redundan. Trait `Destruct` memungkinkan `Dictionary` untuk secara otomatis di-"squash" saat keluar dari ruang lingkup. Anda juga dapat menemukan informasi lebih lanjut tentang `Destruct` [di sini](ch04-01-what-is-ownership.md#the-destruct-trait).
ko: 게다가 사전은 범위를 벗어나기 전에 압축되어야 합니다. 각각에 수동으로 `squash` 메서드를 호출하는 것은 빠르게 중복될 수 있습니다. `Destruct` 트레이트는 사전이 범위를 벗어날 때 자동으로 압축되도록 합니다. `Destruct`에 대한 자세한 정보는 [여기](ch04-01-what-is-ownership.md#the-destruct-trait)에서 찾을 수 있습니다.
zh_cn: 此外，字典在离开作用域之前需要被squash（压缩）。在每个字典上手动调用`squash`方法很快就不再是必须操作。`Destruct` 特性允许字典在超出范围时被自动压缩。你也可以在[这里](ch04-01-what-is-ownership.md#the-destruct-trait) 找到更多关于`Destruct`的信息。

source: Store
ko: 상점

source: Storing a user-defined struct in a storage variable within a Starknet contract requires the `Store` trait to be implemented for this type. You can automatically derive the `store` trait for all structs that do not contain complex types like Dictionaries or Arrays.
id: Menyimpan struktur yang ditentukan pengguna dalam variabel penyimpanan dalam kontrak Starknet memerlukan trait `Store` untuk diimplementasikan pada tipe ini. Anda dapat secara otomatis mendapatkan trait `store` untuk semua struktur yang tidak mengandung tipe kompleks seperti Dictionary atau Array.
ko: Starknet 계약 내에서 사용자 정의 구조체를 저장 변수에 저장하려면 해당 유형에 대해 `Store` 특성이 구현되어야 합니다. 딕셔너리나 배열과 같은 복잡한 유형을 포함하지 않는 모든 구조체에 대해 `store` 특성을 자동으로 파생시킬 수 있습니다.
zh_cn: 在Starknet合约中的存储变量中存储用户定义的结构体需要为该类型实现 `Store` trait 。您可以为所有不包含字典或数组等复杂类型的结构体自动派生 `Store` trait 。

source: Here we demonstrate the implementation of a `struct A` that derives the Store trait. This `struct A` is subsequently used as a storage variable in the contract.
id: Berikut adalah implementasi dari `struct A` yang mendapatkan trait `Store`. `struct A` ini kemudian digunakan sebagai variabel penyimpanan dalam kontrak.
ko: 여기에서는 Store 특성을 파생하는 'struct A'의 구현을 보여줍니다. 이 'struct A'는 이후 계약에서 저장 변수로 사용됩니다.

source: PartialOrd and Ord for Ordering Comparisons
id: PartialOrd dan Ord untuk Perbandingan Pemesanan
ko: 부분 순서 및 순서를 위한 순서 비교

source: In addition to the `PartialEq` trait, the standard library also provides the `PartialOrd` and `Ord` traits to compare values for ordering.
id: Selain trait `PartialEq`, pustaka standar juga menyediakan trait `PartialOrd` dan `Ord` untuk membandingkan nilai untuk pengurutan.
ko: 표준 라이브러리는 `PartialEq` 트레이트 외에도 값의 순서를 비교하기 위한 `PartialOrd` 및 `Ord` 트레이트를 제공합니다.
zh_cn: 除了 `PartialEq` trait，标准库还提供了 `PartialOrd` 和 `Ord` trait，用于值排序中的比较。

source: The `PartialOrd` trait allows for comparison between instances of a type for ordering, thereby enabling the \<, \<=, >, and >= operators.
id: Trait `PartialOrd` memungkinkan perbandingan antara instans suatu tipe untuk pengurutan, sehingga memungkinkan operator \<, \<=, >, dan >=.
ko: `PartialOrd` 트레이트는 유형의 인스턴스 간의 비교를 허용하여 \<, \<=, >, 그리고 >= 연산자를 가능하게 합니다.

source: When `PartialOrd` is derived on structs, two instances are ordered by comparing each field in turn.
id: Ketika `PartialOrd` di-derive pada struktur, dua instansi diurutkan dengan membandingkan setiap bidang secara berurutan.
ko: `PartialOrd`가 구조체에 파생될 때 두 인스턴스는 각 필드를 차례대로 비교하여 정렬됩니다.
zh_cn: 当在结构体上派生 `PartialOrd` 时，两个实例通过依次比较每个字段来排序。

source: Appendix D - Useful Development Tools
id: Lampiran D - Alat Pengembangan yang Berguna
ko: 부록 D - 유용한 개발 도구

source: In this appendix, we talk about some useful development tools that the Cairo project provides. We’ll look at automatic formatting, quick ways to apply warning fixes, a linter, and integrating with IDEs.
id: Di lampiran ini, kita akan membahas beberapa alat pengembangan yang berguna yang disediakan oleh proyek Cairo. Kita akan melihat pemformatan otomatis, cara cepat untuk menerapkan perbaikan peringatan, linter, dan integrasi dengan IDE.
ko: 본 부록에서는 카이로 프로젝트에서 제공하는 몇 가지 유용한 개발 도구에 대해 이야기합니다. 자동 서식 지정, 경고 수정을 쉽게 적용하는 빠른 방법, 린터 및 IDE 통합을 살펴볼 것입니다.

source: Automatic Formatting with `scarb fmt`
id: Pemformatan otomatis dapat dilakukan dengan menggunakan perintah`scarb fmt`
ko: `scarb fmt`를 사용한 자동 서식 지정

source: Scarb projects can be formatted using the `scarb fmt` command. If you're using the cairo binaries directly, you can run `cairo-format` instead. Many collaborative projects use `scarb fmt` to prevent arguments about which style to use when writing Cairo: everyone formats their code using the tool.
id: Proyek-proyek Scarb dapat diformat menggunakan perintah `scarb fmt`. Jika Anda menggunakan biner Cairo secara langsung, Anda dapat menjalankan `cairo-format` sebagai pengganti. Banyak proyek kolaboratif menggunakan `scarb fmt` untuk mencegah perdebatan tentang gaya penulisan kode: setiap orang memformat kode mereka menggunakan alat ini.
ko: Scarb 프로젝트는 `scarb fmt` 명령을 사용하여 형식을 지정할 수 있습니다. 만약 cairo 이진 파일을 직접 사용 중이라면 `cairo-format`을 대신 실행할 수 있습니다. 많은 협업 프로젝트에서는 Cairo를 작성할 때 어떤 스타일을 사용할지에 대한 논쟁을 방지하기 위해 `scarb fmt`를 사용합니다: 모든 사람은 이 도구를 사용하여 코드를 형식화합니다.

source: To format any Cairo project, enter the following:
es: Para formatear cualquier proyecto de Cairo, introduce lo siguiente:
id: Untuk memformat proyek Cairo apa pun, masukkan perintah berikut:
ko: 모든 카이로 프로젝트를 포맷하려면 다음을 입력하십시오:
zh_cn: 要格式化任何Cairo项目，请输入以下命令：

source: IDE Integration Using `cairo-language-server`
id: Integrasi IDE Menggunakan `cairo-language-server`
ko: `cairo-language-server`를 사용한 IDE 통합

source: To help IDE integration, the Cairo community recommends using the [`cairo-language-server`](https://github.com/starkware-libs/cairo/tree/main/crates/cairo-lang-language-server)
id: Untuk membantu integrasi IDE, komunitas Cairo menyarankan penggunaan [`cairo-language-server`](https://github.com/starkware-libs/cairo/tree/main/crates/cairo-lang-language-server)
ko: IDE 통합을 돕기 위해, 카이로 커뮤니티는 [`cairo-language-server`](https://github.com/starkware-libs/cairo/tree/main/crates/cairo-lang-language-server)를 사용하는 것을 권장합니다.

source: . This tool is a set of compiler-centric utilities that speaks the [Language Server Protocol](http://langserver.org/)
id: . Alat ini adalah kumpulan utilitas berorientasi kompilator yang berbicara dengan [Language Server Protocol](http://langserver.org/)
ko: 이 도구는 [Language Server Protocol](http://langserver.org/)를 지원하는 컴파일러 중심의 유틸리티 세트입니다.

source: , which is a specification for IDEs and programming languages to communicate with each other. Different clients can use `cairo-language-server`, such as [the Cairo extension for Visual Studio Code](https://marketplace.visualstudio.com/items?itemName=starkware.cairo1).
id: , yang merupakan spesifikasi untuk IDE dan bahasa pemrograman berkomunikasi satu sama lain. Klien yang berbeda dapat menggunakan `cairo-language-server`, seperti [ekstensi Cairo untuk Visual Studio Code](https://marketplace.visualstudio.com/items?itemName=starkware.cairo1).
ko: 다른 클라이언트들은 `cairo-language-server`를 사용할 수 있습니다. 예를 들어, [Visual Studio Code용 카이로 익스텐션](https://marketplace.visualstudio.com/items?itemName=starkware.cairo1)과 같은 것들이 있습니다.

source: Visit the `vscode-cairo` [page](https://marketplace.visualstudio.com/items?itemName=starkware.cairo1)
id: Kunjungi halaman `vscode-cairo` [di sini](https://marketplace.visualstudio.com/items?itemName=starkware.cairo1)
ko: `vscode-cairo` [페이지](https://marketplace.visualstudio.com/items?itemName=starkware.cairo1)을 방문하세요.

source: to install it on VSCode. You will get abilities such as autocompletion, jump to definition, and inline errors.
id: untuk menginstalnya di VSCode. Anda akan mendapatkan kemampuan seperti autokomplet, lompat ke definisi, dan kesalahan di baris.
ko: VSCode에 설치하십시오. 자동완성, 정의로 이동 및 인라인 오류와 같은 기능을 얻을 수 있습니다.

source: Note: If you have Scarb installed, it should work out of the box with the Cairo VSCode extension, without a manual installation of the language server.
id: Catatan: Jika Anda telah menginstal Scarb, seharusnya bekerja tanpa masalah dengan ekstensi Cairo untuk VSCode, tanpa instalasi manual server bahasa.
ko: 참고: Scarb를 설치한 경우, Cairo VSCode 확장 프로그램을 수동으로 언어 서버를 설치하지 않고도 즉시 사용할 수 있어야 합니다.

source: Appendix E - Common Types & Traits and the Cairo Prelude
id: Lampiran E - Jenis dan Trait Umum serta Prelude Cairo
ko: 부록 E - 일반 유형 및 특성 및 카이로 서곡

source: Prelude
ko: 서론

source: The Cairo prelude is a collection of commonly used modules, functions, data types, and traits that are automatically brought into scope of every module in a Cairo crate without needing explicit import statements. Cairo's prelude provides the basic building blocks developers need to start Cairo programs and writing smart contracts.
id: Prelude Cairo adalah kumpulan modul, fungsi, jenis data, dan trait yang umum digunakan yang secara otomatis dimasukkan ke dalam cakupan setiap modul dalam kerangka kerja Cairo tanpa perlu pernyataan impor eksplisit. Prelude Cairo menyediakan blok bangunan dasar yang dibutuhkan pengembang untuk memulai program Cairo dan menulis kontrak pintar.
ko: 카이로 프렐류드는 명시적으로 가져오기 문을 필요로하지 않고 카이로 크레이트의 모든 모듈의 범위로 자동으로 가져오는 일반적으로 사용되는 모듈, 함수, 데이터 유형 및 특성의 모음입니다. 카이로의 프렐류드는 개발자가 카이로 프로그램을 시작하고 스마트 계약을 작성하는 데 필요한 기본 구성 요소를 제공합니다.

source: The core library prelude is defined in the [lib.cairo](https://github.com/starkware-libs/cairo/blob/v2.4.0/corelib/src/lib.cairo) file of the corelib crate and contains Cairo's primitive data types, traits, operators, and utility functions. This includes: Data types - felts, bools, arrays, dicts, etc. Traits - behaviors for arithmetic, comparison, serialization Operators - arithmetic, logical, bitwise Utility functions - helpers for arrays, maps, boxing, etc. The core library prelude delivers the fundamental programming constructs and operations needed for basic Cairo programs, without requiring the explicit import of elements. Since the core library prelude is automatically imported, its contents are available for use in any Cairo crate without explicit imports. This prevents repetition and provides a better devX. This is what allows you to use `ArrayTrait::append()` or the `Default` trait without bringing them explicitly into scope.
ko: 핵심 라이브러리 프리루드는 corelib 크레이트의 [lib.cairo](https://github.com/starkware-libs/cairo/blob/v2.4.0/corelib/src/lib.cairo) 파일에 정의되어 있으며, Cairo의 기본 데이터 유형, 특성, 연산자 및 유틸리티 함수를 포함합니다. 이에는 다음이 포함됩니다: 데이터 유형 - felts, bools, arrays, dicts 등 특성 - 산술, 비교, 직렬화를 위한 동작 연산자 - 산술, 논리, 비트 연산 유틸리티 함수 - 배열, 맵, 박싱 등을 위한 도우미 핵심 라이브러리 프리루드는 기본 Cairo 프로그램에 필요한 프로그래밍 구조와 연산을 제공하며, 요소의 명시적 가져오기를 필요로하지 않습니다. 핵심 라이브러리 프리루드가 자동으로 가져오기 때문에 해당 내용은 요소를 명시적으로 가져오지 않고도 모든 Cairo 크레이트에서 사용할 수 있습니다. 이는 반복을 방지하고 더 나은 개발 경험을 제공합니다. 이것은 `ArrayTrait::append()` 또는 `Default` 특성을 명시적으로 범위 내에 가져오지 않고도 사용할 수 있게 해줍니다.

source: You can choose which prelude to use. For example, adding `edition = "2023_10"` in `Scarb.toml` configuration file will load the prelude from October 2023, which is more restricted than the one from January 2023. The compiler currently exposes 2 different versions of the prelude:
ko: 어떤 프렐루드를 사용할지 선택할 수 있습니다. 예를 들어, `Scarb.toml` 구성 파일에 `edition = "2023_10"`를 추가하면 2023년 10월의 프렐루드를 로드하게 되며, 이는 2023년 1월의 것보다 더 제한적입니다. 현재 컴파일러는 프렐루드의 2가지 다른 버전을 노출하고 있습니다.

source: A general version, with a lot of traits that are made available, corresponding to `edition = "2023_01"`.
ko: 일반 버전으로, 사용 가능한 많은 특성을 갖춘 것에 해당하는 `edition = "2023_01"`입니다.

source: A restricted version, including the most essential traits needed for general cairo programming, corresponding to `edition = 2023_10`.
ko: 일반 카이로 프로그래밍에 필요한 가장 중요한 특성을 포함하는 제한된 버전은 `edition = 2023_10`에 해당합니다.

source: List of common types and traits
id: Daftar tipe data dan trait umum
ko: 일반적인 유형 및 특성 목록

source: The following section provides a brief overview of commonly used types and traits when developing Cairo programs. Most of these are included in the prelude and not required to be imported explicitly - but not all of them.
id: Bagian berikut memberikan gambaran singkat tentang jenis dan trait yang umum digunakan saat mengembangkan program Cairo. Sebagian besar dari ini sudah termasuk dalam prelude dan tidak perlu diimpor secara eksplisit - tetapi tidak semuanya.
ko: 다음 섹션은 카이로 프로그램을 개발할 때 일반적으로 사용되는 유형 및 특성에 대한 간단한 개요를 제공합니다. 이 중 대부분은 프렐루드에 포함되어 있어 명시적으로 가져올 필요가 없지만 모두가 그렇지는 않습니다.

source: Import
ko: 수입

source: Path
ko: 경로

source: Usage
ko: 사용법

source: `OptionTrait`
ko: 옵션 트레이트

source: `core::option::OptionTrait`
ko: `core::option::OptionTrait` would be translated to `핵심::옵션::옵션트레이트` in Korean.

source: `OptionTrait<T>` defines a set of methods required to manipulate optional value.
ko: `OptionTrait<T>`은 선택적인 값을 조작하는 데 필요한 일련의 메서드를 정의합니다.

source: `ResultTrait`
ko: `ResultTrait` would be translated to `결과 특성` in Korean.

source: `core::result::ResultTrait`
ko: `core::result::ResultTrait` would be translated to `핵심::결과::결과트레이트` in Korean.

source: `ResultTrait<T, E>` Type for Starknet contract address, a value in the range \[0, 2 \*\* 251).
ko: `ResultTrait<T, E>` 유형은 Starknet 계약 주소를 나타내며, 값의 범위는 \[0, 2 \*\* 251)입니다.

source: `ContractAddress`
ko: 계약 주소

source: `starknet::ContractAddress`
ko: `starknet::ContractAddress` would be translated to `starknet::계약주소` in Korean.

source: `ContractAddress` is a type to represent the smart contract address
ko: `ContractAddress`는 스마트 계약 주소를 나타내는 유형입니다.

source: `ContractAddressZeroable`
ko: `ContractAddressZeroable` would be translated to `계약 주소 제로 가능` in Korean.

source: `ContractAddressZeroable` is the implementation of the trait `Zeroable` for the `ContractAddress` type. It is required to check whether a value of `t:ContractAddress` is zero or not.
ko: `ContractAddressZeroable`는 `Zeroable` 특성을 `ContractAddress` 유형에 대해 구현한 것입니다. `t:ContractAddress` 값이 0인지 아닌지 확인해야 합니다.

source: `contract_address_const`
ko: `contract_address_const` would be translated to `계약 주소 상수` in Korean.

source: The `contract_address_const!` it's a function that allows instantiating constant contract address values.
id: `contract_address_const!` adalah fungsi yang memungkinkan instansiasi nilai alamat kontrak konstan.
ko: `contract_address_const!`는 상수 계약 주소 값을 인스턴스화하는 기능입니다.

source: `Into`
ko: 들어가다

source: `Into<T>` is a trait used for conversion between types. If there is an implementation of Into\<T,S> for the types T and S, you can convert T into S.
id: `Into<T>` adalah trait yang digunakan untuk konversi antar tipe. Jika ada implementasi Into\<T, S> untuk tipe T dan S, Anda dapat mengonversi T menjadi S.
ko: `Into<T>`은 타입 간 변환에 사용되는 트레이트입니다. T와 S 타입에 대한 Into<T, S> 구현이 있다면, T를 S로 변환할 수 있습니다.

source: `TryInto<T>` is a trait used for conversion between types.If there is an implementation of TryInto\<T,S> for the types T and S, you can convert T into S.
id: `TryInto<T>` adalah trait yang digunakan untuk konversi antar tipe. Jika ada implementasi TryInto\<T, S> untuk tipe T dan S, Anda dapat mengonversi T menjadi S.
ko: `TryInto<T>`은 타입 간 변환에 사용되는 트레이트입니다. 만약 T와 S 타입에 대한 TryInto<T,S>의 구현이 있다면, T를 S로 변환할 수 있습니다.

source: `get_caller_address()` is a function that returns the address of the caller of the contract. It can be used to identify the caller of a contract function.
id: `get_caller_address()` adalah fungsi yang mengembalikan alamat pemanggil kontrak. Ini dapat digunakan untuk mengidentifikasi pemanggil fungsi kontrak.
ko: `get_caller_address()`는 계약 호출자의 주소를 반환하는 함수입니다. 이 함수는 계약 함수의 호출자를 식별하는 데 사용될 수 있습니다.

source: `get_contract_address()` is a function that returns the address of the current contract. It can be used to obtain the address of the contract being executed.
id: `get_contract_address()` adalah fungsi yang mengembalikan alamat kontrak saat ini. Ini dapat digunakan untuk mendapatkan alamat kontrak yang sedang dieksekusi.
ko: `get_contract_address()`는 현재 계약의 주소를 반환하는 함수입니다. 실행 중인 계약의 주소를 얻는 데 사용할 수 있습니다.
