Repository: cairo-book/cairo-book
Catalog: po/*.po
Languages: es, id, ko, zh_cn

source: When sending messages from Starknet to Ethereum, you will have to use the `send_message_to_l1` syscall in your Cairo contracts. This syscall allows you to send messages to the `StarknetMessaging` contract on L1. Unlike `L1->L2` messages, `L2->L1` messages must be consumed manually, which means that you will need your Solidity contract to call the `consumeMessageFromL2` function of the `StarknetMessaging` contract explicitly in order to consume the message.
id: Ketika mengirim pesan dari Starknet ke Ethereum, Anda harus menggunakan syscall `send_message_to_l1` dalam kontrak Cairo Anda. Syscall ini memungkinkan Anda untuk mengirim pesan ke kontrak `StarknetMessaging` di L1. Berbeda dengan pesan `L1->L2`, pesan `L2->L1` harus dikonsumsi secara manual, yang berarti bahwa Anda perlu agar kontrak Solidity Anda memanggil fungsi `consumeMessageFromL2` dari kontrak `StarknetMessaging` secara eksplisit untuk mengonsumsi pesan tersebut.
ko: 스타크넷에서 이더리움으로 메시지를 보낼 때, 카이로 계약에서 `send_message_to_l1` 시스콜을 사용해야 합니다. 이 시스콜을 사용하면 L1의 `StarknetMessaging` 계약으로 메시지를 보낼 수 있습니다. `L1->L2` 메시지와는 달리, `L2->L1` 메시지는 수동으로 소비해야 합니다. 즉, 소비하기 위해 솔리디티 계약에서 명시적으로 `StarknetMessaging` 계약의 `consumeMessageFromL2` 함수를 호출해야 합니다.
zh_cn: 当从Starknet发送消息到以太坊时，你将需要在Cairo合约中使用 `send_message_to_l1` 系统调用。该系统调用允许您向L1上的 `StarknetMessaging` 合约发送消息。与 `L1->L2` 消息不同的是，`L2->L1` 消息必须手动消耗，这意味着你的Solidity合约需要显式调用 `StarknetMessaging` 合约的 `consumeMessageFromL2` 函数来消耗消息。

source: To send a message from L2 to L1, what we would do on Starknet is:
id: Untuk mengirim pesan dari L2 ke L1, yang akan kita lakukan di Starknet adalah:
ko: L2에서 L1로 메시지를 보내려면 Starknet에서 우리가 할 일은 다음과 같습니다:
zh_cn: 要从 L2 向 L1 发送信息，我们在Starknet上要做的是：

source: // Note here, we "serialize" my_felt, as the payload must be // a `Span<felt252>`.
ko: 여기서 주목해야 할 점은 페이로드가 `Span<felt252>`여야 하므로 my_felt를 "직렬화"한다는 것입니다.

source: We simply build the payload and pass it, along with the L1 contract address, to the syscall function.
id: Kita hanya membangun payload dan meneruskannya, bersama dengan alamat kontrak L1, ke dalam fungsi syscall.
ko: 우리는 단순히 페이로드를 구축하고, L1 계약 주소와 함께 syscall 함수에 전달합니다.
zh_cn: 我们只需构建payload，并将其与 L1 合约地址一起传递给系统调用函数。

source: On L1, the important part is to build the same payload sent by the L2. Then you call `consumeMessageFromL2` in you Solidity contract by passing the L2 contract address and the payload. Please be aware that the L2 contract address expected by the `consumeMessageFromL2` is the address of the contract that sends the message on the L2 by calling `send_message_to_l1_syscall`.
ko: L1에서 중요한 부분은 L2에서 보낸 동일한 페이로드를 구축하는 것입니다. 그런 다음 L2 계약 주소와 페이로드를 전달하여 Solidity 계약에서 `consumeMessageFromL2`를 호출합니다. `consumeMessageFromL2`에서 예상하는 L2 계약 주소는 `send_message_to_l1_syscall`를 호출하여 L2에서 메시지를 보내는 계약의 주소입니다.

source: // You can use the message hash if you want here.
ko: 여기서 메시지 해시를 사용할 수 있습니다.

source: // We expect the payload to contain only a felt252 value (which is a uint256 in Solidity).
ko: 우리는 페이로드에는 felt252 값만 포함되어 있다고 예상합니다 (이는 Solidity에서 uint256입니다).

source: "Invalid payload"
ko: "잘못된 페이로드"

source: // From here, you can safely use `my_felt` as the message has been verified by StarknetMessaging.
ko: 여기서부터는 StarknetMessaging에 의해 메시지가 확인되었기 때문에 `my_felt`를 안전하게 사용할 수 있습니다.

source: "Invalid value"
ko: "잘못된 값"

source: As you can see, in this context we don't have to verify which contract from L2 is sending the message (as we do on the L2 to verify which contract from L1 is sending the message). But we are actually using the `consumeMessageFromL2` of the `StarknetCore` contract to validate the inputs (the contract address on L2 and the payload) to ensure we are only consuming valid messages.
ko: 보시다시피, 이 문맥에서는 L2의 어떤 계약이 메시지를 보내는지 확인할 필요가 없습니다(L1에서 메시지를 보내는 계약을 확인하는 것과 같이). 그러나 실제로 우리는 L2의 `StarknetCore` 계약의 `consumeMessageFromL2`를 사용하여 입력(계약 주소 및 페이로드)를 유효한 메시지만 소비하도록 보장하기 위해 유효성을 검사합니다.

source: **Note:** The `consumeMessageFromL2` function of the `StarknetCore` contract is expected to be called from a Solidity contract, and not directly on the `StarknetCore` contract. The reason of that is because the `StarknetCore` contract is using `msg.sender` to actually compute the hash of the message. And this `msg.sender` must correspond to the `to_address` field that is given to the function `send_message_to_l1_syscall` that is called on Starknet.
ko: **참고:** `StarknetCore` 계약의 `consumeMessageFromL2` 함수는 Solidity 계약에서 호출되어야 하며, `StarknetCore` 계약에 직접 호출되어서는 안 됩니다. 그 이유는 `StarknetCore` 계약이 실제로 메시지의 해시를 계산하기 위해 `msg.sender`를 사용하고 있기 때문입니다. 그리고 이 `msg.sender`는 Starknet에서 호출되는 `send_message_to_l1_syscall` 함수에 주어진 `to_address` 필드와 일치해야 합니다.

source: It is important to remember that on L1 we are sending a payload of `uint256`, but the basic data type on Starknet is `felt252`; however, `felt252` are approximately 4 bits smaller than `uint256`. So we have to pay attention to the values contained in the payload of the messages we are sending. If, on L1, we build a message with values above the maximum `felt252`, the message will be stuck and never consumed on L2.
id: Penting untuk diingat bahwa di L1 kita mengirimkan payload berupa `uint256`, tetapi tipe data dasar pada Starknet adalah `felt252`; namun, `felt252` kurang lebih 4 bit lebih kecil daripada `uint256`. Oleh karena itu, kita harus memperhatikan nilai-nilai yang terdapat dalam payload pesan yang kita kirimkan. Jika, di L1, kita membangun sebuah pesan dengan nilai di atas maksimum dari `felt252`, pesan tersebut akan terjebak dan tidak pernah dikonsumsi di L2.
ko: L1에서는 `uint256`의 페이로드를 보내고 있지만, Starknet의 기본 데이터 유형은 `felt252`입니다. 그러나 `felt252`는 대략 `uint256`보다 4비트 작습니다. 따라서 우리는 보내는 메시지의 페이로드에 포함된 값에 주의해야 합니다. L1에서 `felt252`의 최대값을 초과하는 값을 가진 메시지를 작성하면, 해당 메시지는 L2에서 소비되지 않고 멈춰있게 될 것입니다.
zh_cn: 重要的是要记住，在L1上我们发送的有效载荷是 `uint256`，但是在Starknet上的基本数据类型是 `felt252`；然而，`felt252` 比 `uint256` 大约小4位。因此，我们必须注意我们发送的消息有效载荷中包含的值。如果在L1上构建的消息的值超过了最大的`felt252`，该消息将被卡住，无法在L2上被消耗。

source: Cairo Serde
ko: 카이로 세르드

source: Before sending messages between L1 and L2, you must remember that Starknet contracts, written in Cairo, can only understand serialized data. And serialized data is always an array of `felt252`. In Solidity we have `uint256` type, and `felt252` are approximately 4 bits smaller than `uint256`. So we have to pay attention to the values contained in the payload of the messages we are sending. If, on L1, we build a message with values above the maximum `felt252`, the message will be stuck and never consumed on L2.
id: Sebelum mengirim pesan antara L1 dan L2, Anda harus ingat bahwa kontrak Starknet, yang ditulis dalam bahasa Cairo, hanya dapat memahami data yang telah diserialisasi. Dan data yang diserialisasi selalu berupa larik `felt252`. Pada Solidity, kita memiliki tipe data `uint256`, dan `felt252` kurang lebih 4 bit lebih kecil daripada `uint256`. Oleh karena itu, kita harus memperhatikan nilai-nilai yang terdapat dalam payload dari pesan yang kita kirimkan. Jika, di L1, kita membangun sebuah pesan dengan nilai di atas maksimum `felt252`, pesan tersebut akan terjebak dan tidak pernah dikonsumsi di L2.
ko: L1과 L2 사이에 메시지를 보내기 전에, Cairo로 작성된 Starknet 계약이 직렬화된 데이터만 이해할 수 있다는 것을 기억해야 합니다. 직렬화된 데이터는 항상 `felt252` 배열입니다. Solidity에서는 `uint256` 유형이 있고, `felt252`는 대략 `uint256`보다 4비트 작습니다. 그래서 우리는 보내는 메시지의 페이로드에 포함된 값에 주의를 기울여야 합니다. L1에서 `felt252` 최대값을 초과하는 값을 포함한 메시지를 작성하면, 해당 메시지는 L2에서 소비되지 않고 멈춰있게 됩니다.

source: So for instance, an actual `uint256` value in Cairo is represented by a struct like:
id: Jadi misalnya, nilai `uint256` yang sebenarnya dalam Cairo direpresentasikan oleh sebuah struktur seperti:
ko: 예를 들어, 카이로에서 실제 `uint256` 값은 다음과 같은 구조체로 표현됩니다:
zh_cn: 例如，在Cairo中，一个实际的 `uint256` 值表示为类似以下的结构：

source: which will be serialized as **TWO** felts, one for the `low`, and one for the `high`. This means that to send only one `u256` to Cairo, you'll need to send a payload from L1 with **TWO** values.
ko: `low`와 `high` 각각을 나타내는 **두 개**의 펠트로 직렬화될 것입니다. 이는 카이로에 하나의 `u256`만 보내려면 L1에서 **두 개**의 값이 포함된 페이로드를 보내야 한다는 것을 의미합니다.
zh_cn: 这将被序列化为**两个** felts ，一个用于 `low` ，另一个用于 `high` 。这意味着要向Cairo发送一个 `u256`，你需要从L1发送一个包含**两个**值的 payload。

source: // Let's send the value 1 as a u256 in cairo: low = 1, high = 0.
ko: 카이로로 u256으로 값 1을 보내봅시다: low = 1, high = 0.

source: If you want to learn more about the messaging mechanism, you can visit the [Starknet documentation](https://docs.starknet.io/documentation/architecture_and_concepts/Network_Architecture/messaging-mechanism/).
id: Jika Anda ingin mempelajari lebih lanjut tentang mekanisme pengiriman pesan, Anda dapat mengunjungi [dokumentasi Starknet](https://docs.starknet.io/documentation/architecture_and_concepts/Network_Architecture/messaging-mechanism/).
ko: 메시징 메커니즘에 대해 더 알고 싶다면, [Starknet 문서](https://docs.starknet.io/documentation/architecture_and_concepts/Network_Architecture/messaging-mechanism/)를 방문할 수 있습니다.
zh_cn: 如果你想了解更多关于消息机制的信息，可以访问 [Starknet 文档](https://docs.starknet.io/documentation/architecture_and_concepts/Network_Architecture/messaging-mechanism/).

source: You can also find a [detailed guide here](https://github.com/glihm/starknet-messaging-dev) to test the messaging in local.
id: Anda juga dapat menemukan [panduan terperinci di sini](https://github.com/glihm/starknet-messaging-dev) untuk menguji mekanisme pengiriman pesan secara lokal.
ko: 로컬에서 메시징을 테스트하려면 [여기에 자세한 가이드](https://github.com/glihm/starknet-messaging-dev)를 찾을 수도 있습니다.
zh_cn: 你也可以在这里找到[详细的教程](https://github.com/glihm/starknet-messaging-dev) 来在本地测试消息传递。

source: When developing software, ensuring it functions as intended is usually straightforward. However, preventing unintended usage and vulnerabilities can be more challenging.
es: Cuando se desarrolla software, asegurarse de que funciona según lo previsto suele ser sencillo. Sin embargo, evitar usos no previstos y vulnerabilidades puede ser más difícil.
id: Ketika mengembangkan perangkat lunak, memastikan bahwa itu berfungsi sesuai yang diinginkan biasanya cukup mudah. Namun, mencegah penggunaan yang tidak disengaja dan kerentanan bisa lebih menantang.
ko: 소프트웨어를 개발할 때 의도한 대로 작동하는지 확인하는 것은 보통 간단합니다. 그러나 의도하지 않은 사용 및 취약점을 방지하는 것은 더 어려울 수 있습니다.
zh_cn: 在开发软件时，确保其按预期运行通常比较简单而直接。然而，防止非预期的使用和漏洞可能更具挑战性。

source: In smart contract development, security is very important. A single error can result in the loss of valuable assets or the improper functioning of certain features.
es: En el desarrollo de contratos inteligentes, la seguridad es muy importante. Un solo error puede provocar la pérdida de activos valiosos o el funcionamiento incorrecto de determinadas características.
id: Dalam pengembangan kontrak pintar (smart contract), keamanan sangat penting. Satu kesalahan saja dapat mengakibatkan hilangnya aset berharga atau tidak berfungsinya fitur-fitur tertentu dengan semestinya.
ko: 스마트 계약 개발에서 보안은 매우 중요합니다. 단 하나의 오류가 가치 있는 자산의 손실이나 특정 기능의 부정확한 작동으로 이어질 수 있습니다.
zh_cn: 在智能合约的开发中，安全性非常重要。仅仅一个简单的错误就可能导致宝贵资产的损失或某些功能的错误运行。

source: Smart contracts are executed in a public environment where anyone can examine the code and interact with it. Any errors or vulnerabilities in the code can be exploited by malicious actors.
es: Los Smart contracts se ejecutan en un entorno público en el que cualquiera puede examinar el código e interactuar con él. Cualquier error o vulnerabilidad en el código puede ser explotado por actores maliciosos.
id: Kontrak pintar dieksekusi di lingkungan publik di mana siapa pun dapat memeriksa kode dan berinteraksi dengannya. Setiap kesalahan atau kerentanan dalam kode dapat dimanfaatkan oleh pihak yang jahat.
ko: 스마트 계약은 누구나 코드를 검토하고 상호 작용할 수 있는 공개 환경에서 실행됩니다. 코드의 오류나 취약점은 악의적인 사용자에 의해 악용될 수 있습니다.
zh_cn: 智能合约在一个公开的环境中执行，任何人都可以检查代码并与之交互。代码中的任何错误或漏洞都可能被恶意行为者利用。

source: This chapter presents general recommendations for writing secure smart contracts. By incorporating these concepts during development, you can create robust and reliable smart contracts. This reduces the chance of unexpected behavior or vulnerabilities.
id: Bab ini menyajikan rekomendasi umum untuk menulis kontrak pintar yang aman. Dengan menerapkan konsep-konsep ini selama pengembangan, Anda dapat membuat kontrak pintar yang kokoh dan handal. Hal ini mengurangi kemungkinan terjadinya perilaku yang tidak terduga atau kerentanan.
ko: 이 장은 안전한 스마트 계약을 작성하기 위한 일반적인 권장 사항을 제시합니다. 이러한 개념을 개발 중에 통합함으로써 견고하고 신뢰할 수 있는 스마트 계약을 만들 수 있습니다. 이는 예기치 않은 동작이나 취약점 발생 가능성을 줄입니다.

source: Disclaimer
ko: 면책 조항

source: This chapter does not provide an exhaustive list of all possible security issues, and it does not guarantee that your contracts will be completely secure.
es: Este capítulo no proporciona una lista exhaustiva de todos los posibles problemas de seguridad, y no garantiza que sus contratos sean completamente seguros.
id: Bab ini tidak memberikan daftar lengkap dari semua masalah keamanan yang mungkin terjadi, dan tidak menjamin bahwa kontrak Anda akan benar-benar aman secara keseluruhan.
ko: 이 장은 모든 가능한 보안 문제의 철저한 목록을 제공하지 않으며, 귀하의 계약이 완전히 안전하다는 것을 보장하지 않습니다.
zh_cn: 本章并未提供所有可能的安全问题的详尽列表，也不能保证您的合约完全安全。

source: If you are developing smart contracts for production use, it is highly recommended to conduct external audits performed by security experts.
es: Si está desarrollando contratos inteligentes para su uso en producción, es muy recomendable llevar a cabo auditorías externas realizadas por expertos en seguridad.
id: Jika Anda sedang mengembangkan kontrak pintar untuk penggunaan produksi, sangat disarankan untuk melakukan audit eksternal yang dilakukan oleh para ahli keamanan.
ko: 생산용 스마트 계약을 개발 중이라면, 보안 전문가들에 의해 수행된 외부 감사를 실시하는 것이 강력히 권장됩니다.
zh_cn: 如果您正在开发用于实际生产环境中的智能合约，强烈建议由安全专家对其进行第三方审计。

source: Mindset
ko: 마음가짐

source: Cairo is a highly safe language inspired by Rust. It is designed in a way that force you to cover all possible cases. Security issues on Starknet mostly arise from the way smart contract flows are designed, not much from the language itself.
ko: 카이로는 러스트에 영감을 받은 매우 안전한 언어입니다. 가능한 모든 경우를 다루도록 설계되어 있습니다. 스타크넷의 보안 문제는 대부분 스마트 계약 플로우가 설계된 방식에서 발생하며, 언어 자체에서는 그렇게 많이 발생하지 않습니다.

source: Adopting a security mindset is the initial step in writing secure smart contracts. Try to always consider all possible scenarios when writing code.
es: Adoptar una mentalidad de seguridad es el paso inicial para escribir contratos inteligentes seguros. Intenta considerar siempre todos los escenarios posibles al escribir código.
id: Menerapkan pola pikir keamanan adalah langkah awal dalam menulis kontrak pintar yang aman. Cobalah untuk selalu mempertimbangkan semua skenario yang mungkin saat menulis kode.
ko: 보안 마인드셋을 채택하는 것은 안전한 스마트 계약을 작성하는 첫 번째 단계입니다. 코드를 작성할 때 항상 모든 가능한 시나리오를 고려하려고 노력해보세요.
zh_cn: 采用安全思维是编写安全智能合约的第一步。在编写代码时，尽量始终考虑所有可能的场景。

source: Viewing smart contract as Finite State Machines
id: Melihat smart contract sebagai Mesin Keadaan Terbatas
ko: 스마트 계약을 유한 상태 기계로 보기

source: Transactions in smart contracts are atomic, meaning they either succeed or fail without making any changes.
es: Las transacciones en los smart contracts son atómicas, lo que significa que tienen éxito o fracasan sin realizar ningún cambio.
id: Transaksi dalam smart contract bersifat atomik, artinya mereka entah berhasil atau gagal tanpa membuat perubahan apapun.
ko: 스마트 계약의 거래는 원자적이며, 어떠한 변경도 없이 성공하거나 실패합니다.
zh_cn: 智能合约中的交易是原子性的，这意味着它们要么成功，要么失败且不发生任何变化。

source: Think of smart contracts as state machines: they have a set of initial states defined by the constructor constraints, and external function represents a set of possible state transitions. A transaction is nothing more than a state transition.
es: Piense en los smart contracts como máquinas de estados: tienen un conjunto de estados iniciales definidos por las restricciones del constructor, y la función externa representa un conjunto de posibles transiciones de estado. Una transacción no es más que una transición de estado.
ko: 스마트 계약을 상태 기계로 생각해보세요: 그들은 생성자 제약 조건에 의해 정의된 초기 상태 집합을 가지고 있으며, 외부 함수는 가능한 상태 전이 집합을 나타냅니다. 거래는 단순히 상태 전이에 불과합니다.
zh_cn: 将智能合约视为状态机：它们有一组由构造函数约束定义的初始状态，而外部函数表示一组可能的状态转换。所谓交易也不过是一个状态转换。

source: The `assert!` or `panic!` macros can be used to validate conditions before performing specific actions. You can learn more about these on the [Unrecoverable Errors with panic](./ch10-01-unrecoverable-errors-with-panic.md) page.
ko: `assert!` 또는 `panic!` 매크로는 특정 작업을 수행하기 전에 조건을 확인하는 데 사용할 수 있습니다. 이에 대해 더 자세히 알아보려면 [패닉으로 처리할 수 없는 오류](./ch10-01-unrecoverable-errors-with-panic.md) 페이지를 참조하십시오.

source: These validations can include:
es: Estas validaciones pueden incluir:
id: Validasi tersebut dapat meliputi:
ko: 이러한 유효성 검사는 다음과 같을 수 있습니다:
zh_cn: 这些验证会包括：

source: Inputs provided by the caller
id: Masukan yang diberikan oleh pemanggil
ko: 통화자가 제공한 입력

source: Execution requirements
id: Persyaratan eksekusi
ko: 실행 요구 사항

source: Invariants (conditions that must always be true)
id: Invarian (kondisi yang harus selalu benar)
ko: 불변 조건 (항상 참이어야 하는 조건)

source: Return values from other function calls
id: Value return dari panggilan fungsi lain
ko: 다른 함수 호출로부터 반환 값을 받기

source: For example, you could use the `assert!` macro to validate that a user has enough funds to perform a withdraw transaction. If the condition is not met, the transaction will fail and the state of the contract will not change.
ko: 예를 들어, `assert!` 매크로를 사용하여 사용자가 출금 거래를 수행하기에 충분한 자금을 가지고 있는지 확인할 수 있습니다. 조건이 충족되지 않으면 거래가 실패하고 계약의 상태가 변경되지 않습니다.

source: "Insufficient funds"
ko: 자금 부족

source: Using these functions to check conditions adds constraints that help clearly define the boundaries of possible state transitions for each function in your smart contract. These checks ensure that the behavior of the contract stays within the expected limits.
es: El uso de estas funciones para comprobar condiciones añade restricciones que ayudan a definir claramente los límites de las posibles transiciones de estado para cada función de tu smart contract. Estas comprobaciones garantizan que el comportamiento del contrato se mantenga dentro de los límites esperados.
id: Menggunakan fungsi-fungsi ini untuk memeriksa kondisi menambahkan batasan-batasan yang membantu mendefinisikan dengan jelas batas-batas transisi keadaan yang mungkin untuk setiap fungsi dalam kontrak pintar Anda. Pemeriksaan ini memastikan bahwa perilaku kontrak tetap dalam batas-batas yang diharapkan.
ko: 이러한 함수를 사용하여 조건을 확인하면 스마트 계약의 각 함수에 대한 가능한 상태 전이의 경계를 명확히 정의하는 데 도움이 되는 제약 조건이 추가됩니다. 이러한 확인은 계약의 동작이 예상한 한도 내에 유지되도록 보장합니다.
zh_cn: 使用这些函数来进行条件检查，添加一���有助于清晰地定义智能合约中每个函数可能的状态转换的边界的约束。这些检查确保合约的行为保持在预期范围内。

source: Recommendations
ko: 추천사항

source: Checks Effects Interactions Pattern
id: Pola Periksa Efek Interaksi
ko: 체크 효과 상호작용 패턴

source: The Checks Effects Interactions pattern is a common design pattern used to prevent reentrancy attacks on Ethereum. While reentrancy is harder to achieve in Starknet, it is still recommended to use this pattern in your smart contracts.
es: El patrón Checks Effects Interactions es un patrón de diseño común utilizado para prevenir ataques de reentrada en Ethereum. Aunque la reentrada es más difícil de conseguir en Starknet, se recomienda utilizar este patrón en los smart contracts.
id: Pola Checks Effects Interactions adalah pola desain umum yang digunakan untuk mencegah serangan reentrancy di Ethereum. Meskipun reentrancy lebih sulit untuk dicapai di Starknet, disarankan tetap menggunakan pola ini dalam kontrak pintar Anda.
ko: 체크 이펙트 상호작용 패턴은 이더리움에서 재진입 공격을 방지하기 위해 사용되는 일반적인 디자인 패턴입니다. Starknet에서 재진입을 달성하기는 더 어렵지만 여전히 스마트 계약에서 이 패턴을 사용하는 것이 권장됩니다.
zh_cn: 检查-效果-交互模式是一种常见的设计模式，用于防止以太坊上的重入攻击。尽管在 Starknet 上更难实现重入攻击，但仍建议在智能合约中使用这种模式。

source: The pattern consists of following a specific order of operations in your functions:
es: El patrón consiste en seguir un orden específico de operaciones en sus funciones:
id: Pola ini terdiri dari mengikuti urutan operasi tertentu dalam fungsi-fungsi Anda:
ko: 패턴은 함수에서 특정 작업 순서를 따르는 것으로 구성됩니다:
zh_cn: 该模式由在函数中按照特定的操作顺序进行操作来实现：

source: **Checks**: Validate all conditions and inputs before performing any state changes.
id: **Checks**: Memvalidasi semua kondisi dan masukan sebelum melakukan perubahan keadaan apapun.
ko: **확인**: 상태 변경을 수행하기 전에 모든 조건과 입력을 확인하십시오.

source: **Effects**: Perform all state changes.
id: **Effects**: Melakukan semua perubahan keadaan.
ko: **효과**: 모든 상태 변경을 수행합니다.

source: **Interactions**: All external calls to other contracts should be made at the end of the function.
id: **Interactions**: Semua panggilan eksternal ke kontrak lain sebaiknya dilakukan di akhir fungsi.
ko: **상호 작용**: 다른 계약에 대한 모든 외부 호출은 함수의 끝에서 이루어져야 합니다.

source: Access control
ko: 접근 제어

source: Access control is the process of restricting access to certain features or resources. It is a common security mechanism used to prevent unauthorized access to sensitive information or actions. In smart contracts, some functions may often be restricted to specific users or roles.
es: El Control de Acceso es el proceso de restringir el acceso a determinadas funciones o recursos. Es un mecanismo de seguridad común utilizado para evitar el acceso no autorizado a información o acciones sensibles. En los contratos inteligentes, algunas funciones pueden a menudo estar restringidas a usuarios o roles específicos.
id: Kontrol akses adalah proses pembatasan akses terhadap fitur atau sumber daya tertentu. Ini adalah mekanisme keamanan umum yang digunakan untuk mencegah akses tidak sah terhadap informasi atau tindakan yang sensitif. Dalam kontrak pintar, beberapa fungsi mungkin sering dibatasi hanya untuk pengguna atau peran tertentu.
ko: 접근 제어는 특정 기능 또는 자원에 대한 액세스를 제한하는 프로세스입니다. 민감한 정보나 작업에 대한 무단 액세스를 방지하는 데 사용되는 일반적인 보안 메커니즘입니다. 스마트 계약에서는 특정 사용자나 역할에게 자주 특정 기능이 제한될 수 있습니다.
zh_cn: 访问控制是限制对特定功能或资源的访问的过程。它是一种常见的安全机制，用于防止未经授权的敏感信息访问或操作。在智能合约中，某些函数可能经常需要被限制为特定的用户或角色使用。

source: You can implement the access control pattern to easily manage permissions. This pattern consists of defining a set of roles and assigning them to specific users. Each function can then be restricted to specific roles.
es: Puede implementar el patrón de control de acceso para gestionar fácilmente los permisos. Este patrón consiste en definir un conjunto de funciones y asignarlas a usuarios específicos. Cada función puede entonces restringirse a roles específicos.
id: Anda dapat mengimplementasikan pola kontrol akses untuk dengan mudah mengelola izin. Pola ini terdiri dari menentukan serangkaian peran dan menugaskan peran tersebut kepada pengguna tertentu. Setiap fungsi kemudian dapat dibatasi hanya untuk peran-peran tertentu.
ko: 액세스 제어 패턴을 구현하여 권한을 쉽게 관리할 수 있습니다. 이 패턴은 일련의 역할을 정의하고 이를 특정 사용자에게 할당하는 것으로 구성됩니다. 각 기능은 그런 다음 특정 역할로 제한될 수 있습니다.
zh_cn: 您可以使用访问控制模式来轻松管理权限。该模式包括定义一组不同权限角色，并给不同用户分配对应的角色。每个函数都可限制为特定的角色才可访问。

source: // Role 'owner': only one address
ko: 역할 '소유자': 하나의 주소만

source: // Role 'role_a': a set of addresses
ko: 'role_a' 역할: 주소 집합

source: // Guard functions to check roles
ko: 역할을 확인하는 가드 함수들

source: "Not owner"
ko: "소유주가 아님"

source: "Not role A"
ko: "역할 A가 아님"

source: // You can easily combine guards to perform complex checks
ko: // 복잡한 검사를 수행하기 위해 가드를 쉽게 결합할 수 있습니다.

source: "Not allowed"
ko: "허용되지 않음"

source: // Functions to manage roles
ko: 역할을 관리하는 함수들

source: // You can now focus on the business logic of your contract // and reduce the complexity of your code by using guard functions
ko: 이제 계약의 비즈니스 로직에 집중할 수 있으며 가드 함수를 사용하여 코드의 복잡성을 줄일 수 있습니다.

source: Static analysis tool
ko: 정적 분석 도구
