Repository: cairo-book/cairo-book
Catalog: po/*.po
Languages: es, id, ko, zh_cn

source: When executed by the prover, it is similar to any other language. Because Cairo is virtualized, and because the operations were not specifically designed for maximum efficiency, this can lead to some performance overhead but it is not the most relevant part to optimize.
id: Ketika dieksekusi oleh pembuktian, ini mirip dengan bahasa lainnya. Karena Cairo tervirtualisasi, dan karena operasi-operasi tidak dirancang khusus untuk efisiensi maksimum, ini bisa menyebabkan beberapa overhead kinerja tetapi bukan bagian yang paling relevan untuk dioptimalkan.
ko: 프로버에 의해 실행될 때, 이는 다른 어떤 언어와도 유사합니다. 카이로가 가상화되어 있고, 연산이 최대 효율성을 위해 특별히 설계되지 않았기 때문에 일부 성능 오버헤드가 발생할 수 있지만 최적화할 가장 중요한 부분은 아닙니다.

source: When the generated proof is verified by a verifier, it is a bit different. This has to be as cheap as possible since it could potentially be verified on many very small machines. Fortunately verifying is faster than computing and Cairo has some unique advantages to improve it even more. A notable one is non-determinism. This is a topic you will cover in more detail later in this book, but the idea is that you can theoretically use a different algorithm for verifying than for computing. Currently, writing custom non-deterministic code is not supported for the developers, but the standard library leverages non-determinism for improved performance. For example sorting an array in Cairo costs the same price as copying it. Because the verifier doesn't sort the array, it just checks that it is sorted, which is cheaper.
id: Ketika bukti yang dihasilkan diverifikasi oleh verifikasi, ini sedikit berbeda. Ini harus seefisien mungkin karena dapat diverifikasi di banyak mesin yang sangat kecil. Untungnya, verifikasi lebih cepat daripada perhitungan dan Cairo memiliki beberapa keunggulan unik untuk meningkatkannya lebih jauh. Salah satunya adalah nondeterminisme. Ini adalah topik yang akan anda bahas lebih detail nanti dalam buku ini, tetapi ideanya adalah bahwa secara teoritis Anda dapat menggunakan algoritma yang berbeda untuk verifikasi daripada untuk komputasi. Saat ini, menulis kode nondeterministik khusus tidak didukung bagi para pengembang, tetapi perpustakaan standar memanfaatkan nondeterminisme untuk kinerja yang lebih baik. Sebagai contoh, mengurutkan sebuah larik di Cairo memiliki biaya yang sama dengan menyalinnya. Karena verifikator tidak mengurutkan larik tersebut, ia hanya memeriksa bahwa larik tersebut terurut, yang lebih murah.
ko: 생성된 증명이 검증자에 의해 검증될 때 약간 다릅니다. 이는 매우 작은 기계에서 잠재적으로 검증될 수 있기 때문에 가능한 한 저렴해야 합니다. 다행히 검증은 계산보다 빠릅니다. 그리고 카이로는 더 개선하기 위한 독특한 장점이 있습니다. 그 중 하나는 비결정론입니다. 이것은 이 책의 뒷부분에서 자세히 다룰 주제이지만, 아이디어는 이론적으로 검증을 위해 계산하는 것과는 다른 알고리즘을 사용할 수 있다는 것입니다. 현재 개발자들을 위해 사용자 정의 비결정론적 코드 작성은 지원되지 않지만 표준 라이브러리는 성능을 향상시키기 위해 비결정론을 활용합니다. 예를 들어, 카이로에서 배열을 정렬하는 것은 복사하는 것과 동일한 비용이 듭니다. 검증자는 배열을 정렬하지 않고 정렬되어 있는지만 확인하기 때문에 더 저렴합니다.

source: Another aspect that sets the language apart is its memory model. In Cairo, memory access is immutable, meaning that once a value is written to memory, it cannot be changed. Cairo 1 provides abstractions that help developers work with these constraints, but it does not fully simulate mutability. Therefore, developers must think carefully about how they manage memory and data structures in their programs to optimize performance.
es: Otro aspecto que diferencia al lenguaje es su modelo de memoria. En Cairo, el acceso a la memoria es inmutable, lo que significa que una vez que se escribe un valor en la memoria, no se puede cambiar. Cairo 1 proporciona abstracciones que ayudan a los desarrolladores a trabajar con estas limitaciones, pero no simula completamente la mutabilidad. Por lo tanto, los desarrolladores deben pensar cuidadosamente en cómo administran la memoria y las estructuras de datos en sus programas para optimizar el rendimiento.
id: Aspek lain yang membedakan bahasa ini adalah model memori yang digunakannya. Dalam Cairo, akses memori bersifat tidak berubah (immutable), yang berarti bahwa setelah suatu nilai ditulis ke dalam memori, nilai tersebut tidak dapat diubah. Cairo 1 menyediakan abstraksi-abstraksi yang membantu para pengembang dalam mengatasi kendala-kendala ini, namun tidak sepenuhnya mensimulasikan mutabilitas. Oleh karena itu, para pengembang harus memikirkan dengan hati-hati bagaimana mereka mengelola memori dan struktur data dalam program-program mereka untuk mengoptimalkan kinerja.
ko: 언어를 독특하게 만드는 또 다른 측면은 그 메모리 모델입니다. 카이로에서 메모리 접근은 불변(immutable)하며, 한 번 값이 메모리에 기록되면 변경할 수 없습니다. 카이로 1은 이러한 제약 조건과 함께 작업하는 개발자들을 돕는 추상화를 제공하지만, 완전한 가변성을 시뮬레이션하지는 않습니다. 따라서 개발자들은 프로그램에서 메모리와 데이터 구조를 어떻게 관리할지 신중히 생각하여 성능을 최적화해야 합니다.
zh_cn: 使该语言与众不同的另一个方面是其内存模型。在Cairo中，内存访问是不可改变的，这意味着一旦一个值被写入内存，它就不能被改变。Cairo 1提供了帮助开发者处理这些约束的抽象，但它并没有完全模拟可变性。因此，开发人员必须仔细考虑如何在他们的程序中管理内存和数据结构以优化性能。

source: References
id: Referensi
ko: 참고문헌

source: Cairo CPU Architecture: <https://eprint.iacr.org/2021/1063>
id: Arsitektur Cairo CPU: <https://eprint.iacr.org/2021/1063>
ko: 카이로 CPU 아키텍처: <https://eprint.iacr.org/2021/1063>

source: Cairo, Sierra and Casm: <https://medium.com/nethermind-eth/under-the-hood-of-cairo-1-0-exploring-sierra-7f32808421f5>
ko: 카이로, 시에라 및 카스민: <https://medium.com/nethermind-eth/under-the-hood-of-cairo-1-0-exploring-sierra-7f32808421f5>

source: State of non determinism: <https://twitter.com/PapiniShahar/status/1638203716535713798>
ko: 결정론적 상태: <https://twitter.com/PapiniShahar/status/1638203716535713798>

source: Let’s start your Cairo journey! There’s a lot to learn, but every journey starts somewhere. In this chapter, we’ll discuss:
ko: 카이로 여행을 시작해봅시다! 배울 것이 많지만 모든 여행은 어딘가에서 시작됩니다. 이 장에서는 다음을 논의할 것입니다:

source: Installing Scarb, which is Cairo's build toolchain and package manager, on Linux, macOS, and Windows.
ko: 리눅스, macOS 및 Windows에 Cairo의 빌드 도구 및 패키지 관리자 인 Scarb를 설치하는 중입니다.

source: Writing a program that prints `Hello, world!`.
ko: `Hello, world!`을 출력하는 프로그램을 작성합니다.

source: Using basic Scarb commands to create a project and execute a program.
ko: 기본 Scarb 명령을 사용하여 프로젝트를 생성하고 프로그램을 실행합니다.

source: Cairo can be installed by simply downloading [Scarb](https://docs.swmansion.com/scarb/docs). Scarb bundles the Cairo compiler and the Cairo language server together in an easy-to-install package so that you can start writing Cairo code right away.
id: Cairo dapat diinstal dengan cara mendownload [Scarb](https://docs.swmansion.com/scarb/docs). Scarb menggabungkan kompiler Cairo dan server bahasa Cairo secara bersamaan dalam paket instalasi yang mudah sehingga Anda dapat mulai menulis kode Cairo dengan cepat.
ko: 카이로는 [Scarb](https://docs.swmansion.com/scarb/docs)를 다운로드하여 간단히 설치할 수 있습니다. Scarb는 카이로 컴파일러와 카이로 언어 서버를 함께 묶어 쉽게 설치할 수 있는 패키지로 제공되어, 즉시 카이로 코드를 작성할 수 있습니다.
zh_cn: 只需下载 [Scarb](https://docs.swmansion.com/scarb/docs)，即可安装 Cairo。Scarb 将 Cairo 编译器和 Cairo 语言服务器捆绑在一个易于安装的软件包中，这样你就可以立即开始编写 Cairo 代码了。

source: Scarb is also Cairo's package manager and is heavily inspired by [Cargo](https://doc.rust-lang.org/cargo/), Rust’s build system and package manager.
id: Scarb juga merupakan pengelola paket Cairo yang sangat terinspirasi dari [Cargo](https://doc.rust-lang.org/cargo/), sistem pembangunan dan pengelola paket Rust.
ko: Scarb는 또한 카이로의 패키지 관리자이며 [Cargo](https://doc.rust-lang.org/cargo/)에 크게 영향을 받았습니다. Cargo는 러스트의 빌드 시스템 및 패키지 관리자입니다.
zh_cn: Scarb同样是Cairo的软件包管理器，在很大程度上受到[Cargo](https://doc.rust-lang.org/cargo/)的启发，Rust的构建系统和软件包管理器。

source: Scarb handles a lot of tasks for you, such as building your code (either pure Cairo or Starknet contracts), downloading the libraries your code depends on, building those libraries, and provides LSP support for the VSCode Cairo 1 extension.
es: Scarb se encarga de muchas tareas por ti, como construir tu código (ya sea en Cairo puro o contratos Starknet), descargar las bibliotecas en las que tu código depende, construir esas bibliotecas y proporcionar soporte LSP (Language Server Protocol) para la extensión de Cairo 1 en VSCode.
id: Scarb menangani banyak tugas untuk Anda, seperti membangun kode Anda (baik itu murni Cairo atau kontrak Starknet), mengunduh pustaka-pustaka yang diperlukan oleh kode Anda, membangun pustaka-pustaka tersebut, dan menyediakan dukungan LSP (Language Server Protocol) untuk ekstensi Cairo 1 pada VSCode.
ko: Scarb는 여러 작업을 대신 수행해 주며, 코드를 빌드하고(순수 Cairo 또는 Starknet 계약), 코드가 의존하는 라이브러리를 다운로드하고, 해당 라이브러리를 빌드하며, VSCode Cairo 1 확장 프로그램을 위한 LSP 지원을 제공합니다.
zh_cn: Scarb会为你处理很多任务，比如构建你的代码（纯Cairo或Starknet合约），为你下载你的代码所依赖的库并构建他们，以及为VSCode Cairo 1扩展提供LSP支持。

source: As you write more complex Cairo programs, you might add dependencies, and if you start a project using Scarb, managing external code and dependencies will be a lot easier to do.
id: Ketika Anda menulis program Cairo yang lebih kompleks, Anda mungkin akan menambahkan dependensi, dan jika Anda memulai sebuah proyek menggunakan Scarb, mengelola kode eksternal dan dependensi akan menjadi lebih mudah.
ko: 더 복잡한 카이로 프로그램을 작성할수록 종속성을 추가할 수 있으며, Scarb를 사용하여 프로젝트를 시작하면 외부 코드 및 종속성을 관리하는 것이 훨씬 쉬워질 것입니다.
zh_cn: 如果你使用 Scarb 启动项目，管理外部代码和依赖关系就会容易得多。

source: Let's start by installing Scarb.
es: Empecemos instalando Scarb.
id: Mari mulai dengan menginstal Scarb.
ko: Scarb를 설치하는 것으로 시작합시다.
zh_cn: 让我们从安装Scarb开始。

source: Installing Scarb
id: Menginstal Scarb
ko: Scarb 설치하기

source: Requirements
id: Persyaratan
ko: 요구 사항

source: Scarb requires a Git executable to be available in the `PATH` environment variable.
es: Scarb requiere un ejecutable Git disponible en la variable de entorno `PATH`.
id: Scarb memerlukan Git yang dapat dieksekusi agar tersedia dalam lingkungan variable `PATH`.
ko: Scarb는 `PATH` 환경 변수에 Git 실행 파일이 있어야 합니다.
zh_cn: Scarb需要`PATH`环境变量里有一个Git可执行文件。

source: To install Scarb, please refer to the [installation instructions](https://docs.swmansion.com/scarb/download). We strongly recommend that you install Scarb [via asdf](https://docs.swmansion.com/scarb/download.html#install-via-asdf), a CLI tool that can manage multiple language runtime versions on a per-project basis. This will ensure that the version of Scarb you use to work on a project always matches the one defined in the project settings, avoiding problems related to version mismatches.
ko: Scarb를 설치하려면 [설치 지침](https://docs.swmansion.com/scarb/download)을 참조하십시오. 우리는 여러 언어 런타임 버전을 프로젝트 단위로 관리할 수 있는 CLI 도구인 asdf를 통해 Scarb를 설치하는 것을 강력히 권장합니다. 이를 통해 프로젝트에서 사용하는 Scarb 버전이 항상 프로젝트 설정에 정의된 버전과 일치하도록 보장하여 버전 불일치로 인한 문제를 피할 수 있습니다. [via asdf로 설치하는 방법](https://docs.swmansion.com/scarb/download.html#install-via-asdf)

source: Please refer to the [asdf documentation](https://asdf-vm.com/guide/getting-started.html) to install all prerequisites.
ko: 모든 전제 조건을 설치하려면 [asdf 문서](https://asdf-vm.com/guide/getting-started.html)를 참조하십시오.

source: Once you have asdf installed locally, you can download Scarb plugin with the following command:
ko: 로컬에 asdf를 설치한 후에 다음 명령어로 Scarb 플러그인을 다운로드할 수 있습니다:

source: This will allow you to download specific versions:
ko: 이를 통해 특정 버전을 다운로드할 수 있습니다.

source: and set a global version:
ko: 그리고 전역 버전을 설정합니다:

source: Otherwise, you can simply run the following command in your terminal, and follow the onscreen instructions. This will install the latest stable release of Scarb.
ko: 그렇지 않으면 터미널에서 다음 명령어를 실행하고 화면 안내에 따르면 됩니다. 이렇게 하면 Scarb의 최신 안정 버전이 설치됩니다.

source: In both cases, you can verify installation by running the following command in a new terminal session, it should print both Scarb and Cairo language versions, e.g:
ko: 두 경우 모두 새 터미널 세션에서 다음 명령을 실행하여 설치를 확인할 수 있습니다. Scarb 및 Cairo 언어 버전이 모두 출력되어야 합니다. 예:

source: Installing the VSCode extension
id: Menginstall ekstensi VSCode
ko: VSCode 확장 프로그램 설치하기

source: Cairo has a VSCode extension that provides syntax highlighting, code completion, and other useful features. You can install it from the [VSCode Marketplace](https://marketplace.visualstudio.com/items?itemName=starkware.cairo1). Once installed, go into the extension settings, and make sure to tick the `Enable Language Server` and `Enable Scarb` options.
id: Cairo memiliki ekstensi VSCode yang menyediakan penyorotan sintaks, penyelesaian kode, dan fitur-fitur berguna lainnya. Anda dapat menginstalnya dari [VSCode Marketplace](https://marketplace.visualstudio.com/items?itemName=starkware.cairo1). Setelah terinstal, pergi ke pengaturan ekstensi, dan pastikan untuk mencentang opsi Enable Language Server dan Enable Scarb.
ko: 카이로에는 구문 강조, 코드 완성 및 기타 유용한 기능을 제공하는 VSCode 확장 프로그램이 있습니다. [VSCode Marketplace](https://marketplace.visualstudio.com/items?itemName=starkware.cairo1)에서 설치할 수 있습니다. 설치한 후에는 확장 프로그램 설정으로 이동하여 `Enable Language Server` 및 `Enable Scarb` 옵션을 선택해야 합니다.

source: Now that you’ve installed Cairo through Scarb, it’s time to write your first Cairo program. It’s traditional when learning a new language to write a little program that prints the text `Hello, world!` to the screen, so we’ll do the same here!
id: Sekarang bahwa Anda telah menginstal Cairo melalui Scarb, saatnya untuk menulis program Cairo pertama Anda. Adalah tradisi ketika belajar bahasa baru untuk menulis program kecil yang mencetak teks Hello, world! ke layar, jadi kita akan melakukan hal yang sama di sini!
ko: 이제 Scarb를 통해 Cairo를 설치했으니, 첫 번째 Cairo 프로그램을 작성할 시간입니다. 새로운 언어를 배울 때 전통적으로 화면에 `Hello, world!` 텍스트를 출력하는 작은 프로그램을 작성하는 것이 관행이므로, 여기서도 같은 작업을 할 것입니다!

source: Note: This book assumes basic familiarity with the command line. Cairo makes no specific demands about your editing or tooling or where your code lives, so if you prefer to use an integrated development environment (IDE) instead of the command line, feel free to use your favorite IDE. The Cairo team has developed a VSCode extension for the Cairo language that you can use to get the features from the language server and code highlighting. See [Appendix D] (appendix-04-useful-development-tools.md) for more details.
ko: 참고: 이 책은 명령줄에 대한 기본적인 이해를 전제로 합니다. 카이로는 편집 또는 도구 또는 코드가 위치하는 곳에 대해 구체적인 요구사항을 제시하지 않으므로 명령줄 대신 통합 개발 환경(IDE)을 사용하는 것을 선호한다면 마음껏 좋아하는 IDE를 사용하십시오. 카이로 팀은 카이로 언어용 VSCode 확장 프로그램을 개발했으며, 이를 사용하여 언어 서버 및 코드 하이라이팅 기능을 활용할 수 있습니다. 자세한 내용은 [부록 D](appendix-04-useful-development-tools.md)를 참조하십시오.

source: Creating a Project Directory
id: Membuat Direktori Proyek
ko: 프로젝트 디렉토리 만들기

source: You’ll start by making a directory to store your Cairo code. It doesn’t matter to Cairo where your code lives, but for the exercises and projects in this book, we suggest making a _cairo_projects_ directory in your home directory and keeping all your projects there.
id: Anda akan memulai dengan membuat direktori untuk menyimpan kode Cairo Anda. Tidak masalah bagi Cairo di mana kode Anda berada, tetapi untuk latihan dan proyek dalam buku ini, kami menyarankan untuk membuat direktori cairo_projects di direktori rumah Anda dan menyimpan semua proyek Anda di sana.
ko: 당신은 카이로 코드를 저장할 디렉토리를 만들며 시작할 것입니다. 카이로에게 코드가 어디에 위치해 있는지는 중요하지 않지만, 이 책의 연습과 프로젝트를 위해 우리는 홈 디렉토리에 _cairo_projects_ 디렉토리를 만들고 모든 프로젝트를 거기에 보관하는 것을 제안합니다.

source: Open a terminal and enter the following commands to make a _cairo_projects_ directory.
ko: 터미널을 열고 다음 명령어를 입력하여 _cairo_projects_ 디렉토리를 만드세요.

source: For Linux, macOS, and PowerShell on Windows, enter this:
es: Para Linux, macOS y PowerShell en Windows, introduce esto:
id: Untuk Linux, macOS, dan PowerShell di Windows, masukkan ini:
ko: 리눅스, macOS 및 Windows의 PowerShell을 위해 다음을 입력하십시오:
zh_cn: 对于Linux、macOS和Windows上的PowerShell，输入：

source: For Windows CMD, enter this:
es: Para Windows CMD, introduzca esto:
id: Untuk Windows CMD, enter this:
ko: Windows CMD를 위해 이것을 입력하십시오:
zh_cn: 对于Windows CMD，请输入以下内容：

source: Note: From now on, for each example shown in the book, we assume that you will be working from a Scarb project directory. If you are not using Scarb, and try to run the examples from a different directory, you might need to adjust the commands accordingly or create a Scarb project.
id: Catatan: Mulai dari sekarang, untuk setiap contoh yang ditunjukkan dalam buku ini, kami mengasumsikan bahwa Anda akan bekerja dari direktori proyek Scarb. Jika Anda tidak menggunakan Scarb, dan mencoba menjalankan contoh-contoh dari direktori yang berbeda, Anda mungkin perlu menyesuaikan perintah-perintahnya atau membuat proyek Scarb.
ko: 참고: 이제부터 책에 나온 각 예제에 대해, 당신이 Scarb 프로젝트 디렉토리에서 작업할 것을 가정합니다. Scarb를 사용하지 않고 다른 디렉토리에서 예제를 실행하려고 하는 경우, 명령을 조정하거나 Scarb 프로젝트를 만들어야 할 수도 있습니다.

source: Creating a Project with Scarb
id: Membuat Projek dengan Scarb
ko: Scarb로 프로젝트 만들기

source: Let’s create a new project using Scarb.
id: Mari membuat sebuah projek menggunakan Scarb.
ko: Scarb를 사용하여 새 프로젝트를 만들어 봅시다.
zh_cn: 让我们使用 Scarb 创建一个新项目。

source: Navigate to your _cairo_projects_ directory (or wherever you decided to store your code). Then run the following:
ko: _카이로_ 프로젝트 디렉토리(또는 코드를 저장하기로 결정한 위치)로 이동한 다음 다음을 실행하십시오.

source: It creates a new directory and project called `hello_world`. We’ve named our project `hello_world`, and Scarb creates its files in a directory of the same name.
id: Perintah tersebut akan membuat direktori dan proyek baru yang disebut `hello_world`. Kami telah memberi nama proyek kami `hello_world`, dan Scarb membuat file-filenya di dalam direktori dengan nama yang sama.
ko: 그러면 새 디렉토리와 `hello_world` 프로젝트를 생성합니다. 저희는 프로젝트를 `hello_world`로 명명했고, Scarb는 동일한이름의 디렉토리에 파일을 생성합니다.
zh_cn: 它创建了一个新的目录和项目，名为`hello_world`。我们把我们的项目命名为`hello_world`，因此Scarb会在同名的目录下创建它的文件。

source: Go into the `hello_world` directory with the command `cd hello_world`. You’ll see that Scarb has generated two files and one directory for us: a _Scarb.toml_ file and a _src_ directory with a _lib.cairo_ file inside.
ko: 명령어 `cd hello_world`를 사용하여 `hello_world` 디렉토리로 이동하십시오. Scarb가 우리를 위해 두 개의 파일과 하나의 디렉토리를 생성했음을 알 수 있습니다: _Scarb.toml_ 파일과 내부에 _lib.cairo_ 파일이 있는 _src_ 디렉토리가 있습니다.

source: It has also initialized a new Git repository along with a `.gitignore` file
es: También ha inicializado un nuevo repositorio Git junto con un archivo `.gitignore`
id: Scarb juga telah menginisialisasi repositori Git baru bersama dengan file `.gitignore`
ko: 새로운 Git 저장소를 초기화했으며 `.gitignore` 파일도 함께 생성했습니다.
zh_cn: 它还初始化了一个新的Git仓库和一个`.gitignore`文件

source: Note: Git is a common version control system. You can stop using version control system by using the `--no-vcs` flag. Run `scarb new -help` to see the available options.
ko: 참고: Git은 일반적인 버전 관리 시스템입니다. `--no-vcs` 플래그를 사용하여 버전 관리 시스템을 사용 중지할 수 있습니다. 사용 가능한 옵션을 보려면 `scarb new -help`를 실행하십시오.

source: Open _Scarb.toml_ in your text editor of choice. It should look similar to the code in Listing 1-2.
es: Abra _Scarb.toml_ en su editor de texto preferido. Debería parecerse al código del Listado 1-2.
id: Buka _Scarb.toml_ di editor teks pilihan Anda. Ini seharusnya terlihat mirip dengan kode pada Listing 1-2.
ko: 선호하는 텍스트 편집기에서 _Scarb.toml_을 엽니다. 이는 1-2 목록의 코드와 비슷하게 보일 것입니다.
zh_cn: 在你选择的文本编辑器中打开 _Scarb.toml_ 。它看起来应该与示例1-2中的代码相似。

source: Filename: Scarb.toml
ko: 파일 이름: Scarb.toml

source: ```toml [package] name = "hello_world" version = "0.1.0" edition = "2024_07" # See more keys and their definitions at https://docs.swmansion.com/scarb/docs/reference/manifest [dependencies] # foo = { path = "vendor/foo" } ```
ko: ```toml [package] name = "hello_world" version = "0.1.0" edition = "2024_07" # 더 많은 키와 그 정의를 보려면 https://docs.swmansion.com/scarb/docs/reference/manifest 를 참조하세요 [dependencies] # foo = { path = "vendor/foo" } ```

source: Listing 1-2: Contents of _Scarb.toml_ generated by `scarb new`
ko: 리스팅 1-2: `scarb new`로 생성된 _Scarb.toml_의 내용

source: This file is in the [TOML](https://toml.io/) (Tom’s Obvious, Minimal Language) format, which is Scarb’s configuration format.
es: Este archivo se encuentra en formato [TOML](https://toml.io/) (Tom’s Obvious, Minimal Language), que es el formato de configuración de Scarb.
id: File ini menggunakan format [TOML](https://toml.io/) (Tom’s Obvious, Minimal Language), yang mana merupakan format konfigurasi Scarb.
ko: 이 파일은 [TOML](https://toml.io/) (Tom's Obvious, Minimal Language) 형식으로 되어 있으며, 이는 Scarb의 구성 형식입니다.
zh_cn: 这个文件是[TOML](https://toml.io/)（Tom's Obvious, Minimal Language）的格式，是Scarb的配置文件格式。

source: The first line, `[package]`, is a section heading that indicates that the following statements are configuring a package. As we add more information to this file, we’ll add other sections.
es: La primera línea, `[package]`, es un encabezado de sección que indica que las siguientes sentencias están configurando un paquete. A medida que agreguemos más información a este archivo, agregaremos otras secciones.
id: Baris pertama, `[package]`, adalah judul bagian yang menunjukkan bahwa pernyataan berikut sedang mengonfigurasi sebuah paket. Saat kami menambahkan lebih banyak informasi ke file ini, kami akan menambahkan bagian lain.
ko: 첫 번째 줄인 `[package]`은 이후 문장들이 패키지를 설정하는 것을 나타내는 섹션 제목입니다. 이 파일에 더 많은 정보를 추가할수록 다른 섹션들을 추가할 것입니다.
zh_cn: 第一行，`[package]`，是一个章节标题，表示下面的语句是在配置一个包。随着我们向这个文件添加更多的信息，我们将添加其他章节。

source: The next three lines set the configuration information Scarb needs to compile your program: the name of the package and the version of Scarb to use, and the edition of the prelude to use. The prelude is the collection of the most commonly used items that are automatically imported into every Cairo program. You can learn more about the prelude in [Appendix E](./appendix-05-common-types-and-traits-and-cairo-prelude.md)
ko: 다음 세 줄은 Scarb가 프로그램을 컴파일하는 데 필요한 구성 정보를 설정합니다: 패키지의 이름 및 사용할 Scarb 버전, 그리고 사용할 프렐루드의 에디션입니다. 프렐루드는 모든 카이로 프로그램에 자동으로 가져오는 가장 일반적으로 사용되는 항목의 모음입니다. 프렐루드에 대해 더 알아보려면 [부록 E](./appendix-05-common-types-and-traits-and-cairo-prelude.md)를 참조하십시오.

source: The last line, `[dependencies]`, is the start of a section for you to list any of your project’s dependencies. In Cairo, packages of code are referred to as crates. We won’t need any other crates for this project.
es: La última línea, `[dependencies]`, es el comienzo de una sección para que puedas listar cualquiera de las dependencias de tu proyecto. En Cairo, los paquetes de código se conocen como crates. No necesitaremos ninguna otra crate para este proyecto.
id: Baris terakhir, `[dependencies]`, adalah awal dari bagian di mana Anda dapat mencantumkan dependensi-dependensi dari proyek Anda. Dalam Cairo, paket-paket kode disebut sebagai crates. Kita tidak akan memerlukan crates lain untuk proyek ini.
ko: 마지막 줄인 `[dependencies]`는 프로젝트 의존성을 나열할 섹션의 시작입니다. 카이로에서 코드 패키지는 크레이트로 참조됩니다. 이 프로젝트에는 다른 크레이트가 필요하지 않을 것입니다.
zh_cn: 最后一行，`[dependencies]`，是一个章节的开始，该章节供你列出你的项目的所有依赖。在Cairo中，代码包被称为crate。在这个项目中，我们不需要任何其他的crate。

source: Note: If you're building contracts for Starknet, you will need to add the `starknet` dependency as mentioned in the [Scarb documentation](https://docs.swmansion.com/scarb/docs/extensions/starknet/starknet-package.html).
id: Catatan: Jika Anda sedang membangun kontrak untuk Starknet, Anda perlu menambahkan dependensi starknet sebagaimana disebutkan dalam [dokumentasi Scarb](https://docs.swmansion.com/scarb/docs/extensions/starknet/starknet-package.html).
ko: 참고: Starknet을 위한 계약을 작성하는 경우, [Scarb 문서](https://docs.swmansion.com/scarb/docs/extensions/starknet/starknet-package.html)에 언급된대로 `starknet` 종속성을 추가해야 합니다.

source: The other file created by Scarb is _src/lib.cairo_, let's delete all the content and put in the following content, we will explain the reason later.
ko: Scarb에 의해 생성된 다른 파일은 _src/lib.cairo_ 입니다. 모든 내용을 삭제하고 다음 내용을 넣어주세요. 이유를 나중에 설명하겠습니다.

source: Then create a new file called _src/hello_world.cairo_ and put the following code in it:
ko: 그런 다음 _src/hello_world.cairo_ 라는 새 파일을 만들고 다음 코드를 넣으십시오:

source: Filename: src/hello_world.cairo
ko: 파일 이름: src/hello_world.cairo
