Repository: cairo-book/cairo-book
Catalog: po/*.po
Languages: es, id, ko, zh_cn

source: /// @dev Trait defining the functions that can be implemented or called by the Starknet Contract
ko: /// @dev Starknet Contract에서 구현하거나 호출할 수 있는 함수를 정의하는 특성

source: /// @dev Function that returns the current vote status
ko: /// @dev 현재 투표 상태를 반환하는 함수

source: /// @dev Function that checks if the user at the specified address is allowed to vote
ko: /// @dev 지정된 주소의 사용자가 투표할 수 있는지 확인하는 함수

source: /// @dev Function that checks if the specified address is registered as a voter
ko: /// @dev 지정된 주소가 유권자로 등록되어 있는지 확인하는 함수

source: /// @dev Function that allows a user to vote
ko: 사용자가 투표할 수 있는 기능입니다.

source: /// @dev Starknet Contract allowing three registered voters to vote on a proposal
ko: /// @dev 세 명의 등록된 투표자가 제안에 투표할 수 있는 Starknet 계약

source: /// @dev Structure that stores vote counts and voter states
ko: /// @dev 투표 수 및 유권자 상태를 저장하는 구조체

source: /// @dev Contract constructor initializing the contract with a list of registered voters and 0 vote count
ko: /// @dev 계약 생성자는 등록된 유권자 목록과 0 투표 수로 계약을 초기화합니다.

source: // Register all voters by calling the _register_voters function
ko: // _register_voters 함수를 호출하여 모든 유권자를 등록합니다.

source: // Initialize the vote count to 0
ko: 투표 수를 0으로 초기화합니다.

source: /// @dev Event that gets emitted when a vote is cast
ko: /// @dev 투표가 제출될 때 발생하는 이벤트

source: /// @dev Represents a vote that was cast
ko: /// @dev 투표를 나타냅니다

source: /// @dev Represents an unauthorized attempt to vote
ko: /// @dev 투표를 시도한 권한이 없음을 나타냅니다.

source: /// @dev Implementation of VoteTrait for ContractState
ko: /// @dev ContractState에 대한 VoteTrait 구현

source: /// @dev Returns the voting results
ko: /// @dev 투표 결과를 반환합니다

source: /// @dev Check whether a voter is allowed to vote
ko: /// @dev 투표자가 투표할 수 있는지 확인합니다.

source: /// @dev Check whether an address is registered as a voter
ko: /// @dev 주소가 유권자로 등록되어 있는지 확인합니다.

source: /// @dev Submit a vote
ko: /// @dev 투표 제출

source: "VOTE_0_OR_1"
ko: "투표_0_또는_1"

source: /// @dev Internal Functions implementation for the Vote contract
ko: /// @dev 투표 계약을 위한 내부 함수 구현

source: /// @dev Registers the voters and initializes their voting status to true (can vote)
ko: /// @dev 유권자를 등록하고 투표 상태를 true(투표 가능)로 초기화합니다.

source: /// @dev Asserts implementation for the Vote contract
ko: /// @dev 투표 계약에 대한 구현을 단언합니다

source: // @dev Internal function that checks if an address is allowed to vote
ko: // @dev 투표를 허용하는지 확인하는 내부 함수

source: "USER_NOT_REGISTERED"
ko: "사용자가 등록되지 않았습니다"

source: "USER_ALREADY_VOTED"
ko: "사용자가 이미 투표했습니다"

source: /// @dev Implement the VotingResultTrait for the Vote contract
ko: /// @dev 투표 계약에 대한 VotingResultTrait를 구현합니다.

source: // @dev Internal function to get the voting results (yes and no vote counts)
ko: // @dev 투표 결과(찬성 및 반대 투표 수)를 가져오는 내부 함수

source: // @dev Internal function to calculate the voting results in percentage
ko: // @dev 투표 결과를 백분율로 계산하는 내부 함수

source: Voting smart contract
ko: 투표 스마트 계약

source: Deploying, calling and invoking the Voting Contract
id: Mendeploy, Memanggil, dan Memanggil Kontrak Pemilihan
ko: 투표 계약을 배포하고 호출하며 실행하기

source: Part of the Starknet experience is deploying and interacting with smart contracts.
id: Bagian dari pengalaman Starknet adalah mendeploy dan berinteraksi dengan kontrak pintar.
ko: 스타크넷 경험의 일부는 스마트 계약을 배포하고 상호 작용하는 것입니다.
zh_cn: Starknet 体验的一部分就是部署智能合约并与之交互。

source: Once the contract is deployed, we can interact with it by calling and invoking its functions:
id: Setelah kontrak didaftarkan, kita dapat berinteraksi dengan kontrak tersebut dengan melakukan panggilan dan pemanggilan fungsi-fungsinya:
ko: 계약이 배포되면 함수를 호출하고 활용하여 상호 작용할 수 있습니다.
zh_cn: 一旦部署了合约，我们就可以通过调用合约的函数与之交互：

source: Calling contracts: Interacting with external functions that only read from the state. These functions do not alter the state of the network, so they don't require fees or signing.
id: Memanggil kontrak: Berinteraksi dengan fungsi eksternal yang hanya membaca dari status. Fungsi-fungsi ini tidak mengubah status jaringan, sehingga tidak memerlukan biaya atau tanda tangan.
ko: 콜링 계약: 상태를 읽기만 하는 외부 함수와 상호 작용합니다. 이러한 함수들은 네트워크의 상태를 변경하지 않으므로 수수료나 서명이 필요하지 않습니다.

source: Invoking contracts: Interacting with external functions that can write to the state. These functions do alter the state of the network and require fees and signing.
id: Memanggil kontrak: Berinteraksi dengan fungsi eksternal yang dapat menulis ke status. Fungsi-fungsi ini mengubah status jaringan dan memerlukan biaya serta tanda tangan.
ko: 계약 호출: 상태를 쓸 수 있는 외부 함수와 상호 작용합니다. 이러한 함수는 네트워크의 상태를 변경하며 수수료와 서명이 필요합니다.

source: We will setup a local development node using `katana` to deploy the voting contract. Then, we'll interact with the contract by calling and invoking its functions. You can also use the Goerli Testnet instead of `katana`. However, we recommend using `katana` for local development and testing. You can find the complete tutorial for `katana` in the [Katana: A Local Node](https://book.starknet.io/ch02-04-katana.html) chapter of the Starknet Book.
ko: 우리는 투표 계약을 배포하기 위해 `katana`를 사용하여 로컬 개발 노드를 설정할 것입니다. 그런 다음, 계약과 상호 작용하기 위해 함수를 호출하고 활성화할 것입니다. `katana` 대신 Goerli Testnet을 사용할 수도 있습니다. 그러나 로컬 개발 및 테스트에는 `katana`를 사용하는 것을 권장합니다. `katana`에 대한 완전한 튜토리얼은 Starknet Book의 [Katana: A Local Node](https://book.starknet.io/ch02-04-katana.html) 장에서 찾을 수 있습니다.

source: The `katana` local Starknet node
id: Node Starknet lokal `katana`
ko: `katana` 로컬 Starknet 노드

source: `katana` is designed to support local development by the [Dojo team](https://github.com/dojoengine/dojo/blob/main/crates/katana/README.md). It will allow you to do everything you need to do with Starknet, but locally. It is a great tool for development and testing.
id: `katana` dirancang untuk mendukung pengembangan lokal oleh [tim Dojo](https://github.com/dojoengine/dojo/blob/main/crates/katana/README.md). Ini akan memungkinkan Anda melakukan semua yang diperlukan dengan Starknet, tetapi secara lokal. Ini adalah alat yang bagus untuk pengembangan dan pengujian.
ko: `katana`는 [Dojo 팀](https://github.com/dojoengine/dojo/blob/main/crates/katana/README.md)이 지원하는 로컬 개발을 지원하기 위해 설계되었습니다. Starknet으로 할 수 있는 모든 작업을 로컬에서 수행할 수 있게 해줍니다. 개발 및 테스트에 좋은 도구입니다.
zh_cn: `katana`旨在支持[Dojo 团队](https://github.com/dojoengine/dojo/blob/main/crates/katana/README.md)的本地开发。通过它，您可以在本地完成Starknet所需的一切工作。它是开发和测试的绝佳工具。

source: To install `katana` from the source code, please refer to the [Basic Installation](https://book.starknet.io/ch02-01-basic-installation.html#katana-node-installation) chapter of the Starknet Book.
ko: `katana`를 소스 코드에서 설치하려면 Starknet Book의 [Basic Installation](https://book.starknet.io/ch02-01-basic-installation.html#katana-node-installation) 장을 참조하십시오.

source: Note: Please verify that the version of `katana` match the specified version provided below.
ko: 참고: `katana`의 버전이 아래 제공된 지정 버전과 일치하는지 확인해주세요.

source: To upgrade `katana`, refer to the [Basic Installation](https://book.starknet.io/ch02-01-basic-installation.html#katana-node-installation) chapter of the Starknet Book.
ko: `katana`를 업그레이드하려면 Starknet Book의 [Basic Installation](https://book.starknet.io/ch02-01-basic-installation.html#katana-node-installation) 장을 참조하십시오.

source: Once you have `katana` installed, you can start the local Starknet node with:
id: Setelah Anda menginstal `katana`, Anda dapat memulai node Starknet lokal dengan:
ko: `katana`를 설치한 후에는 다음과 같이 로컬 Starknet 노드를 시작할 수 있습니다:
zh_cn: 一旦安装了 `katana`，就可以用以下命令启动本地Starknet节点：

source: This command will start a local Starknet node with 3 deployed accounts. We will use these accounts to deploy and interact with the voting contract:
id: Perintah ini akan memulai node Starknet lokal dengan 3 akun yang telah didaftarkan. Kami akan menggunakan akun-akun ini untuk mendaftarkan dan berinteraksi dengan kontrak pemilihan:
ko: 이 명령은 3개의 배포된 계정이 있는 로컬 Starknet 노드를 시작합니다. 이러한 계정을 사용하여 투표 계약을 배포하고 상호 작용할 것입니다.
zh_cn: 该命令将启动一个本地 Starknet 节点，并部署 3 个账户。我们将使用这些账户部署投票合约并与之交互：

source: Before we can interact with the voting contract, we need to prepare the voter and admin accounts on Starknet. Each voter account must be registered and sufficiently funded for voting. For a more detailed understanding of how accounts operate with Account Abstraction, refer to the [Account Abstraction](https://book.starknet.io/ch04-00-account-abstraction.html) chapter of the Starknet Book.
ko: 투표 계약과 상호 작용하기 전에, Starknet에서 투표자 및 관리자 계정을 준비해야 합니다. 각 투표자 계정은 등록되어 있고 투표를 위해 충분히 자금이 지원되어 있어야 합니다. 계정 추상화와 관련된 계정 작동 방식에 대해 자세히 알고 싶다면, Starknet Book의 [Account Abstraction](https://book.starknet.io/ch04-00-account-abstraction.html) 장을 참조하십시오.

source: Smart wallets for voting
ko: 투표용 스마트 지갑

source: Aside from Scarb you will need to have Starkli installed. Starkli is a command line tool that allows you to interact with Starknet. You can find the installation instructions in the [Basic Installation](https://book.starknet.io/ch02-01-basic-installation.html#starkli-installation) chapter of the Starknet Book.
ko: Scarb 외에도 Starkli를 설치해야 합니다. Starkli는 스타크넷과 상호 작용할 수 있는 명령 줄 도구입니다. Starkli 설치 지침은 스타크넷 북의 [기본 설치](https://book.starknet.io/ch02-01-basic-installation.html#starkli-installation) 장에서 찾을 수 있습니다.

source: Note: Please verify that the version of `starkli` match the specified version provided below.
ko: 참고: `starkli`의 버전이 아래 제공된 지정된 버전과 일치하는지 확인해주세요.

source: To upgrade `starkli` to `1.0.20`, use the `starkliup -v 0.1.20` command.
ko: `starkli`를 `1.0.20`으로 업그레이드하려면 `starkliup -v 0.1.20` 명령을 사용하십시오.

source: For each smart wallet we'll use, we must create a Signer within the encrypted keystore and an Account Descriptor. This process is also detailed in the [Testnet Deployment](https://book.starknet.io/ch02-05-testnet-deployment.html?highlight=signer#creating-a-signer) chapter of the Starknet Book.
ko: 각 스마트 지갑을 사용할 때, 우리는 암호화된 키스토어 내에서 서명자와 계정 기술자를 생성해야 합니다. 이 과정은 Starknet Book의 [테스트넷 배포](https://book.starknet.io/ch02-05-testnet-deployment.html?highlight=signer#creating-a-signer) 장에서도 자세히 설명되어 있습니다.

source: We can create Signers and Account Descriptors for the accounts we want to use for voting. Let's create a smart wallet for voting in our smart contract.
id: Kita dapat membuat Pemeterai (Signer) dan Deskripsi Akun untuk akun-akun yang ingin kita gunakan untuk memberikan suara. Mari buat dompet pintar untuk memberikan suara dalam kontrak pintar kita.
ko: 우리는 투표에 사용할 계정에 대한 서명자와 계정 설명자를 생성할 수 있습니다. 스마트 계약에서 투표를 위한 스마트 지갑을 만들어 봅시다.
zh_cn: 我们可以为要用于投票的账户创建签名者和账户描述符。让我们在智能合约中创建一个用于投票的智能钱包。

source: Firstly, we create a signer from a private key:
id: Pertama-tama, kita membuat pemeterai dari kunci pribadi:
ko: 먼저, 우리는 개인 키에서 서명자를 생성합니다.
zh_cn: 首先，我们用私钥创建一个签名者：

source: Then, we create the Account Descriptor by fetching the katana account we want to use:
ko: 그런 다음, 우리는 사용하고 싶은 katana 계정을 가져와서 계정 기술자(Account Descriptor)를 생성합니다.
zh_cn: 然后，我们通过获取我们要使用的katana账户来创建账户描述符：

source: This command will create a new `account0_account.json` file containing the following details:
ko: 이 명령은 다음 세부 정보가 포함된 새 `account0_account.json` 파일을 생성합니다.
zh_cn: 这个命令将创建一个新的 `account0_account.json` 文件，其中包含以下细节：

source: "version"
ko: 버전

source: "variant"
ko: "변형"

source: "type"
ko: 유형

source: "public_key"
ko: "공개 키"

source: "deployment"
ko: 배치

source: "status"
ko: "상태"

source: "deployed"
ko: "배치된"

source: "address"
ko: 주소

source: You can retrieve the smart wallet class hash (it will be the same for all your smart wallets) with the following command. Notice the use of the `--rpc` flag and the RPC endpoint provided by `katana`:
id: Anda dapat mengambil hash kelas dompet pintar (akan sama untuk semua dompet pintar Anda) dengan perintah berikut. Perhatikan penggunaan flag `--rpc` dan ujung RPC yang disediakan oleh `katana`:
ko: 다음 명령을 사용하여 스마트 지갑 클래스 해시를 검색할 수 있습니다. `--rpc` 플래그와 `katana`에서 제공하는 RPC 엔드포인트 사용에 주의하십시오.
zh_cn: 你可以用以下命令获取智能钱包的 class hash（所有智能钱包的class hash都一样）。注意使用了 `--rpc` 标志和 `katana` 提供的 RPC 端点：

source: ``` starkli class-hash-at <SMART_WALLET_ADDRESS> --rpc http://0.0.0.0:5050 ```
ko: ``` starkli class-hash-at <SMART_WALLET_ADDRESS> --rpc http://0.0.0.0:5050 ``` -> ``` starkli class-hash-at <스마트_지갑_주소> --rpc http://0.0.0.0:5050 ```

source: For the public key, you can use the `starkli signer keystore inspect` command with the directory of the keystore json file:
id: Untuk kunci publik, Anda dapat menggunakan perintah `starkli signer keystore inspect` dengan direktori file json keystore:
ko: 공개 키를 얻으려면 `starkli signer keystore inspect` 명령을 사용하여 키스토어 JSON 파일이 있는 디렉토리를 지정할 수 있습니다.
zh_cn: 要获取公钥，可以使用 `starkli signer keystore inspect` 命令，并输入 keystore json 文件的目录：

source: This process is identical for `account_1` and `account_2` in case you want to have a second and a third voter.
id: Proses ini identik untuk `account_1` dan `account_2` jika Anda ingin memiliki voter kedua dan ketiga.
ko: 이 프로세스는 두 번째와 세 번째 투표자를 원하는 경우 `account_1` 및 `account_2`에 대해 동일합니다.
zh_cn: 如果您想拥有第二个和第三个投票人，用同样的过程对 `account_1` 和 `account_2` 进行操作即可。

source: Contract Deployment
ko: 계약 배포

source: Before deploying, we need to declare the contract. We can do this with the `starkli declare` command:
id: Sebelum melakukan penyebaran, kita perlu mendeklarasikan kontrak. Hal ini dapat dilakukan dengan perintah `starkli declare`:
ko: 배포하기 전에 계약을 선언해야 합니다. 이를 `starkli declare` 명령어로 할 수 있습니다.
zh_cn: 在部署之前，我们需要声明合约。我们可以使用 `starkli declare` 命令来完成这项工作：

source: If the compiler version you're using is older than the one used by Starkli and you encounter a `compiler-version` error while using the command above, you can specify a compiler version to use in the command by adding the `--compiler-version x.y.z` flag.
id: Jika versi kompilator yang Anda gunakan lebih lama daripada yang digunakan oleh Starkli dan Anda mengalami kesalahan `compiler-version` saat menggunakan perintah di atas, Anda dapat menentukan versi kompilator yang akan digunakan dalam perintah dengan menambahkan flag `--compiler-version x.y.z`.
ko: 만약 사용 중인 컴파일러 버전이 Starkli에서 사용한 것보다 오래된 경우이고 위 명령을 사용하는 동안 `compiler-version` 오류가 발생하면, `--compiler-version x.y.z` 플래그를 추가하여 명령에서 사용할 컴파일러 버전을 지정할 수 있습니다.
zh_cn: 如果你使用的编译器版本旧于Starkli使用的版本，并且在使用上述命令时遇到了 `compiler-version` 错误，你可以通过在命令中添加 `--compiler-version x.y.z` 标志来指定要使用的编译器版本。

source: If you're still encountering issues with the compiler version, try upgrading Starkli using the command: `starkliup` to make sure you're using the latest version of starkli.
id: Jika Anda masih mengalami masalah dengan versi kompilator, coba perbarui Starkli menggunakan perintah: `starkliup` untuk memastikan Anda menggunakan versi terbaru dari starkli.
ko: 컴파일러 버전에 문제가 계속 발생한다면, 최신 starkli 버전을 사용하도록 Starkli를 업그레이드하려면 다음 명령을 사용해보세요: `starkliup`.
zh_cn: 如果你仍然遇到编译器版本的问题，请尝试使用以下命令来升级 Starkli：`starkliup`，以确保你正在使用 starkli 的最新版本。

source: The class hash of the contract is: `0x06974677a079b7edfadcd70aa4d12aac0263a4cda379009fca125e0ab1a9ba52`. You can find it [on any block explorer](https://goerli.voyager.online/class/0x06974677a079b7edfadcd70aa4d12aac0263a4cda379009fca125e0ab1a9ba52).
id: Hash kelas dari kontrak adalah: `0x06974677a079b7edfadcd70aa4d12aac0263a4cda379009fca125e0ab1a9ba52`. Anda dapat menemukannya [di penjelajah blok mana pun](https://goerli.voyager.online/class/0x06974677a079b7edfadcd70aa4d12aac0263a4cda379009fca125e0ab1a9ba52).
ko: 계약의 클래스 해시는 다음과 같습니다: `0x06974677a079b7edfadcd70aa4d12aac0263a4cda379009fca125e0ab1a9ba52`. 이 링크에서 확인할 수 있습니다: [on any block explorer](https://goerli.voyager.online/class/0x06974677a079b7edfadcd70aa4d12aac0263a4cda379009fca125e0ab1a9ba52).
zh_cn: 合约的的class hash是`0x06974677a079b7edfadcd70aa4d12aac0263a4cda379009fca125e0ab1a9ba52`.您可以在 [任何区块浏览器] (https://goerli.voyager.online/class/0x06974677a079b7edfadcd70aa4d12aac0263a4cda379009fca125e0ab1a9ba52)中看到他。

source: The `--rpc` flag specifies the RPC endpoint to use (the one provided by `katana`). The `--account` flag specifies the account to use for signing the transaction. The account we use here is the one we created in the previous step. The `--keystore` flag specifies the keystore file to use for signing the transaction.
id: Flag `--rpc` menentukan titik akhir RPC yang digunakan (yang disediakan oleh `katana`). Flag `--account` menentukan akun yang digunakan untuk menandatangani transaksi. Akun yang kita gunakan di sini adalah yang kita buat pada langkah sebelumnya. Flag `--keystore` menentukan file keystore yang digunakan untuk menandatangani transaksi.
ko: `--rpc` 플래그는 사용할 RPC 엔드포인트를 지정합니다(`katana`에서 제공하는 엔드포인트). `--account` 플래그는 트랜잭션에 서명하는 데 사용할 계정을 지정합니다. 여기서 사용하는 계정은 이전 단계에서 생성한 계정입니다. `--keystore` 플래그는 트랜잭션에 서명하는 데 사용할 키스토어 파일을 지정합니다.
zh_cn: `--rpc`标志指定要使用的 RPC 端点（由 `katana`提供）。`--account` 标志指定用于签署交易的账户。这里使用的账户是上一步创建的账户。 `--keystore`标记用于指定签署交易的密钥存储文件。

source: Since we are using a local node, the transaction will achieve finality immediately. If you are using the Goerli Testnet, you will need to wait for the transaction to be final, which usually takes a few seconds.
id: Karena kita menggunakan node lokal, transaksi akan mencapai finalitas segera. Jika Anda menggunakan Goerli Testnet, Anda perlu menunggu transaksi menjadi final, yang biasanya memerlukan waktu beberapa detik.
ko: 우리는 로컬 노드를 사용하기 때문에 거래는 즉시 최종성을 달성할 것입니다. Goerli 테스트넷을 사용하는 경우 거래가 최종화되기까지 몇 초 정도 기다려야 합니다.
zh_cn: 由于我们使用的是本地节点，因此交易将立即完成。如果您使用的是 Goerli Testnet，则需要等待交易最终完成，这通常需要几秒钟。

source: The following command deploys the voting contract and registers voter_0, voter_1, and voter_2 as eligible voters. These are the constructor arguments, so add a voter account that you can later vote with.
id: Perintah berikut ini mendeploy kontrak pemungutan suara dan mendaftarkan voter_0, voter_1, dan voter_2 sebagai pemilih yang memenuhi syarat. Ini adalah argumen konstruktor, jadi tambahkan akun pemilih yang nantinya dapat Anda gunakan untuk memberikan suara.
ko: 다음 명령은 투표 계약을 배포하고 voter_0, voter_1 및 voter_2를 선거자로 등록합니다. 이들은 생성자 인수이므로 나중에 투표할 수 있는 투표자 계정을 추가하십시오.
zh_cn: 以下命令将部署投票合约，并将 voter_0、voter_1 和 voter_2 注册为合格投票人。这些是构造函数参数，因此请添加一个以后可以用来投票的选民账户。

source: An example command:
id: Example command:
ko: 예시 명령어:
zh_cn: 命令示例：

source: In this case, the contract has been deployed at an specific address: `0x05ea3a690be71c7fcd83945517f82e8861a97d42fca8ec9a2c46831d11f33349`. This address will be different for you. We will use this address to interact with the contract.
id: Dalam kasus ini, kontrak telah didisposisikan pada alamat spesifik: `0x05ea3a690be71c7fcd83945517f82e8861a97d42fca8ec9a2c46831d11f33349`. Alamat ini akan berbeda untuk Anda. Kami akan menggunakan alamat ini untuk berinteraksi dengan kontrak.
ko: 이 경우에는 계약이 특정 주소인 `0x05ea3a690be71c7fcd83945517f82e8861a97d42fca8ec9a2c46831d11f33349`에 배포되었습니다. 이 주소는 여러분에게는 다를 것입니다. 우리는 이 주소를 사용하여 계약과 상호 작용할 것입니다.
zh_cn: 在本例中，合约已部署到特定地址：`0x05ea3a690be71c7fcd83945517f82e8861a97d42fca8ec9a2c46831d11f33349`。您应该会看到不同的地址。我们将使用此地址与合约进行交互。

source: Voter Eligibility Verification
ko: 유권자 자격 확인

source: In our voting contract, we have two functions to validate voter eligibility, `voter_can_vote` and `is_voter_registered`. These are external read functions, which mean they don't alter the state of the contract but only read the current state.
id: Dalam kontrak pemungutan suara kami, kami memiliki dua fungsi untuk memvalidasi kelayakan pemilih, `voter_can_vote` dan `is_voter_registered`. Ini adalah fungsi baca eksternal, yang berarti mereka tidak mengubah status kontrak tetapi hanya membaca status saat ini.
ko: 우리의 투표 계약에는 유권자 자격을 확인하는 두 가지 함수인 `voter_can_vote`와 `is_voter_registered`가 있습니다. 이들은 외부 읽기 함수로, 계약의 상태를 변경하지 않고 현재 상태만 읽습니다.
zh_cn: 在我们的投票合约中，我们有两个函数来验证投票人的资格，即 `voter_can_vote` 和 `is_voter_registered`。这些函数是外部只读函数，这意味着它们不会改变合约的状态，而只是读取当前状态。

source: The `is_voter_registered` function checks whether a particular address is registered as an eligible voter in the contract. The `voter_can_vote` function, on the other hand, checks whether the voter at a specific address is currently eligible to vote, i.e., they are registered and haven't voted already.
id: Fungsi `is_voter_registered` memeriksa apakah suatu alamat tertentu terdaftar sebagai pemilih yang memenuhi syarat dalam kontrak. Sementara itu, fungsi `voter_can_vote` memeriksa apakah pemilih pada alamat tertentu saat ini berhak untuk memberikan suara, yaitu, mereka terdaftar dan belum memberikan suara.
ko: `is_voter_registered` 함수는 특정 주소가 계약서에 등록된 유권자인지 확인합니다. 반면에 `voter_can_vote` 함수는 특정 주소의 유권자가 현재 투표 자격이 있는지 확인합니다. 즉, 그들이 등록되어 있고 아직 투표하지 않았는지를 확인합니다.
zh_cn: `is_voter_registered`函数检查特定地址是否在合约中登记为合格投票人。另一方面，`voter_can_vote`函数会检查特定地址的投票人当前是否有资格投票，即他们是否已登记且尚未投票。

source: You can call these functions using the `starkli call` command. Note that the `call` command is used for read functions, while the `invoke` command is used for functions that can also write to storage. The `call` command does not require signing, while the `invoke` command does.
id: Anda dapat memanggil fungsi-fungsi ini menggunakan perintah `starkli call`. Perhatikan bahwa perintah `call` digunakan untuk fungsi baca, sementara perintah `invoke` digunakan untuk fungsi yang juga dapat menulis ke penyimpanan. Perintah `call` tidak memerlukan penandatanganan, sedangkan perintah `invoke` memerlukan penandatanganan.
ko: 이 함수들은 `starkli call` 명령을 사용하여 호출할 수 있습니다. `call` 명령은 읽기 함수에 사용되는 반면, `invoke` 명령은 스토리지에 쓸 수도 있는 함수에 사용됩니다. `call` 명령은 서명이 필요하지 않지만, `invoke` 명령은 필요합니다.
zh_cn: 你可以使用 `starkli call` 命令来调用这些函数。请注意，`call`命令用于只读函数，而 `invoke`命令用于也可以写入存储空间的函数。调用 `call` 命令不需要签名，而 `invoke`命令需要签名。

source: First we added the address of the contract, then the function we want to call, and finally the input for the function. In this case, we are checking whether the voter at the address `0x03ee9e18edc71a6df30ac3aca2e0b02a198fbce19b7480a63a0d71cbd76652e0` can vote.
id: Pertama, kami menambahkan alamat kontrak, kemudian fungsi yang ingin kami panggil, dan akhirnya masukan untuk fungsi tersebut. Dalam hal ini, kami sedang memeriksa apakah pemilih di alamat `0x03ee9e18edc71a6df30ac3aca2e0b02a198fbce19b7480a63a0d71cbd76652e0` dapat memberikan suara.
ko: 먼저 우리는 계약의 주소를 추가했고, 그 다음에 우리가 호출하고자 하는 함수를 추가했으며, 마지막으로 함수에 대한 입력을 추가했습니다. 이 경우에는 주소 `0x03ee9e18edc71a6df30ac3aca2e0b02a198fbce19b7480a63a0d71cbd76652e0`에 있는 투표자가 투표할 수 있는지 확인하고 있습니다.
zh_cn: 首先，我们添加了合约的地址，然后是要调用的函数，最后是函数的输入。在本例中，我们要检查地址为 `0x03ee9e18edc71a6df30ac3aca2e0b02a198fbce19b7480a63a0d71cbd76652e0` 的投票人是否可以投票。

source: Since we provided a registered voter address as an input, the result is 1 (boolean true), indicating the voter is eligible to vote.
id: Karena kami memberikan alamat pemilih yang terdaftar sebagai masukan, hasilnya adalah 1 (benar dalam bentuk boolean), menunjukkan bahwa pemilih memenuhi syarat untuk memberikan suara.
ko: 등록된 유권자 주소를 입력했기 때문에 결과는 1(부울 참)로, 유권자가 투표 자격이 있다는 것을 나타냅니다.
zh_cn: 由于我们提供了已登记的投票人的地址作为输入，因此结果为 1（布尔值为 true），表明该选民有资格投票。

source: Next, let's call the `is_voter_registered` function using an unregistered account address to observe the output:
id: Selanjutnya, mari panggil fungsi `is_voter_registered` menggunakan alamat akun yang tidak terdaftar untuk mengamati keluarannya:
ko: 다음으로, 등록되지 않은 계정 주소를 사용하여 `is_voter_registered` 함수를 호출하여 출력을 관찰해 봅시다:
zh_cn: 接下来，让我们使用一个未注册的账户地址调用 `is_voter_registered` 函数来观察输出结果：

source: With an unregistered account address, the terminal output is 0 (i.e., false), confirming that the account is not eligible to vote.
id: Dengan alamat akun yang tidak terdaftar, keluaran terminal adalah 0 (yakni, salah), mengkonfirmasi bahwa akun tersebut tidak memenuhi syarat untuk memberikan suara.
ko: 등록되지 않은 계정 주소로 터미널 출력이 0(즉, 거짓)이 되어 해당 계정이 투표 자격이 없음을 확인합니다.
zh_cn: 对于未注册的账户地址，终端输出为 0（即假），确认该账户没有投票资格。

source: Casting a Vote
ko: 투표하기
