Repository: cairo-book/cairo-book
Catalog: po/*.po
Languages: es, id, ko, zh_cn

source: - `OwnableImpl` requires the implementation of the `HasComponent<TContractState>` trait by the underlying contract, which is automatically generated with the `component!()` macro when using a component inside a contract. The compiler will generate an impl that wraps any function in `OwnableImpl`, replacing the `self: ComponentState<TContractState>` argument with `self: TContractState`, where access to the component state is made via the `get_component` function in the `HasComponent<TContractState>` trait. For each component, the compiler generates a `HasComponent` trait. This trait defines the interface to bridge between the actual `TContractState` of a generic contract, and `ComponentState<TContractState>`. ```rust // generated per component trait HasComponent<TContractState> { fn get_component(self: @TContractState) -> @ComponentState<TContractState>; fn get_component_mut(ref self: TContractState) -> ComponentState<TContractState>; fn get_contract(self: @ComponentState<TContractState>) -> @TContractState; fn get_contract_mut(ref self: ComponentState<TContractState>) -> TContractState; fn emit<S, impl IntoImp: traits::Into<S, Event>>(ref self: ComponentState<TContractState>, event: S); } ``` In our context `ComponentState<TContractState>` is a type specific to the ownable component, i.e. it has members based on the storage variables defined in `ownable_component::Storage`. Moving from the generic `TContractState` to `ComponentState<TContractState>` will allow us to embed `Ownable` in any contract that wants to use it. The opposite direction (`ComponentState<TContractState>` to `ContractState`) is useful for dependencies (see the `Upgradeable` component depending on an `IOwnable` implementation example in the [Components dependencies ](./ch99-01-05-02-component-dependencies.md) section. To put it briefly, one should think of an implementation of the above `HasComponent<T>` as saying: **“Contract whose state T has the upgradeable component”.** - `Ownable` is annotated with the `embeddable_as(<name>)` attribute: `embeddable_as` is similar to `embeddable`; it only applies to `impls` of `starknet::interface` traits and allows embedding this impl in a contract module. That said, `embeddable_as(<name>)` has another role in the context of components. Eventually, when embedding `OwnableImpl` in some contract, we expect to get an impl with the following functions: ```rust fn owner(self: @TContractState) -> ContractAddress; fn transfer_ownership(ref self: TContractState, new_owner: ContractAddress); fn renounce_ownership(ref self: TContractState); ``` Note that while starting with a function receiving the generic type `ComponentState<TContractState>`, we want to end up with a function receiving `ContractState`. This is where `embeddable_as(<name>)` comes in. To see the full picture, we need to see what is the impl generated by the compiler due to the `embeddable_as(Ownable)` annotation: ```rust #[starknet::embeddable] impl Ownable< TContractState, +HasComponent<TContractState> , impl TContractStateDrop: Drop<TContractState> > of super::IOwnable<TContractState> { fn owner(self: @TContractState) -> ContractAddress { let component = HasComponent::get_component(self); OwnableImpl::owner(component, ) } fn transfer_ownership(ref self: TContractState, new_owner: ContractAddress ) { let mut component = HasComponent::get_component_mut(ref self); OwnableImpl::transfer_ownership(ref component, new_owner, ) } fn renounce_ownership(ref self: TContractState) { let mut component = HasComponent::get_component_mut(ref self); OwnableImpl::renounce_ownership(ref component, ) } } ``` Note that thanks to having an impl of `HasComponent<TContractState>`, the compiler was able to wrap our functions in a new impl that doesn’t directly know about the `ComponentState` type. `Ownable`, whose name we chose when writing `embeddable_as(Ownable)`, is the impl that we will embed in a contract that wants ownership.
zh_cn: - `OwnableImpl` 要求底层合约实现`HasComponent<TContractState>` trait。 这个trait在合约中使用组件的时候，会由`component!()`宏自动生成。 编译器将生成一个封装 `OwnableImpl` 中任何函数的 impl、 用`self:TContractState`替换掉中的 `self: ComponentState<TContractState>`参数，其中对组件状态的访问是通过 `HasComponent<TContractState>` trait中的 `get_component` 函数来进行的。 编译器会为每个组件生成一个 `HasComponent` trait。该trait 定义了连接泛型合约与实际 `TContractState` 和 `ComponentState<TContractState>` 之间的接口。 ```rust // generated per component trait HasComponent<TContractState> { fn get_component(self: @TContractState) -> @ComponentState<TContractState>; fn get_component_mut(ref self: TContractState) -> ComponentState<TContractState>; fn get_contract(self: @ComponentState<TContractState>) -> @TContractState; fn get_contract_mut(ref self: ComponentState<TContractState>) -> TContractState; fn emit<S, impl IntoImp: traits::Into<S, Event>>(ref self: ComponentState<TContractState>, event: S); } ``` 在我们的上下文中，`ComponentState<TContractState>` 是一个特定的ownable组件的类型。 它拥有着基于`ownable_component::Storage`定义的变量成员。 从泛型`TContractState`转移到`ComponentState<TContractState>` 使得我们可以将 `Ownable` 嵌入任意合约。反方向的转移（即`ComponentState<TContractState>` 转移到 `ContractState`）对于外部依赖是很有用的。 详细可见[组件依赖 ](./ch99-01-05-02-component-dependencies.md)章节中的依赖于一个`IOwnable`实现的`Upgradeable`组件的例子。 简而言之，我们应该考虑上述 `HasComponent<T>` 的实现： **"合约的状态 T 具有可升级组件"。** - `Ownable`被标注为 `embeddable_as(<name>)`属性： `embeddable_as`与 `embeddable`类似；它只适用于 `starknet::interface` trait的 "impls", 并允许将这个impl嵌入一个合约模块。也就是说，`embeddable_as(<name>)`在组件的上下文中还有另一个作用。 最终，当在某个契约中嵌入 `OwnableImpl` 时，我们希望得到一个具有以下函数的 impl： ```rust fn owner(self: @TContractState) -> ContractAddress; fn transfer_ownership(ref self: TContractState, new_owner: ContractAddress); fn renounce_ownership(ref self: TContractState); ``` 请注意，在开始使用函数接收泛型 `ComponentState<TContractState>`时，我们期望的是一个接受`ContractState`的函数。 这就是 `embeddable_as(<name>)` 的用武之地。要了解全景， 我们需要知道编译器为`embeddable_as(Ownable)`注解生成的 impl 是什么： ```rust #[starknet::embeddable] impl Ownable< TContractState, +HasComponent<TContractState> , impl TContractStateDrop: Drop<TContractState> > of super::IOwnable<TContractState> { fn owner(self: @TContractState) -> ContractAddress { let component = HasComponent::get_component(self); OwnableImpl::owner(component, ) } fn transfer_ownership(ref self: TContractState, new_owner: ContractAddress ) { let mut component = HasComponent::get_component_mut(ref self); OwnableImpl::transfer_ownership(ref component, new_owner, ) } fn renounce_ownership(ref self: TContractState) { let mut component = HasComponent::get_component_mut(ref self); OwnableImpl::renounce_ownership(ref component, ) } } ``` 请注意，由于有了`HasComponent<TContractState>`的impl， 编译器才能够将我们的函数封装在一个不需要直接知道`ComponentState`的新的impl中。 在合约中写上`embeddable_as(Ownable)`时，就意味着`Ownable`将是被嵌入合约中来实现所有权功能的impl。

source: ## Contract Integration
zh_cn: ## 合约集成

source: We've seen how generic impls enable component reusability. Next let's see how a contract integrates a component.
zh_cn: 我们已经了解了泛型impl如何实现组件的可重用性。接下来，让我们看看合约是如何集成组件的。

source: The contract uses an **impl alias** to instantiate the component's generic impl with the concrete `ContractState` of the contract.
zh_cn: 合约使用 **impl alias** 来实例化组件的泛型 impl 替换为该合约的具体`ContractState`。

source: The above lines use the Cairo impl embedding mechanism alongside the impl alias syntax. We’re instantiating the generic `OwnableImpl<TContractState>` with the concrete type `ContractState`. Recall that `OwnableImpl<TContractState>` has the `HasComponent<TContractState>` generic impl parameter. An implementation of this trait is generated by the `component!` macro.
zh_cn: 上面的代码使用了 Cairo impl 嵌入机制和 impl 别名语法。 我们正在用具体类型的`ContractState`来实例化泛型 `OwnableImpl<TContractState>` 回想一下，`OwnableImpl<TContractState>` 具有`HasComponent<TContractState>`泛型 impl 参数。 此实现的trait 由 `component!` 宏生成。

source: Note that only the using contract could have implemented this trait since only it knows about both the contract state and the component state.
zh_cn: 请注意，这只可以使用在可以实现这个trati的合约上， 因为只有这种合约知晓合约state 和组件 state。

source: ## Key Takeaways
zh_cn: ## 关键要点

source: - Embeddable impls allow injecting components logic into contracts by adding entry points and modifying the contract ABI. - The compiler automatically generates a `HasComponent` trait implementation when a component is used in a contract. This creates a bridge between the contract's state and the component's state, enabling interaction between the two. - Components encapsulate reusable logic in a generic, contract-agnostic way. Contracts integrate components through impl aliases and access them via the generated `HasComponent` trait. - Components build on embeddable impls by defining generic component logic that can be integrated into any contract wanting to use that component. Impl aliases instantiate these generic impls with the contract's concrete storage types.
zh_cn: - 可嵌入的实现允许通过组件注入来添加入口点和改变合约 ABI。 - 档组件被用于合约中时，编译器会自动生成`HasComponent` tarit实现 这在合约状态和组件状态搭了一座桥，以实现双方互动。 - 组件以通用的、与合约无关的方式封装可重用的逻辑。 合约通过 impl 别名集成组件，并通过生成的`HasComponent` trait来访问组件。 - 组件基于可嵌入的实现构建，通过定义通用组件逻辑 可以集成到任何想要使用该组件的合约中。 实现别名使用合约的具体存储来实例化这些泛型实现类型。

source: # Component dependencies
zh_cn: # 组件依赖

source: # Testing components
zh_cn: # 测试组件

source: # Starknet contracts: ABIs and cross-contract interactions
es: # Contratos de Starknet: ABIs e interacciones entre cross-contract
zh_cn: # Starknet合约：ABI和跨合约交互

source: # ABIs and Contract Interfaces
es: # ABIs e Interfaces de Contrato
zh_cn: # ABI和合约接口

source: ## ABI - Application Binary Interface
zh_cn: ## ABI - 应用二进制接口

source: ## Interface
es: ## Interfaz
zh_cn: ## 接口

source: The interface of a contract is a list of the functions it exposes publicly. It specifies the function signatures (name, parameters, visibility and return value) contained in a smart contract without including the function body.
zh_cn: 合约的接口是它公开的函数列表。 它指定了智能合约中包含的函数签名（名称、参数、可见性和返回值），但不包括函数体。

source: > Note: The contract constructor is not part of the interface. Nor are internal functions part of the interface.
zh_cn: > 注意：合约的构造函数不是接口的一部分。内部函数也不是接口的一部分。

source: <span class="caption">Listing 99-4: A simple ERC20 Interface</span>
es: <span class="caption">Listado 9-4: Una interfaz simple de ERC20</span>
zh_cn: <span class="caption">示例99-4：一个简单的ERC20接口</span>

source: # Interacting with other contracts and classes using Dispatchers and syscalls
zh_cn: # 使用调度程序和系统调用与其他合约和类交互

source: 1. The Contract Dispatcher `IERC20Dispatcher` 2. The Library Dispatcher `IERC20LibraryDispatcher`
zh_cn: 1. 合约调度器 `IERC20Dispatcher` 2. 库调度器 `IERC20LibraryDispatcher`

source: To effectively break down the concepts in this chapter, we are going to be using the IERC20 interface from the previous chapter (refer to Listing 99-4):
es: Para desglosar efectivamente los conceptos en este capítulo, utilizaremos la interfaz IERC20 del capítulo anterior (consulte la Lista 9-4):
id: Untuk secara efektif memahami konsep dalam bab ini, kita akan menggunakan antarmuka IERC20 dari bab sebelumnya (lihat Listing 99-4):
zh_cn: 为了有效地拆解本章的概念，我们将使用前一章的IERC20接口（参考示例99-4）：

source: ## Contract Dispatcher
es: ## Despachador de Contratos
zh_cn: ## 合约调度器

source: As mentioned previously, traits annotated with the `#[starknet::interface]` attribute automatically generate a dispatcher and a trait on compilation. Our `IERC20` interface is expanded into something like this:
zh_cn: 如前所述，使用 `#[starknet::interface]` 属性注释的trait会在编译时自动生成一个调度器和一个trait。 我们的 `IERC20` 接口扩展至如下：

source: <span class="caption">Listing 99-5: An expanded form of the IERC20 trait</span>
es: <span class="caption">Listado 9-5: Una forma expandida del trait IERC20</span>
zh_cn: <span class="caption">示例99-5：IERC20 trait的扩展</span>

source: ### Calling Contracts using the Contract Dispatcher
es: ### Llamando contratos usando el Dispatcher de Contrato
zh_cn: ### 使用合约调度器调用合约

source: <span class="caption">Listing 99-6: A sample contract which uses the Contract Dispatcher</span>
es: <span class="caption">Listado 9-6: Un ejemplo de contrato que utiliza el Contract Dispatcher</span>
zh_cn: <span class="caption">示例99-6：一个使用合约调度器的样本合约</span>

source: ## Library Dispatcher
es: ## Dispatcher de Biblioteca
zh_cn: ## 库调度器

source: <span class="caption">Listing 99-7: An expanded form of the IERC20 trait</span>
es: <span class="caption">Listado 9-7: Una forma expandida de trait IERC20</span>
zh_cn: <span class="caption">示例99-7：IERC20 trait的扩展</span>

source: ### Calling Contracts using the Library Dispatcher
es: ### Llamando a Contratos usando el Dispatcher de Biblioteca
zh_cn: ### 使用库调度器调用合约

source: <span class="caption">Listing 99-8: A sample contract using the Library Dispatcher</span>
es: <span class="caption">Listado 9-8: Un contrato de muestra que utiliza el Dispatcher de Biblioteca</span>
zh_cn: <span class="caption">示例99-8：一个使用库调度器的样本合约</span>

source: As you can see, we had to first import in our contract the `IContractBDispatcherTrait` and `IContractBLibraryDispatcher` which were generated from our interface by the compiler. Then, we can create an instance of `IContractBLibraryDispatcher` passing in the `class_hash` of the class we want to make library calls to. From there, we can call the functions defined in that class, executing its logic in the context of our contract. When we call `set_value` on ContractA, it will make a library call to the `set_value` function in ContractB, updating the value of the storage variable `value` in ContractA.
id: Seperti yang dapat Anda lihat, kita harus mengimpor terlebih dahulu ke dalam kontrak kita `IContractBDispatcherTrait` dan `IContractBLibraryDispatcher` yang dihasilkan dari antarmuka kita oleh kompiler. Kemudian, kita dapat membuat instansi dari `IContractBLibraryDispatcher` dengan meneruskan `class_hash` dari kelas yang ingin kita panggil sebagai pustaka. Dari sana, kita dapat memanggil fungsi-fungsi yang didefinisikan dalam kelas tersebut, menjalankan logiknya dalam konteks kontrak kita. Ketika kita memanggil `set_value` pada KontrakA, itu akan membuat panggilan pustaka ke fungsi `set_value` di KontrakB, memperbarui nilai variabel penyimpanan `value` di KontrakA.
zh_cn: 正如你所看到的，我们必须首先在我们的合约中导入`IContractBDispatcherTrait`和`IContractBLibraryDispatcher`，它们是由编译器从我们的接口中生成的。然后，我们可以创建一个 `IContractBLibraryDispatcher` 实例，并将我们要调用库的类的 `class_hash` 传递进去。在这里，我们可以调用该类中定义的函数，在我们的合约上下文中执行其逻辑。当我们在合约 A 上调用 `set_value` 时，它将对合约 B 中的 `set_value` 函数进行库调用，更新合约 A 中存储变量 `value` 的值。

source: ## Using low-level syscalls
zh_cn: ## 使用底层系统调用来

source: <span class="caption">Listing 99-9: A sample contract using syscalls</span>
zh_cn: <span class="caption">示例 99-9：使用系统调用的合约示例</span>

source: # Other examples
zh_cn: # 其他例子

source: # Deploying and Interacting with a Voting contract
zh_cn: # 部署表决合约并与之互动

source: <span class="caption">Voting smart contract</span>
zh_cn: <span class="caption">投票智能合约</span>

source: ## Deploying, calling and invoking the Voting Contract
zh_cn: ## 部署、调用和唤起投票合约

source: - Calling contracts: Interacting with external functions that only read from the state. These functions do not alter the state of the network, so they don't require fees or signing. - Invoking contracts: Interacting with external functions that can write to the state. These functions do alter the state of the network and require fees and signing.
zh_cn: - 调用合约：与只读取状态的外部函数交互。这些函数不会改变网络的状态，因此不需要付费或签署。 - 唤起合约：与可以写入状态的外部函数交互。这些函数会改变网络状态，因此需要付费或签署。

source: We will setup a local development node using `katana` to deploy the voting contract. Then, we'll interact with the contract by calling and invoking its functions. You can also use the Goerli Testnet instead of `katana`. However, we recommend using `katana` for local development and testing. You can find the complete tutorial for `katana` in the [Local Development with Katana](https://book.starknet.io/chapter_3/katana.html) chapter of the Starknet Book.
id: Kami akan menyiapkan node pengembangan lokal menggunakan `katana` untuk mendeploy kontrak pemilihan. Selanjutnya, kita akan berinteraksi dengan kontrak tersebut dengan memanggil dan memanggil fungsi-fungsinya. Anda juga dapat menggunakan Goerli Testnet sebagai pengganti `katana`. Namun, kami merekomendasikan menggunakan `katana` untuk pengembangan dan pengujian lokal. Anda dapat menemukan panduan lengkap untuk `katana` dalam bab [Pengembangan Lokal dengan Katana](https://book.starknet.io/chapter_3/katana.html) dari Buku Starknet.
zh_cn: 我们将使用 `katana` 设置一个本地开发节点来部署投票合约。然后，我们将通过调用和调用其函数与合约进行交互。你也可以使用Goerli测试网络而不是 `katana`。然而，我们建议在本地开发和测试中使用 `katana`。你可以在Starknet Book的 [Local Development with Katana](https://book.starknet.io/chapter_3/katana.html) 章节中找到有关 `katana` 的完整教程。

source: ### The `katana` local Starknet node
zh_cn: ### `katana` 本地Starknet节点

source: To install `katana` from the source code, please refer to the [Local Development with Katana](https://book.starknet.io/chapter_3/katana.html) chapter of the Starknet Book.
id: Untuk menginstal `katana` dari kode sumber, silakan lihat bab [Pengembangan Lokal dengan Katana](https://book.starknet.io/chapter_3/katana.html) pada Buku Starknet.
zh_cn: 要从源代码安装 `katana`，请参考Starknet Book的 [Local Development with Katana](https://book.starknet.io/chapter_3/katana.html) 章节。

source: Before we can interact with the voting contract, we need to prepare the voter and admin accounts on Starknet. Each voter account must be registered and sufficiently funded for voting. For a more detailed understanding of how accounts operate with Account Abstraction, refer to the [Account Abstraction](https://book.starknet.io/chapter_4/index.html) chapter of the Starknet Book.
id: Sebelum kita dapat berinteraksi dengan kontrak pemilihan, kita perlu menyiapkan akun pemilih dan admin di Starknet. Setiap akun pemilih harus didaftarkan dan memiliki cukup dana untuk memberikan suara. Untuk pemahaman yang lebih rinci tentang bagaimana akun beroperasi dengan Abstraksi Akun, lihat bab [Abstraksi Akun](https://book.starknet.io/chapter_4/index.html) dari Buku Starknet.
zh_cn: 在我们与投票合约进行交互之前，我们需要在Starknet上准备选民和管理员账户。每个选民账户必须进行注册，并具备足够的资金进行投票。如果你想更详细地了解账户如何与账户抽象一起操作，请参考Starknet Book的 [账户抽象](https://book.starknet.io/chapter_4/index.html) 章节。

source: ### Smart wallets for voting
zh_cn: ### 用于投票的智能钱包

source: Aside from Scarb you will need to have Starkli installed. Starkli is a command line tool that allows you to interact with Starknet. You can find the installation instructions in the [Environment setup](https://book.starknet.io/chapter_1/environment_setup.html) chapter of the Starknet Book.
id: Selain Scarb, Anda juga perlu menginstal Starkli. Starkli adalah alat baris perintah yang memungkinkan Anda berinteraksi dengan Starknet. Anda dapat menemukan petunjuk instalasi di bab [Pengaturan Environment](https://book.starknet.io/chapter_1/environment_setup.html) dari Buku Starknet.
zh_cn: 除了Scarb之外，你还需要安装Starkli。Starkli是一个命令行工具，允许你与Starknet进行交互。你可以在Starknet Book的 [环境初始化](https://book.starknet.io/chapter_1/environment_setup.html) 章节中找到安装说明。

source: For each smart wallet we'll use, we must create a Signer within the encrypted keystore and an Account Descriptor. This process is also detailed in the [Environment setup](https://book.starknet.io/chapter_1/environment_setup.html) chapter of the Starknet Book.
id: Untuk setiap dompet pintar yang akan kita gunakan, kita harus membuat Pemeterai (Signer) di dalam keystore terenkripsi dan sebuah Deskripsi Akun. Proses ini juga dijelaskan secara rinci dalam bab [Pengaturan Environment](https://book.starknet.io/chapter_1/environment_setup.html) dari Buku Starknet.
zh_cn: 对于我们将使用的每个智能钱包，我们必须在加密的密钥库中创建一个签名者和一个账户描述符。这个过程也在Starknet Book的[环境初始化](https://book.starknet.io/chapter_1/environment_setup.html) 章节中详细介绍了。

source: ### Contract Deployment
zh_cn: ### 合约部署

source: ### Voter Eligibility Verification
zh_cn: ### 投票人资格验证

source: ### Casting a Vote
zh_cn: ### 投票

source: ### Visualizing Vote Outcomes
zh_cn: ### 投票结果可视化

source: # L1-L2 Messaging
zh_cn: # L1-L2 间信息传递

source: - **Asynchronous**: this means that in your contract code (being solidity or cairo), you can't wait the result of the message being sent on the other chain within your contract code execution. - **Asymmetric**: sending a message from Ethereum to Starknet (`L1->L2`) is fully automatized by the Starknet sequencer, which means that the message is being automatically delivered to the target contract on L2. However, when sending a message from Starknet to Ethereum (`L2->L1`), only the hash of the message is sent on L1 by the Starknet sequencer. You must then consume the message manually via a transaction on L1.
zh_cn: - **异步性**：这意味着在你的合约代码（无论是Solidity还是Cairo）中，在合约代码执行期间，你不能等待另一个链上发送消息的结果。 - **非对称性**：从以太坊发送消息到Starknet（`L1->L2`）是由Starknet序列器完全自动化的，这意味着消息会自动传递到L2上的目标合约。然而，当从Starknet发送消息到以太坊（`L2->L1`）时，Starknet序列器仅在L1上发送消息的哈希。然后，你必须通过L1上的交易来手动消耗该消息。

source: ## The StarknetMessaging Contract
zh_cn: ## Starknet消息传递合约

source: <span class="caption"> Starknet messaging contract interface</span>
zh_cn: <span class="caption">Starknet消息传送合约接口</span>

source: In the case of `L1->L2` messages, the Starknet sequencer is constantly listening to the logs emitted by the `StarknetMessaging` contract on Ethereum. Once a message is detected in a log, the sequencer prepares and executes a `L1HandlerTransaction` to call the function on the target L2 contract. This takes up to 1-2 minutes to be done (few seconds for ethereum block to be mined, and then the sequencer must build and execute the transaction).
zh_cn: 对于 `L1->L2` 的消息，Starknet序列器不断监听以太坊上的 `StarknetMessaging` 合约发出的日志。 一旦在日志中检测到消息，序列器会准备并执行 `L1HandlerTransaction`，以调用目标L2合约上的函数。这个过程可能需要1-2分钟（几秒钟用于挖掘以太坊区块，然后序列器必须构建并执行事务）。

source: `L2->L1` messages are prepared by contracts execution on L2 and are part of the block produced. When the sequencer produces a block, it sends the hash of each message prepared by contracts execution to the `StarknetCore` contract on L1, where they can then be consumed once the block they belong to is proven and verified on Ethereum (which for now is around 3-4 hours).
zh_cn: `L2->L1` 的消息是由在L2上执行的合约准备的，并且是生成的区块的一部分。当序列器生成一个区块时，序列器将把合约执行准备的每个消息的哈希发送到L1上的 `StarknetCore` 合约，一旦它们所属的区块在以太坊上被证明和验证（目前大约需要3-4小时），这些消息就可以被消耗。

source: ## Sending messages from Ethereum to Starknet
zh_cn: ## 从以太坊向Starknet发送信息

source: Let's take a simple contract taken from [this tutorial](https://github.com/glihm/starknet-messaging-dev/blob/main/solidity/src/ContractMsg.sol) where we want to send a message to Starknet. The `_snMessaging` is a state variable already initialized with the address of the `StarknetMessaging` contract. You can check those addresses [here](https://docs.starknet.io/documentation/tools/important_addresses/).
zh_cn: 让我们看一个简单的合约，来自[这个教程](https://github.com/glihm/starknet-messaging-dev/blob/main/solidity/src/ContractMsg.sol) 我们希望向Starknet发送一条消息。 `_snMessaging` 是一个已经初始化为 `StarknetMessaging` 合约地址的状态变量。你可以在[这里](https://docs.starknet.io/documentation/tools/important_addresses/)检查这些地址。

source: The function sends a message with a single felt value to the `StarknetMessaging` contract. Please note that if you want to send more complex data you can. Just be aware that your cairo contract will only understand `felt252` data type. So you must ensure that the serialization of your data into the `uint256` array follow the cairo serialization scheme.
zh_cn: 该函数向 `StarknetMessaging` 合约发送一个包含单个 felt 值的消息。 请注意，如果你想发送更复杂的数据，可以这样做。只是要注意，你的 Cairo 合约只能理解 `felt252` 数据类型。因此，你必须确保将数据序列化为 `uint256` 数组时，要按照 Cairo 的序列化方案进行操作。

source: It's important to note that we have `{value: msg.value}`. In fact, the minimum value we've to send here is `20k wei`, due to the fact that the `StarknetMessaging` contract will register the hash of our message in the storage of Ethereum.
zh_cn: 这里需要注意的是我们有 `{value: msg.value}`。实际上，我们在这里必须发送的最小值是 `20,000 wei` ，因为 `StarknetMessaging` 合约会在以太坊的存储中注册我们消息的哈希。
