Repository: cairo-book/cairo-book
Catalog: po/*.po
Languages: es, id, ko, zh_cn

source: A struct, or structure, is a custom data type that lets you package together and name multiple related values that make up a meaningful group. If you’re familiar with an object-oriented language, a struct is like an object’s data attributes. In this chapter, we’ll compare and contrast tuples with structs to build on what you already know and demonstrate when structs are a better way to group data.
es: Un struct, o estructura, es un tipo de datos personalizado que te permite empaquetar y nombrar múltiples valores relacionados que conforman un grupo significativo. Si estás familiarizado con un lenguaje orientado a objetos, un struct es como los atributos de datos de un objeto. En este capítulo, compararemos y contrastaremos las tuplas con los structs para construir sobre lo que ya sabes y demostrar cuándo los structs son una mejor manera de agrupar datos.
id: Sebuah struct, atau struktur, adalah tipe data kustom yang memungkinkan Anda untuk mengemas bersama dan memberi nama pada beberapa nilai terkait yang membentuk kelompok yang bermakna. Jika Anda familiar dengan bahasa pemrograman berbasis objek, sebuah struct mirip dengan atribut data objek. Dalam bab ini, kita akan membandingkan dan kontras antara tuple dengan struct untuk memperluas pengetahuan Anda dan menunjukkan kapan struct menjadi cara yang lebih baik untuk mengelompokkan data.
ko: 구조체는 사용자 정의 데이터 유형으로, 의미 있는 그룹을 구성하는 여러 관련 값을 함께 묶고 이름을 붙일 수 있게 해주는 것입니다. 객체 지향 언어에 익숙하다면, 구조체는 객체의 데이터 속성과 유사합니다. 이 장에서는 이미 알고 있는 내용을 바탕으로 튜플과 구조체를 비교하고 대조하여, 언제 구조체가 데이터를 그룹화하는 더 나은 방법인지를 보여줍니다.
zh_cn: 结构体（ _struct_ ），或称 _structure_ ，是一种自定义的数据类型，允许你包装和命名多个相关的值，从而形成一个有意义的组合。如果你熟悉一门面向对象语言，struct 就像对象中的数据属性。在本章中，我们会对元组和结构体进行比较和对比，并演示什么时候结构体是一种更好的数据分组方式。

source: We’ll demonstrate how to define and instantiate structs. We’ll discuss how to define associated functions, especially the kind of associated functions called methods, to specify behavior associated with a struct type. Structs and enums (discussed in the [next chapter](ch06-01-enums.md)) are the building blocks for creating new types in your program’s domain to take full advantage of Cairo's compile-time type checking.
ko: 우리는 어떻게 구조체를 정의하고 인스턴스화하는지를 보여줄 것입니다. 특히 메서드라고 불리는 연관 함수를 정의하는 방법에 대해 논의할 것입니다. 구조체와 열거형(다음 장에서 다룰 예정)은 Cairo의 컴파일 시간 타입 체크를 최대한 활용하기 위해 프로그램 도메인에서 새로운 타입을 생성하는 데 사용되는 기본 요소입니다.

source: Structs are similar to tuples, discussed in the [Data Types](ch02-02-data-types.md) section, in that both hold multiple related values. Like tuples, the pieces of a struct can be different types. Unlike with tuples, in a struct you’ll name each piece of data so it’s clear what the values mean. Adding these names means that structs are more flexible than tuples: you don’t have to rely on the order of the data to specify or access the values of an instance.
id: Struct mirip dengan tuple, yang dibahas dalam bagian [Tipe Data](ch02-02-data-types.md), karena keduanya menyimpan beberapa nilai terkait. Seperti tuple, bagian-bagian dari sebuah struct dapat memiliki tipe yang berbeda-beda. Berbeda dengan tuple, dalam sebuah struct, Anda akan memberi nama pada setiap bagian data sehingga jelas apa arti dari nilai-nilai tersebut. Menambahkan nama-nama ini berarti bahwa struct lebih fleksibel daripada tuple: Anda tidak perlu bergantung pada urutan data untuk menentukan atau mengakses nilai dari sebuah instance.
ko: 구조체는 튜플과 유사하며, [데이터 유형](ch02-02-data-types.md) 섹션에서 설명된 것처럼 둘 다 여러 관련 값들을 보유합니다. 튜플과 마찬가지로 구조체의 구성 요소는 다른 유형일 수 있습니다. 튜플과 달리 구조체에서는 각 데이터 조각에 이름을 지정하여 값의 의미를 명확하게 합니다. 이러한 이름을 추가하면 구조체가 튜플보다 유연해지며, 데이터의 순서에 의존하지 않고 인스턴스의 값을 지정하거나 액세스할 수 있습니다.
zh_cn: 结构体与[数据类型](ch02-02-data-types.md)一节中讨论的元组类似，它们都包含多个相关的值。和元组一样，结构体的每一部分可以是不同类型。但不同于元组，结构体需要命名各部分数据以便能清楚的表明其值的意义。由于有了这些命名，结构体比元组更灵活：不需要依赖顺序来指定或访问实例中的值。

source: To define a struct, we enter the keyword `struct` and name the entire struct. A struct’s name should describe the significance of the pieces of data being grouped together. Then, inside curly brackets, we define the names and types of the pieces of data, which we call fields. For example, Listing 5-1 shows a struct that stores information about a user account.
id: Untuk mendefinisikan sebuah struct, kita masukkan kata kunci `struct` dan memberi nama pada keseluruhan struct. Nama struct sebaiknya menggambarkan signifikansi dari potongan-potongan data yang dikelompokkan bersama. Kemudian, di dalam kurung kurawal, kita mendefinisikan nama dan tipe dari potongan-potongan data tersebut, yang disebut sebagai fields. Sebagai contoh, Listing 5-1 menunjukkan sebuah struct yang menyimpan informasi tentang sebuah akun pengguna.
ko: 구조체를 정의하려면 키워드 'struct'를 입력하고 전체 구조체의 이름을 지정합니다. 구조체의 이름은 함께 그룹화된 데이터 조각의 중요성을 설명해야 합니다. 그런 다음 중괄호 안에서 데이터 조각의 이름과 유형을 정의합니다. 이를 필드라고 합니다. 예를 들어, Listing 5-1은 사용자 계정 정보를 저장하는 구조체를 보여줍니다.
zh_cn: 定义结构体，需要使用 `struct` 关键字并为整个结构体提供一个名字。结构体的名字需要描述它所组合的数据的意义。接着，在大括号中，定义每一部分数据的名字和类型，我们称为 字段（field）。例如，示例 5-1 展示了一个存储用户账号信息的结构体。

source: Listing 5-1: A `User` struct definition
id: Listing 5-1: Definisi struct `User`
ko: 리스트 5-1: `User` 구조체 정의

source: To use a struct after we’ve defined it, we create an _instance_ of that struct by specifying concrete values for each of the fields. We create an instance by stating the name of the struct and then add curly brackets containing _key: value_ pairs, where the keys are the names of the fields and the values are the data we want to store in those fields. We don’t have to specify the fields in the same order in which we declared them in the struct. In other words, the struct definition is like a general template for the type, and instances fill in that template with particular data to create values of the type.
id: Untuk menggunakan sebuah struct setelah kita telah mendefinisikannya, kita membuat sebuah _instance_ dari struct tersebut dengan menentukan nilai konkret untuk setiap fieldnya. Kita membuat sebuah instance dengan menyebutkan nama struct dan kemudian menambahkan kurung kurawal yang berisi pasangan _key: value_, di mana kunci-kuncinya adalah nama-nama field dan nilai-nilainya adalah data yang ingin kita simpan dalam field-field tersebut. Kita tidak harus menyebutkan field-field tersebut dalam urutan yang sama dengan yang kita deklarasikan dalam struct. Dengan kata lain, definisi struct tersebut seperti template umum untuk tipe data, dan instance mengisi template tersebut dengan data tertentu untuk membuat nilai dari tipe tersebut.
ko: 구조체를 정의한 후에 사용하려면, 각 필드에 구체적인 값을 지정하여 해당 구조체의 _인스턴스_ 를 생성합니다. 우리는 구조체의 이름을 명시하고 그 다음에 _키: 값_ 쌍을 포함하는 중괄호를 추가하여 인스턴스를 생성합니다. 여기서 키는 필드의 이름이고 값은 해당 필드에 저장하려는 데이터입니다. 우리는 구조체를 선언할 때 필드를 동일한 순서로 지정할 필요가 없습니다. 다시 말해, 구조체 정의는 해당 유형에 대한 일반 템플릿과 같으며, 인스턴스는 해당 템플릿을 특정 데이터로 채워 해당 유형의 값을 생성합니다.

source: For example, we can declare two particular users as shown in Listing 5-2.
ko: 예를 들어, 우리는 5-2 목록에 표시된 두 명의 특정 사용자를 선언할 수 있습니다.

source: Listing 5-2: Creating two instances of the `User` struct
ko: 리스트 5-2: `User` 구조체의 두 인스턴스 생성하기

source: To get a specific value from a struct, we use dot notation. For example, to access `user1`'s email address, we use `user1.email`. If the instance is mutable, we can change a value by using the dot notation and assigning into a particular field. Listing 5-3 shows how to change the value in the `email` field of a mutable `User` instance.
ko: 구조체에서 특정 값을 가져오려면 점 표기법을 사용합니다. 예를 들어 `user1`의 이메일 주소에 접근하려면 `user1.email`을 사용합니다. 인스턴스가 가변적인 경우, 특정 필드에 값을 할당하여 값을 변경할 수 있습니다. 5-3 목록은 가변적인 `User` 인스턴스의 `email` 필드의 값을 변경하는 방법을 보여줍니다.

source: Listing 5-3: Changing the value in the email field of a `User` instance
id: Listing 5-3: Mengubah nilai dalam field email dari sebuah instance `User`
ko: 리스팅 5-3: `User` 인스턴스의 이메일 필드 값 변경하기

source: Note that the entire instance must be mutable; Cairo doesn’t allow us to mark only certain fields as mutable.
es: Tenga en cuenta que toda la instancia debe ser mutable; Cairo no nos permite marcar solo ciertos campos como mutables.
id: Perlu diingat bahwa seluruh instance harus mutable; Cairo tidak mengizinkan kita untuk menandai hanya beberapa field tertentu sebagai mutable.
ko: 전체 인스턴스가 가변해야 한다는 점을 유의하세요. 카이로는 특정 필드만을 가변으로 표시할 수 없습니다.
zh_cn: 注意，整个实例必须是可变的；Cairo不允许我们只把某些字段标记为可变的。

source: As with any expression, we can construct a new instance of the struct as the last expression in the function body to implicitly return that new instance.
es: Como con cualquier expresión, podemos construir una nueva instancia de la estructura como la última expresión en el cuerpo de la función para devolver implícitamente esa nueva instancia.
id: Seperti halnya dengan ekspresi lainnya, kita dapat membuat sebuah instance baru dari struct sebagai ekspresi terakhir dalam tubuh fungsi untuk secara implisit mengembalikan instance baru tersebut.
ko: 모든 표현과 마찬가지로, 우리는 새로운 구조체의 인스턴스를 함수 본문의 마지막 표현식으로 구성하여 해당 새 인스턴스를 암시적으로 반환할 수 있습니다.
zh_cn: 与任何表达式一样，我们可以在函数主体的最后一个表达式中构造一个新的结构体实例，以隐式返回该新实例。

source: Listing 5-4 shows a `build_user` function that returns a `User` instance with the given email and username. The `active` field gets the value of `true`, and the `sign_in_count` gets a value of `1`.
id: Listing 5-4 menunjukkan sebuah fungsi `build_user` yang mengembalikan sebuah instance `User` dengan email dan username yang diberikan. Field `active` mendapatkan nilai `true`, dan field `sign_in_count` mendapatkan nilai `1`.
ko: 5-4 목록은 주어진 이메일과 사용자 이름을 가진 `User` 인스턴스를 반환하는 `build_user` 함수를 보여줍니다. `active` 필드는 `true`의 값을 받고, `sign_in_count`는 `1`의 값을 받습니다.
zh_cn: 示例5-4显示了一个`build_user`函数，该函数返回一个`User`实例，并给出了电子邮件和用户名。`active`字段的值为`true`，`sign_in_count`的值为`1`。

source: Listing 5-4: A `build_user` function that takes an email and username and returns a `User` instance
id: Listing 5-4: Sebuah fungsi `build_user` yang mengambil email dan username, dan mengembalikan sebuah instance `User`
ko: 리스팅 5-4: 이메일과 사용자 이름을 가져와 `User` 인스턴스를 반환하는 `build_user` 함수

source: It makes sense to name the function parameters with the same name as the struct fields, but having to repeat the `email` and `username` field names and variables is a bit tedious. If the struct had more fields, repeating each name would get even more annoying. Luckily, there’s a convenient shorthand!
es: Tiene sentido nombrar los parámetros de la función con el mismo nombre que los campos de la estructura, porque tener que repetir los nombres y variables de los campos `email`y `username` es un poco tedioso. Si la estructura tuviera más campos, repetir cada nombre sería aún más molesto. ¡Afortunadamente, hay una forma abreviada!
id: Masuk akal untuk memberi nama parameter fungsi dengan nama yang sama dengan field-field struct, tetapi harus mengulang nama field `email` dan `username` serta variabelnya agak menjengkelkan. Jika struct memiliki lebih banyak field, pengulangan setiap nama akan menjadi lebih menjengkelkan. Untungnya, ada sebuah singkatan yang nyaman!
ko: 함수 매개변수를 구조체 필드와 동일한 이름으로 지정하는 것은 이치에 맞지만, `email`과 `username` 필드 이름과 변수를 반복해야 하는 것은 약간 지루합니다. 구조체에 더 많은 필드가 있다면, 각 이름을 반복하는 것이 더 귀찮아질 것입니다. 다행히도 편리한 축약형이 있습니다!
zh_cn: 为函数参数起与结构体字段相同的名字是可以理解的，但必须重复`email`和`username`字段的名称和变量就有点乏味了。如果结构体有更多字段，重复每个名称就更加烦人了。幸运的是，有一个方便的简写语法！

source: Using the Field Init Shorthand
id: Menggunakan Singkatan Inisialisasi Field
ko: 필드 이닛 축약법 사용하기

source: Because the parameter names and the struct field names are exactly the same in Listing 5-4, we can use the field init shorthand syntax to rewrite `build_user` so it behaves exactly the same but doesn’t have the repetition of `username` and `email`, as shown in Listing 5-5.
id: Karena nama-nama parameter dan nama-nama field struct sama persis dalam Listing 5-4, kita dapat menggunakan sintaks singkatan inisialisasi field untuk menulis ulang `build_user` sehingga berfungsi sama persis tetapi tidak memiliki pengulangan `username` dan `email`, seperti yang ditunjukkan dalam Listing 5-5.
ko: 리스팅 5-4에서 매개변수 이름과 구조체 필드 이름이 정확히 같기 때문에, 우리는 필드 초기화 축약 구문을 사용하여 `build_user`를 다시 작성할 수 있습니다. 이렇게 하면 `username`과 `email`의 반복을 없앨 수 있지만 동일하게 작동합니다. 이는 리스팅 5-5에 나와 있습니다.
zh_cn: 因为示例 5-4 中的参数名与字段名都完全相同，我们可以使用字段初始化简写语法（field init shorthand）来重写 `build_user`。如示例 5-5 所示，重写后其行为与之前完全相同，不过无需重复 `username` 和 `email` 了。

source: Listing 5-5: A `build_user` function that uses field init shorthand because the `username` and `email` parameters have the same name as struct fields
id: Listing 5-5: Sebuah fungsi `build_user` yang menggunakan singkatan inisialisasi field karena parameter `username` dan `email` memiliki nama yang sama dengan field struct
ko: 리스트 5-5: `username` 및 `email` 매개변수가 구조체 필드와 동일한 이름을 가지고 있기 때문에 필드 초기화 단축 구문을 사용하는 `build_user` 함수

source: Here, we’re creating a new instance of the `User` struct, which has a field named `email`. We want to set the `email` field’s value to the value in the `email` parameter of the `build_user` function. Because the `email` field and the `email` parameter have the same name, we only need to write `email` rather than `email: email`.
es: Aquí, estamos creando una nueva instancia de la estructura `User`, que tiene un campo llamado `email`. Queremos establecer el valor del campo `email` con el valor del parámetro `email` de la función `build_user`. Debido a que el campo `email` y el parámetro `email` tienen el mismo nombre, solo necesitamos escribir `email` en lugar de `email: email`.
id: Di sini, kita sedang membuat sebuah instance baru dari struct `User`, yang memiliki field bernama `email`. Kita ingin mengatur nilai field `email` ke nilai dari parameter `email` dalam fungsi `build_user`. Karena field `email` dan parameter `email` memiliki nama yang sama, kita hanya perlu menulis `email` daripada `email: email`.
ko: 여기서는 `User` 구조체의 새 인스턴스를 생성하고 있습니다. 이 구조체는 `email`이라는 필드를 가지고 있습니다. 우리는 `email` 필드의 값을 `build_user` 함수의 `email` 매개변수의 값으로 설정하고 싶습니다. `email` 필드와 `email` 매개변수가 같은 이름을 가지고 있기 때문에 `email: email` 대신에 `email`만 작성하면 됩니다.
zh_cn: 这里，我们正在创建一个新的 `User` 结构体实例，它有一个名为 `email`的字段。我们希望将`email`字段的值设置为`build_user`函数的`email`参数中的值。因为`email`字段和`email`参数有相同的名字，我们只需要写`email`而不是`email: email`。

source: To understand when we might want to use structs, let’s write a program that calculates the area of a rectangle. We’ll start by using single variables, and then refactor the program until we’re using structs instead.
es: Para entender cuándo podríamos usar estructuras, escribamos un programa que calcule el área de un rectángulo. Comenzaremos usando variables individuales y luego reescribiremos el programa hasta que estemos usando estructuras en su lugar.
id: Untuk memahami kapan kita mungkin ingin menggunakan struct, mari kita tulis sebuah program yang menghitung luas dari sebuah persegi panjang. Kita akan mulai dengan menggunakan variabel tunggal, dan kemudian melakukan refaktor program hingga pada akhirnya kita menggunakan struct.
ko: 우리가 구조체를 사용하고 싶을 때를 이해하기 위해, 직사각형의 면적을 계산하는 프로그램을 작성해 봅시다. 우리는 먼저 단일 변수를 사용하여 시작하고, 그런 다음 구조체를 사용하도록 프로그램을 리팩터링할 것입니다.
zh_cn: 为了理解何时会需要使用结构体，让我们编写一个计算长方形面积的程序。我们会从单独的变量开始，接着重构程序直到使用结构体替代他们为止。

source: Let’s make a new project with Scarb called _rectangles_ that will take the width and height of a rectangle specified in pixels and calculate the area of the rectangle. Listing 5-6 shows a short program with one way of doing exactly that in our project’s _src/lib.cairo_.
id: Mari buat proyek baru dengan Scarb yang disebut _rectangles_ yang akan mengambil lebar dan tinggi dari sebuah persegi panjang yang ditentukan dalam piksel dan menghitung luas dari persegi panjang tersebut. Listing 5-6 menunjukkan sebuah program pendek dengan salah satu cara untuk melakukan hal tersebut dalam _src/lib.cairo_ dari proyek kita.
ko: Scarb와 함께 _rectangles_ 라는 새 프로젝트를 만들어 보겠습니다. 이 프로젝트는 픽셀로 지정된 직사각형의 너비와 높이를 가져와 직사각형의 면적을 계산할 것입니다. 5-6 목록은 프로젝트의 _src/lib.cairo_ 에서 정확히 그 작업을 수행하는 한 가지 방법을 보여줍니다.
zh_cn: 让我们用Scarb创建一个名为 _rectangles_ 的新项目，它获取以像素为单位的长方形的宽度和高度，并计算出长方形的面积。示例5-6显示了位于项目中的 _src/lib.cairo_ 中的小程序，它刚好实现此功能。

source: "Area is {}"
ko: "면적은 {}입니다"

source: Listing 5-6: Calculating the area of a rectangle specified by separate width and height variables
id: Listing 5-6: Menghitung luas dari sebuah persegi panjang yang ditentukan oleh variabel lebar dan tinggi terpisah
ko: 리스팅 5-6: 별도의 너비와 높이 변수로 지정된 직사각형의 면적 계산

source: Now run the program with `scarb cairo-run`:
id: Sekarang jalankan program dengan `scarb cairo-run`:
ko: 지금 `scarb cairo-run`으로 프로그램을 실행하세요.
zh_cn: 现在用`scarb cairo-run`运行该程序：

source: This code succeeds in figuring out the area of the rectangle by calling the `area` function with each dimension, but we can do more to make this code clear and readable.
es: Este código logra calcular el área del rectángulo llamando a la función `area` con cada dimensión, pero podemos hacer más para que este código sea claro y legible.
id: Kode ini berhasil dalam menemukan luas dari persegi panjang dengan memanggil fungsi `area` dengan setiap dimensi, tetapi kita dapat melakukan lebih untuk membuat kode ini lebih jelas dan mudah dibaca.
ko: 이 코드는 각 차원을 사용하여 `area` 함수를 호출하여 직사각형의 면적을 계산하는 데 성공합니다. 그러나 이 코드를 더 명확하고 가독성 있게 만들 수 있습니다.
zh_cn: 这段代码通过调用每个维度的`area`函数，成功地算出了矩形的面积，但我们仍然可以修改这段代码来使它的意义更加明确，并且增加可读性。

source: The issue with this code is evident in the signature of `area`:
es: El problema con este código es evidente en la declaración de la función `area`:
id: Permasalahan pada kode ini terlihat pada tanda tangan dari `area`:
ko: 이 코드의 문제는 `area`의 시그니처에서 명확하게 나타납니다.
zh_cn: 这段代码的问题在 `area` 的签名中很明显：

source: The `area` function is supposed to calculate the area of one rectangle, but the function we wrote has two parameters, and it’s not clear anywhere in our program that the parameters are related. It would be more readable and more manageable to group width and height together. We’ve already discussed one way we might do that in the [tuple section of Chapter 2](ch02-02-data-types.html#the-tuple-type).
ko: `area` 함수는 하나의 직사각형의 넓이를 계산해야하지만, 우리가 작성한 함수는 두 개의 매개변수를 가지고 있으며, 우리 프로그램 어디에서도 이 매개변수들이 관련되어 있다는 것이 명확하지 않습니다. 너비와 높이를 함께 그룹화하는 것이 더 읽기 쉽고 관리하기 쉬울 것입니다. 이미 [2장 튜플 섹션](ch02-02-data-types.html#the-tuple-type)에서 그것을 어떻게 할 수 있는지에 대해 논의했습니다.

source: Refactoring with Tuples
id: Refaktorisasi dengan Tuple
ko: 튜플을 사용한 리팩터링

source: Listing 5-7 shows another version of our program that uses tuples.
id: Listing 5-7 menunjukkan versi lain dari program kita yang menggunakan tuple.
ko: 5-7 목록은 튜플을 사용하는 우리 프로그램의 다른 버전을 보여줍니다.
zh_cn: 示例5-7显示了我们使用元组的另一个程序版本。

source: Listing 5-7: Specifying the width and height of the rectangle with a tuple
id: Listing 5-7: Menentukan lebar dan tinggi dari persegi panjang dengan sebuah tuple
ko: 리스트 5-7: 튜플을 사용하여 직사각형의 너비와 높이 지정하기

source: In one way, this program is better. Tuples let us add a bit of structure, and we’re now passing just one argument. But in another way, this version is less clear: tuples don’t name their elements, so we have to index into the parts of the tuple, making our calculation less obvious.
es: En cierto modo, este programa es mejor. Las tuplas nos permiten agregar un poco de estructura y ahora estamos pasando solo un argumento. Pero en otro sentido, esta versión es menos clara: las tuplas no nombran sus elementos, por lo que tenemos que indexar las partes de la tupla, lo que hace que nuestro cálculo sea menos obvio.
id: Dalam satu hal, program ini lebih baik. Tuple memungkinkan kita menambahkan sedikit struktur, dan sekarang kita hanya melewatkan satu argumen. Tetapi dalam hal lain, versi ini kurang jelas: tuple tidak memberi nama pada elemen-elemennya, sehingga kita harus mengindeks ke dalam bagian-bagian dari tuple, membuat perhitungan kita menjadi kurang jelas.
ko: 한 가지 측면에서 이 프로그램은 더 나아졌습니다. 튜플을 사용하면 약간의 구조를 추가할 수 있고, 이제는 하나의 인수만 전달하고 있습니다. 그러나 다른 한 측면에서는 이 버전이 덜 명확합니다: 튜플은 요소에 이름을 지정하지 않으므로 튜플의 부분에 색인을 사용해야 하며, 이로 인해 계산이 덜 명확해집니다.
zh_cn: 在某种程度上说，这个程序更好一点了。元组帮助我们增加了一些结构性，并且现在只需传一个参数。不过在另一方面，这个版本却有一点不明确了：元组并没有给出元素的名称，所以计算变得更费解了，因为不得不使用索引来获取元组的每一部分。

source: Mixing up the width and height wouldn’t matter for the area calculation, but if we want to calculate the difference, it would matter! We would have to keep in mind that `width` is the tuple index `0` and `height` is the tuple index `1`. This would be even harder for someone else to figure out and keep in mind if they were to use our code. Because we haven’t conveyed the meaning of our data in our code, it’s now easier to introduce errors.
es: Mezclar el ancho y la altura no importaría para el cálculo del área, pero si queremos calcular la diferencia, ¡sería importante! Tendríamos que tener en cuenta que `width` es el índice de tupla `0` y `height` es el índice de tupla `1`. Esto sería aún más difícil de entender y tener en cuenta para otra persona si usara nuestro código. Debido a que no hemos transmitido el significado de nuestros datos en nuestro código, ahora es más fácil introducir errores.
id: Bercampurnya lebar dan tinggi tidak akan masalah dalam perhitungan luas, tetapi jika kita ingin menghitung perbedaannya, hal ini akan menjadi masalah! Kita harus ingat bahwa `width` adalah indeks `0` dari tuple dan `height` adalah indeks `1` dari tuple. Ini akan menjadi lebih sulit bagi orang lain untuk memahami dan diingat jika mereka ingin menggunakan kode kita. Karena kita belum menyampaikan makna dari data kita dalam kode kita, sekarang lebih mudah untuk memperkenalkan kesalahan.
ko: 너비와 높이를 혼동해도 면적 계산에는 상관이 없지만, 차이를 계산하려면 상관이 있습니다! '너비'가 튜플 인덱스 '0'이고 '높이'가 튜플 인덱스 '1'임을 염두에 두어야 합니다. 우리의 코드를 사용하는 다른 사람이 이를 이해하고 기억하는 것은 더 어려울 것입니다. 우리의 코드에서 데이터의 의미를 전달하지 않았기 때문에 이제 오류를 도입하기가 더 쉬워졌습니다.
zh_cn: 混淆宽度和高度对于计算面积来说并不重要，但是如果我们想计算差值，那就很重要了。我们必须记住 `width` 是元组索引`0`， `height` 是元组索引`1`。如果其他人要使用这些代码，他们必须要搞清楚这一点，并也要牢记于心。很容易忘记或者混淆这些值而造成错误，因为我们没有在代码中传达数据的意图。

source: Refactoring with Structs: Adding More Meaning
id: Refaktorisasi dengan Struct: Menambahkan Lebih Banyak Makna
ko: 구조체를 사용한 리팩터링: 더 많은 의미 추가하기

source: We use structs to add meaning by labeling the data. We can transform the tuple we’re using into a struct with a name for the whole as well as names for the parts.
es: Usamos estructuras para agregar significado al etiquetar los datos. Podemos transformar la tupla que estamos usando en una estructura con un nombre para el todo y nombres para las partes.
id: Kita menggunakan struct untuk menambahkan makna dengan memberi label pada data. Kita dapat mengubah tuple yang kita gunakan menjadi sebuah struct dengan sebuah nama untuk keseluruhan serta nama-nama untuk bagian-bagiannya.
ko: 우리는 데이터에 레이블을 붙여 의미를 추가하기 위해 구조체를 사용합니다. 우리는 사용 중인 튜플을 전체를 위한 이름과 각 부분을 위한 이름을 가진 구조체로 변환할 수 있습니다.
zh_cn: 我们使用结构体为数据命名来为其赋予意义。我们可以将我们正在使用的元组转换成一个有整体名称而且每个部分也有对应名字的结构体。

source: Listing 5-8: Defining a `Rectangle` struct
id: Listing 5-8: Mendefinisikan sebuah struct `Rectangle`
ko: 리스트 5-8: `Rectangle` 구조체 정의하기
