Repository: cairo-book/cairo-book
Catalog: po/*.po
Languages: es, id, ko, zh_cn

source: We have just created a file called _lib.cairo_, which contains a module declaration referencing another module named `hello_world`, as well as the file _hello_world.cairo_, containing the implementation details of the `hello_world` module.
ko: 우리는 방금 _lib.cairo_ 라는 파일을 만들었습니다. 이 파일에는 `hello_world`라는 다른 모듈을 참조하는 모듈 선언이 포함되어 있습니다. 또한 `hello_world` 모듈의 구현 세부 정보를 포함하는 _hello_world.cairo_ 파일도 있습니다.

source: Scarb requires your source files to be located within the _src_ directory.
ko: Scarb는 소스 파일이 _src_ 디렉토리 내에 위치해야 합니다.

source: The top-level project directory is reserved for README files, license information, configuration files, and any other non-code-related content. Scarb ensures a designated location for all project components, maintaining a structured organization.
id: Direktori top-level digunakan untuk file README, lisensi informasi, file konfigurasi, dan konten lain yang tidak terkait dengan kode.Scarb memastikan lokasi yang ditentukan untuk semua komponen proyek, menjagaorganisasi terstruktur.
ko: 최상위 프로젝트 디렉토리는 README 파일, 라이선스 정보, 구성 파일 및 기타 코드와 관련이 없는 콘텐츠를 위해 예약되어 있습니다. Scarb는 모든 프로젝트 구성 요소에 대한 지정된 위치를 보장하여 구조화된 조직을 유지합니다.

source: If you started a project that doesn’t use Scarb, you can convert it to a project that does use Scarb. Move the project code into the _src_ directory and create an appropriate _Scarb.toml_ file. You can also use `scarb init` command to generate the _src_ folder and the _Scarb.toml_ it contains.
ko: 만약 Scarb를 사용하지 않는 프로젝트를 시작했다면, Scarb를 사용하는 프로젝트로 변환할 수 있습니다. 프로젝트 코드를 _src_ 디렉토리로 이동하고 적절한 _Scarb.toml_ 파일을 생성하세요. 또한 `scarb init` 명령어를 사용하여 _src_ 폴더와 그 안에 포함된 _Scarb.toml_ 을 생성할 수도 있습니다.

source: A sample Scarb project structure
id: Contoh struktur proyek Scarb
ko: 샘플 Scarb 프로젝트 구조

source: Building a Scarb Project
id: Mulai membangun Projek Scarb
ko: Scarb 프로젝트를 진행 중입니다.

source: From your `hello_world` directory, build your project by entering the following command:
id: Dari direktori `hello_world` Anda, bangun proyek Anda dengan memasukkan perintah berikut:
ko: 당신의 `hello_world` 디렉토리에서 다음 명령어를 입력하여 프로젝트를 빌드하세요:
zh_cn: 在你的`hello_world`目录中，通过输入以下命令来编译你的项目：

source: This command creates a `sierra` file in _target/dev_, let's ignore the `sierra` file for now.
ko: 이 명령은 _target/dev_ 에 `sierra` 파일을 생성합니다. 지금은 `sierra` 파일을 무시합시다.

source: If you have installed Cairo correctly, you should be able to run the `main` function of your program with the `scarb cairo-run` command and see the following output:
ko: 만약 Cairo를 올바르게 설치했다면, `scarb cairo-run` 명령어로 프로그램의 `main` 함수를 실행하고 다음 출력을 볼 수 있어야 합니다:

source: Regardless of your operating system, the string `Hello, world!` should print to the terminal.
id: Terlepas dari sistem operasi Anda, string `Halo, dunia!` harus dicetak ke terminal.
ko: 어떤 운영 체제를 사용하더라도 문자열 `Hello, world!`은 터미널에 출력되어야 합니다.

source: If `Hello, world!` did print, congratulations! You’ve officially written a Cairo program. That makes you a Cairo programmer—welcome!
id: Jika `Hello, world!` berhasil dicetak, selamat! Anda telah resmi menulis Program Cairo. Itu membuatmu menjadi Cairo programmer—welcome!
ko: `Hello, world!`가 출력되었다면, 축하합니다! 이제 공식적으로 카이로 프로그램을 작성했습니다. 이제 당신은 카이로 프로그래머가 되었습니다. 환영합니다!

source: Anatomy of a Cairo Program
id: Anatomi Program Cairo
ko: 카이로 프로그램의 해부학

source: Let’s review this “Hello, world!” program in detail. Here’s the first piece of the puzzle:
id: Mari kita ulas “Hello, world!” program ini secara detail. Ini bagian pertama dari teka-teki:
ko: 이 "Hello, world!" 프로그램을 자세히 검토해 봅시다. 퍼즐의 첫 번째 조각은 여기 있습니다:

source: These lines define a function named `main`. The `main` function is special: it is always the first code that runs in every executable Cairo program. Here, the first line declares a function named `main` that has no parameters and returns nothing. If there were parameters, they would go inside the parentheses `()`.
id: Baris-baris ini mendefinisikan fungsi bernama `main`. Fungsi `main` adalah spesial: itu selalu menjadi kode pertama yang dijalankan di setiap program Cairo yang dapat dieksekusi.Di sini, baris pertama mendeklarasikan fungsi bernama `main` yang tidak memiliki parameterdan tidak mengembalikan apa pun. Jika ada parameter, parameter tersebut akan masuk ke dalam tanda kurung `()`.
ko: 이 라인들은 `main`이라는 함수를 정의합니다. `main` 함수는 특별합니다: 모든 실행 가능한 카이로 프로그램에서 항상 가장 먼저 실행되는 코드입니다. 여기서 첫 번째 라인은 매개변수가 없고 아무것도 반환하지 않는 `main`이라는 함수를 선언합니다. 만약 매개변수가 있다면, 그것들은 괄호 `()` 안에 들어갈 것입니다.

source: The function body is wrapped in `{}`. Cairo requires curly brackets around all function bodies. It’s good style to place the opening curly bracket on the same line as the function declaration, adding one space in between.
id: Fungsi badan dibungkus dengan `{}`. Cairo memerlukan tanda kurung kurawal di sekelilingnya semua badan berfungsi. Sebaiknya letakkan tanda kurung kurawal pembuka di baris yang sama dengan deklarasi fungsi, menambahkan satu spasi di antaranya.
ko: 함수 본문은 `{}`로 둘러싸여 있습니다. Cairo는 모든 함수 본문 주위에 중괄호를 필요로 합니다. 함수 선언과 동일한 줄에 여는 중괄호를 두는 것이 좋은 스타일이며, 중괄호 사이에 공백을 하나 추가하는 것이 좋습니다.

source: Note: If you want to stick to a standard style across Cairo projects, you can use the automatic formatter tool available with `scarb fmt` to format your code in a particular style (more on `scarb fmt` in [Appendix D](appendix-04-useful-development-tools.md)). The Cairo team has included this tool with the standard Cairo distribution, as `cairo-run` is, so it should already be installed on your computer!
id: Catatan: Jika Anda ingin tetap menggunakan gaya standar di seluruh proyek Cairo, Andadapat menggunakan alat pemformat otomatis yang tersedia dengan `scarb fmt` untuk memformatkode Anda dalam gaya tertentu (lebih lanjut tentang `scarb fmt` di [Lampiran D](appendix-04-useful-development-tools.md)). Tim Cairo sudah memasukkan inialat dengan distribusi standar Cairo, seperti `cairo-run`, jadi seharusnyasudah terinstal di komputer Anda!
ko: 참고: 카이로 프로젝트 전체에서 표준 스타일을 유지하고 싶다면, 특정 스타일로 코드를 서식 지정하는 자동 포매터 도구 `scarb fmt`를 사용할 수 있습니다 ([부록 D](appendix-04-useful-development-tools.md)에서 `scarb fmt`에 대해 자세히 알아볼 수 있습니다). 카이로 팀은 이 도구를 표준 카이로 배포에 포함시켰으므로, `cairo-run`과 마찬가지로 이미 컴퓨터에 설치되어 있어야 합니다!

source: The body of the `main` function holds the following code:
es: El cuerpo de la función `main` contiene el siguiente código:
id: Badan fungsi `main` berisi kode berikut:
ko: `main` 함수의 본문에는 다음 코드가 포함되어 있습니다.
zh_cn: `main`函数的主体包含以下代码：

source: This line does all the work in this little program: it prints text to the screen. There are four important details to notice here.
id: Baris ini melakukan semua pekerjaan dalam program kecil ini: ia mencetak teks kelayar. Ada empat detail penting yang perlu diperhatikan di sini.
ko: 이 줄은 이 작은 프로그램에서 모든 작업을 수행합니다: 화면에 텍스트를 출력합니다. 여기서 주목해야 할 네 가지 중요한 세부 사항이 있습니다.

source: First, Cairo style is to indent with four spaces, not a tab.
es: En primer lugar, el estilo de Cairo es hacer sangrías con cuatro espacios, no con una tabulación.
id: Pertama, gaya Cairo adalah membuat indentasi dengan empat spasi, bukan tab.
ko: 먼저, 카이로 스타일은 탭이 아닌 네 개의 공백으로 들여쓰기하는 것입니다.
zh_cn: 首先，Cairo的风格是用四个空格缩进，而不是用制表符。

source: Second, `println!` calls a Cairo macro. If it had called a function instead, it would be entered as `println` (without the `!`). We’ll discuss Cairo macros in more detail in [Chapter Macros](./ch11-02-macros.md). For now, you just need to know that using a `!` means that you’re calling a macro instead of a normal function and that macros don’t always follow the same rules as functions.
ko: 둘째, `println!`은 카이로 매크로를 호출합니다. 대신 함수를 호출했다면 `println`으로 입력되었을 것입니다 ( `!` 없이). 우리는 [매크로 장](./ch11-02-macros.md)에서 카이로 매크로에 대해 더 자세히 다룰 것입니다. 지금 당장은 `!`를 사용하면 일반 함수 대신 매크로를 호출한다는 것을 알아두세요. 매크로는 항상 함수와 같은 규칙을 따르지 않는다는 점을 알아두세요.

source: Third, you see the `"Hello, world!"` string. We pass this string as an argument to `println!`, and the string is printed to the screen.
ko: 세 번째로, "Hello, world!" 문자열을 보게 됩니다. 우리는 이 문자열을 `println!`에 인수로 전달하고, 화면에 문자열이 출력됩니다.

source: Fourth, we end the line with a semicolon (`;`), which indicates that this expression is over and the next one is ready to begin. Most lines of Cairo code end with a semicolon.
id: Keempat, kita mengakhiri baris dengan titik koma (`;`), yang menunjukkan bahwa Ekspresi ini sudah selesai dan yang berikutnya siap dimulai. Sebagian besar jalur di Cairokode diakhiri dengan titik koma.
ko: 네 번째로, 우리는 세미콜론(`;`)으로 라인을 끝냅니다. 이는 이 표현이 끝났고 다음 표현이 시작할 준비가 되었음을 나타냅니다. 카이로 코드의 대부분의 라인은 세미콜론으로 끝납니다.

source: Summary
id: Ringkasan
ko: 요약

source: Let’s recap what we’ve learned so far about Scarb:
es: Recapitulemos lo que hemos aprendido hasta ahora sobre Scarb:
id: Mari kita rekap apa yang telah kita pelajari sejauh ini tentang Scarb:
ko: 지금까지 우리가 Scarb에 대해 배운 내용을 다시 한 번 요약해 보겠습니다:
zh_cn: 让我们回顾一下到目前为止我们所了解到的关于Scarb的情况：

source: We can install one or multiple Scarb versions, either the latest stable or a specific one, using asdf.
ko: asdf를 사용하여 최신 안정 버전 또는 특정 버전을 설치할 수 있습니다. Scarb 버전을 하나 또는 여러 개 설치할 수 있습니다.

source: We can create a project using `scarb new`.
id: Kita dapat membuat proyek menggunakan `scarb new`.
ko: `scarb new`를 사용하여 프로젝트를 생성할 수 있습니다.

source: We can build a project using `scarb build` to generate the compiled Sierra code.
id: Kita dapat membangun proyek menggunakan `scarb build` untuk menghasilkan kode Sierra yang telah dikompilasi.
ko: `scarb build`를 사용하여 컴파일된 Sierra 코드를 생성하여 프로젝트를 구축할 수 있습니다.

source: We can execute a Cairo program using the `scarb cairo-run` command.
ko: `scarb cairo-run` 명령을 사용하여 카이로 프로그램을 실행할 수 있습니다.

source: An additional advantage of using Scarb is that the commands are the same no matter which operating system you’re working on. So, at this point, we’ll no longer provide specific instructions for Linux and macOS versus Windows.
es: Una ventaja adicional de usar Scarb es que los comandos son los mismos sin importar el sistema operativo en el que estemos trabajando. Así que, en este punto, ya no proporcionaremos instrucciones específicas para Linux y macOS frente a Windows.
id: Keuntungan tambahan menggunakan Scarb adalah perintahnya sama, tidaktidak peduli sistem operasi apa yang sedang Anda gunakan. Jadi, pada titik ini, kami tidak akan melakukannyalagi memberikan instruksi khusus untuk Linux dan macOS versus Windows.
ko: Scarb를 사용하는 추가적인 장점은 어떤 운영 체제에서 작업하더라도 명령어가 동일하다는 것입니다. 따라서 이 시점에서는 더 이상 Linux 및 macOS 대 Windows에 대한 구체적인 지침을 제공하지 않을 것입니다.
zh_cn: 使用Scarb的另一个好处是，无论你在哪个操作系统上工作，命令都是一样的。所以我们将不再提供Linux和macOS与Windows的具体说明。

source: You’re already off to a great start on your Cairo journey! This is a great time to build a more substantial program to get used to reading and writing Cairo code.
ko: 당신은 이미 카이로 여행을 시작했습니다! 이제 카이로 코드를 읽고 쓰는 데 익숙해지기 위해 더 구체적인 프로그램을 만드는 좋은 시기입니다.

source: This chapter covers concepts that appear in almost every programming language and how they work in Cairo. Many programming languages have much in common at their core. None of the concepts presented in this chapter are unique to Cairo, but we’ll discuss them in the context of Cairo and explain the conventions around using these concepts.
es: Este capítulo cubre conceptos que aparecen en casi todos los lenguajes de programación y cómo funcionan en Cairo. Muchos lenguajes de programación tienen mucho en común en su núcleo. Ninguno de los conceptos presentados en este capítulo son exclusivos de Cairo, pero los discutiremos en el contexto de Cairo y explicaremos las convenciones sobre el uso de estos conceptos.
id: Bab ini membahas konsep-konsep yang muncul dalam hampir setiap bahasa pemrograman dan bagaimana cara kerjanya di Cairo. Banyak bahasa pemrograman memiliki kesamaan pada inti mereka. Tidak ada konsep yang disajikan dalam bab ini yang unik untuk Cairo, namun kami akan membahasnya dalam konteks Cairo dan menjelaskan konvensi seputar penggunaan konsep-konsep ini.
ko: 이 장에서는 대부분의 프로그래밍 언어에서 나타나는 개념과 그것들이 카이로에서 어떻게 작동하는지 다룹니다. 많은 프로그래밍 언어들은 핵심적으로 많은 부분을 공유합니다. 이 장에서 제시된 개념들은 카이로에만 있는 것은 아니지만, 우리는 카이로의 맥락에서 이들을 논의하고 이러한 개념을 사용하는 관례에 대해 설명할 것입니다.
zh_cn: 本章涵盖了几乎所有编程语言中出现的概念，以及它们在Cairo的工作原理。许多编程语言的核心都有很多共同点。本章介绍的概念没有一个是Cairo独有的，但我们会在Cairo的背景下讨论它们，并解释使用这些概念的惯例。

source: Specifically, you’ll learn about variables, basic types, functions, comments, and control flow. These foundations will be in every Cairo program, and learning them early will give you a strong core to start from.
es: Específicamente, aprenderás sobre variables, tipos básicos, funciones, comentarios y flujo de control. Estos fundamentos estarán en cada programa de Cairo, y aprenderlos desde el principio te dará un núcleo fuerte desde el que empezar.
id: Secara khusus, Anda akan mempelajari tentang variabel, tipe-tipe dasar, fungsi, komentar, dan alur kontrol. Dasar-dasar ini akan ada dalam setiap program Cairo, dan mempelajarinya sejak awal akan memberikan fondasi yang kuat untuk memulai.
ko: 구체적으로, 변수, 기본 유형, 함수, 주석 및 제어 흐름에 대해 배우게 됩니다. 이러한 기초는 모든 카이로 프로그램에 포함되어 있으며, 일찍 배우는 것은 강력한 기반을 제공하여 출발할 수 있습니다.
zh_cn: 具体来说，你将学习到变量、基本类型、函数、注释和控制流。这些基础将出现在每个Cairo程序中，尽早学习它们将给你一个强大的核心来开启旅程。

source: Cairo uses an immutable memory model, meaning that once a memory cell is written to, it can't be overwritten but only read from. To reflect this immutable memory model, variables in Cairo are immutable by default. However, the language abstracts this model and gives you the option to make your variables mutable. Let’s explore how and why Cairo enforces immutability, and how you can make your variables mutable.
id: Cairo menggunakan model memori yang tidak dapat diubah (immutable), artinya setelah sebuah sel memori ditulisi, sel tersebut tidak dapat ditimpa (overwrite) tapi hanya dapat dibaca. Untuk mencerminkan model memori yang tidak dapat diubah ini, variabel dalam Cairo bersifat tidak dapat diubah secara default. Namun, bahasa ini mengabstraksikan model ini dan memberikan opsi untuk membuat variabel Anda menjadi dapat diubah (mutable). Mari kita jelajahi bagaimana dan mengapa Cairo menerapkan ketidakberubahannya, serta bagaimana Anda dapat membuat variabel Anda menjadi dapat diubah.
ko: 카이로는 변경할 수 없는 메모리 모델을 사용합니다. 즉, 한 번 메모리 셀에 기록되면 덮어쓸 수 없고 읽기만 가능합니다. 이 변경할 수 없는 메모리 모델을 반영하기 위해 카이로에서 변수는 기본적으로 변경할 수 없습니다. 그러나 이 언어는 이 모델을 추상화하고 변수를 변경할 수 있도록 옵션을 제공합니다. 카이로가 변경할 수 없음을 강제하는 방법과 이를 어떻게 변경할 수 있는지 살펴보겠습니다.

source: When a variable is immutable, once a value is bound to a name, you can’t change that value. To illustrate this, generate a new project called _variables_ in your _cairo_projects_ directory by using `scarb new variables`.
id: Ketika sebuah variabel tidak dapat diubah, setelah nilai terikat pada sebuah nama, Anda tidak dapat mengubah nilai tersebut. Untuk mengilustrasikannya, buatlah proyek baru yang disebut _variables_ dalam direktori _cairo_projects_ Anda dengan menggunakan perintah `scarb new variables`.
ko: 변수가 불변일 때, 한 번 값이 이름에 바인딩되면 해당 값을 변경할 수 없습니다. 이를 설명하기 위해 `scarb new variables`를 사용하여 _cairo_projects_ 디렉토리에 _variables_ 라는 새 프로젝트를 생성하세요.

source: Then, in your new _variables_ directory, open _src/lib.cairo_ and replace its code with the following code, which won’t compile just yet:
id: Kemudian, di direktori baru Anda _variables_, buka _src/lib.cairo_ dan gantikan kode di dalamnya dengan kode berikut, yang belum dapat dikompilasi:
ko: 그런 다음 새 _variables_ 디렉토리에서 _src/lib.cairo_ 파일을 열고 아래 코드로 코드를 바꿉니다. 아래 코드는 아직 컴파일되지 않습니다:

source: Filename: src/lib.cairo
ko: 파일 이름: src/lib.cairo

source: "The value of x is: {}"
ko: "x의 값은: {}"

source: Save and run the program using `scarb cairo-run`. You should receive an error message regarding an immutability error, as shown in this output:
id: Simpan dan jalankan program menggunakan `scarb cairo-run`. Anda seharusnya menerima pesan kesalahan terkait kesalahan ketidakbisaan untuk mengubah variabel, seperti yang ditunjukkan dalam output ini:
ko: `scarb cairo-run`를 사용하여 프로그램을 저장하고 실행하세요. 이 출력에서 보이는 대로 불변성 오류에 관한 오류 메시지를 받아야 합니다.

source: This example shows how the compiler helps you find errors in your programs. Compiler errors can be frustrating, but they only mean your program isn’t safely doing what you want it to do yet; they do _not_ mean that you’re not a good programmer! Experienced Caironautes still get compiler errors.
ko: 이 예시는 컴파일러가 프로그램에서 오류를 찾는 데 어떻게 도움을 주는지 보여줍니다. 컴파일러 오류는 짜증을 내게 할 수 있지만, 이는 단지 당신이 원하는 대로 안전하게 작동하지 않는 프로그램일 뿐이며, 당신이 좋은 프로그래머가 아니라는 뜻은 아닙니다! 경험이 많은 Caironautes도 여전히 컴파일러 오류를 만납니다.

source: You received the error message `Cannot assign to an immutable variable.` because you tried to assign a second value to the immutable `x` variable.
id: Anda menerima pesan kesalahan `Cannot assign to an immutable variable.` karena mencoba mengganti nilai kedua pada variabel `x` yang bersifat immutable (tidak dapat diubah).
ko: 불변 변수 `x`에 두 번째 값을 할당하려고 시도하여 `불변 변수에 할당할 수 없습니다.` 오류 메시지를 받았습니다.

source: It’s important that we get compile-time errors when we attempt to change a value that’s designated as immutable because this specific situation can lead to bugs. If one part of our code operates on the assumption that a value will never change and another part of our code changes that value, it’s possible that the first part of the code won’t do what it was designed to do. The cause of this kind of bug can be difficult to track down after the fact, especially when the second piece of code changes the value only _sometimes_.
ko: 우리가 변경할 수 없는 값으로 지정된 값을 변경하려고 시도할 때 컴파일 시간 오류를 얻는 것이 중요합니다. 왜냐하면 이 특정 상황은 버그로 이어질 수 있기 때문입니다. 코드의 한 부분이 값이 변경되지 않을 것이라는 가정으로 작동하고 다른 부분이 그 값을 변경한다면, 첫 번째 코드 부분이 의도한 대로 작동하지 않을 수 있습니다. 이러한 종류의 버그의 원인은 특히 두 번째 코드 조각이 값 변경을 _가끔_ 만 하는 경우에는 추적하기 어려울 수 있습니다.

source: Cairo, unlike most other languages, has immutable memory. This makes a whole class of bugs impossible, because values will never change unexpectedly. This makes code easier to reason about.
ko: 카이로는 대부분의 다른 언어와 달리 불변 메모리를 가지고 있습니다. 이는 값이 예기치 않게 변경되지 않기 때문에 일부 버그가 불가능하게 만듭니다. 이는 코드를 이해하기 쉽게 만듭니다.

source: But mutability can be very useful, and can make code more convenient to write. Although variables are immutable by default, you can make them mutable by adding `mut` in front of the variable name. Adding `mut` also conveys intent to future readers of the code by indicating that other parts of the code will be changing the value associated to this variable.
ko: 변이성은 매우 유용할 수 있으며 코드를 더 편리하게 작성할 수 있게 해줄 수 있습니다. 변수는 기본적으로 불변이지만 변수 이름 앞에 `mut`를 추가하여 가변하게 만들 수 있습니다. `mut`를 추가함으로써 코드의 미래 독자들에게 이 변수와 연관된 값이 변경될 것임을 나타내어 의도를 전달할 수도 있습니다.

source: However, you might be wondering at this point what exactly happens when a variable is declared as `mut`, as we previously mentioned that Cairo's memory is immutable. The answer is that the _value_ is immutable, but the _variable_ isn't. The value associated to the variable can be changed. Assigning to a mutable variable in Cairo is essentially equivalent to redeclaring it to refer to another value in another memory cell, but the compiler handles that for you, and the keyword `mut` makes it explicit. Upon examining the low-level Cairo Assembly code, it becomes clear that variable mutation is implemented as syntactic sugar, which translates mutation operations into a series of steps equivalent to variable shadowing. The only difference is that at the Cairo level, the variable is not redeclared so its type cannot change.
ko: 그러나 여기서 변수가 `mut`로 선언될 때 정확히 무엇이 발생하는지 궁금할 수 있습니다. 이전에 카이로의 메모리는 불변이라고 언급했었기 때문입니다. 답은 _값_ 은 불변이지만 _변수_ 는 그렇지 않다는 것입니다. 변수에 연결된 값은 변경될 수 있습니다. 카이로에서 가변 변수에 할당하는 것은 사실 다른 메모리 셀에서 다른 값을 참조하도록 다시 선언하는 것과 동등합니다. 그러나 컴파일러가 이를 처리하고 키워드 `mut`을 명시적으로 만들어 줍니다. 저수준의 카이로 어셈블리 코드를 조사하면 변수 변이가 문법적 설탕으로 구현되어 있음을 알 수 있습니다. 이는 변이 작업을 변수 음영화와 동등한 단계의 일련의 단계로 변환하는 것입니다. 유일한 차이점은 카이로 수준에서 변수가 다시 선언되지 않으므로 그 유형이 변경될 수 없다는 것입니다.

source: For example, let’s change _src/lib.cairo_ to the following:
es: Por ejemplo, cambiemos _src/lib.cairo_ por lo siguiente:
id: Sebagai contoh, mari ubah _src/lib.cairo_ menjadi sebagai berikut:
ko: 예를 들어, 다음과 같이 _src/lib.cairo_ 를 변경해 봅시다:
zh_cn: 例如，让我们把 _src/lib.cairo_ 改为以下内容：

source: When we run the program now, we get this:
es: Cuando ejecutamos el programa ahora, obtenemos esto:
id: Saat kita menjalankan program sekarang, kita mendapatkan ini:
ko: 지금 프로그램을 실행하면 이렇게 나옵니다.
zh_cn: 当我们现在运行该程序时，我们得到了这个结果：

source: We’re allowed to change the value bound to `x` from `5` to `6` when `mut` is used. Ultimately, deciding whether to use mutability or not is up to you and depends on what you think is clearest in that particular situation.
id: Kita diizinkan untuk mengubah nilai yang terikat pada `x` dari `5` menjadi `6` ketika `mut` digunakan. Pada akhirnya, keputusan untuk menggunakan mutabilitas atau tidak tergantung pada Anda dan tergantung pada apa yang menurut Anda paling jelas dalam situasi tertentu tersebut.
ko: 우리는 `mut`을 사용할 때 `x`에 바인딩된 값을 `5`에서 `6`으로 변경할 수 있습니다. 결국 가변성을 사용할지 여부는 당신에게 달려 있으며, 그 특정 상황에서 가장 명확하다고 생각하는 것에 달려 있습니다.

source: Constants
id: Constant
ko: 상수

source: Like immutable variables, _constants_ are values that are bound to a name and are not allowed to change, but there are a few differences between constants and variables.
id: Seperti variabel yang tidak dapat diubah, _Constant_ adalah nilai yang terikat pada sebuah nama dan tidak diizinkan untuk diubah, namun ada beberapa perbedaan antara konstan dan variabel.
ko: 불변 변수와 마찬가지로 _상수_ 는 이름에 바인딩된 값으로 변경할 수 없지만, 상수와 변수 사이에는 몇 가지 차이가 있습니다.

source: First, you aren’t allowed to use `mut` with constants. Constants aren’t just immutable by default—they’re always immutable. You declare constants using the `const` keyword instead of the `let` keyword, and the type of the value _must_ be annotated. We’ll cover types and type annotations in the next section, [“Data Types”](ch02-02-data-types.md), so don’t worry about the details right now. Just know that you must always annotate the type.
id: Pertama, Anda tidak diizinkan menggunakan `mut` dengan Constant. Constant bukan hanya tidak dapat diubah secara default—mereka selalu bersifat tidak dapat diubah. Anda mendeklarasikan konstan menggunakan kata kunci `const` bukan kata kunci `let`, dan tipe nilai _harus_ diannotasikan. Kami akan membahas tipe dan annotasi tipe pada bagian berikutnya, [“Tipe Data”](ch02-02-data-types.md), jadi jangan khawatir tentang detailnya saat ini. Cukup ketahui bahwa Anda selalu harus melakukan annotasi tipe.
ko: 먼저, 상수와 `mut`을 함께 사용할 수 없습니다. 상수는 기본적으로 불변이 아니라 항상 불변입니다. 상수는 `let` 키워드 대신 `const` 키워드를 사용하여 선언하며, 값의 유형은 _반드시_ 주석이 달려 있어야 합니다. 다음 섹션인 [“데이터 유형”](ch02-02-data-types.md)에서 유형과 유형 주석을 다룰 것이므로 지금은 세부 사항에 대해 걱정하지 마십시오. 단지 항상 유형을 주석으로 표시해야 한다는 것을 알아두세요.

source: Constants can only be declared in the global scope, which makes them useful for values that many parts of code need to know about.
id: Constant hanya dapat dideklarasikan dalam cakupan global, yang membuatnya berguna untuk nilai yang diperlukan oleh banyak bagian kode.
ko: 상수는 전역 범위에서만 선언할 수 있으며, 이는 코드의 많은 부분이 알아야 하는 값에 유용합니다.

source: The last difference is that constants may natively be set only to a constant expression, not the result of a value that could only be computed at runtime. Only literal constants are currently supported.
ko: 마지막 차이점은 상수가 상수 식으로만 설정될 수 있고 런타임에서만 계산할 수 있는 값의 결과로는 설정할 수 없다는 것입니다. 현재 리터럴 상수만 지원됩니다.

source: Here’s an example of a constant declaration:
es: Aquí hay un ejemplo de declaración de constante:
id: Berikut ini adalah contoh deklarasi konstan:
ko: 다음은 상수 선언의 예입니다.
zh_cn: 下面是一个声明常量的例子：

source: Nonetheless, it is possible to use the `consteval_int!` macro to create a `const` variable that is the result of some computation:
ko: 그럼에도 불구하고, `consteval_int!` 매크로를 사용하여 어떤 계산의 결과인 `const` 변수를 만들 수 있습니다.

source: We will dive into more detail about macros in the [dedicated section](./ch11-02-macros.md).
ko: 우리는 [전용 섹션](./ch11-02-macros.md)에서 매크로에 대해 더 자세히 다룰 것입니다.
