Repository: cairo-book/cairo-book
Catalog: po/*.po
Languages: es, id, ko, zh_cn

source: The `get` function returns an `Option<Box<@T>>`, which means it returns an option to a Box type (Cairo's smart-pointer type) containing a snapshot to the element at the specified index if that element exists in the array. If the element doesn't exist, `get` returns `None`. This method is useful when you expect to access indices that may not be within the array's bounds and want to handle such cases gracefully without panics. Snapshots will be explained in more detail in the [References and Snapshots](ch03-02-references-and-snapshots.md) chapter.
es: La función `get` devuelve una `Option<Box<@T>>`, lo que significa que devuelve una opción a un tipo Box (el tipo smart-pointer de Cairo) que contiene una instantánea al elemento en el índice especificado si ese elemento existe en el array. Si el elemento no existe, `get` devuelve `None`. Este método es útil cuando esperas acceder a índices que pueden no estar dentro de los límites del array y quieres manejar tales casos con gracia sin pánicos. Las instantáneas se explicarán con más detalle en el capítulo [Referencias y Snapshots](ch03-02-references-and-snapshots.md).

source: The `at` function, on the other hand, directly returns a snapshot to the element at the specified index using the `unbox()` operator to extract the value stored in a box. If the index is out of bounds, a panic error occurs. You should only use at when you want the program to panic if the provided index is out of the array's bounds, which can prevent unexpected behavior.
es: La función `at`, por otro lado, devuelve directamente una instantánea al elemento en el índice especificado utilizando el operador `unbox()` para extraer el valor almacenado en una caja. Si el índice está fuera de los límites, se produce un error de pánico. Sólo debe utilizar at cuando desee que el programa entre en pánico si el índice proporcionado está fuera de los límites del array, lo que puede evitar comportamientos inesperados.

source: #### Size related methods
es: #### Métodos relacionados con el tamaño

source: #### Storing multiple types with Enums
es: #### Almacenar multiples tipos con Enums

source: If you want to store elements of different types in an array, you can use an `Enum` to define a custom data type that can hold multiple types.
es: Si desea almacenar elementos de diferentes tipos en una array, puede utilizar un `Enum` para definir un tipo de datos personalizado que pueda contener múltiples tipos.

source: `Span` is a struct that represents a snapshot of an `Array`. It is designed to provide safe and controlled access to the elements of an array without modifying the original array. Span is particularly useful for ensuring data integrity and avoiding borrowing issues when passing arrays between functions or when performing read-only operations (cf. [References and Snapshots](ch03-02-references-and-snapshots.md))
es: `Span` es una estructura que representa una instantánea de un `Array`. Está diseñada para proporcionar un acceso seguro y controlado a los elementos de un array sin modificar el array original. Span es particularmente útil para asegurar la integridad de los datos y evitar problemas de préstamo cuando se pasan arrays entre funciones o cuando se realizan operaciones de sólo lectura (cf. [References and Snapshots](ch03-02-references-and-snapshots.md))

source: ##### Turning an Array into span
es: ##### Convertir un Array en span

source: You made it! This was a sizable chapter: you learned about variables, data types, functions, comments, `if` expressions, loops, and common collections! To practice with the concepts discussed in this chapter, try building programs to do the following:
es: ¡Lo has conseguido! Este ha sido un capítulo considerable: has aprendido sobre variables, tipos de datos, funciones, comentarios, expresiones `if`, bucles y colecciones comunes. Para practicar con los conceptos discutidos en este capítulo, intenta construir programas para hacer lo siguiente:

source: When you’re ready to move on, we’ll talk about a concept that Cairo shares with Rust and that _doesn’t_ commonly exist in other programming languages: ownership.
es: Cuando estés listo para continuar, hablaremos de un concepto que Cairo comparte con Rust y que _no_ existe comúnmente en otros lenguajes de programación: ownership.

source: The variable `s` refers to a short string, where the value of the string is hardcoded into the text of our program. The variable is valid from the point at which it’s declared until the end of the current _scope_. Listing 3-1 shows a program with comments annotating where the variable `s` would be valid.
es: La variable `s` hace referencia a una cadena corta, donde el valor de la cadena está codificado en el texto de nuestro programa. La variable es válida desde el momento en que se declara hasta el final del _ámbito_ actual. La Lista 3-1 muestra un programa con comentarios que anotan dónde sería válida la variable `s`.

source: <span class="caption">Listing 3-1: A variable and the scope in which it is valid</span>
es: <span class="caption">Lista 3-1: Una variable y el ámbito en el que es válida</span>

source: At this point, the relationship between scopes and when variables are valid is similar to that in other programming languages. Now we’ll build on top of this understanding by using the `Array` type we introduced in the [previous chapter](ch02-06-common-collections.md).
es: En este punto, la relación entre los ámbitos y cuándo las variables son válidas es similar a la de otros lenguajes de programación. Ahora nos basaremos en este utilizando el tipo `Array` que introdujimos en el [capítulo anterior](ch02-06-common-collections.md).

source: To illustrate the rules of ownership, we need a data type that is more complex. The types covered in the [“Data Types”][data-types]<!-- ignore --> section of Chapter 2 are of a known size, can be quickly and trivially copied to make a new, independent instance if another part of code needs to use the same value in a different scope, and can easily be dropped when they're no longer used. But what is the behavior with the `Array` type whose size is unknown at compile time and which can't be trivially copied?
es: Para ilustrar las reglas de propiedad, necesitamos un tipo de datos más complejo. Los tipos cubiertos en la sección ["Tipos de datos"][data-types]<!-- ignore -->section el Capítulo 2 son de un tamaño conocido, pueden ser copiados rápidamente y trivialmente para crear una nueva instancia independiente si otra parte del código necesita usar el mismo valor en un ámbito diferente, y pueden ser fácilmente eliminados cuando ya no se usan. Pero, ¿cuál es el comportamiento con el tipo `Array`, cuyo tamaño es desconocido en tiempo de compilación y no puede ser copiado trivialmente?

source: _Don't worry about the `Struct` keyword. We will introduce this in [Chapter 4](ch04-00-using-structs-to-structure-related-data.md)._
es: _No te preocupes por la palabra clave `Struct`. La introduciremos en el [Capítulo 4](ch04-00-using-structs-to-structure-related-data.md)._

source: If we _do_ want to deeply copy the data of an `Array`, we can use a common method called `clone`. We’ll discuss method syntax in Chapter 5, but because methods are a common feature in many programming languages, you’ve probably seen them before.
es: Si queremos copiar profundamente los datos de un `Array`, podemos utilizar un método común llamado `clone`. Discutiremos la sintaxis de los métodos en el Capítulo 5, pero como los métodos son una característica común en muchos lenguajes de programación, es probable que ya los hayas visto antes.

source: > Note: you will need to run `cairo-run` with the `--available-gas=2000000` option to run this example, because it uses a loop and must be ran with a gas limit.
es: > Nota: necesitarás ejecutar `cairo-run` con la opción `--available-gas=2000000` para ejecutar este ejemplo, ya que utiliza un bucle y debe ser ejecutado con un límite de gas.

source: Listing 3-3 has an example with some annotations showing where variables go into and out of scope.
es: El Listado 3-3 tiene un ejemplo con algunas anotaciones que muestran dónde las variables entran y salen de ámbito.

source: Returning values can also transfer ownership. Listing 3-4 shows an example of a function that returns some value, with similar annotations as those in Listing 4-3.
es: La devolución de valores también puede transferir la propiedad. El Listado 3-4 muestra un ejemplo de una función que devuelve algún valor, con anotaciones similares a las del Listado 4-3.

source: <span class="caption">Listing 3-4: Transferring ownership of return values</span>
es: <span class="caption">Listado 3-4: Transferencia de propiedad de valores devueltos</span>

source: Cairo does let us return multiple values using a tuple, as shown in Listing 3-5.
es: Cairo nos permite devolver múltiples valores usando una tupla, como se muestra en el Listado 3-5.

source: <span class="caption">Listing 3-5: Returning ownership of parameters</span>
es: <span class="caption">Listado 3-5: Devolviendo propiedad de los parámetros</span>

source: The issue with the tuple code in Listing 3-5 is that we have to return the `Array` to the calling function so we can still use the `Array` after the call to `calculate_length`, because the `Array` was moved into `calculate_length`.
es: El problema con el código de tupla en el Listado 3-5 es que tenemos que devolver el `Array` a la función de llamada para que podamos seguir usando el `Array` después de la llamada a `calculate_length`, ya que el `Array` se movió a `calculate_length`.

source: Snapshots can be converted back into regular values using the `desnap` operator `*`, as long as the value type is copyable (which is not the case for Arrays, as they don't implement `Copy`). In the following example, we want to calculate the area of a rectangle, but we don't want to take ownership of the rectangle in the `calculate_area` function, because we might want to use the rectangle again after the function call. Since our function doesn't mutate the rectangle instance, we can pass the snapshot of the rectangle to the function, and then transform the snapshots back into values using the `desnap` operator `*`.
es: Los snapshots se pueden convertir de nuevo en valores regulares usando el operador `desnap` `*`, siempre y cuando el tipo de valor sea copiable (lo cual no es el caso para los Arrays, ya que no implementan `Copy`). En el siguiente ejemplo, queremos calcular el área de un rectángulo, pero no queremos tomar la propiedad del rectángulo en la función `calculate_area`, porque podríamos querer usar el rectángulo de nuevo después de la llamada a la función. Dado que nuestra función no muta la instancia del rectángulo, podemos pasar el snapshot del rectángulo a la función, y luego transformar los snapshots de nuevo en valores usando el operador `desnap` `*`.

source: The snapshot type is always copyable and droppable, so that you can use it multiple times without worrying about ownership transfers.
es: El tipo de snapshot siempre es copiable y eliminable, para que pueda usarlo varias veces sin preocuparse por las transferencias de propiedad.

source: But, what happens if we try to modify something we’re passing as snapshot? Try the code in Listing 3-6. Spoiler alert: it doesn’t work!
es: Pero, ¿qué sucede si intentamos modificar algo que estamos pasando como instantánea? Prueba el código en la Lista 3-6. ¡Alerta de spoiler: no funciona!

source: <span class="caption">Listing 3-6: Attempting to modify a snapshot value</span>
es: <span class="caption">Listado 3-6: Intentando modificar un valor de snapshot</span>

source: We can achieve the behavior we want in Listing 3-6 by using a _mutable reference_ instead of a snapshot. Mutable references are actually mutable values passed to a function that are implicitly returned at the end of the function, returning ownership to the calling context. By doing so, they allow you to mutate the value passed while keeping ownership of it by returning it automatically at the end of the execution. In Cairo, a parameter can be passed as _mutable reference_ using the `ref` modifier.
es: Podemos lograr el comportamiento que queremos en el Listado 3-6 utilizando una _referencia mutable_ en lugar de un snapshot. Las referencias mutables son valores mutables pasados a una función que se devuelven implícitamente al final de la función, devolviendo la propiedad al contexto de llamada. Al hacerlo, le permiten mutar el valor pasado y mantener su propiedad devolviéndolo automáticamente al final de la ejecución. En Cairo, se puede pasar un parámetro como _referencia mutable_ utilizando el modificador `ref`.

source: In Listing 3-7, we use a mutable reference to modify the value of the `height` and `width` fields of the `Rectangle` instance in the `flip` function.
es: En el Listado 3-7, usamos una referencia mutable para modificar el valor del campo `height` de la instancia de `Rectangle` en la función `flip`.

source: <span class="caption">Listing 3-7: Use of a mutable reference to modify a value</span>
es: <span class="caption">Listing 3-7: Uso de una referencia mutable para modificar un valor</span>

source: Structs are similar to tuples, discussed in [The Data Types](ch02-02-data-types.md) section, in that both hold multiple related values. Like tuples, the pieces of a struct can be different types. Unlike with tuples, in a struct you’ll name each piece of data so it’s clear what the values mean. Adding these names means that structs are more flexible than tuples: you don’t have to rely on the order of the data to specify or access the values of an instance.
es: Las estructuras son similares a las tuplas, discutidas en la sección [Tipos de datos](ch02-02-data-types.md), en el sentido de que ambas contienen múltiples valores relacionados. Al igual que las tuplas, las piezas de una estructura pueden ser de diferentes tipos. A diferencia de las tuplas, en una estructura se nombra cada dato para que quede claro lo que significan los valores. Agregar estos nombres significa que las estructuras son más flexibles que las tuplas: no se tiene que depender del orden de los datos para especificar o acceder a los valores de una instancia.

source: To define a struct, we enter the keyword `struct` and name the entire struct. A struct’s name should describe the significance of the pieces of data being grouped together. Then, inside curly brackets, we define the names and types of the pieces of data, which we call fields. For example, Listing 4-1 shows a struct that stores information about a user account.
es: Para definir una estructura, introducimos la palabra clave `struct` y nombramos la estructura completa. El nombre de una estructura debe describir el significado de los datos que se agrupan. Después, entre llaves, definimos los nombres y tipos de los datos, que llamamos campos. Por ejemplo, el Listado 4-1 muestra una estructura que almacena información sobre una cuenta de usuario.

source: For example, we can declare a particular user as shown in Listing 4-2.
es: Por ejemplo, podemos declarar un usuario particular como se muestra en el Listado 4-2.

source: <span class="caption">Listing 4-2: Creating an instance of the `User` struct</span>
es: <span class="caption">Listado 4-2: Creando una instancia de la estructura `User`</span>

source: To get a specific value from a struct, we use dot notation. For example, to access this user’s email address, we use `user1.email`. If the instance is mutable, we can change a value by using the dot notation and assigning into a particular field. Listing 4-3 shows how to change the value in the `email` field of a mutable `User` instance.
es: Para obtener un valor específico de una estructura, usamos la notación punto. Por ejemplo, para acceder a la dirección de correo electrónico de este usuario, usamos `user1.email`. Si la instancia es mutable, podemos cambiar un valor usando la notación punto y asignándolo a un campo en particular. El listado 4-3 muestra cómo cambiar el valor en el campo `email`de una instancia mutable de `User`.

source: <span class="caption">Listing 4-3: Changing the value in the email field of a `User` instance</span>
es: <span class="caption">Listado 4-3: Cambiando el valor del campo email de la instancia `User`</span>

source: Listing 4-4 shows a `build_user` function that returns a `User` instance with the given email and username. The `active` field gets the value of `true`, and the `sign_in_count` gets a value of `1`.
es: Listado 4-4 muestra la función `build_user` que retorna una instancia de la estructura `User` con el email y el username. Al campo `active` se le asigna el valor `true`,y el campo `sign_in_count` obtiene el valor de `1`.

source: <span class="caption">Listing 4-4: A `build_user` function that takes an email and username and returns a `User` instance</span>
es: <span class="caption">Listado 4-4: Función `build_user` que toma los argumentos email y username, y retorna una instancia de la estructura `User`</span>

source: Because the parameter names and the struct field names are exactly the same in Listing 4-4, we can use the field init shorthand syntax to rewrite `build_user` so it behaves exactly the same but doesn’t have the repetition of `username` and `email`, as shown in Listing 4-5.
es: Como los nombres de los parámetros y los nombres de los campos struct son exactamente los mismos en el Listado 4-4, podemos usar la sintaxis abreviada de field init para reescribir `build_user` de forma que se comporte exactamente igual pero sin la repetición de `username` y `email`, como se muestra en el Listado 4-5.

source: <span class="caption">Listing 4-5: A `build_user` function that uses field init shorthand because the `username` and `email` parameters have the same name as struct fields</span>
es: <span class="caption">Lista 4-5: Una función `build_user` que utiliza la abreviatura field init porque los parámetros `username` y `email` tienen el mismo nombre que los campos struct</span>

source: Let’s make a new project with Scarb called _rectangles_ that will take the width and height of a rectangle specified in pixels and calculate the area of the rectangle. Listing 4-6 shows a short program with one way of doing exactly that in our project’s _src/lib.cairo_.
es: Hagamos un nuevo proyecto con Scarb llamado _rectangles_ que tomará el ancho y la altura de un rectángulo en píxeles y calculará el área del rectángulo. El Listado 4-6 muestra un pequeño programa con una forma de hacer exactamente eso en el _src/lib.cairo_ de nuestro proyecto.

source: <span class="caption">Listing 4-6: Calculating the area of a rectangle specified by separate width and height variables</span>
es: <span class="caption">Listado 4-6: Cálculo del área de un rectángulo especificado por variables separadas de ancho y alto</span>

source: Now run the program with `cairo-run src/lib.cairo`:
es: Para compilar el programa usamos `cairo-run src/lib.cairo`:

source: The `area` function is supposed to calculate the area of one rectangle, but the function we wrote has two parameters, and it’s not clear anywhere in our program that the parameters are related. It would be more readable and more manageable to group width and height together. We’ve already discussed one way we might do that in [Chapter 3](ch02-02-data-types.html#the-tuple-type): using tuples.
es: Se supone que la función `area` calcula el área de un rectángulo, pero la función que escribimos tiene dos parámetros, y no está claro en ninguna parte de nuestro programa que los parámetros estén relacionados. Sería más legible y manejable agrupar el ancho y el alto juntos. Ya discutimos una forma en que podríamos hacer eso en el [Capítulo 3](ch02-02-data-types.html#the-tuple-type): usando tuplas.

source: Listing 4-7 shows another version of our program that uses tuples.
es: El listado 4-7 muestra otra versión de nuestro programa usando tuplas.

source: <span class="caption">Listing 4-7: Specifying the width and height of the rectangle with a tuple</span>
es: <span class="caption">Listing 4-7: Especificando el ancho y alto de un rectángulo con una tupla</span>

source: <span class="caption">Listing 4-8: Defining a `Rectangle` struct</span>
es: <span class="caption">Listado 4-8: Definición de una estructura llamada `Rectangle`</span>

source: It’d be useful to be able to print an instance of `Rectangle` while we’re debugging our program and see the values for all its fields. Listing 4-9 tries using the `print` as we have used in previous chapters. This won’t work.
es: Sería útil poder imprimir una instancia de `Rectangle` mientras estamos depurando nuestro programa y ver los valores de todos sus campos. El Listado 4-9 intenta usar `print` como lo hemos usado en capítulos anteriores. Esto no funcionará.

source: <span class="caption">Listing 4-9: Attempting to print a `Rectangle` instance</span>
es: <span class="caption">Listado 4-9: Intentando imprimir una instancia de `Rectangle`</span>

source: The `print` trait is implemented for many data types, but not for the `Rectangle` struct. We can fix this by implementing the `PrintTrait` trait on `Rectangle` as shown in Listing 4-10. To learn more about traits, see [Traits in Cairo](ch07-02-traits-in-cairo.md).
es: El trait `print` está implementado para muchos tipos de datos, pero no para la estructura `Rectangle`. Podemos arreglar esto implementando el trait `PrintTrait` en la estructura `Rectangle` como se muestra en el Listado 4-10. Para aprender más sobre traits,[Traits en Cairo](ch07-02-traits-in-cairo.md).

source: <span class="caption">Listing 4-10: Implementing the `PrintTrait` trait on `Rectangle`</span>
es: <span class="caption">Listado 4-10: Implementación del trait `PrintTrait` en `Rectangle`</span>

source: Let’s change the `area` function that has a `Rectangle` instance as a parameter and instead make an `area` method defined on the `RectangleTrait` trait, as shown in Listing 4-13.
es: Cambiemos la función `area` que tiene una instancia `Rectangle` como parámetro y en su lugar hagamos un método `area` definido en el rasgo `RectangleTrait`, como se muestra en el Listado 4-13. en el Listado 4-13.

source: <span class="caption">Listing 4-13: Defining an `area` method to use on the `Rectangle` </span>
es: <span class="caption">Listado 4-13: Definiendo el método `area` para usar en la estructura `Rectangle` </span>

source: Let’s practice using methods by implementing a second method on the `Rectangle` struct. This time we want an instance of `Rectangle` to take another instance of `Rectangle` and return `true` if the second `Rectangle` can fit completely within `self` (the first `Rectangle`); otherwise, it should return `false`. That is, once we’ve defined the `can_hold` method, we want to be able to write the program shown in Listing 4-14.
es: Practiquemos el uso de métodos implementando un segundo método en la estructura `Rectangle`. struct. Esta vez queremos que una instancia de `Rectangle` tome otra instancia de `Rectangle de `Rectangle` y devuelva `true` si el segundo `Rectangle` cabe completamente dentro de dentro de `self` (el primer `Rectangle`); en caso contrario, devolverá `false`. Es decir, una vez que hemos definido el método `can_hold`, queremos ser capaces de escribir el programa mostrado en el Listado 4-14.

source: <span class="caption">Listing 4-14: Using the as-yet-unwritten `can_hold` method</span>
es: <span class="caption">Listado 4-14: Utilizando el método `can_hold` aún no escrito</span>
