Repository: cairo-book/cairo-book
Catalog: po/*.po
Languages: es, id, ko, zh_cn

source: The top-level project directory is reserved for README files, license information, configuration files, and any other non-code-related content. Scarb ensures a designated location for all project components, maintaining a structured organization.
es: El directorio de proyecto de nivel superior está reservado para los archivos README, información de licencia, archivos de configuración, y cualquier otro contenido no relacionado con el código. Scarb asegura una ubicación designada para todos los componentes del proyecto, manteniendo una organización estructurada.
zh_cn: 顶层项目目录是为README文件、许可证信息、配置文件和任何其他与代码无关的内容保留的。 Scarb确保所有项目组件都有一个指定的位置，维持一个结构化的组织架构。

source: If you started a project that doesn’t use Scarb, you can convert it to a project that does use Scarb. Move the project code into the src directory and create an appropriate `Scarb.toml` file.
id: Jika Anda memulai proyek yang tidak menggunakan Scarb, Anda dapat mengonversinya menjadi proyek yang menggunakan Scarb. Pindahkan kode proyek ke direktori srcdan buat file `Scarb.toml` yang sesuai.
zh_cn: 如果你启动了一个不使用Scarb的项目，你可以把它转换成一个使用Scarb的项目。将项目代码移到src目录下，并创建一个适当的`Scarb.toml`文件。

source: ### Building a Scarb Project
es: ### Creación de un proyecto Scarb
zh_cn: ### 编译Scarb项目

source: This command creates a `sierra` file in `target/dev`, let's ignore the `sierra` file for now.
id: Perintah ini membuat file `sierra` di `target/dev`, abaikan saja file `sierra` untuk saat ini.
zh_cn: 这个命令在`target/dev`中创建了一个`sierra`文件，现在我们先忽略`sierra`文件。

source: If you have installed Cairo correctly, you should be able to run and see the following output:
es: Si has instalado Cairo correctamente, deberías ser capaz de ejecutarlo y ver la siguiente salida:
id: Jika Anda telah menginstal Kairo dengan benar, Anda seharusnya dapat menjalankannya dan melihatcontoh output:
zh_cn: 如果你正确安装了Cairo，你应该能够运行并看到以下输出：

source: Regardless of your operating system, the string `Hello, world!` should print to the terminal.
es: Independientemente de su sistema operativo, la cadena `Hello, world!` debería imprimirse en el terminal.
zh_cn: 无论你的操作系统如何，终端里都应该打印出字符串`Hello, world!`。

source: If `Hello, world!` did print, congratulations! You’ve officially written a Cairo program. That makes you a Cairo programmer—welcome!
es: Si `Hello, world!` se imprime, ¡enhorabuena! Has escrito oficialmente un programa en Cairo. Eso te convierte en un programador de Cairo ¡Bienvenido!
zh_cn: 如果 "Hello，world！"打印出来了，那么恭喜你！你已经正式写了一个Cairo程序！ 你已经成为了一名Cairo程序员--欢迎!

source: ### Anatomy of a Cairo Program
es: ### Anatomía de un Programa Cairo
zh_cn: ### 解析Cairo程序

source: Let’s review this “Hello, world!” program in detail. Here’s the first piece of the puzzle:
es: Revisemos este programa "¡Hola, mundo!" en detalle. Aquí está la primera pieza del puzzle:
zh_cn: 让我们详细回顾一下这个 "Hello，world！"程序。这里有拼图的第一部分：

source: These lines define a function named `main`. The `main` function is special: it is always the first code that runs in every executable Cairo program. Here, the first line declares a function named `main` that has no parameters and returns nothing. If there were parameters, they would go inside the parentheses `()`.
es: Estas líneas definen una función llamada `main`. La función `main` es especial: es es siempre el primer código que se ejecuta en cada programa ejecutable de El Cairo. Aquí, la primera línea declara una función llamada `main` que no tiene parámetros y devuelve nada. Si hubiera parámetros, irían dentro de los paréntesis `()`.
zh_cn: 这些代码定义了一个名为 `main`的函数。`main`函数很特别：它总是每个可执行的Cairo程序中运行的第一个代码。 这里，第一行声明了一个名为 `main`的函数，没有参数，也不返回。如果有参数，它们会被放在括号`()`里。

source: The function body is wrapped in `{}`. Cairo requires curly brackets around all function bodies. It’s good style to place the opening curly bracket on the same line as the function declaration, adding one space in between.
es: El cuerpo de la función está envuelto en `{}`. Cairo requiere llaves alrededor de todos los cuerpos de función. Es de buen estilo colocar la llave de apertura en la misma línea que la declaración de la función, añadiendo un espacio en medio.
zh_cn: 函数主体被包裹在"{}"中。Cairo要求在所有的函数体周围加上大括号 将开头的左大括号与函数声明放在同一行是很好的编码风格。 别忘了在它们中间加一个空格。

source: > Note: If you want to stick to a standard style across Cairo projects, you can > use the automatic formatter tool available with `scarb fmt` to format your code in a > particular style (more on `scarb fmt` in > [Appendix D][devtools]). The Cairo team has included this tool > with the standard Cairo distribution, as `cairo-run` is, so it should already be > installed on your computer!
zh_cn: > 注意：如果你想在Cairo项目中使用一个统一代码风格标准，你可以 > 使用自动格式化工具`scarb fmt`来将你的代码格式化为 > 特定的代码风格（更多关于`scarb fmt`的信息见 > [附录D][devtools]）。Cairo团队已经将这个工具 > 包含在标准的Cairo发行版中，就像`cairo-run`一样，所以它应该已经被 > 已经安装在你的计算机上了!

source: Prior to the main function declaration, The line `use debug::PrintTrait;` is responsible for importing an item defined in another module. In this case, we are importing the `PrintTrait` item from the Cairo core library. By doing so, we gain the ability to use the `print()` method on data types that are compatible with printing.
es: Antes de la declaración de la función principal, la línea `use debug::PrintTrait;` es responsable de importar un elemento definido en otro módulo. En este caso, estamos importando el elemento `PrintTrait` de la biblioteca central de Cairo. Haciendo esto, ganamos la habilidad de usar el método `print()` en tipos de datos que son compatibles con la impresión.
id: Sebelum deklarasi fungsi utama, baris `use debug::PrintTrait;` bertanggung jawab untuk mengimpor item yang ditentukan dalam modul lain. Dalam hal ini, kita mengimpor item `PrintTrait` dari library inti Cairo. Dengan melakukan itu, kita mendapatkan kemampuan untuk menggunakan metode `print()` pada tipe data yang kompatibel dengan printing.
zh_cn: 在主函数声明之前，`use debug::PrintTrait;`一行负责导入另一个模块中定义的项目。在这个例子中，我们从Cairo核心库中导入了`PrintTrait`项目。通过这样做，我们获得了在可以打印的数据类型上使用`print()`方法的能力。

source: This line does all the work in this little program: it prints text to the screen. There are four important details to notice here.
es: Esta línea hace todo el trabajo en este pequeño programa: imprime texto en la pantalla. pantalla. Hay cuatro detalles importantes a tener en cuenta aquí.
zh_cn: 这一行完成了这个小程序的所有工作：将文本打印到屏幕上。这里有四个重要的细节需要注意。

source: Second, the `print()` function called is a method from the trait `PrintTrait`. This trait is imported from the Cairo core library, and it defines how to print values to the screen for different data types. In our case, our text is defined as a "short string", which is an ASCII string that can fit in Cairo's basic data type, which is the `felt252` type. By calling `Hello, world!'.print()`, we're calling the `print()` method of the `felt252` implementation of the `PrintTrait` trait.
es: Segundo, la función `print()` es un método del trait `PrintTrait`. Este trait se importa de la librería del núcleo de Cairo, y define cómo imprimir valores en la pantalla para diferentes tipos de datos. En nuestro caso, nuestro texto está definido como una "cadena corta", que es una cadena ASCII que puede caber en el tipo de datos básico de Cairo, que es el tipo `felt252`. Al llamar a `Hello, world!'.print()`, estamos llamando al método `print()` de la implementación `felt252` del trait `PrintTrait`.
id: Kedua, fungsi `print()` yang dipanggil adalah metode dari sifat `PrintTrait`. Sifat ini diimpor dari library inti Cairo, dan itu mendefinisikan cara mencetak nilai ke layar untuk tipe data berbeda. Di dalam hal ini, teks kita didefinisikan sebagai "string pendek", yang merupakan string ASCII yang dapat ditampung dalam tipe data dasar Cairo, yaitu tipe `felt252`. Dengan memanggil `Hello, world!'.print()`, kita memanggil metode `print()` dari `felt252` penerapan sifat `PrintTrait`.
zh_cn: 第二，调用的`print()`函数是来自trait`PrintTrait`的一个方法。这个trait是从Cairo核心库中导入的，它定义了如何将不同数据类型的值打印到屏幕上。在我们的例子中，我们的文本被定义为 "short string"，这是一个ASCII字符串，可以适合Cairo的基本数据类型，即`felt252`类型。通过调用`'Hello, world!'.print()`，我们正在调用`PrintTrait`trait的`felt252`实现的`print()`方法。

source: Third, you see the `'Hello, World!'` short string. We pass this short string as an argument to `print()`, and the short string is printed to the screen.
zh_cn: 第三，看见了`'Hello, world!'`短字符串么。我们把这个短字符串作为一个参数传递给`print()`，因此短字符串被打印到屏幕上。

source: Fourth, we end the line with a semicolon (`;`), which indicates that this expression is over and the next one is ready to begin. Most lines of Cairo code end with a semicolon.
es: Cuarto, terminamos la línea con un punto y coma (`;`), que indica que esta expresión ha terminado y la siguiente está lista para comenzar. La mayoría de las líneas de código de Cairo terminan con punto y coma.
zh_cn: 第四，我们用分号（`;`）来结束这一行，这表示这个表达式已经结束，下一个表达式准备开始。大多数Cairo的代码行以分号结束。

source: ### Running tests
zh_cn: ## 运行测试

source: To run all the tests associated with a particular package, you can use the `scarb test` command. It is not a test runner by itself, but rather delegates work to a testing solution of choice. Scarb comes with preinstalled `scarb cairo-test` extension, which bundles Cairo's native test runner. It is the default test runner used by scarb test. To use third-party test runners, please refer to [Scarb's documentation](https://docs.swmansion.com/scarb/docs/extensions/testing.html#using-third-party-test-runners).
zh_cn: 要运行与特定软件包相关的所有测试，可以使用`scarb test`命令。 它本身并不是一个测试运行工具，而是将测试工作委托给所选的测试工具。Scarb预装了`scarb cairo-test`扩展，它捆绑了Cairo的本地测试运行器。它也是scarb test默认使用的测试运行器。 要使用第三方测试运行器，请参考[Scarb文档](https://docs.swmansion.com/scarb/docs/extensions/testing.html#using-third-party-test-runners)。

source: Test functions are marked with the `#[test]` attributes, and running `scarb test` will run all test functions in your codebase under the `src/` directory.
id: Fungsi pengujian ditandai dengan atribut `#[test]`, dan menjalankan `scarb test` akan menjalankan semua fungsi pengujian di basis kode Anda di bawah `src/` direktori.
zh_cn: 测试函数用`#[test]`属性标记，运行`scarb test`将运行代码库中`src/`目录下的所有测试函数。

source: <span class="caption"> A sample Scarb project structure</span>
zh_cn: <span class="caption">Scarb 项目结构示例</span>

source: - We can create a project using `scarb new`. - We can build a project using `scarb build` to generate the compiled Sierra code. - We can define custom scripts in `Scarb.toml` and call them with the `scarb run` command. - We can run tests using the `scarb test` command.
zh_cn: - 我们可以使用 `scarb new` 创建项目。 - 我们可以使用 `scarb build` 生成编译后的 Sierra 代码。 - 我们可以在 `Scarb.toml` 中定义自定义脚本，并使用 `scarb run` 命令调用它们。 - 我们可以使用 `scarb test` 命令运行测试。

source: # Summary
es: # Resumen
zh_cn: # 总结

source: You’re already off to a great start on your Cairo journey! In this chapter, you’ve learned how to:
es: Ya has empezado con buen pie tu viaje en Cairo. En este capítulo, has aprendido cómo:
id: Anda sudah memulai perjalanan Anda di Cairo dengan baik! Dalam bab ini, Anda telah belajar cara:
zh_cn: 你的Cairo之旅已经有了一个很好的开始！在本章中，你已经学会了如何：

source: - Install the latest stable version of Cairo - Write and run a “Hello, Scarb!” program using `scarb` directly - Create and run a new project using the conventions of Scarb - Execute tests using the `scarb test` command
zh_cn: - 安装最新稳定版本的 Cairo - 直接使用 `scarb` 编写并运行 “Hello, world!”程序 - 使用 Scarb 的默认设置创建并运行一个新项目 - 使用 `scarb test` 命令执行测试

source: This is a great time to build a more substantial program to get used to reading and writing Cairo code.
es: Este es un buen momento para construir un programa más sustancial para acostumbrarte a leer y escribir código de Cairo.
id: Ini saat yang tepat untuk membangun program yang lebih substansial untuk membiasakan diri membaca dan menulis kode Cairo.
zh_cn: 是时候通过建立更多实用程序来熟悉阅读和编写Cairo代码了。

source: # Common Programming Concepts
es: # Conceptos comunes de programación
zh_cn: # 常见的编程概念

source: ## Variables and Mutability
es: ## Variables y mutabilidad
zh_cn: ## 变量和可变性

source: Cairo uses an immutable memory model, meaning that once a memory cell is written to, it can't be overwritten but only read from. To reflect this immutable memory model, variables in Cairo are immutable by default. However, the language abstracts this model and gives you the option to make your variables mutable. Let’s explore how and why Cairo enforces immutability, and how you can make your variables mutable.
es: Cairo usa un modelo de memoria inmutable, lo que significa que una vez que se escribe en una celda de memoria, no puede ser sobrescrita sino sólo leída. Para reflejar este modelo de memoria inmutable, las variables en Cairo son inmutables por defecto. Sin embargo, el lenguaje abstrae este modelo y te da la opción de hacer tus variables mutables. Exploremos cómo y por qué Cairo impone la inmutabilidad, y cómo puedes hacer tus variables mutables.
zh_cn: Cairo使用一个不可改变的内存模型，这意味着一旦一个内存单元被写入就不能被覆盖， 只能被读出。为了反映这种不可变的内存模型，变量在Cairo中默认是不可变的。 然而，该语言对这种模式进行了抽象，让你可以选择变量是否可变。让我们来 探讨一下Cairo是如何以及为什么要强行规定变量不可变，以及如何使变量成为可变的。

source: When a variable is immutable, once a value is bound to a name, you can’t change that value. To illustrate this, generate a new project called _variables_ in your _cairo_projects_ directory by using `scarb new variables`.
es: Cuando una variable es inmutable, una vez que un valor está ligado a un nombre, no puedes cambiar ese valor. Para ilustrar esto, genera un nuevo proyecto llamado _ variables_ en tu directorio _cairo_projects_ usando `scarb new variables`.
zh_cn: 当一个变量是不可变的，一旦一个值被绑定到一个名字上，你就不能改变该值。 为了展示这一点，在你的 _cairo_projects_ 目录下，使用`scarb new variables`生成一个名为 _variables_ 的新项目。

source: Then, in your new _variables_ directory, open _src/lib.cairo_ and replace its code with the following code, which won’t compile just yet:
es: A continuación, en su nuevo directorio _variables_, abra _src/lib.cairo_ y sustituya su código por el siguiente, que todavía no compilará:
zh_cn: 然后，在你新的 _variables_ 目录下，打开 _src/lib.cairo_ 并将其替换为下面的代码，这段代码还不会被编译：

source: <span class="filename">Filename: src/lib.cairo</span>
zh_cn: <span class="filename">文件名： src/lib.cairo</span>

source: Save and run the program using `scarb cairo-run`. You should receive an error message regarding an immutability error, as shown in this output:
zh_cn: 保存并使用`scarb cairo-run`运行该程序。你应该收到一条关于不可变性的错误，如下所示：

source: This example shows how the compiler helps you find errors in your programs. Compiler errors can be frustrating, but really they only mean your program isn’t safely doing what you want it to do yet; they do _not_ mean that you’re not a good programmer! Experienced Caironautes still get compiler errors.
es: Este ejemplo muestra cómo el compilador te ayuda a encontrar errores en tus programas. Los errores del compilador pueden ser frustrantes, pero en realidad sólo significan que su programa todavía no está haciendo con seguridad lo que usted quiere que haga; ¡no significan que usted no sea un buen programador! Los Caironautas experimentados siguen teniendo errores de compilador.
zh_cn: 这个例子显示了编译器如何帮助你发现程序中的错误。 编译错误可能令人沮丧，但实际上它们只意味着你的程序 还没有安全地完成你想做的事情；它们并不意味着你不是一个好的程序员。 即使有经验的Caironautes仍然会遇到编译错误。

source: You received the error message `Cannot assign to an immutable variable.` because you tried to assign a second value to the immutable `x` variable.
es: Recibiste el mensaje de error `Cannot assign to an immutable variable.` porque intentaste asignar un segundo valor a la variable inmutable `x`.
zh_cn: 你收到的错误信息是 `Cannot assign to an immutable variable.`。 因为你试图给不可变的`x`变量分配第二个值。

source: It’s important that we get compile-time errors when we attempt to change a value that’s designated as immutable because this specific situation can lead to bugs. If one part of our code operates on the assumption that a value will never change and another part of our code changes that value, it’s possible that the first part of the code won’t do what it was designed to do. The cause of this kind of bug can be difficult to track down after the fact, especially when the second piece of code changes the value only _sometimes_. The Cairo compiler guarantees that when you state that a value won’t change, it really won’t change, so you don’t have to keep track of it yourself. Your code is thus easier to reason through.
es: Es importante que obtengamos errores en tiempo de compilación cuando intentamos cambiar un valor designado como inmutable porque esta situación específica puede conducir a errores. Si una parte de nuestro código opera bajo la suposición de que un valor nunca cambiará y otra parte de nuestro código cambia ese valor, es posible que la primera parte del código no haga lo que fue diseñada para hacer. La causa de este tipo de error puede ser difícil de rastrear después de los hechos, especialmente cuando la segunda parte del código cambia el valor sólo _a veces_. El compilador Cairo garantiza que cuando dices que un valor no cambiará, realmente no cambiará, por lo que no tiene que hacer un seguimiento. Su código es así más fácil de razonar.
zh_cn: 在尝试改变预设为不可变的值时，产生编译时错误是很重要的，因为这种情况可能导致 bug。 如果一部分代码假设一个值永远也不会改变，而另一部分代码改变了这个值， 第一部分代码就有可能以不可预料的方式运行。不得不承认这种 bug 的起因难以跟踪，尤其是第二部分代码只是 _有时_ 会改变值。 Cairo 编译器保证，如果声明一个值不会变，它就真的不会变，所以你不必自己跟踪它。这意味着你的代码更易于推导。

source: But mutability can be very useful, and can make code more convenient to write. Although variables are immutable by default, you can make them mutable by adding `mut` in front of the variable name. Adding `mut` also conveys intent to future readers of the code by indicating that other parts of the code will be changing this variable’s value.
es: Pero la mutabilidad puede ser muy útil, y puede hacer que el código sea más cómodo de escribir. Aunque las variables son inmutables por defecto, puedes hacerlas mutables añadiendo `mut` delante del nombre de la variable. Añadir `mut` también transmite intención a los futuros lectores del código indicando que otras partes del código cambiarán el valor de esta variable.
zh_cn: 不过可变性也是非常有用的，可以用来更方便地编写代码。尽管变量默认是不可变的，你仍然可以在变量名前添加 `mut` 来使其可变。`mut` 也向阅读代码的人表明了其他代码将会改变这个变量值的意图。

source: However, you might be wondering at this point what exactly happens when a variable is declared as `mut`, as we previously mentioned that Cairo's memory is immutable. The answer is that Cairo's memory is immutable, but the memory address the variable points to can be changed. Upon examining the low-level Cairo Assembly code, it becomes clear that variable mutation is implemented as syntactic sugar, which translates mutation operations into a series of steps equivalent to variable shadowing. The only difference is that at the Cairo level, the variable is not redeclared so its type cannot change.
es: Sin embargo, puede que en este punto te estés preguntando qué ocurre exactamente cuando una variable es declarada como `mut`, ya que previamente mencionamos que la memoria de Cairo es inmutable. La respuesta es que la memoria de Cairo es inmutable, pero la dirección de memoria a la que apunta la variable puede ser cambiada. Al examinar el código ensamblador de bajo nivel de Cairo, queda claro que la mutación de variables se implementa como azúcar sintáctico, que traduce las operaciones de mutación en una serie de pasos equivalentes al shadowing de variables. La única diferencia es que en el nivel la variable no se vuelve a declarar, por lo que su tipo no puede cambiar.
zh_cn: 然而，你可能想知道，当一个变量被声明为 `mut` 时，究竟会发生什么？因为我们之前提到Cairo的内存是不可改变的。 答案是，Cairo的内存是不可改变的，但变量指向的内存地址可以被改变。在检查了低级别的Cairo汇编代码后， 我们可以清楚地发现变量可变性是以语法糖的形式实现的，它将变量可变性操作转化为一系列的步骤，等同于变量的隐藏（variable shadowing）。 唯一的区别是，在Cairo，变量没有被重新声明，所以它的类型不能改变。

source: We’re allowed to change the value bound to `x` from `5` to `6` when `mut` is used. Ultimately, deciding whether to use mutability or not is up to you and depends on what you think is clearest in that particular situation.
es: Se nos permite cambiar el valor ligado a `x` de `5` a `6` cuando se usa `mut`. En última instancia, la decisión de utilizar la mutabilidad o no es suya y depende de lo que usted piensa que es más claro en esa situación particular.
zh_cn: 当使用 `mut` 时，我们将在`x`绑定的值从`5`改为 `6` 。 最终，决定是否使用可变性取决于你自己以及你认为在特定情况下什么是最清楚的。

source: ### Constants
es: ##### Constantes
zh_cn: ### 常量

source: Like immutable variables, _constants_ are values that are bound to a name and are not allowed to change, but there are a few differences between constants and variables.
es: Al igual que las variables inmutables, las _constantes_ son valores que están vinculados a un nombre y no se les permite cambiar, pero hay algunas diferencias entre las constantes y las variables.
zh_cn: 类似于不可变变量，常量 (constants) 是绑定到一个名称的不允许改变的值，不过常量与变量还是有一些区别。

source: First, you aren’t allowed to use `mut` with constants. Constants aren’t just immutable by default—they’re always immutable. You declare constants using the `const` keyword instead of the `let` keyword, and the type of the value _must_ be annotated. We’ll cover types and type annotations in the next section, [“Data Types”][data-types], so don’t worry about the details right now. Just know that you must always annotate the type.
es: En primer lugar, no se permite el uso de `mut` con las constantes. Las constantes no son solo inmutables por defecto, sino que siempre son inmutables. Se declaran constantes usando la palabra clave `const` en lugar de la palabra clave `let`, y el tipo de valor _debe_ ser anotado. Cubriremos los tipos y las anotaciones de tipo en la próxima sección, [“Tipos de datos”][tipos-de-datos], así que no se preocupe por los detalles por ahora. Solo sepa que siempre debe anotar el tipo.
zh_cn: 首先，不允许对常量使用 `mut`。常量不仅仅是默认不可变—它总是不可变。声明常量使用 `const` 关键字而不是 `let`，并且 _必须_ 注明值的类型。在下一部分，[“数据类型”][data-types]中会介绍类型和类型注解，现在无需关心这些细节，记住总是标注类型即可。

source: Constants can only be declared in the global scope, which makes them useful for values that many parts of code need to know about.
es: Las constantes solo se pueden declarar en el ámbito global, lo que las hace útiles para valores que muchas partes del código deben conocer.
zh_cn: 常量可以在任何作用域中声明，包括全局作用域，这在一个值需要被很多部分的代码用到时很有用。

source: The last difference is that constants may be set only to a constant expression, not the result of a value that could only be computed at runtime. Only literal constants are currently supported.
es: La última diferencia es que las constantes solo pueden ser asignadas a una expresión constante, no al resultado de un valor que solo se podría calcular en tiempo de ejecución. Actualmente, solo se admiten constantes literales.
zh_cn: 最后一个区别是，常量只能被设置为常量表达式，而不可以是其他任何只能在运行时计算出的值。目前只支持字面常量。

source: Cairo's naming convention for constants is to use all uppercase with underscores between words.
es: La convención de nomenclatura de Cairo para las constantes es usar todas las mayúsculas con guiones bajos entre palabras.
zh_cn: Cairo的常量命名规则是使用所有大写字母，单词之间使用下划线。

source: Constants are valid for the entire time a program runs, within the scope in which they were declared. This property makes constants useful for values in your application domain that multiple parts of the program might need to know about, such as the maximum number of points any player of a game is allowed to earn, or the speed of light.
es: Las constantes son válidas durante todo el tiempo que se ejecuta un programa, dentro del ámbito en el que fueron declaradas. Esta propiedad hace que las constantes sean útiles para los valores en el dominio de su aplicación que varias partes del programa podrían necesitar conocer, como el número máximo de puntos que cualquier jugador de un juego puede ganar o la velocidad de la luz.
zh_cn: 在声明它的作用域之中，常量在整个程序生命周期中都有效， 此属性使得常量可以作为多处代码使用的全局范围的固定数值，例如一个游戏中玩家可以获取的最高分，或者光速。
