Repository: cairo-book/cairo-book
Catalog: po/*.po
Languages: es, id, ko, zh_cn

source: Here is how you would define and use a `calculate_length` function that takes a snapshot to an array as a parameter instead of taking ownership of the underlying value. In this example, the `calculate_length` function returns the length of the array passed as parameter. As we're passing it as a snapshot, which is an immutable view of the array, we can be sure that the `calculate_length` function will not mutate the array, and ownership of the array is kept in the main function.
id: Berikut adalah cara Anda akan mendefinisikan dan menggunakan fungsi `calculate_length` yang mengambil snapshot dari sebuah array sebagai parameter daripada mengambil kepemilikan dari nilai yang mendasarinya. Pada contoh ini, fungsi `calculate_length` mengembalikan panjang dari array yang dilewatkan sebagai parameter. Karena kita melewatinya sebagai snapshot, yang merupakan pandangan yang tidak dapat diubah dari array, kita dapat yakin bahwa fungsi `calculate_length` tidak akan mengubah array tersebut, dan kepemilikan dari array tetap berada di dalam fungsi utama.

source: But, what happens if we try to modify something we’re passing as snapshot? Try the code in Listing 4-6. Spoiler alert: it doesn’t work!
id: Tetapi, apa yang terjadi jika kita mencoba memodifikasi sesuatu yang kita lewati sebagai snapshot? Cobalah kode di Listing 4-6. Peringatan: itu tidak berhasil!

source: Listing 4-6: Attempting to modify a snapshot value
id: Listing 4-6: Mencoba untuk memodifikasi nilai snapshot

source: We can achieve the behavior we want in Listing 4-6 by using a _mutable reference_ instead of a snapshot. Mutable references are actually mutable values passed to a function that are implicitly returned at the end of the function, returning ownership to the calling context. By doing so, they allow you to mutate the value passed while keeping ownership of it by returning it automatically at the end of the execution. In Cairo, a parameter can be passed as _mutable reference_ using the `ref` modifier.
id: Kita dapat mencapai perilaku yang diinginkan pada Listing 4-6 dengan menggunakan sebuah _mutable reference_ daripada sebuah snapshot. Mutable references sebenarnya adalah nilai yang dapat dimutasi yang dilewati ke suatu fungsi yang secara implisit dikembalikan pada akhir fungsi, mengembalikan kepemilikan ke konteks pemanggilan. Dengan cara ini, mereka memungkinkan Anda untuk memodifikasi nilai yang dilewati sambil tetap memegang kepemilikannya dengan mengembalikannya secara otomatis pada akhir eksekusi. Di Cairo, sebuah parameter dapat dilewati sebagai _mutable reference_ menggunakan modifier `ref`.

source: Listing 4-7: Use of a mutable reference to modify a value
id: Listing 4-7: Penggunaan mutable reference untuk memodifikasi sebuah nilai

source: Listing 5-2: Creating an instance of the `User` struct
id: Listing 5-2: Membuat sebuah instance dari struct `User`

source: The `print` trait is implemented for many data types, but not for the `Rectangle` struct. We can fix this by implementing the `PrintTrait` trait on `Rectangle` as shown in Listing 5-10. To learn more about traits, see [Traits in Cairo](ch08-02-traits-in-cairo.md).
id: Trait `print` diimplementasikan untuk banyak tipe data, tetapi tidak untuk struct `Rectangle`. Kita dapat memperbaiki hal ini dengan mengimplementasikan trait `PrintTrait` pada `Rectangle` seperti yang ditunjukkan dalam Listing 5-10. Untuk mempelajari lebih lanjut tentang traits, lihat [Traits in Cairo](ch08-02-traits-in-cairo.md).

source: Listing 5-10: Implementing the `PrintTrait` trait on `Rectangle`
id: Listing 5-10: Mengimplementasikan trait `PrintTrait` pada `Rectangle`

source: _Methods_ are similar to functions: we declare them with the `fn` keyword and a name, they can have parameters and a return value, and they contain some code that’s run when the method is called from somewhere else. Unlike functions, methods are defined within the context of a type and their first parameter is always `self`, which represents the instance of the type the method is being called on. For those familiar with Rust, Cairo's approach might be confusing, as methods cannot be defined directly on types. Instead, you must define a trait and an implementation associated with the type for which the method is intended.
id: _Metode_ mirip dengan fungsi: kita mendeklarasikannya dengan kata kunci `fn` dan sebuah nama, mereka dapat memiliki parameter dan nilai pengembalian, dan mereka berisi beberapa kode yang dijalankan ketika metode tersebut dipanggil dari suatu tempat lain. Berbeda dengan fungsi, metode didefinisikan dalam konteks dari suatu tipe dan parameter pertamanya selalu `self`, yang mewakili instance dari tipe yang metode itu dipanggil. Bagi yang akrab dengan Rust, pendekatan Cairo mungkin membingungkan, karena metode tidak dapat didefinisikan secara langsung pada tipe-tipe. Sebagai gantinya, Anda harus mendefinisikan sebuah trait dan implementasi yang terkait dengan tipe yang dituju untuk metode tersebut.

source: Let’s change the `area` function that has a `Rectangle` instance as a parameter and instead make an `area` method defined on the `RectangleTrait` trait, as shown in Listing 5-13.
id: Mari ubah fungsi `area` yang memiliki sebuah instance `Rectangle` sebagai parameter dan alihkan menjadi sebuah metode `area` yang didefinisikan pada trait `RectangleTrait`, seperti yang ditunjukkan dalam Listing 5-13.

source: Listing 5-13: Defining an `area` method to use on the `Rectangle`
id: Listing 5-13: Mendefinisikan metode `area` yang digunakan pada `Rectangle`

source: Here, we’re choosing to make the `width` method return `true` if the value in the instance’s `width` field is greater than `0` and `false` if the value is `0`: we can use a field within a method of the same name for any purpose. In `main`, when we follow `rect1.width` with parentheses, Cairo knows we mean the method `width`. When we don’t use parentheses, Cairo knows we mean the field `width`.
id: Di sini, kita memilih untuk membuat metode `width` mengembalikan `true` jika nilai dalam field `width` dari instance lebih besar dari `0` dan `false` jika nilai adalah `0`: kita dapat menggunakan field dalam sebuah metode yang memiliki nama yang sama untuk tujuan apapun. Di `main`, ketika kita mengikuti `rect1.width` dengan tanda kurung, Cairo tahu bahwa kita mengacu pada metode `width`. Ketika kita tidak menggunakan tanda kurung, Cairo tahu bahwa kita mengacu pada field `width`.

source: Let’s practice using methods by implementing a second method on the `Rectangle` struct. This time we want an instance of `Rectangle` to take another instance of `Rectangle` and return `true` if the second `Rectangle` can fit completely within `self` (the first `Rectangle`); otherwise, it should return `false`. That is, once we’ve defined the `can_hold` method, we want to be able to write the program shown in Listing 5-14.
id: Mari latihan menggunakan metode dengan mengimplementasikan metode kedua pada struct `Rectangle`. Kali ini, kita ingin sebuah instance dari `Rectangle` untuk mengambil instance lain dari `Rectangle` dan mengembalikan `true` jika `Rectangle` kedua dapat sepenuhnya muat di dalam `self` (Rectangle pertama); jika tidak, maka seharusnya mengembalikan `false`. Artinya, setelah kita mendefinisikan metode `can_hold`, kita ingin dapat menulis program seperti yang ditunjukkan dalam Listing 5-14.

source: Listing 5-14: Using the as-yet-unwritten `can_hold` method
id: Listing 5-14: Menggunakan metode `can_hold` yang belum ditulis

source: We know we want to define a method, so it will be within the `trait RectangleTrait` and `impl RectangleImpl of RectangleTrait` blocks. The method name will be `can_hold`, and it will take a snapshot of another `Rectangle` as a parameter. We can tell what the type of the parameter will be by looking at the code that calls the method: `rect1.can_hold(@rect2)` passes in `@rect2`, which is a snapshot to `rect2`, an instance of `Rectangle`. This makes sense because we only need to read `rect2` (rather than write, which would mean we’d need a mutable borrow), and we want `main` to retain ownership of `rect2` so we can use it again after calling the `can_hold` method. The return value of `can_hold` will be a Boolean, and the implementation will check whether the width and height of `self` are greater than the width and height of the other `Rectangle`, respectively. Let’s add the new `can_hold` method to the `trait` and `impl` blocks from Listing 5-13, shown in Listing 5-15.
id: Kita tahu kita ingin mendefinisikan sebuah metode, jadi metode tersebut akan berada dalam blok `trait RectangleTrait` dan `impl RectangleImpl of RectangleTrait`. Nama metode tersebut akan menjadi `can_hold`, dan itu akan mengambil gambaran dari `Rectangle` lain sebagai parameter. Kita dapat mengetahui tipe data parameter tersebut dengan melihat kode yang memanggil metode: `rect1.can_hold(@rect2)` mengirimkan `@rect2`, yang merupakan gambaran dari `rect2`, suatu instansi dari `Rectangle`. Ini masuk akal karena kita hanya perlu membaca `rect2` (bukan menulis, yang berarti kita memerlukan pinjaman yang dapat diubah), dan kita ingin agar `main` tetap memiliki kepemilikan dari `rect2` sehingga kita dapat menggunakannya lagi setelah memanggil metode `can_hold`. Nilai kembalian dari `can_hold` akan berupa Boolean, dan implementasinya akan memeriksa apakah lebar dan tinggi dari `self` lebih besar dari lebar dan tinggi dari `Rectangle` lain tersebut, masing-masing. Mari tambahkan metode `can_hold` baru ke blok `trait` dan `impl` dari Listing 5-13, seperti yang ditunjukkan dalam Listing 5-15.

source: Listing 5-15: Implementing the `can_hold` method on `Rectangle` that takes another `Rectangle` instance as a parameter
id: Listing 5-15: Implementasi metode `can_hold` pada `Rectangle` yang mengambil instansi `Rectangle` lain sebagai parameter

source: When we run this code with the `main` function in Listing 5-14, we’ll get our desired output. Methods can take multiple parameters that we add to the signature after the `self` parameter, and those parameters work just like parameters in functions.
id: Ketika kita menjalankan kode ini dengan fungsi `main` pada Listing 5-14, kita akan mendapatkan output yang diinginkan. Metode dapat mengambil beberapa parameter yang kita tambahkan ke dalam tanda tangan setelah parameter `self`, dan parameter-parameter tersebut berfungsi seperti parameter dalam fungsi.

source: To call this function, we use the `::` syntax with the implementation name; `let square = RectangleImpl::square(10);` is an example. This function is namespaced by the implementation; the `::` syntax is used for both trait functions and namespaces created by modules. We’ll discuss modules in \[Chapter 8\]\[modules\]
id: Untuk memanggil fungsi ini, kita menggunakan sintaks `::` dengan nama implementasi; `let square = RectangleImpl::square(10);` adalah contohnya. Fungsi ini berada di dalam ruang nama implementasi; sintaks `::` digunakan untuk fungsi-fungsi trait maupun ruang nama yang dibuat oleh modul. Kita akan membahas modul di \[Chapter 8\]\[modules\].

source: Each struct is allowed to have multiple `trait` and `impl` blocks. For example, Listing 5-15 is equivalent to the code shown in Listing 5-16, which has each method in its own `trait` and `impl` blocks.
id: Setiap struktur diizinkan memiliki beberapa blok `trait` dan `impl`. Sebagai contoh, Listing 5-15 setara dengan kode yang ditunjukkan dalam Listing 5-16, yang memiliki setiap metode dalam blok `trait` dan `impl` tersendiri.

source: Listing 5-16: Rewriting Listing 5-15 using multiple `impl` blocks
id: Listing 5-16: Menuliskan ulang Listing 5-15 menggunakan beberapa blok `impl`

source: Listing 6-5: A function that uses a match expression on an `Option<u8>`
id: Listing 6-5: Sebuah fungsi yang menggunakan ekspresi match pada `Option<u8>`

source: Match 0 and the \_ Placeholder
id: Match 0 dan \_ Placeholder

source: A Cairo package is a bundle of one or more crates with a Scarb.toml file that describes how to build those crates. This enables the splitting of code into smaller, reusable parts and facilitates more structured dependency management.
id: Package Cairo adalah bundel dari satu atau lebih crate dengan berkas Scarb.toml yang mendeskripsikan cara membangun crate-crate tersebut. Hal ini memungkinkan pemisahan kode ke dalam bagian-bagian yang lebih kecil dan dapat digunakan kembali, serta memfasilitasi manajemen dependensi yang lebih terstruktur.

source: The line `use garden::vegetables::Asparagus;` lets us use bring the `Asparagus` type into scope, so we can use it in the `main` function.
id: Baris `use garden::vegetables::Asparagus;` memungkinkan kita untuk membawa tipe data `Asparagus` ke dalam lingkup, sehingga kita dapat menggunakannya dalam fungsi `main`.

source: Although both Listing 7-5 and 6-7 accomplish the same task, Listing 7-5 is the idiomatic way to bring a function into scope with `use`. Bringing the function’s parent module into scope with `use` means we have to specify the parent module when calling the function. Specifying the parent module when calling the function makes it clear that the function isn’t locally defined while still minimizing repetition of the full path. The code in Listing 7-7 is unclear as to where `add_to_waitlist` is defined.
id: Meskipun kedua Listing 7-5 dan 6-7 berhasil menyelesaikan tugas yang sama, Listing 7-5 merupakan cara yang idiomatik untuk membawa sebuah fungsi ke dalam lingkup dengan `use`. Memasukkan modul induk fungsi ke dalam scope dengan `use` berarti kita harus menentukan modul induk saat memanggil fungsi tersebut. Menentukan modul induk saat memanggil fungsi membuat jelas bahwa fungsi tersebut tidak didefinisikan secara lokal sementara tetap meminimalkan pengulangan dari jalur lengkap. Kode dalam Listing 7-7 kurang jelas mengenai di mana `add_to_waitlist` didefinisikan.

source: We first define `WalletTrait<T>` trait using a generic type `T` which defines a method that returns a snapshot of the field `address` from `Wallet`. Then we give an implementation for the trait in `WalletImpl<T>`. Note that you need to include a generic type in both definitions of the trait and the implementation.
es: Primero definimos la clase `WalletTrait<T>` usando un tipo genérico `T` que define un método que devuelve una instantánea del campo `address` de `Wallet`. Luego, damos una implementación de la clase en `WalletImpl<T>`. Ten en cuenta que debes incluir un tipo genérico en ambas definiciones de la clase y la implementación.
id: Pertama, kita mendefinisikan trait `WalletTrait<T>` menggunakan tipe generik `T` yang mendefinisikan sebuah metode yang mengembalikan salinan dari bidang `address` dari `Wallet`. Kemudian kita memberikan implementasi untuk trait tersebut dalam `WalletImpl<T>`. Perhatikan bahwa Anda perlu menyertakan tipe generik dalam kedua definisi trait dan implementasinya.

source: Implementing a Trait
id: Melaksanakan Sebuah Trait

source: Checking Results with the assert function
id: Memeriksa Hasil dengan Fungsi assert

source: We are asserting in main that `my_number` is not zero to ensure that we're not performing a division by 0. In this example, `my_number` is zero so the assertion will fail, and the program will panic with the string 'number is zero' (as a felt252) and the division will not be reached.
id: Kami melakukan asersi di dalam fungsi `main` bahwa `my_number` bukan nol untuk memastikan bahwa kita tidak melakukan pembagian dengan 0. Pada contoh ini, `my_number` adalah nol sehingga asersi akan gagal, dan program akan panic dengan string 'number is zero' (sebagai felt252) dan pembagian tidak akan tercapai.

source: Let's take another example demonstrating the use of `unwrap`. First we import the necessary modules:
id: Mari kita lihat contoh lain yang menunjukkan penggunaan `unwrap`. Pertama, kita impor modul-modul yang diperlukan:

source: We could have also used the #\[should_panic\] attribute here.
id: Kita juga bisa menggunakan atribut `#[should_panic]` di sini.

source: Let's start by `array!`
id: Mari kita mulai dengan `array!`

source: Sometimes, we need to create arrays with values that are already known at compile time. The basic way of doing that is redundant. You would first declare the array and then append each value one by one. `array!` is a simpler way of doing this task by combining the two steps. At compile-time, the compiler will create an array and append all values passed to the `array!` macro sequentially.
id: Terkadang, kita perlu membuat array dengan nilai yang sudah diketahui pada saat kompilasi. Cara dasar untuk melakukannya terasa redundan. Anda akan pertama-tama mendeklarasikan array dan kemudian menambahkan masing-masing nilai satu per satu. `array!` adalah cara yang lebih sederhana untuk melakukan tugas ini dengan menggabungkan dua langkah tersebut. Pada saat kompilasi, kompiler akan membuat array dan menambahkan semua nilai yang dilewatkan ke macro `array!` secara berurutan.

source: This chapter will give you a high level introduction to what smart-contracts are, what are they used for and why would blockchain developers use Cairo and Starknet. If you are already familiar with blockchain programming, feel free to skip this chapter. The last part might still be interesting though.
id: Bab ini akan memberikan pengantar tingkat tinggi tentang apa itu kontrak pintar, apa yang mereka gunakan, dan mengapa pengembang blockchain akan menggunakan Cairo dan Starknet. Jika Anda sudah familiar dengan pemrograman blockchain, silakan lewati bab ini. Bagian terakhir mungkin masih menarik untuk dibaca.

source: Listing 99-1-bis: A wrong implementation of the interface of the contract. This does not compile.
id: Listing 99-1-bis: Implementasi antarmuka kontrak yang salah. Ini tidak dapat dikompilasi.

source: Listing 99-1bis: Our reference contract for this chapter
id: Listing 99-1bis: Kontrak referensi untuk bab ini

source: For more details about the contract storage layout in the [Starknet Documentation](https://docs.starknet.io/documentation/architecture_and_concepts/Contracts/contract-storage/#storage_variables)
id: Untuk informasi lebih lanjut tentang tata letak penyimpanan kontrak, kunjungi [Dokumentasi Starknet](https://docs.starknet.io/documentation/architecture_and_concepts/Contracts/contract-storage/#storage_variables).

source: **Note:** It's important to note that both external and view functions are public. To create an internal function in a contract, you will need to define it outside of the implementation block annotated with the `#[external(v0)]` attribute.
id: **Catatan:** Penting untuk dicatat bahwa fungsi eksternal dan fungsi tampilan (view) keduanya bersifat publik. Untuk membuat fungsi internal dalam sebuah kontrak, Anda perlu mendefinisikannya di luar blok implementasi yang diberi atribut `#[external(v0)]`.

source: Recall that in order to access the ContractState in a function, this function must be defined in an implementation block whose generic parameter is `ContractState`. This implies that we first need to define a generic trait that takes a `TContractState`, and then implement this trait for the `ContractState` type. But by using the `#[generate_trait]` attribute, this whole process can be skipped and we can simply define the implementation block directly, without any generic parameter, and use `self: ContractState` in our functions.
id: Ingat bahwa untuk mengakses ContractState dalam suatu fungsi, fungsi ini harus didefinisikan dalam blok implementasi yang generic parameternya adalah `ContractState`. Ini mengimplikasikan bahwa kita pertama-tama perlu mendefinisikan trait generik yang mengambil `TContractState`, dan kemudian mengimplementasikan trait ini untuk tipe `ContractState`. Tetapi dengan menggunakan atribut `#[generate_trait]`, seluruh proses ini dapat dilewati dan kita dapat dengan mudah mendefinisikan blok implementasi secara langsung, tanpa parameter generik apapun, dan menggunakan `self: ContractState` dalam fungsi-fungsi kita.

source: Listing 99-5: An expanded form of the IERC20 trait
id: Listing 99-5: Bentuk yang diperluas dari trait IERC20

source: Listing 99-6: A sample contract which uses the Contract Dispatcher
id: Listing 99-6: Sebuah kontrak contoh yang menggunakan Pemanggil Kontrak

source: Listing 99-7: An expanded form of the IERC20 trait
id: Listing 99-7: Sebuah bentuk yang diperluas dari trait IERC20

source: Listing 99-8: A sample contract using the Library Dispatcher
id: Listing 99-8: Sebuah contoh kontrak yang menggunakan Library Dispatcher

source: Listing 99-9: A sample contract using syscalls
id: Listing 99-9: Sebuah contoh kontrak yang menggunakan syscall

source: Then, we create the Account Descriptor:
id: Kemudian, kita membuat Account Descriptor:

source: The Account Descriptor will look like this. You can get the public key and the smart wallet address from the output of the initial `katana` command:
id: Account Descriptor: akan terlihat seperti ini. Anda dapat mendapatkan kunci publik dan alamat dompet pintar dari keluaran perintah awal `katana`:

source: Copy the Account Descriptor above and paste in the newly created `account0_account.json file`, then replace "\<SMART_WALLET_PUBLIC_KEY>", "\<SMART_WALLET_CLASS_HASH>" and "\<SMART_WALLET_ADDRESS>" with values from the `katana` account used.
id: Salin Deskripsi Akun di atas dan tempelkan ke dalam file `account0_account.json` yang baru dibuat, kemudian gantilah "\<SMART_WALLET_PUBLIC_KEY>", "\<SMART_WALLET_CLASS_HASH>" dan "\<SMART_WALLET_ADDRESS>" dengan nilai-nilai dari akun `katana` yang digunakan.

source: **Asymmetric**: sending a message from Ethereum to Starknet (`L1->L2`) is fully automatized by the Starknet sequencer, which means that the message is being automatically delivered to the target contract on L2. However, when sending a message from Starknet to Ethereum (`L2->L1`), only the hash of the message is sent on L1 by the Starknet sequencer. You must then consume the message manually via a transaction on L1.
id: **Asymmetric**: Mengirim pesan dari Ethereum ke Starknet (`L1->L2`) sepenuhnya diotomatisasi oleh sekuen Starknet, yang berarti pesan secara otomatis dikirimkan ke kontrak tujuan di L2. Namun, saat mengirim pesan dari Starknet ke Ethereum (`L2->L1`), hanya hash dari pesan yang dikirimkan di L1 oleh sekuen Starknet. Anda kemudian harus secara manual mengonsumsi pesan tersebut melalui transaksi di L1.

source: The function sends a message with a single felt value to the `StarknetMessaging` contract. Please note that if you want to send more complex data you can. Just be aware that your Cairo contract will only understand `felt252` data type. So you must ensure that the serialization of your data into the `uint256` array follow the cairo serialization scheme.
id: Fungsi tersebut mengirim pesan dengan satu nilai felt ke kontrak `StarknetMessaging`. Harap dicatat bahwa jika Anda ingin mengirim data yang lebih kompleks, Anda dapat melakukannya. Namun, perhatikan bahwa kontrak Cairo Anda hanya akan memahami tipe data `felt252`. Jadi, pastikan bahwa serialisasi data Anda ke dalam larik `uint256` mengikuti skema serialisasi Cairo.
