Repository: cairo-book/cairo-book
Catalog: po/*.po
Languages: es, id, ko, zh_cn

source: Although both Listing 6-5 and 6-7 accomplish the same task, Listing 6-5 is the idiomatic way to bring a function into scope with `use`. Bringing the function’s parent module into scope with `use` means we have to specify the parent module when calling the function. Specifying the parent module when calling the function makes it clear that the function isn’t locally defined while still minimizing repetition of the full path. The code in Listing 6-7 is unclear as to where `add_to_waitlist` is defined.
es: Aunque tanto el Listado 6-5 como el 6-7 realizan la misma tarea, el Listado 6-5 es la forma idiomática de traer una función al ámbito con `use`. Traer el módulo padre de la función al ámbito con `use` significa que tenemos que especificar el módulo padre al llamar a la función. Especificar el módulo padre al al llamar a la función deja claro que la función no está definida localmente a la vez que minimiza la repetición de la ruta completa. El código del Listado 6-7 es no está claro dónde está definido `add_to_waitlist`.

source: On the other hand, when bringing in structs, enums, traits, and other items with `use`, it’s idiomatic to specify the full path. Listing 6-8 shows the idiomatic way to bring the core library’s `ArrayTrait` trait into the scope.
es: Por otro lado, cuando se introducen structs, enums, traits y otros elementos con `use`, es idiomático especificar la ruta completa. El listado 6-8 muestra la forma idiomática de traer el trait `ArrayTrait` de la librería core al ámbito.

source: <span class="caption">Listing 6-8: Bringing `ArrayTrait` into scope in an idiomatic way</span>
es: <span class="caption">Listado 6-8: Introducir `ArrayTrait` en el ámbito de forma forma idiomática</span>

source: There’s another solution to the problem of bringing two types of the same name into the same scope with `use`: after the path, we can specify `as` and a new local name, or _alias_, for the type. Listing 6-9 shows how you can rename an import with `as`:
es: Hay otra solución al problema de meter dos tipos del mismo nombre en el mismo ámbito con `use`: después de la ruta, podemos especificar `as` y un nuevo nombre local, o _alias_, para el tipo. El listado 6-9 muestra cómo puedes renombrar una importación con `as`:

source: <span class="caption">Listing 6-9: Renaming a trait when it’s brought into scope with the `as` keyword</span>
es: <span class="caption">Listado 6-9: Renombrar un trait cuando es traído a scope con la palabra clave `as`</span>

source: <span class="caption">Listing 6-10: Importing multiple items from the same module</span>
es: <span class="caption">Listado 6-10 Importación de varios elementos del mismo módulo</span>

source: <span class="caption">Listing 6-11: Making a name available for any code to use from a new scope with `pub use`</span>
es: <span class="caption">Listado 6-11: Hacer que un nombre esté disponible para que lo use cualquier código desde un nuevo ámbito con `pub use`</span>

source: For example, let’s start from the code in Listing 6-11 that had multiple restaurant modules. We’ll extract modules into files instead of having all the modules defined in the crate root file. In this case, the crate root file is _src/lib.cairo_.
es: Por ejemplo, partamos del código del Listado 6-11 que tenía múltiples módulos de restaurante. Extraeremos los módulos en archivos en lugar de tener todos los módulos definidos en el archivo raíz del crate. En este caso, el archivo raíz es _src/lib.cairo_.

source: First, we’ll extract the `front_of_house` module to its own file. Remove the code inside the curly brackets for the `front_of_house` module, leaving only the `mod front_of_house;` declaration, so that _src/lib.cairo_ contains the code shown in Listing 6-12. Note that this won’t compile until we create the _src/front_of_house.cairo_ file in Listing 6-13.
es: Primero, extraeremos el módulo `front_of_house` a su propio archivo. Elimina el código dentro de las llaves del módulo `front_of_house`, dejando sólo la declaración la declaración `mod front_of_house;`, de forma que _src/lib.cairo_ contenga el código mostrado en el Listado 6-12. Ten en cuenta que esto no compilará hasta que creemos el módulo _src/front_of_house.cairo_ del Listado 6-13.

source: <span class="caption">Listing 6-12: Declaring the `front_of_house` module whose body will be in _src/front_of_house.cairo_</span>
es: <span class="caption">Listado 6-12: Declarando el módulo `front_of_house` cuyo cuerpo estará en _src/front_of_house.cairo_</span>

source: Next, place the code that was in the curly brackets into a new file named _src/front_of_house.cairo_, as shown in Listing 6-13. The compiler knows to look in this file because it came across the module declaration in the crate root with the name `front_of_house`.
es: A continuación, coloque el código que estaba entre llaves en un nuevo archivo llamado _src/front_of_house.cairo_, como se muestra en el Listado 6-13. El compilador sabe que debe buscar en este archivo porque se encontró con la declaración del módulo en la raíz del crate con el nombre `front_of_house`.

source: <span class="caption">Listing 6-13: Definitions inside the `front_of_house` module in _src/front_of_house.cairo_</span>
es: <span class="caption">Listado 6-13: Definiciones dentro del módulo `front_of_house` en _src/front_of_house.cairo_</span>

source: Every programming language has tools for effectively handling the duplication of concepts. In Cairo, one such tool is generics: abstract stand-ins for concrete types or other properties. We can express the behaviour of generics or how they relate to other generics without knowing what will be in their place when compiling and running the code.
es: Cada lenguaje de programación tiene herramientas para manejar eficazmente la duplicación de conceptos. En Cairo, una de esas herramientas son los genéricos: sustitutos abstractos de tipos concretos u otras propiedades. Podemos expresar el comportamiento de los genéricos o cómo se relacionan con otros genéricos sin saber qué habrá en su lugar al compilar y ejecutar el código.

source: Functions, structs, enums and traits can incorporate generic types as part of their definition instead of a concrete types like `u32` or `ContractAddress`.
es: Las funciones, estructuras, enumeraciones y traits pueden incorporar tipos genéricos como parte de su definición en lugar de tipos concretos como `u32` o `ContractAddress`.

source: The new `largest_list` function includes in its definition the requirement that whatever generic type is placed there, it must be droppable. The `main` function remains unchanged, the compiler is smart enough to deduct which concrete type is being used and if it implements the `Drop` trait.
es: La nueva función `largest_list` incluye en su definición el requisito de que cualquier tipo genérico que se coloque allí debe poder eliminarse. La función `main` sigue sin cambios, el compilador es lo suficientemente inteligente como para deducir qué tipo concreto se está utilizando y si implementa el trait `Drop`.

source: When defining generic types, it is useful to have information about them. Knowing which traits a generic type implements allow us to use them more effectively in a functions logic at the cost of constraining the generic types that can be used with the function. We saw an example of this previously by adding the `TDrop` implementation as part of the generic arguments of `largest_list`. While `TDrop` was added to satisfy the compilers requirements, we can also add constraints to benefit our function logic.
es: Al definir tipos genéricos, es útil tener información sobre ellos. Saber qué traits implementa un tipo genérico nos permite usarlos de manera más efectiva en la lógica de una función a costa de limitar los tipos genéricos que se pueden usar con la función. Vimos un ejemplo de esto anteriormente al agregar la implementación de `TDrop` como parte de los argumentos genéricos de `largest_list`. Si bien `TDrop` se agregó para cumplir con los requisitos del compilador, también podemos agregar restricciones para beneficiar nuestra lógica de función.

source: Imagine that we want, given a list of elements of some generic type `T`, find the smallest element among them. Initially, we know that for an element of type `T` to be comparable, it must implement the `PartialOrd` trait. The resulting function would be:
es: Imaginemos que queremos, dado una lista de elementos de algún tipo genérico `T`, encontrar el elemento más pequeño entre ellos. Inicialmente, sabemos que para que un elemento de tipo `T` sea comparable, debe implementar el trait `PartialOrd`. La función resultante sería:

source: In the example above, `self` is a special parameter. When a parameter with name `self` is used, the implemented functions are also [attached to the instances of the type as methods](ch04-03-method-syntax.md#defining-methods). Here's an illustration,
es: En el ejemplo anterior, `self` es un parámetro especial. Cuando se usa un parámetro con el nombre `self`, las funciones implementadas también [se adjuntan a las instancias del tipo como métodos](ch04-03-method-syntax.md#defining-methods). Aquí hay una ilustración,

source: If the code was organised into modules like this,
es: Si el código estuviera organizado en módulos de esta manera,

source: you might also need to use `CircleGeometry`,
es: para hacerlo funcionar, también tendrías que usar `CircleGeometry`,

source: At its simplest, a test in Cairo is a function that’s annotated with the `test` attribute. Attributes are metadata about pieces of Cairo code; one example is the derive attribute we used with structs in Chapter 4. To change a function into a test function, add `#[test]` on the line before `fn`. When you run your tests with the `cairo-test` command, Cairo builds a test runner binary that runs the annotated functions and reports on whether each test function passes or fails.
es: En su forma más simple, una prueba en Cairo es una función que está anotada con el atributo `test`. Los atributos son metadatos sobre piezas de código en Cairo; un ejemplo es el atributo `derive` que usamos con estructuras en el capítulo 4. Para convertir una función en una función de prueba, agrega `#[test]` en la línea antes de `fn`. Cuando se ejecutan las pruebas con el comando `cairo-test`, Cairo construye un binario de ejecución de pruebas que ejecuta las funciones anotadas y reporta si cada función de prueba pasa o falla.

source: > Note: You will notice here a `cairo_project.toml` file. > This is the configuration file for "vanilla" Cairo projects (i.e. not managed by Scarb), > which is required to run the `scarb cairo-test` command to run the code of the crate. > It is required until Scarb implements this feature. The content of the file is: > > ```toml > [crate_roots] > adder = "src" > ``` > > and indicates that the crate named "adder" is located in the `src` directory.
es: > Nota: Aquí notarás un archivo `cairo_project.toml`. > Este es el archivo de configuración para proyectos Cairo "vanilla" (es decir, no administrados por Scarb), > que se requiere para ejecutar el comando `scarb cairo-test` para ejecutar el código del crate. > Es necesario hasta que Scarb implemente esta característica. El contenido del archivo es: > > ```toml > [crate_roots] > adder = "src" > ``` > > e indica que el crate llamado "adder" se encuentra en el directorio `src`.

source: In _lib.cairo_, let's add a first test, as shown in Listing 8-1.
es: En _lib.cairo_, agreguemos una primera prueba, como se muestra en el Listado 8-1.

source: <span class="caption">Listing 8-1: A test module and function</span>
es: <span class="caption">Listing 8-1: Un módulo de test y función</span>

source: The `scarb cairo-test` command runs all tests in our project, as shown in Listing 8-2.
es: El comando `scarb cairo-test` ejecuta todas las pruebas en nuestro proyecto, como se muestra en el Listado 8-2.

source: <span class="caption">Listing 8-2: The output from running a test</span>
es: <span class="caption">Listado 8-2: El resultado de ejecutar una prueba</span>

source: `cairo-test` compiled and ran the test. We see the line `running 1 tests`. The next line shows the name of the generated test function, called `it_works`, and that the result of running that test is `ok`. The overall summary `test result: ok.` means that all the tests passed, and the portion that reads `1 passed; 0 failed` totals the number of tests that passed or failed.
es: `cairo-test` compiló y ejecutó la prueba. Vemos la línea `running 1 tests`. La siguiente línea muestra el nombre de la función de prueba generada, llamada `it_works`, y que el resultado de ejecutar esa prueba es `ok`. El resumen general `test result: ok.` significa que todas las pruebas pasaron, y la porción que lee `1 passed; 0 failed` totaliza el número de pruebas que pasaron o fallaron.

source: It’s possible to mark a test as ignored so it doesn’t run in a particular instance; we’ll cover that in the [Ignoring Some Tests Unless Specifically Requested](#ignoring-some-tests-unless-specifically-requested) section later in this chapter. Because we haven’t done that here, the summary shows `0 ignored`. We can also pass an argument to the `cairo-test` command to run only a test whose name matches a string; this is called filtering and we’ll cover that in the [Running Single Tests](#running-single-tests) section. We also haven’t filtered the tests being run, so the end of the summary shows `0 filtered out`.
es: Es posible marcar una prueba como ignorada para que no se ejecute en una instancia particular; cubriremos eso en la sección [Ignorando algunas pruebas a menos que se soliciten específicamente](#ignoring-some-tests-unless-specifically-requested) más adelante en este capítulo. Debido a que no hemos hecho eso aquí, el resumen muestra `0 ignoradas`. También podemos pasar un argumento al comando `cairo-test` para ejecutar solo una prueba cuyo nombre coincida con una cadena; esto se llama filtrado y lo cubriremos en la sección [Ejecución de pruebas individuales](#running-single-tests). Tampoco hemos filtrado las pruebas que se ejecutan, por lo que el final del resumen muestra `0 filtradas`.

source: Then run `cairo-test -- --path src` again. The output now shows `exploration` instead of `it_works`:
es: A continuación, ejecute `cairo-test -- --path src` de nuevo. La salida muestra ahora `exploration` en lugar de `it_works`:

source: Now we’ll add another test, but this time we’ll make a test that fails! Tests fail when something in the test function panics. Each test is run in a new thread, and when the main thread sees that a test thread has died, the test is marked as failed. Enter the new test as a function named `another`, so your _src/lib.cairo_ file looks like Listing 8-3.
es: Ahora agregaremos otra prueba, ¡pero esta vez haremos una prueba que falla! Las pruebas fallan cuando algo en la función de prueba causa un pánico. Cada prueba se ejecuta en un hilo nuevo y cuando el hilo principal ve que un hilo de prueba ha muerto, la prueba se marca como fallida. Agregue la nueva prueba como una función llamada `another`, de modo que su archivo _src/lib.cairo_ se vea como en el Listado 8-3.

source: <span class="caption">Listing 8-3: Adding a second test that will fail</span>
es: <span class="caption">Lista 8-3: Agregando una segunda prueba que fallará</span>

source: <span class="caption">Listing 8-4: Test results when one test passes and one test fails</span>
es: <span class="caption">Listing 8-4: Resultados de las pruebas cuando una pasa y otra falla</span>

source: In [Chapter 4, Listing 5-15](ch04-03-method-syntax.md#multiple-impl-blocks), we used a `Rectangle` struct and a `can_hold` method, which are repeated here in Listing 8-5. Let’s put this code in the _src/lib.cairo_ file, then write some tests for it using the `assert` function.
es: En [Capítulo 4, Lista 5-15](ch04-03-method-syntax.md#multiple-impl-blocks), usamos una estructura `Rectangle` y un método `can_hold`, que se repiten aquí en la Lista 8-5. Colocaremos este código en el archivo _src/lib.cairo_, luego escribiremos algunas pruebas para él usando la función `assert`.

source: <span class="caption">Listing 8-5: Using the `Rectangle` struct and its `can_hold` method from Chapter 5</span>
es: <span class="caption">Lista 8-5: Uso de la estructura `Rectangle` y su método `can_hold` del Capítulo 5</span>

source: The `can_hold` method returns a `bool`, which means it’s a perfect use case for the assert function. In Listing 8-6, we write a test that exercises the `can_hold` method by creating a `Rectangle` instance that has a width of `8` and a height of `7` and asserting that it can hold another `Rectangle` instance that has a width of `5` and a height of `1`.
es: El método `can_hold` devuelve un `bool`, lo que significa que es un caso de uso perfecto para la función assert. En el Listado 8-6, escribimos una prueba que ejercita el método `can_hold` creando una instancia de `Rectangle` que tiene una anchura de `8` y una altura de `7` y afirmando que puede contener otra instancia de `Rectangle` que tiene una anchura de `5` y una altura de `1`.

source: <span class="caption">Listing 8-6: A test for `can_hold` that checks whether a larger rectangle can indeed hold a smaller rectangle</span>
es: <span class="caption">Lista 8-6: Un test para `can_hold` que verifica si un rectángulo más grande realmente puede contener un rectángulo más pequeño</span>

source: ## Checking for Panics with `should_panic`
es: ## Comprobando los pánicos con `should_panic`

source: In addition to checking return values, it’s important to check that our code handles error conditions as we expect. For example, consider the Guess type in Listing 8-8. Other code that uses `Guess` depends on the guarantee that `Guess` instances will contain only values between `1` and `100`. We can write a test that ensures that attempting to create a `Guess` instance with a value outside that range panics.
es: Además de comprobar los valores de retorno, es importante comprobar que nuestro código maneja las condiciones de error como esperamos. Por ejemplo, considere el tipo Adivinar del Listado 8-8. Otro código que utiliza `Guess` depende de la garantía de que las instancias de `Guess` contendrán sólo valores entre `1` y `100`. Podemos escribir una prueba que asegure que al intentar crear una instancia de `Guess` con un valor fuera de ese rango se produzca un pánico.

source: Listing 8-8 shows a test that checks that the error conditions of `GuessTrait::new` happen when we expect them to.
es: El Listing 8-8 muestra una prueba que verifica que las condiciones de error de `GuessTrait::new` ocurren cuando esperamos que sucedan.

source: <span class="caption">Listing 8-8: Testing that a condition will cause a panic</span>
es: <span class="caption">Listing 8-8: Probando que una condición causará un pánico</span>

source: When we run the test in Listing 8-8, it will fail:
es: Cuando ejecutamos la prueba en el Listado 8-8, fallará:

source: Tests that use `should_panic` can be imprecise. A `should_panic` test would pass even if the test panics for a different reason from the one we were expecting. To make `should_panic` tests more precise, we can add an optional expected parameter to the `should_panic` attribute. The test harness will make sure that the failure message contains the provided text. For example, consider the modified code for `Guess` in Listing 8-9 where the new function panics with different messages depending on whether the value is too small or too large.
es: Las pruebas que usan `should_panic` pueden ser imprecisas. Una prueba con `should_panic` pasaría incluso si la prueba produce un pánico por una razón diferente a la que esperábamos. Para hacer que las pruebas con `should_panic` sean más precisas, podemos agregar un parámetro opcional `expected` al atributo `should_panic`. El sistema de pruebas se asegurará de que el mensaje de error contenga el texto proporcionado. Por ejemplo, considere el código modificado para `Guess` en el Listado 8-9, donde la nueva función genera un pánico con mensajes diferentes dependiendo de si el valor es demasiado pequeño o demasiado grande.

source: <span class="caption">Listing 8-9: Testing for a panic with a panic message containing the error message string</span>
es: <span class="caption">Listado 8-9: Prueba para una excepción con un mensaje de excepción que contiene la cadena del mensaje de error</span>

source: Sometimes, running a full test suite can take a long time. If you’re working on code in a particular area, you might want to run only the tests pertaining to that code. You can choose which tests to run by passing `cairo-test` the name of the test you want to run as an argument.
es: A veces, ejecutar un conjunto completo de pruebas puede llevar mucho tiempo. Si está trabajando en código en un área particular, es posible que desee ejecutar solo las pruebas relacionadas con ese código. Puede elegir qué pruebas ejecutar pasando el nombre de la prueba que desea ejecutar como argumento a `cairo-test`.

source: To demonstrate how to run a single test, we’ll first create two tests functions, as shown in Listing 8-10, and choose which ones to run.
es: Para demostrar cómo ejecutar una sola prueba, primero crearemos dos funciones de prueba, como se muestra en el Listado 8-10, y elegiremos cuáles ejecutar.

source: <span class="caption">Listing 8-10: Two tests with two different names</span>
es: <span class="caption">Listado 8-10: Dos pruebas con dos nombres diferentes</span>

source: Sometimes a few specific tests can be very time-consuming to execute, so you might want to exclude them during most runs of `cairo-test`. Rather than listing as arguments all tests you do want to run, you can instead annotate the time-consuming tests using the `ignore` attribute to exclude them, as shown here:
es: A veces, algunas pruebas específicas pueden ser muy lentas de ejecutar, por lo que es posible que desee excluirlos durante la mayoría de las ejecuciones de `cairo-test`. En lugar de enumerar como argumentos todas las pruebas que desea ejecutar, puede anotar las pruebas que consumen mucho tiempo utilizando el atributo `ignore` para excluirlos, como se muestra aquí:

source: When you’re at a point where it makes sense to check the results of the ignored tests and you have time to wait for the results, you can run `cairo-test --include-ignored` to run all tests whether they’re ignored or not.
es: Cuando esté en un punto en el que tenga sentido verificar los resultados de las pruebas ignoradas y tenga tiempo para esperar los resultados, puede ejecutar `cairo-test --include-ignored` para ejecutar todas las pruebas, ya sea que estén ignoradas o no.

source: We'll think about tests in terms of two main categories: unit tests and integration tests. Unit tests are small and more focused, testing one module in isolation at a time, and can test private functions. Integration tests use your code in the same way any other external code would, using only the public interface and potentially exercising multiple modules per test.
es: Pensaremos en las pruebas en términos de dos categorías principales: pruebas unitarias y pruebas de integración. Las pruebas unitarias son pequeñas y más enfocadas, probando un módulo a la vez en aislamiento, y pueden probar funciones privadas. Las pruebas de integración utilizan su código de la misma manera que cualquier otro código externo, utilizando solo la interfaz pública y potencialmente ejercitando varios módulos por prueba.
