Repository: cairo-book/cairo-book
Catalog: po/*.po
Languages: es, id, ko, zh_cn

source: The example function body uses the `assert` function, which contains the result of adding 2 and 2, equals 4. This assertion serves as an example of the format for a typical test. Let’s run it to see that this test passes.
es: El cuerpo de la función de ejemplo utiliza la función `assert`, que comprueba que el resultado de sumar 2 y 2 es igual a 4. Esta afirmación sirve como ejemplo del formato de una prueba típica. Ejecutémoslo para ver que esta prueba pasa.
id: Tubuh fungsi contoh menggunakan fungsi `assert`, yang berisi hasil penambahan 2 dan 2, sama dengan 4. Pernyataan ini berfungsi sebagai contoh format untuk pengujian biasa. Mari jalankan untuk melihat bahwa pengujian ini berhasil.
zh_cn: 这个例子的函数体使用了`assert`函数，它包含了2和2相加的结果，等于4。这个断言是一个典型测试格式范例。让我们运行它，看看这个测试是否通过。

source: <span class="caption">Listing 9-2: The output from running a test</span>
zh_cn: <span class="caption">示例9-2：运行测试后的输出</span>

source: <span class="caption">Listing 9-3: Adding a second test that will fail</span>
zh_cn: <span class=“caption”>示例9-3：添加第二个测试（会失败的测试）</span>

source: <span class="caption">Listing 9-4: Test results when one test passes and one test fails</span>
zh_cn: <span class=“caption”>示例9-4：一个测试通过，一个测试失败时的测试结果</span>

source: ## Checking Results with the assert function
es: ## Verificar Resultados con la función assert
zh_cn: ## 用断言函数检查结果

source: The `assert` function, provided by Cairo, is useful when you want to ensure that some condition in a test evaluates to `true`. We give the `assert` function a first argument that evaluates to a Boolean. If the value is `true`, nothing happens and the test passes. If the value is `false`, the assert function calls `panic()` to cause the test to fail with a message we defined as the second argument of the `assert` function. Using the `assert` function helps us check that our code is functioning in the way we intend.
es: La función `assert`, proporcionada por Cairo, es útil cuando desea asegurarse de que alguna condición en una prueba se evalúe como verdadera. Le damos a la función `assert` un primer argumento que se evalúa como un valor booleano. Si el valor es `true`, no sucede nada y la prueba pasa. Si el valor es `false`, la función `assert` llama a `panic()` para hacer que la prueba falle con un mensaje que definimos como segundo argumento de la función `assert`. Usar la función `assert` nos ayuda a verificar que nuestro código funciona de la manera que pretendemos.
id: Fungsi `assert`, yang disediakan oleh Cairo, berguna ketika Anda ingin memastikan bahwa kondisi tertentu dalam tes dievaluasi sebagai `true`. Kami memberikan fungsi `assert` argumen pertama yang dievaluasi sebagai Boolean. Jika nilai tersebut adalah `true`, tidak ada yang terjadi dan tes berhasil. Jika nilai tersebut adalah `false`, fungsi assert memanggil `panic()` untuk menyebabkan tes gagal dengan pesan yang kita tentukan sebagai argumen kedua dari fungsi `assert`. Menggunakan fungsi `assert` membantu kami memeriksa bahwa kode kita berfungsi sesuai yang kami inginkan.
zh_cn: Cairo提供的`assert`函数，在你想确保测试中的某些条件一定为`true`时非常有用。我们给`assert`函数的第一个参数是一个布尔值。如果该值为`true`，则不会发生任何事情，测试通过。如果值是 `false`，assert函数调用 `panic()`，导致测试失败，我们定义的信息是 `assert`函数的第二个参数。使用`assert`函数可以帮助我们检查我们的代码是否按照我们的意图运行。

source: In [Chapter 5, Listing 5-15](ch05-03-method-syntax.md#multiple-impl-blocks), we used a `Rectangle` struct and a `can_hold` method, which are repeated here in Listing 9-5. Let’s put this code in the _src/lib.cairo_ file, then write some tests for it using the `assert` function.
id: Pada [Bab 5, Listing 5-15](ch05-03-method-syntax.md#multiple-impl-blocks), kita menggunakan struktur `Rectangle` dan metode `can_hold`, yang diulang di sini pada Listing 9-5. Mari letakkan kode ini dalam file _src/lib.cairo_, lalu tulis beberapa tes untuknya menggunakan fungsi `assert`.
zh_cn: 在[第5章，示例5-15](ch05-03-method-syntax.md#multiple-impl-blocks)中，我们使用了一个`Rectangle`结构和一个`can_hold`方法，在示例9-5中重复了这些。让我们把这段代码放在_src/lib.cairo_文件中，然后用`assert`函数为它写一些测试。

source: <span class="caption">Listing 9-5: Using the `Rectangle` struct and its `can_hold` method from Chapter 5</span>
zh_cn: <span class=“caption”>示例9-5：使用第五章中的 `Rectangle`结构及其`can_hold`方法</span>

source: The `can_hold` method returns a `bool`, which means it’s a perfect use case for the assert function. In Listing 9-6, we write a test that exercises the `can_hold` method by creating a `Rectangle` instance that has a width of `8` and a height of `7` and asserting that it can hold another `Rectangle` instance that has a width of `5` and a height of `1`.
id: Metode `can_hold` mengembalikan `bool`, yang berarti ini adalah penggunaan yang sempurna untuk fungsi assert. Pada Listing 9-6, kita menulis tes yang menggunakan metode `can_hold` dengan membuat instans `Rectangle` yang memiliki lebar `8` dan tinggi `7`, serta mengasertakan bahwa itu dapat menahan instans `Rectangle` lain yang memiliki lebar `5` dan tinggi `1`.
zh_cn: 返回值为`bool`的`can_hold`方法是assert函数的一个完美用例。在示例9-6中，我们写了一个测试，通过创建一个宽度为`8`、高度为`7`的`Rectangle`实例，并断言它可以容纳另一个宽度为`5`、高度为`1`的`Rectangle`实例，来测试`can_hold`方法。

source: <span class="caption">Listing 9-6: A test for `can_hold` that checks whether a larger rectangle can indeed hold a smaller rectangle</span>
zh_cn: <span class=“caption”>示例 9-6: `can_hold`的测试，检查一个较大的矩形是否真的可以容纳一个较小的矩形</span>

source: We’ve named our test `larger_can_hold_smaller`, and we’ve created the two `Rectangle` instances that we need. Then we called the assert function and passed it the result of calling `larger.can_hold(@smaller)`. This expression is supposed to return `true`, so our test should pass. Let’s find out!
es: Hemos nombrado nuestro test `larger_can_hold_smaller`, y hemos creado los dos instancias de `Rectangle` que necesitamos. Luego llamamos a la función assert y le pasamos el resultado de llamar a `larger.can_hold(@smaller)`. Esta expresión se supone que devuelve `true`, por lo que nuestra prueba debería pasar. ¡Descubramoslo!
id: Kami memberi nama tes kami `larger_can_hold_smaller`, dan kami telah membuat dua instans `Rectangle` yang kita perlukan. Kemudian, kami memanggil fungsi assert dan meneruskannya dengan hasil pemanggilan `larger.can_hold(@smaller)`. Ekspresi ini seharusnya mengembalikan `true`, jadi tes kami seharusnya berhasil. Mari kita lihat!
zh_cn: 我们将我们的测试命名为`larger_can_hold_smaller`，并且创建了我们需要的两个`Rectangle`实例。然后我们调用了assert函数，并将调用`larger.can_hold(@smaller)`的结果传给它。这个表达式应该返回 `true`，所以我们的测试应该通过。让我们拭目以待吧!

source: Because the correct result of the `can_hold` function in this case is `false`, we need to negate that result before we pass it to the assert function. As a result, our test will pass if `can_hold` returns false:
es: Como el resultado correcto de la función `can_hold` en este caso es `false`, debemos negar ese resultado antes de pasarlo a la función `assert`. Como resultado, nuestro test pasará si `can_hold` devuelve false:
id: Karena hasil yang benar dari fungsi `can_hold` dalam kasus ini adalah `false`, kita perlu menegasi hasil tersebut sebelum kita meneruskannya ke fungsi assert. Sebagai hasilnya, tes kita akan berhasil jika `can_hold` mengembalikan false:
zh_cn: 因为在这种情况下，`can_hold`函数的正确结果是`false`，我们需要在传递给assert函数之前否定这个结果。因此，如果`can_hold`返回false，我们的测试将通过：

source: ## Checking for panics with `should_panic`
zh_cn: ## 用`should_panic`检查panic情况

source: <span class="caption">Listing 9-8: Testing that a condition will cause a panic</span>
zh_cn: <span class=“caption”>示例9-8：测试一个条件是否会导致panic</span>

source: <span class="caption">Listing 9-9: Testing for a panic with a panic message containing the error message string</span>
zh_cn: <span class=“caption”>示例9-9：用包含错误信息字符串的恐慌信息来测试panic</span>

source: ## Running Single Tests
es: ## Ejecución de Pruebas Individuales
zh_cn: ## 运行单一测试

source: To demonstrate how to run a single test, we’ll first create two tests functions, as shown in Listing 9-10, and choose which ones to run.
id: Untuk menunjukkan bagaimana menjalankan satu tes saja, pertama-tama kita akan membuat dua fungsi tes, seperti yang ditunjukkan pada Listing 9-10, dan memilih mana yang akan dijalankan.
zh_cn: 为了演示如何运行一个测试，我们将首先创建两个测试函数，如示例9-10所示，并选择运行哪一个。

source: <span class="caption">Listing 9-10: Two tests with two different names</span>
zh_cn: <span class=“caption”>示例9-10：两个不同名称的测试</span>

source: ## Ignoring Some Tests Unless Specifically Requested
es: ## Ignorar Algunos Test a menos que se Soliciten Específicamente
zh_cn: ## 在非特别指定时，忽略一些测试

source: ## Testing recursive functions or loops
zh_cn: ## 测试递归函数或循环

source: When testing recursive functions or loops, you must provide the test with a maximum amount of gas that it can consume. This prevents running infinite loops or consuming too much gas, and can help you benchmark the efficiency of your implementations. To do so, you must add the `#[available_gas(<Number>)]` attribute on the test function. The following example shows how to use it:
id: Saat menguji fungsi rekursif atau perulangan, Anda harus memberikan jumlah gas maksimum yang dapat dikonsumsi oleh uji coba. Hal ini mencegah terjadinya perulangan tak terbatas atau penggunaan gas yang berlebihan, dan dapat membantu Anda dalam mengukur efisiensi implementasi Anda. Untuk melakukannya, Anda harus menambahkan atribut `#[available_gas(<Angka>)]` pada fungsi uji coba. Berikut adalah contoh penggunaannya:
zh_cn: 在测试递归函数或循环时，必须为测试提供可消耗的最大gas。这样可以防止运行无限循环或消耗过多gas，还可以帮助对您的代码实现效率进行基准测试。为此，必须在测试函数中添加 `#[available_gas(<Number>)]` 属性。下面的示例展示了如何使用该属性：

source: ## Benchmarking the gas usage of a specific operation
zh_cn: ## 测定特定操作的gas使用量

source: # Testing Organization
es: # Organización de Test
zh_cn: # 测试的组织结构

source: ## Unit Tests
es: ## Test Unitarios
zh_cn: ## 单元测试

source: ### The Tests Module and `#[cfg(test)]`
es: ### El Módulo de Test y `#[cfg(test)]`
zh_cn: ### 测试模块和`#[cfg(test)]`

source: <span class="caption">Filename: src/lib.cairo</span>
zh_cn: <span class="caption">文件名: src/lib.cairo</span>

source: ## Integration Tests
es: ## Test de Integración
zh_cn: ## 集成测试

source: ### The `tests` Directory
es: ### Directorio `tests`
zh_cn: ### `tests`目录

source: <span class="caption">Filename: src/tests.cairo</span>
zh_cn: <span class="caption">文件名：src/tests.cairo</span>

source: Enter the code in Listing 9-11 into the _src/tests/integration_test.cairo_ file:
zh_cn: 将示例9-11中的代码输入到 _src/tests/integration_test.cairo_ 文件：

source: <span class="caption">Filename: src/tests/integration_test.cairo</span>
zh_cn: <span class="caption">文件名：src/tests/integration_test.cairo</span>

source: # Error handling
es: # Gestión de errores
zh_cn: # 错误处理

source: # Unrecoverable Errors with panic
es: # Errores Irrecuperables con pánico
zh_cn: # 无法恢复的错误与恐慌（panic）

source: ## nopanic notation
es: ## notación nopanic
zh_cn: ## nopanic记号

source: ## panic_with attribute
zh_cn: ## panic_with 属性

source: ## Using assert
es: ## Usando assert
zh_cn: ## 使用断言(assert)

source: The assert function from the Cairo core library is actually a utility function based on panics. It asserts that a boolean expression is true at runtime, and if it is not, it calls the panic function with an error value. The assert function takes two arguments: the boolean expression to verify, and the error value. The error value is specified as a felt252, so any string passed must be able to fit inside a felt252.
es: La función assert de la librería del núcleo de Cairo es en realidad una función de utilidad basada en panics. Afirma que una expresión booleana es verdadera en tiempo de ejecución, y si no lo es, llama a la función panic con un valor de error. La función assert toma dos argumentos: la expresión booleana a verificar y el valor de error. El valor de error se especifica como un felt252, por lo que cualquier cadena que se pase debe caber dentro de un felt252.
id: Fungsi assert dari pustaka inti Cairo sebenarnya adalah fungsi utilitas berbasis panic. Ini menegaskan bahwa sebuah ekspresi boolean benar saat runtime, dan jika tidak, itu memanggil fungsi panic dengan nilai kesalahan. Fungsi assert mengambil dua argumen: ekspresi boolean yang akan diverifikasi, dan nilai kesalahan. Nilai kesalahan ditentukan sebagai felt252, jadi setiap string yang dilewatkan harus mampu masuk ke dalam felt252.
zh_cn: Cairo核心库中的assert函数实际上是一个基于panic的实用函数。它断言一个布尔表达式在运行时是真的，如果不是，它就会调用带有错误值的panic函数。assert函数需要两个参数：要验证的布尔表达式，以及错误值。错误值被指定为felt252，所以任何传递的字符串都必须能够容纳在felt252中。

source: Here is an example of its usage:
es: He aquí un ejemplo de su uso:
id: Berikut adalah contoh penggunaannya:
zh_cn: 下面是它的一个使用例子：

source: We are asserting in main that `my_number` is not zero to ensure that we're not performing a division by 0. In this example, `my_number` is zero so the assertion will fail, and the program will panic with the string 'number is zero' (as a felt252) and the division will not be reached.
es: Estamos afirmando en main que `mi_número` no es cero para asegurarnos de que no estamos realizando una división por 0. En este ejemplo, `my_number` es cero por lo que la afirmación fallará, y el programa entrará en pánico con la cadena 'number is zero' (como felt252) y no se realizará la división.
zh_cn: 我们在`main`中断言`my_number`不是0，以确保我们没有进行除以0的操作。 在这个例子中，`my_number`是零，所以断言会失败，程序会panic， 并给出 'number is zero'的字符串结果（以felt252的形式），除法将不会被执行。

source: # Recoverable Errors with `Result`
es: # Errores Recuperables con `Result`
zh_cn: # 可恢复的错误与 `Result`

source: ## The `Result` enum
es: ## El enum `Result`
zh_cn: ## `Result`枚举

source: ## The `ResultTrait`
es: ## El `ResultTrait`
zh_cn: ## `ResultTrait`

source: A careful reader may have noticed the `<impl TDrop: Drop<T>>` and `<impl EDrop: Drop<E>>` in the first four methods signatures. This syntax represents generic type constraints in the Cairo language. These constraints indicate that the associated functions require an implementation of the `Drop` trait for the generic types `T` and `E`, respectively.
es: Un lector atento puede haber notado el `<impl TDrop: Drop<T>>` y `<impl EDrop: Drop<E>>` en las firmas de los cuatro primeros métodos. Esta sintaxis representa restricciones de tipo genérico en el lenguaje Cairo. Estas restricciones indican que las funciones asociadas requieren una implementación del rasgo `Drop` para los tipos genéricos `T` y `E`, respectivamente.
id: Seorang pembaca yang teliti mungkin telah memperhatikan `<impl TDrop: Drop<T>>` dan `<impl EDrop: Drop<E>>` dalam tanda tangan metode-metode pertama. sintaks ini merupakan representasi dari batasan tipe generik dalam bahasa Cairo. Batasan-batasan ini menunjukkan bahwa fungsi-fungsi terkait memerlukan implementasi dari trait `Drop` untuk tipe-tipe generik `T` dan `E`, secara berturut-turut.
zh_cn: 细心的读者可能已经注意到前四个方法签名中的`<impl TDrop: Drop<T>>` and `<impl EDrop: Drop<E>>`。这种语法代表了Cairo语言中的通用类型约束。这些约束表示相关的函数需要分别对通用类型`T`和`E`的`Drop`特性进行实现。

source: `is_err` takes a reference to a `Result<T, E>` value and returns `true` if the `Result` is the `Err` variant, meaning the operation encountered an error. If the `Result` is the `Ok` variant, it returns `false`.
es: `is_err` toma una referencia a un valor `Result<T, E>` y devuelve `true` si el `Result` es la variante `Err`, lo que significa que la operación ha encontrado un error. Si el `Resultado` es la variante `Ok`, devuelve `false`.
id: `is_err` mengambil referensi dari nilai `Result<T, E>` dan mengembalikan `true` jika `Result` merupakan varian `Err`, yang berarti operasi mengalami kesalahan. Jika `Result` merupakan varian `Ok`, maka mengembalikan `false`.
zh_cn: `is_err`接收一个对`Result<T, E>`值的引用，如果`Result`是`Err`成员，意味着操作遇到了错误，则返回`true`。如果 `Result`是 `Ok`成员，则返回 `false`。

source: Let's take another example demonstrating the use of `unwrap`. First we import the necessary modules:
es: Veamos otro ejemplo que demuestra el uso de `unwrap`. Primero importamos los módulos necesarios:
zh_cn: 让我们再举一个例子，演示一下`unwrap`的使用。 首先我们导入必要的模块：

source: <span class="caption">Listing 10-1: Using the Result type</span>
zh_cn: <span class=“caption”>示例10-1：使用Result 类型</span>

source: > We could have also used the #[should_panic] attribute here.
es: > También podríamos haber utilizado aquí el atributo #[should_panic].
zh_cn: > 我们也可以在这里使用 #[should_panic] 属性。

source: ### The `?` operator ?
es: ### ¿El operador `?`?
zh_cn: ### `?`运算符?

source: - If the value is `Result::Ok(x)` or `Option::Some(x)`, it will return the inner value `x` directly. - If the value is `Result::Err(e)` or `Option::None`, it will propagate the error or `None` by immediately returning from the function.
es: - Si el valor es `Result::Ok(x)` u `Opción::Some(x)`, devolverá el valor interno `x` directamente. - Si el valor es `Result::Err(e)` u `Option::None`, propagará el error o `None` retornando inmediatamente de la función.
zh_cn: - 如果值是`Result::Ok(x)`或`Option::Some(x)`，它将直接返回内部值`x`。 - 如果值是`Result::Err(e)`或`Option::None`，它将通过立即从函数返回来传播错误或`None`。

source: <span class="caption">Listing 10-1: Using the `?` operator</span>
zh_cn: <span class=“caption”>示例 10-1: 使用 `?` 操作符</span>

source: ### Summary
es: ### Resumen
zh_cn: ### 总结

source: # Advanced Features
es: # Funciones Avanzadas
zh_cn: # 高级特性

source: # Operator Overloading
es: # Sobrecarga de Operadores
zh_cn: # 操作符重载

source: In Cairo, operator overloading is achieved through the implementation of specific traits. Each operator has an associated trait, and overloading that operator involves providing an implementation of that trait for a custom type. However, it's essential to use operator overloading judiciously. Misuse can lead to confusion, making the code more difficult to maintain, for example when there is no semantic meaning to the operator being overloaded.
es: En Cairo, la sobrecarga de operadores se consigue mediante la implementación de rasgos específicos. Cada operador tiene un rasgo asociado, y sobrecargar ese operador implica proporcionar una implementación de ese rasgo para un tipo personalizado. Sin embargo, es esencial utilizar la sobrecarga de operadores con criterio. Un mal uso puede llevar a confusión, haciendo el código más difícil de mantener, por ejemplo cuando no hay un significado semántico para el operador que se sobrecarga.
zh_cn: 在Cairo中，操作符重载是通过实现特定的trait来实现的。每个操作符都有一个相关的traits，操作符重载涉及到需为一个自定义类型提供该trait的实现。 然而，明智地使用操作符重载是非常重要的。误用会导致混乱，使代码更难维护，比如当被重载的操作符的语义与操作符原有的语义毫不相干的时候。

source: # Macros
zh_cn: # 宏

source: The Cairo language has some plugins that allows developers to simplify their code. They are called `inline_macros` and are a way of writing code that generates other code. In Cairo, there are only two `macros`: `array![]` and `consteval_int!()`.
id: Bahasa Cairo memiliki beberapa plugin yang memungkinkan pengembang menyederhanakan kode mereka. Mereka disebut `inline_macros` dan merupakan cara penulisan kode yang menghasilkan kode lain. Di Cairo, hanya ada dua `macros`: `array![]` dan `consteval_int!()`.
zh_cn: Cairo语言有一些插件可以让开发人员简化代码。它们被称为 `内联宏`（inline_macros），是一种可以生成其他代码的代码编写方式。在Cairo语言中，只有两个 `宏`："array![]"和 "consteval_int!()"。

source: ### Let's start by `array!`
zh_cn: ### 让我们从 `array!` 宏开始

source: Sometimes, we need to create arrays with values that are already known at compile time. The basic way of doing that is redundant. You would first declare the array and then append each value one by one. `array!` is a simpler way of doing this task by combining the two steps. At compile-time, the compiler will create an array and append all values passed to the `array!` macro sequentially.
zh_cn: 有时候，我们需要用在编译时已经知道的值来创建数组。这件事的基本做法是很不优雅且多余的。你需要首先声明数组，然后逐一为数组追加每个值。`array!` 是一种更简单的方法，它将这两个步骤合并在一起。 在编译时，编译器将创建一个数组，并按顺序追加传递给 `array!` 宏的所有值。

source: # Hashes
zh_cn: # 哈希

source: In this chapter, we will present the two hash functions implemented in natively in the Cairo library : `Poseidon` and `Pedersen`. We will discuss about when and how to use them, and see examples with cairo programs.
zh_cn: 本章，我们将介绍 Cairo 库中原生实现的两种哈希函数：Poseidon 和 Pedersen。我们将讨论何时以及如何使用它们，并通过 Cairo 程序展示示例。

source: ### Hash functions in Cairo
zh_cn: ### Cairo中的哈希函数

source: Poseidon is a family of hash functions designed for being very efficient as algebraic circuits. Its design is particularly efficient for Zero-Knowledge proof systems, including STARKs (so, Cairo). Poseidon uses a method called a 'sponge construction,' which soaks up data and transforms it securely using a process known as the Hades permutation. Cairo's version of Poseidon is based on a three element state permutation with [specific parameters](https://github.com/starkware-industries/poseidon/blob/main/poseidon3.txt)
zh_cn: Poseidon 是一系列哈希函数，作为代数电路非常高效。它的设计特别适用于零知识证明系统，包括 STARKs (所以也适用于 Cairo)。Poseidon 使用一种称为“sponge construction”的方法，该方法吸收数据并使用称为 Hades 置换的过程安全地转换数据。Cairo 版本的 Poseidon 基于具有三元素状态置换和 [特定参数](https://github.com/starkware-industries/poseidon/blob/main/poseidon3.txt)的设计。

source: #### When to use them ?
zh_cn: #### 何时使用它们？

source: ### Working with Hashes
zh_cn: ### 使用哈希函数

source: As our struct derives the trait HashTrait, we can call the function as follow for Poseidon hashing :
zh_cn: 由于我们的结构体派生了 HashTrait 这个trait，我们可以使用以下方式调用 Poseidon 哈希函数：

source: And as follow for Pedersen hashing :
zh_cn: 同样地，我们也可以使用以下方式调用 Pedersen 哈希函数：

source: ### Advanced Hashing: Hashing arrays with Poseidon
zh_cn: ### 高级哈希：使用 Poseidon 哈希数组

source: Let us look at an example of hashing a function that contains an `Span<felt252>`. To hash a `Span<felt252>` or a struct that contains a `Span<felt252>` you can use the build-in function in poseidon ` poseidon_hash_span(mut span: Span<felt252>) -> felt252`. Similarly you can hash `Array<felt252>` by calling `poseidon_hash_span` on its span.
zh_cn: 让我们来看一个哈希包含 `Span<felt252>`.的函数的例子。 要哈希 `Span<felt252>` 或包含 `Span<felt252>` 的结构体，您可以使用 poseidon 中的内置函数 ` poseidon_hash_span(mut span: Span<felt252>) -> felt252`。同样，您可以通过对其 span 调用 `poseidon_hash_span` 来哈希 `Array<felt252>`。

source: Now we define the structure, as you might have notice we didn't derived the Hash trait. If you try to derive the Hash trait on this structure it will rise an error because the structure contains a field not hashable.
zh_cn: 现在，我们来定义结构体。正如您可能注意到的，我们没有派生 Hash trait。如果您尝试在这个结构体上派生 Hash trait，它会引发错误，因为结构体包含一个不可哈希的字段。

source: In this example, we initialized a HashState (`hash`) and updated it and then called the function `finalize()` on the HashState to get the computed hash `hash_felt252`. We used the `poseidon_hash_span` on the `Span` of the `Array<felt252>` to compute its hash.
zh_cn: 在这个例子中，我们初始化了一个 HashState (`hash`) 并更新了它，然后在 HashState 上调用了函数 `finalize()` 以获得计算出的哈希 `hash_felt252`。我们使用 `poseidon_hash_span` 对 `Array<felt252>` 的 `Span` 进行哈希计算，以计算其哈希值。

source: # Starknet Smart Contracts
es: # Contratos Inteligentes en Starknet
zh_cn: # Starknet智能合约

source: Starknet contracts are denoted by the `#[contract]` attribute. We'll dive deeper into this in the next sections. If you want to learn more about the Starknet network itself, its architecture and the tooling available, you should read the [Starknet Book](https://book.starknet.io/). This section will focus on writing smart contracts in Cairo.
es: Los contratos de Starknet se denotan mediante el atributo `#[contract]`. Profundizaremos en esto en las próximas secciones. Si quieres aprender más sobre la propia red Starknet, su arquitectura y las herramientas disponibles, deberías leer el [Libro Starknet](https://book.starknet.io/). Esta sección se centrará en escribir contratos inteligentes en Cairo.
zh_cn: Starknet合约由`#[contract]`属性标记。我们将在接下来的部分对此进行深入探讨。如果你想了解更多关于Starknet网络本身，其架构以及可用的工具，你应该阅读[Starknet Book](https://book.starknet.io/)。本节将只专注于如何使用Cairo编写智能合约。
