Repository: cairo-book/cairo-book
Catalog: po/*.po
Languages: es, id, ko, zh_cn

source: Now we define the structure, as you might have notice we didn't derived the Hash trait. If you try to derive the Hash trait on this structure it will rise an error because the structure contains a field not hashable.
ko: 이제 우리는 구조를 정의합니다. 아마도 주목했겠지만, 우리는 Hash 트레이트를 유도하지 않았습니다. 이 구조에 Hash 트레이트를 유도하려고 하면, 구조에 해시할 수 없는 필드가 포함되어 있기 때문에 오류가 발생할 것입니다.

source: In this example, we initialized a HashState (`hash`) and updated it and then called the function `finalize()` on the HashState to get the computed hash `hash_felt252`. We used the `poseidon_hash_span` on the `Span` of the `Array<felt252>` to compute its hash.
ko: 이 예시에서는 HashState(`hash`)를 초기화하고 업데이트한 후 HashState에서 함수 `finalize()`를 호출하여 계산된 해시 `hash_felt252`를 얻었습니다. 우리는 `Array<felt252>`의 `Span`에 `poseidon_hash_span`을 사용하여 해당 해시를 계산했습니다.

source: All through the previous sections, you've mostly written programs with a `main` entrypoint. In the coming sections, you will learn to write and deploy Starknet contracts.
es: En todas las secciones anteriores, principalmente ha escrito programas con un punto de entrada `main`. En las próximas secciones, aprenderá a escribir e implementar contratos inteligentes en Starknet.
id: Sepanjang bagian-bagian sebelumnya, Anda sebagian besar menulis program dengan titik masuk `main`. Pada bagian-bagian berikutnya, Anda akan belajar menulis dan mendeploy kontrak Starknet.
ko: 이전 섹션을 통해 대부분 `main` 진입점을 가진 프로그램을 작성했습니다. 다음 섹션에서는 Starknet 계약을 작성하고 배포하는 방법을 배우게 될 것입니다.
zh_cn: 在前面的章节中，你主要是用`main`入口来编写程序。在接下来的章节中，你将学习如何编写和部署Starknet合约。

source: One of the applications of the Cairo language is to write smart contracts for the Starknet network. Starknet is a permissionless network that leverages zk-STARKs technology for scalability. As a Layer-2 scalability solution for Ethereum, Starknet's goal is to offer fast, secure, and low-cost transactions. It functions as a Validity Rollup (commonly known as a zero-knowledge Rollup) and is built on top of the Cairo language and the Starknet VM.
id: Salah satu aplikasi dari bahasa Cairo adalah menulis kontrak pintar untuk jaringan Starknet. Starknet adalah jaringan tanpa izin yang memanfaatkan teknologi zk-STARKs untuk skalabilitas. Sebagai solusi skalabilitas Layer-2 untuk Ethereum, tujuan Starknet adalah menawarkan transaksi yang cepat, aman, dan dengan biaya rendah. Ini berfungsi sebagai Validity Rollup (umumnya dikenal sebagai zero-knowledge Rollup) dan dibangun di atas bahasa Cairo dan Starknet VM.
ko: 카이로 언어의 응용 중 하나는 Starknet 네트워크를 위한 스마트 계약을 작성하는 것입니다. Starknet은 확장성을 위해 zk-STARKs 기술을 활용하는 허가되지 않은 네트워크입니다. 이더리움을 위한 Layer-2 확장성 솔루션으로, Starknet의 목표는 빠르고 안전하며 저렴한 거래를 제공하는 것입니다. 이는 Validity Rollup(일반적으로 제로 지식 Rollup이라고 알려짐)으로 작동하며, 카이로 언어와 Starknet VM 위에 구축되어 있습니다.
zh_cn: Cairo语言的一个应用是编写用于Starknet网络的智能合约。Starknet是一个无许可网络，利用zk-STARKs技术实现可扩展性。作为以太坊的二层可扩展性解决方案，Starknet的目标是提供快速、安全和低成本的交易。它作为一个有效性Rollup（通常称为零知识Rollup）运行，并构建在Cairo语言和Starknet虚拟机之上。

source: Starknet contracts, in simple words, are programs that can run on the Starknet VM. Since they run on the VM, they have access to Starknet’s persistent state, can alter or modify variables in Starknet’s states, communicate with other contracts, and interact seamlessly with the underlying L1.
es: Un contrato inteligente en Starknet en términos simples, es un programa que puede ejecutarse en la VM de Starknet. Dado que se ejecutan en la VM, tienen acceso al estado persistente de Starknet, pueden modificar variables en los estados de Starknet, comunicarse con otros contratos e interactuar sin problemas con la L1 subyacente.
id: Kontrak Starknet, dengan kata sederhana, adalah program-program yang dapat dijalankan pada Starknet VM. Karena mereka berjalan di VM, mereka memiliki akses ke status persisten Starknet, dapat mengubah atau memodifikasi variabel dalam status Starknet, berkomunikasi dengan kontrak lain, dan berinteraksi dengan lancar dengan L1 yang mendasarinya.
ko: 스타크넷 계약은 간단히 말해, 스타크넷 VM에서 실행할 수 있는 프로그램입니다. VM에서 실행되기 때문에 스타크넷의 지속 상태에 액세스할 수 있으며, 스타크넷 상태의 변수를 변경하거나 수정할 수 있으며, 다른 계약과 통신하고 기본 L1과 원활하게 상호 작용할 수 있습니다.
zh_cn: 简单来说，Starknet合约就是可以在Starknet虚拟机上运行的程序。由于它们在虚拟机上运行，它们可以访问Starknet的持久性状态，可以改变或修改Starknet状态中的变量，与其他合约沟通，并与底层的L1无缝交互。

source: Starknet contracts are denoted by the `#[contract]` attribute. We'll dive deeper into this in the next sections. If you want to learn more about the Starknet network itself, its architecture and the tooling available, you should read the [Starknet Book](https://book.starknet.io/). This section will focus on writing smart contracts in Cairo.
id: Kontrak Starknet ditandai dengan atribut `#[contract]`. Kami akan membahas ini lebih lanjut pada bagian-bagian berikutnya. Jika Anda ingin mempelajari lebih lanjut tentang jaringan Starknet itu sendiri, arsitekturnya, dan alat yang tersedia, Anda sebaiknya membaca [Buku Starknet](https://book.starknet.io/). Bagian ini akan fokus pada penulisan kontrak pintar di Cairo.
ko: Starknet 계약은 `#[contract]` 속성으로 표시됩니다. 다음 섹션에서 이에 대해 더 자세히 다룰 것입니다. Starknet 네트워크 자체, 그 아키텍처 및 사용 가능한 도구에 대해 더 알고 싶다면 [Starknet Book](https://book.starknet.io/)을 읽어보세요. 이 섹션은 Cairo에서 스마트 계약을 작성하는 데 초점을 맞출 것입니다.

source: Scarb
ko: Scarb -> Scarb

source: Scarb supports smart contract development for Starknet. To enable this functionality, you'll need to make some configurations in your `Scarb.toml` file (see [Installation](./ch01-01-installation.md) for how to install Scarb). You have to add the `starknet` dependency and add a `[[target.starknet-contract]]` section to enable contract compilation.
id: Scarb mendukung pengembangan kontrak pintar untuk Starknet. Untuk mengaktifkan fungsionalitas ini, Anda perlu melakukan beberapa konfigurasi dalam file `Scarb.toml` Anda (lihat [Instalasi](./ch01-01-installation.md) untuk cara menginstal Scarb). Anda harus menambahkan dependensi `starknet` dan menambahkan bagian `[[target.starknet-contract]]` untuk mengaktifkan kompilasi kontrak.
ko: Scarb는 Starknet을 위한 스마트 계약 개발을 지원합니다. 이 기능을 활성화하려면 `Scarb.toml` 파일에서 몇 가지 구성을 해야 합니다 (Scarb 설치 방법은 [설치](./ch01-01-installation.md)를 참조하세요). `starknet` 종속성을 추가하고 계약 컴파일을 가능하게 하려면 `[[target.starknet-contract]]` 섹션을 추가해야 합니다.

source: Below is the minimal Scarb.toml file required to compile a crate containing Starknet contracts:
id: Berikut adalah file Scarb.toml minimal yang diperlukan untuk mengompilasi kerangka yang berisi kontrak Starknet:
ko: 다음은 Starknet 계약을 포함하는 크레이트를 컴파일하는 데 필요한 최소한의 Scarb.toml 파일입니다:
zh_cn: 下面是编译包含Starknet合约的crate所需的最小Scarb.toml文件示例：

source: For additional configuration, such as external contract dependencies, please refer to the [Scarb documentation](https://docs.swmansion.com/scarb/docs/extensions/starknet/contract-target.html#compiling-external-contracts).
id: Untuk konfigurasi tambahan, seperti dependensi kontrak eksternal, silakan merujuk ke [dokumentasi Scarb](https://docs.swmansion.com/scarb/docs/extensions/starknet/contract-target.html#compiling-external-contracts).
ko: 추가 구성, 예를 들어 외부 계약 종속성과 같은 경우, [Scarb 문서](https://docs.swmansion.com/scarb/docs/extensions/starknet/contract-target.html#compiling-external-contracts)를 참조하십시오.
zh_cn: 有关外部合约依赖等更多配置相关的内容，请参阅 [Scarb 文档](https://docs.swmansion.com/scarb/docs/extensions/starknet/contract-target.html#compiling-external-contracts)。

source: Each example in this chapter can be used with Scarb.
id: Setiap contoh dalam bab ini dapat digunakan dengan Scarb.
ko: 이 장의 각 예시는 Scarb와 함께 사용할 수 있습니다.
zh_cn: 本章中的每个示例都可以与 Scarb 一起使用。

source: This chapter will give you a high level introduction to what smart-contracts are, what are they used for, and why would blockchain developers use Cairo and Starknet. If you are already familiar with blockchain programming, feel free to skip this chapter. The last part might still be interesting though.
ko: 이 장은 스마트 계약이 무엇인지, 어떻게 사용되는지, 그리고 왜 블록체인 개발자들이 Cairo와 Starknet을 사용하는지에 대한 고수준 소개를 제공할 것입니다. 이미 블록체인 프로그래밍에 익숙하다면 이 장을 건너뛰어도 됩니다. 그러나 마지막 부분은 여전히 흥미로울 수 있습니다.

source: Smart-contracts
ko: 스마트 계약

source: Smart contracts gained popularity and became more widespread with the birth of Ethereum. Smart contracts are essentially programs deployed on a blockchain. The term "smart contract" is somewhat misleading, as they are neither "smart" nor "contracts" but rather code and instructions that are executed based on specific inputs. They primarily consist of two components: storage and functions. Once deployed, users can interact with smart contracts by initiating blockchain transactions containing execution data (which function to call and with what input). Smart contracts can modify and read the storage of the underlying blockchain. A smart contract has its own address and is considered a blockchain account, meaning it can hold tokens.
es: Los contratos inteligentes ganaron popularidad y se generalizaron con el nacimiento de Ethereum. Los contratos inteligentes son esencialmente programas desplegados en una blockchain. El término "smart contract" es algo engañoso, ya que no son ni "inteligentes" ni "contratos", sino más bien código e instrucciones que se ejecutan en función de entradas específicas. Constan principalmente de dos componentes: almacenamiento y funciones. Una vez desplegados, los usuarios pueden interactuar con los contratos inteligentes iniciando transacciones en la cadena de bloques que contengan datos de ejecución (a qué función llamar y con qué datos de entrada). Los contratos inteligentes pueden modificar y leer el almacenamiento de la blockchain subyacente. Un contrato inteligente tiene su propia dirección y se considera una cuenta de blockchain, lo que significa que puede contener tokens.
id: Kontrak pintar menjadi populer dan lebih tersebar luas dengan lahirnya Ethereum. Kontrak pintar pada dasarnya adalah program yang diterapkan pada blockchain. Istilah "kontrak pintar" agak menyesatkan, karena mereka bukanlah "pintar" maupun "kontrak," melainkan berupa kode dan instruksi yang dieksekusi berdasarkan input tertentu. Mereka terutama terdiri dari dua komponen: penyimpanan dan fungsi. Setelah diterapkan, pengguna dapat berinteraksi dengan kontrak pintar dengan memulai transaksi blockchain yang berisi data eksekusi (fungsi yang akan dipanggil dan dengan input apa). Kontrak pintar dapat memodifikasi dan membaca penyimpanan blockchain yang mendasarinya. Kontrak pintar memiliki alamat sendiri dan dianggap sebagai akun blockchain, yang berarti dapat menyimpan token.
ko: 스마트 계약은 이더리움의 탄생과 함께 인기를 얻고 보급화되었습니다. 스마트 계약은 본질적으로 블록체인에 배포된 프로그램입니다. "스마트 계약"이라는 용어는 다소 오해를 줄 수 있습니다. 그들은 "스마트"하거나 "계약"이 아니라 특정 입력에 기반하여 실행되는 코드와 명령어입니다. 주로 두 가지 구성 요소로 이루어져 있습니다: 저장소와 함수. 배포된 후에는 사용자가 블록체인 트랜잭션을 시작하여 실행 데이터를 포함시킬 수 있습니다 (어떤 입력으로 어떤 함수를 호출할지). 스마트 계약은 기본 블록체인의 저장소를 수정하고 읽을 수 있습니다. 스마트 계약은 자체 주소를 가지고 있으며 블록체인 계정으로 간주되어 토큰을 보유할 수 있습니다.
zh_cn: 随着以太坊的诞生，智能合约得到了普及并变得更加广泛。智能合约本质上是部署在区块链上的程序。术语 "智能合约 "有些误导，因为它们既不 "智能 "也不是 "合约"，而只是根据特定输入执行的代码和指令。它们主要由两部分组成：存储和函数。部署后，用户可以通过启动包含执行数据的区块链交易（调用哪个函数，输入什么参数）与智能合约互动。智能合约可以修改和读取底层区块链的存储。智能合约有自己的地址，因此它是一个区块链账户，意味着它可以持有代币。

source: The programming language used to write smart contracts varies depending on the blockchain. For example, on Ethereum and the [EVM-compatible ecosystem](https://ethereum.org/en/developers/docs/evm/), the most commonly used language is Solidity, while on Starknet, it is Cairo. The way the code is compiled also differs based on the blockchain. On Ethereum, Solidity is compiled into bytecode. On Starknet, Cairo is compiled into Sierra and then into Cairo Assembly (casm).
es: El lenguaje de programación utilizado para escribir contratos inteligentes varía en función de la blockchain. Por ejemplo, en Ethereum y en el ecosistema [compatible con EVM](https://ethereum.org/en/developers/docs/evm/), el lenguaje más utilizado es Solidity, mientras que en Starknet es Cairo. La forma de compilar el código también difiere en función del blockchain. En Ethereum, Solidity se compila en bytecode. En Starknet, Cairo se compila en Sierra y luego en Cairo Assembly (casm).
id: Bahasa pemrograman yang digunakan untuk menulis kontrak pintar bervariasi tergantung pada blockchain. Sebagai contoh, pada Ethereum dan [ekosistem yang kompatibel dengan EVM](https://ethereum.org/en/developers/docs/evm/), bahasa yang paling umum digunakan adalah Solidity, sementara pada Starknet, menggunakan bahasa Cairo. Cara kode dikompilasi juga berbeda berdasarkan blockchain. Pada Ethereum, Solidity dikompilasi menjadi bytecode. Pada Starknet, Cairo dikompilasi menjadi Sierra dan kemudian menjadi Cairo Assembly (casm).
ko: 스마트 계약을 작성하는 데 사용되는 프로그래밍 언어는 블록체인에 따라 다릅니다. 예를 들어, 이더리움 및 [EVM 호환 생태계](https://ethereum.org/en/developers/docs/evm/)에서 가장 일반적으로 사용되는 언어는 Solidity이며, Starknet에서는 Cairo입니다. 코드가 컴파일되는 방식도 블록체인에 따라 다릅니다. 이더리움에서는 Solidity가 바이트코드로 컴파일됩니다. Starknet에서는 Cairo가 Sierra로 컴파일되고 그런 다음 Cairo 어셈블리(casm)로 컴파일됩니다.
zh_cn: 用于编写智能合约的编程语言因区块链的不同而不同。例如，在以太坊和[EVM兼容的生态系统](https://ethereum.org/en/developers/docs/evm/)生态系统上，最常用的语言是Solidity，而在Starknet上，是Cairo。代码的编译方式也根据区块链的不同而不同。在Ethereum上，Solidity被编译成字节码。在Starknet上，Cairo被编译成Sierra，然后再编译成Cairo Assembly（casm）。

source: Smart contracts possess several unique characteristics. They are **permissionless**, meaning anyone can deploy a smart contract on the network (within the context of a decentralized blockchain, of course). Smart contracts are also **transparent**; the data stored by the smart contract is accessible to anyone. The code that composes the contract can also be transparent, enabling **composability**. This allows developers to write smart contracts that use other smart contracts. Smart contracts can only access and interact with data from the blockchain they are deployed on. They require third-party software (called `oracles`) to access external data (the price of a token for instance).
id: Kontrak pintar memiliki beberapa karakteristik unik. Mereka **tanpa izin**, artinya siapa pun dapat menerapkan kontrak pintar di jaringan (dalam konteks blockchain terdesentralisasi, tentu saja). Kontrak pintar juga **transparan**; data yang disimpan oleh kontrak pintar dapat diakses oleh siapa pun. Kode yang menyusun kontrak juga dapat transparan, memungkinkan **komposabilitas**. Ini memungkinkan pengembang menulis kontrak pintar yang menggunakan kontrak pintar lainnya. Kontrak pintar hanya dapat mengakses dan berinteraksi dengan data dari blockchain tempat mereka diterapkan. Mereka memerlukan perangkat lunak pihak ketiga (yang disebut `orakel`) untuk mengakses data eksternal (seperti harga token, misalnya).
ko: 스마트 계약은 몇 가지 독특한 특성을 가지고 있습니다. 그들은 **허가 없는** 특성을 가지고 있어 누구나 네트워크에 스마트 계약을 배포할 수 있습니다 (물론 탈중앙화된 블록체인의 맥락 안에서). 스마트 계약은 또한 **투명**합니다; 스마트 계약에 의해 저장된 데이터는 누구에게나 접근 가능합니다. 계약을 구성하는 코드도 투명할 수 있어 **가능성**을 제공합니다. 이는 개발자가 다른 스마트 계약을 사용하는 스마트 계약을 작성할 수 있도록 합니다. 스마트 계약은 배포된 블록체인의 데이터에만 액세스하고 상호 작용할 수 있습니다. 외부 데이터에 액세스하기 위해 제3자 소프트웨어( `오라클` 라고 불림)가 필요합니다 (예를 들어 토큰의 가격).
zh_cn: 智能合约具有几个独特特征。它们是 **无需许可** 的，意味着任何人都可以在网络上部署智能合约（当然是在去中心化的区块链上）。智能合约也是 **透明** 的；由智能合约存储的数据对任何人都是可访问的。构成合约的代码也可以是透明的，从而实现 **可组合性**。这使得开发人员可以编写使用其他智能合约的智能合约。智能合约只能访问和与其部署所在的区块链上的数据进行交互。它们需要第三方软件（被称为 `oracle`）来访问外部数据（例如代币的价格）。

source: For developers to build smart contracts that can interact with each other, it is required to know what the other contracts look like. Hence, Ethereum developers started to build standards for smart contract development, the `ERCxx`. The two most used and famous standards are the `ERC20`, used to build tokens like `USDC`, `DAI` or `STARK`, and the `ERC721`, for NFTs (Non-fungible tokens) like `CryptoPunks` or `Everai`.
es: Para que los desarrolladores puedan crear contratos inteligentes que interactúen entre sí, es necesario saber cómo son los demás contratos. Por ello, los desarrolladores de Ethereum empezaron a crear estándares para el desarrollo de contratos inteligentes, los "ERCxx". Los dos estándares más usados y famosos son el `ERC20`, usado para construir tokens como `USDC`, `DAI` o `STARK`, y el `ERC721`, para NFTs (Non-fungible tokens) como `CryptoPunks` o `Everai`.
id: Agar pengembang dapat membangun kontrak pintar yang dapat berinteraksi satu sama lain, diperlukan pengetahuan tentang bagaimana kontrak lain terlihat. Oleh karena itu, pengembang Ethereum mulai membangun standar untuk pengembangan kontrak pintar, yaitu `ERCxx`. Dua standar yang paling banyak digunakan dan terkenal adalah `ERC20`, digunakan untuk membangun token seperti `USDC`, `DAI`, atau `STARK`, dan `ERC721`, untuk NFT (Token Non-fungible) seperti `CryptoPunks` atau `Everai`.
ko: 개발자들이 서로 상호 작용할 수 있는 스마트 계약을 구축하기 위해서는 다른 계약이 어떻게 보이는지 알아야 합니다. 그래서 이더리움 개발자들은 스마트 계약 개발을 위한 표준인 `ERCxx`를 만들기 시작했습니다. 가장 많이 사용되고 유명한 두 가지 표준은 `ERC20`으로, `USDC`, `DAI`, 또는 `STARK`와 같은 토큰을 만드는 데 사용되며, `ERC721`은 `CryptoPunks`나 `Everai`와 같은 NFT(대체 불가능한 토큰)를 위한 것입니다.
zh_cn: 对于开发者来说，要想建立能够相互互动的智能合约，就必须知道其他合约的是什么样。因此，以太坊开发者建立了一些智能合约开发的标准，即 `ERCxx`。两个最常用和最著名的标准是 `ERC20`，用于建立 `USDC`、`DAI`或 `STARK`等代币，以及 `ERC721`，用于 `CryptoPunks`或 `Everai`等NFT（Non-fungible token）。

source: Use cases
ko: 사용 사례

source: There are many possible use cases for smart-contracts. The only limits are the technical constraints of the blockchain and the creativity of developers.
es: Hay muchos casos de uso posibles para los smart-contracts. Los únicos límites son las restricciones técnicas de la cadena de bloques y la creatividad de los desarrolladores.
id: Ada banyak kasus penggunaan yang mungkin untuk kontrak pintar. Satu-satunya batasan adalah kendala teknis dari blockchain dan kreativitas para pengembang.
ko: 스마트 계약에는 많은 가능한 사용 사례가 있습니다. 제한은 블록체인의 기술적 제약과 개발자들의 창의력뿐입니다.
zh_cn: 智能合约有许多可能的用例。唯一的限制是区块链的技术限制和开发者的创造力。

source: DeFi
ko: DeFi 디파이

source: Right now, the principal use case for smart contracts is similar to that of Ethereum or Bitcoin, which is essentially handling money. In the context of the alternative payment system promised by Bitcoin, smart contracts on Ethereum enable the creation of decentralized financial applications that no longer rely on traditional financial intermediaries. This is what we call DeFi (decentralized finance). DeFi consists of various projects such as lending/borrowing apps, decentralized exchanges (DEX), on-chain derivatives, stablecoins, decentralized hedge funds, insurance, and many more.
es: Ahora mismo, el principal caso de uso de los smart contracts es similar al de Ethereum o Bitcoin, que consiste esencialmente en manejar dinero. En el contexto del sistema de pago alternativo prometido por Bitcoin, los smart contracts en Ethereum permiten crear aplicaciones financieras descentralizadas que ya no dependen de los intermediarios financieros tradicionales. Es lo que llamamos DeFi (finanzas descentralizadas). DeFi consta de varios proyectos, como aplicaciones de préstamo/endeudamiento, intercambios descentralizados (DEX), derivados en cadena, stablecoins, fondos de cobertura descentralizados, seguros y muchos más.
id: Saat ini, kasus penggunaan utama untuk kontrak pintar mirip dengan Ethereum atau Bitcoin, yang pada dasarnya menangani uang. Dalam konteks sistem pembayaran alternatif yang dijanjikan oleh Bitcoin, kontrak pintar di Ethereum memungkinkan penciptaan aplikasi keuangan terdesentralisasi yang tidak lagi bergantung pada perantara keuangan tradisional. Ini yang disebut DeFi (keuangan terdesentralisasi). DeFi terdiri dari berbagai proyek seperti aplikasi peminjaman/peminjaman, pertukaran terdesentralisasi (DEX), derivatif on-chain, stablecoin, dana lindung terdesentralisasi, asuransi, dan banyak lagi.
ko: 현재 스마트 계약의 주요 사용 사례는 에테리움이나 비트코인과 유사하며, 본질적으로는 자금을 처리하는 것입니다. 비트코인이 약속한 대체 결제 시스템의 맥락에서, 에테리움의 스마트 계약은 전통적인 금융 중개인에 의존하지 않는 탈중앙화된 금융 애플리케이션의 생성을 가능하게 합니다. 이를 우리는 DeFi(탈중앙화된 금융)라고 합니다. DeFi에는 대출/차입 앱, 탈중앙화 거래소(DEX), 온체인 파생상품, 스테이블코인, 탈중앙화 헤지 펀드, 보험 등 다양한 프로젝트가 포함되어 있습니다.
zh_cn: 眼下，智能合约的主要用例与以太坊或比特币的用例类似，基本上是处理金钱。在比特币承诺的替代支付系统的背景下，我们在以太坊上可以使用智能合约创建去中心化的金融应用，不需要再依赖传统的金融中介机构。这就是我们所说的DeFi（去中心化金融）。DeFi由各种项目组成，如借贷应用、去中心化交易所（DEX）、链上衍生品、稳定币、去中心化对冲基金、保险等等。

source: Tokenization
ko: 토큰화

source: Smart contracts can facilitate the tokenization of real-world assets, such as real estate, art, or precious metals. Tokenization divides an asset into digital tokens, which can be easily traded and managed on blockchain platforms. This can increase liquidity, enable fractional ownership, and simplify the buying and selling process.
es: Los smart contracts pueden facilitar la tokenización de activos del mundo real, como bienes inmuebles, obras de arte o metales preciosos. La tokenización divide un activo en fichas digitales, que pueden negociarse y gestionarse fácilmente en plataformas de cadena de bloques. Esto puede aumentar la liquidez, permitir la propiedad fraccionaria y simplificar el proceso de compraventa.
id: Kontrak pintar dapat memfasilitasi tokenisasi aset dunia nyata, seperti properti, seni, atau logam mulia. Tokenisasi membagi suatu aset menjadi token digital, yang dapat diperdagangkan dan dikelola dengan mudah di platform blockchain. Ini dapat meningkatkan likuiditas, memungkinkan kepemilikan fraksional, dan menyederhanakan proses jual beli.
ko: 스마트 계약은 부동산, 예술, 또는 귀금속과 같은 실제 자산의 토큰화를 용이하게 할 수 있습니다. 토큰화는 자산을 디지털 토큰으로 나누어 블록체인 플랫폼에서 쉽게 거래하고 관리할 수 있게 합니다. 이는 유동성을 증가시키고 분할 소유권을 가능하게 하며 매매 과정을 간소화할 수 있습니다.
zh_cn: 智能合约可以促进现实世界资产的代币化，如房地产、艺术品或贵金属。代币化将资产划分为数字代币，可以在区块链平台上轻松交易和管理。这可以增加流动性，实现部分所有权，并简化购买和销售过程。

source: Voting
ko: 투표

source: Smart contracts can be used to create secure and transparent voting systems. Votes can be recorded on the blockchain, ensuring immutability and transparency. The smart contract can then automatically tally the votes and declare the results, minimizing the potential for fraud or manipulation.
es: Los smart contracts pueden utilizarse para crear sistemas de votación seguros y transparentes. Los votos pueden registrarse en la cadena de bloques, lo que garantiza la inmutabilidad y la transparencia. A continuación, el contrato inteligente puede contabilizar automáticamente los votos y declarar los resultados, minimizando las posibilidades de fraude o manipulación.
id: Kontrak pintar dapat digunakan untuk membuat sistem pemungutan suara yang aman dan transparan. Suara dapat dicatat di blockchain, memastikan ketidakubahannya dan transparansi. Kontrak pintar kemudian dapat secara otomatis menghitung suara dan mengumumkan hasilnya, meminimalkan potensi penipuan atau manipulasi.
ko: 스마트 계약은 안전하고 투명한 투표 시스템을 만드는 데 사용될 수 있습니다. 투표는 블록체인에 기록될 수 있어 변경 불가능성과 투명성을 보장합니다. 스마트 계약은 그 후에 자동으로 투표를 집계하고 결과를 선언할 수 있어 사기나 조작 가능성을 최소화합니다.
zh_cn: 智能合约可用于创建安全和透明的投票系统。投票可以记录在区块链上，确保不可更改性和透明度。然后，智能合约可以自动统计票数并宣布结果，将欺诈或操纵的可能性降到最低。

source: Royalties
ko: 로열티

source: Smart contracts can automate royalty payments for artists, musicians, and other content creators. When a piece of content is consumed or sold, the smart contract can automatically calculate and distribute the royalties to the rightful owners, ensuring fair compensation and reducing the need for intermediaries.
es: Los smart contracts pueden automatizar el pago de derechos de autor para artistas, músicos y otros creadores de contenidos. Cuando un contenido se consume o se vende, el contrato inteligente puede calcular y distribuir automáticamente los derechos de autor a los legítimos propietarios, garantizando una compensación justa y reduciendo la necesidad de intermediarios.
id: Kontrak pintar dapat mengotomatisasi pembayaran royalti bagi seniman, musisi, dan pembuat konten lainnya. Ketika suatu konten dikonsumsi atau dijual, kontrak pintar dapat secara otomatis menghitung dan mendistribusikan royalti kepada pemilik yang berhak, memastikan kompensasi yang adil dan mengurangi kebutuhan akan perantara.
ko: 스마트 계약은 예술가, 음악가 및 기타 콘텐츠 창작자들을 위한 로열티 지불을 자동화할 수 있습니다. 콘텐츠가 소비되거나 판매될 때, 스마트 계약은 자동으로 로열티를 정확히 계산하고 소유자들에게 분배하여 공정한 보상을 보장하고 중개인의 필요성을 줄입니다.
zh_cn: 智能合约可以为艺术家、音乐家和其他内容创作者自动支付版税。当一段内容被消费或出售时，智能合约可以自动计算并将版税分配给合法的所有者，确保公平的补偿并减少对中间人的需求。

source: Decentralized identities DIDs
ko: 분산 신원 DIDs
