Repository: cairo-book/cairo-book
Catalog: po/*.po
Languages: es, id, ko, zh_cn

source: Each event variant has to be a struct of the same name as the variant, and each variant needs to implement the `starknet::Event` trait itself. Moreover, the members of these variants must implement the `Serde` trait (_c.f._ [Appendix C: Serializing with Serde](./appendix-03-derivable-traits.md)), as keys/data are added to the event using a serialization process.
zh_cn: 每个事件变体成员必须是一个与变体同名的结构体，并且每个变体本身需要实现`starknet::Event`trait。 此外，这些变体的成员必须实现`Serde`trait(_c.f._ [Appendix C: Serializing with Serde](./appendix-03-derivable-traits.md))，因为键/数据是通过序列化过程添加到事件中的。

source: In our contract, we define an event named `StoredName` that emits the contract address of the caller and the name stored within the contract, where the `user` field is serialized as a key and the `name` field is serialized as data. To index the key of an event, simply annotate it with the `#[key]` as demonstrated in the example for the `user` key.
zh_cn: 在我们的合约中，我们定义了一个名为 `StoredName` 的事件，该事件将调用者的合约地址和存储在合约中的名称发送出去，其中 `user` 字段序列化为键，而 `name` 字段序列化为数据。 要索引一个事件的键，只需用`#[key]`注释它，如`user`键的示例所示。

source: When emitting the event with `self.emit(StoredName { user: user, name: name })`, a key corresponding to the name ` StoredName`, specifically `sn_keccak(StoredName)`, is appended to the keys list. `user`is serialized as key, thanks to the `#[key]` attribute, while address is serialized as data. After everything is processed, we end up with the following keys and data: `keys = [sn_keccak("StoredName"),user]` and `data = [address]`.
id: Saat mengeluarkan peristiwa dengan `self.emit(StoredName { user: user, name: name })`, sebuah kunci yang sesuai dengan nama `StoredName`, khususnya `sn_keccak(StoredName)`, ditambahkan ke daftar kunci. `user` diserialisasikan sebagai kunci, berkat atribut `#[key]`, sementara alamat diserialisasikan sebagai data. Setelah semuanya diproses, kita mendapatkan kunci dan data berikut: `keys = [sn_keccak("StoredName"),user]` dan `data = [address]`.
zh_cn: 当使用 `self.emit(StoredName { user: user, name: name })` 发布事件时，与名称 `StoredName` 相对应的键，特别是 `sn_keccak(StoredName)` 会被添加到键列表中。由于使用了 `#[key]`属性，`user` 被序列化为 key，而地址被序列化为数据。一切处理完毕后，我们将得到以下键和数据：`keys = [sn_keccak("StoredName"),user]` 和 `data = [address]`。

source: ### Emitting events
es: ### Emisión de eventos
zh_cn: ### 发射事件

source: # Reducing boilerplate
zh_cn: # 减少冗余模板代码

source: Recall that in order to access the ContractState in a function, this function must be defined in an implementation block whose generic parameter is `ContractState`. This implies that we first need to define a generic trait that takes a `TContractState`, and then implement this trait for the `ContractState` type. But by using the `#[generate_trait]` attribute, this whole process can be skipped and we can simply define the implementation block directly, without any generic parameter, and use `self: ContractState` in our functions.
zh_cn: 回想一下，为了在函数中访问 ContractState，该函数必须定义在泛型参数为 `ContractState` 的实现块中。这意味着我们首先需要定义一个接受`TContractState`的泛型trait，然后为`ContractState`类型实现这个trait。 但是通过使用 `#[generate_trait]` 属性，我们可以跳过整个过程，从而简单地直接定义实现块，不需要任何泛型参数，并在我们的函数中使用 `self.ContractState` 属性。

source: ## Storage Optimization with `StorePacking`
zh_cn: ## 使用`StorePacking`优化存储

source: When writing Cairo smart contracts, it is important to optimize storage usage to reduce gas costs. Indeed, most of the cost associated with a transaction is related to storage updates; and each storage slot costs gas to write to. This means that by packing multiple values into fewer slots, you can decrease the gas cost incurred by the users of your smart contract.
zh_cn: 在编写Cairo智能合约时，优化存储使用以减少 gas 成本是非常重要的。事实上，与交易相关的大部分成本都与存储更新相关；而每个存储槽位写入都需要 gas 成本。 这意味着通过将多个值打包到较少的槽位中，你可以减少智能合约的用户所需的 gas 成本。

source: <span class="caption">Optimizing storage by implementing the `StorePacking` trait</span>
zh_cn: <span class="caption">通过实现 `StorePacking` trait来优化存储</span>

source: If you're not familiar with bit operations, here's an explanation of the operations performed in the example: The goal is to pack the `tiny`, `small`, and `medium` fields into a single `u128` value. First, when packing:
zh_cn: 如果您对位运算不熟悉，这里将解释示例中执行的运算： 我们的目标是将 `tiny`, `small`, 还有 `medium`字段打包成一个 `u128` 值。 首先，打包时：

source: - `tiny` is a `u8` so we just convert it directly to a `u128` with `.into()`. This creates a `u128` value with the low 8 bits set to `tiny`'s value. - `small` is a `u32` so we first shift it left by 8 bits (add 8 bits with the value 0 to the left) to create room for the 8 bites taken by `tiny`. Then we add `tiny` to `small` to combine them into a single `u128` value. The value of `tiny` now takes bits 0-7 and the value of small takes bits 8-39. - Similarly `medium` is a `u64` so we shift it left by 40 (8 + 32) bits (`TWO_POW_40`) to make space for the previous fields. This takes bits 40-103.
zh_cn: - `tiny` 是一个 `u8`，因此我们只需用 `.into()` 将其直接转换为 `u128`。这会创建一个低 8 位设置为 `tiny` 值的 `u128` 值。 - `small` 是一个 `u32`，因此我们首先将它左移 8 位（向左添加 8 位值为 0 的比特），为 `tiny` 占用的 8 位留出空间。然后，我们将 `tiny` 添加到 `small` 中，将它们合并成一个 `u128` 值。现在，`tiny` 的值占 0-7 位，`small` 的值占 8-39 位。 - 同样，`medium` 是一个 `u64`，因此我们将其左移 40 (8 + 32) 位（`TWO_POW_40`），为前面的字段腾出空间。这需要占用 40-103 位。

source: - First we extract `tiny` by bitwise ANDing (&) with a bitmask of 8 ones (`& MASK_8`). This isolates the lowest 8 bits of the packed value, which is `tiny`'s value. - For `small`, we right shift by 8 bits (`/ TWO_POW_8`) to align it with the bitmask, then use bitwise AND with the 32 ones bitmask. - For `medium` we right shift by 40 bits. Since it is the last value packed, we don't need to apply a bitmask as the higher bits are already 0.
zh_cn: - 首先，我们通过与 8 个 1 的位掩码（`& MASK_8`）进行比特 AND（&）来提取`tiny`。这样就分离出打包值的最低 8 位，也就是 `tiny` 的值。 - 对于 `small`，我们右移 8 位 (`/TWO_POW_8`)，使其与位掩码对齐，然后与 32 个 1 的位掩码进行位和运算。 - 对于 `medium`，我们右移 40 位。由于它是最后打包的值，我们不需要应用位掩码，因为高位已经为 0。

source: The rest of the work is done magically by the compiler - if a type implements the `StorePacking` trait, then the compiler will know it can use the `StoreUsingPacking` implementation of the `Store` trait in order to pack before writing and unpack after reading from storage. One important detail, however, is that the type that `StorePacking::pack` spits out also has to implement `Store` for `StoreUsingPacking` to work. Most of the time, we will want to pack into a felt252 or u256 - but if you want to pack into a type of your own, make sure that this one implements the `Store` trait.
zh_cn: 其余的工作由编译器自动完成 - 如果一个类型实现了 `StorePacking` trait，那么编译器将知道它可以使用 `Store` trait 的 `StoreUsingPacking` 实现，在写入之前进行打包，在从存储中读取后进行解包。 然而，一个重要的细节是，`StorePacking::pack` 输出的类型也必须实现 `Store`，以使 `StoreUsingPacking` 正常工作。大多数情况下，我们希望打包到 felt252 或 u256 类型中 - 但是如果你想打包到自定义类型中，请确保该类型实现了 `Store` trait。

source: # Components: Lego-Like Building Blocks for Smart Contracts
zh_cn: # 组件：智能合约的乐高式构建块

source: Developing contracts sharing a common logic and storage can be painful and bug-prone, as this logic can hardly be reused and needs to be reimplemented in each contract. But what if there was a way to snap in just the extra functionality you need inside your contract, separating the core logic of your contract from the rest?
zh_cn: 开发共享通用逻辑和存储的合约可能会很痛苦，而且容易出错， 因为这个逻辑很难重用，需要在每份合约中重新编写。 但是，如果有一种方法可以额外提供您在合约中需要的功能， 并与你的合约的核心逻辑是分离的会怎样呢？

source: Components provide exactly that. They are modular add-ons encapsulating reusable logic, storage, and events that can be incorporated into multiple contracts. They can be used to extend a contract's functionality, without having to reimplement the same logic over and over again.
zh_cn: 组件正好提供了这一点。它们是封装可重复使用的 模块化附加逻辑、存储和事件，可以被整合到多个合约中。 它们可用于扩展合约的功能，而无需一遍又一遍地重新实现相同的逻辑。

source: Think of components as Lego blocks. They allow you to enrich your contracts by plugging in a module that you or someone else wrote. This module can be a simple one, like an ownership component, or more complex like a full-fledged ERC20 token.
zh_cn: 将组件视为乐高积木。它们允许您通过插入您或其他人编写的模块方式增强您的合约。 这个模块可以是一个简单的组件，如所有权组件，或更复杂的，如成熟的 ERC20代币。

source: A component is a separate module that can contain storage, events, and functions. Unlike a contract, a component cannot be declared or deployed. Its logic will eventually be part of the contract’s bytecode it has been embedded in.
zh_cn: 组件是一个单独的模块，可以包含存储、事件和功能。 与合约不同，你不能声明或部署组件。 其逻辑最终将成为它被嵌入的合约字节码的一部分。

source: ## What's in a Component?
zh_cn: ## 组件里面有什么？

source: - Storage variables - Events - External and internal functions
zh_cn: - 存储变量 - 事件 - 外部和内部函数

source: Unlike a contract, a component cannot be deployed on its own. The component's code becomes part of the contract it's embedded to.
zh_cn: 与合约不同，组件不能单独部署。组件的代码成为嵌入到的合约的一部分。

source: ## Creating Components
zh_cn: ## 创建组件

source: To create a component, first define it in its own module decorated with a `#[starknet::component]` attribute. Within this module, you can declare a ` Storage` struct and `Event` enum, as usually done in [Contracts](./ch99-01-02-a-simple-contract.md).
zh_cn: 要创建一个组件，首先在它自己的模块中定义它，并用`#[starknet::component]` 属性。 在此模块中，您可以声明一个 `Storage` 结构和 `Event` 枚举，这通常在[合约](./ch99-01-02-a-simple-contract.md)中。

source: The next step is to define the component interface, containing the signatures of the functions that will allow external access to the component's logic. You can define the interface of the component by declaring a trait with the `#[starknet::interface]` attribute, just as you would with contracts. This interface will be used to enable external access to the component's functions using the [Dispatcher](./ch99-02-02-contract-dispatcher-library-dispatcher-and-system-calls.md) pattern.
zh_cn: 下一步是定义组件接口，其中包含允许从外部访问组件逻辑的函数。 您可以这样定义组件的接口，方法是使用`#[starknet::interface]`属性， 就像你使用合约一样。这接口通过[Dispatcher](./ch99-02-02-contract-dispatcher-library-dispatcher-and-system-calls.md)模式， 用于启用对组件功能的外部访问。

source: The actual implementation of the component's external logic is done in an `impl` block marked as `#[embeddable_as(name)]`. Usually, this `impl` block will be an implementation of the trait defining the interface of the component.
zh_cn: 组件外部逻辑的实际实现是在标记为`#[embeddable_as(name)]`的`impl`代码块中完成的。 通常，这个`impl`块将是一个定义组件接口的trait的实现。

source: > Note: `name` is the name that we’ll be using in the contract to refer to the > component. It is different than the name of your impl.
zh_cn: > 注意：`name`是我们将在合约中用来指代 > 组件的名称。它与 impl 的名称不同。

source: You can also define internal functions that will not be accessible externally, by simply omitting the `#[embeddable_as(name)]` attribute above the internal `impl` block. You will be able to use these internal functions inside the contract you embed the component in, but not interact with it from outside, as they're not a part of the abi of the contract.
zh_cn: 您还可以定义外部无法访问的内部函数， 只需省略内部`impl`块上方的 `#[embeddable_as(name)]` 属性即可。 您将能够在合约内部使用组件，但无法从外部与组件交互，因为它们不是合约 ABI 的一部分。

source: Functions within these `impl` block expect arguments like `ref self: ComponentState<TContractState>` (for state-modifying functions) or `self: @ComponentState<TContractState>` (for view functions). This makes the impl generic over `TContractState`, allowing us to use this component in any contract.
zh_cn: 这些`impl`块中的函数需要类似`ref self:ComponentState<TContractState>`（用于状态修改函数）的参数 或`self:@ComponentState<TContractState>`（用于只读函数）。这使得 impl 基于泛型 `TContractState`，允许我们在任何合约中使用该组件。

source: ### Example: an Ownable component
zh_cn: ### 示例：一个 Ownable 组件

source: > ⚠️ The example shown below has not been audited and is not intended for > production use. The authors are not responsible for any damages caused by the > use of this code.
zh_cn: > ⚠️ 下面显示的示例尚未经过审核，不应适用于 > 产品之中。作者对因 > 使用此代码产生的任何问题概不负责。

source: The interface of the Ownable component, defining the methods available externally to manage ownership of a contract, would look like this:
zh_cn: Ownable 组件的接口，定义的用于管理合约所有权外部可用方法如下所示：

source: This syntax is actually quite similar to the syntax used for contracts. The only differences relate to the `#[embeddable_as]` attribute above the impl and the genericity of the impl block that we will dissect in details.
zh_cn: 这种语法实际上与用于合约的语法非常相似。 唯一的差异与 impl 上方的 `#[embeddable_as]` 属性有关。 我们将详细剖析的 impl 块的泛用性。

source: As you can see, our component has two `impl` blocks: one corresponding to the implementation of the interface trait, and one containing methods that should not be exposed externally and are only meant for internal use. Exposing the `assert_only_owner` as part of the interface wouldn't make sense, as it's only meant to be used internally by a contract embedding the component.
zh_cn: 正如你所看到的，我们的组件有两个 `impl` 块： 一个对应于接口trait的实现，另一个包含不暴露在外部，仅供内部使用方法。 把`assert_only_owner`暴露出来作为接口的一部分是没有意义的， 因为它只是旨在由嵌入组件的合约在内部使用。

source: ## A closer look at the `impl` block
zh_cn: ## 进一步研究 `impl` 块

source: The `#[embeddable_as]` attribute is used to mark the impl as embeddable inside a contract. It allows us to specify the name of the impl that will be used in the contract to refer to this component. In this case, the component will be referred to as `Ownable` in contracts embedding it.
zh_cn: `#[embeddable_as]`属性用于将 impl 标记为可嵌入到合约。 它允许我们指定将在合约中引用此组件。 在这种情况下，组件将在嵌入它的合约中被视为`Ownable` 。

source: The implementation itself is generic over `ComponentState<TContractState>`, with the added restriction that `TContractState` must implement the `HasComponent<T>` trait. This allows us to use the component in any contract, as long as the contract implements the `HasComponent` trait. Understanding this mechanism in details is not required to use components, but if you're curious about the inner workings, you can read more in the [Components under the hood](./ch99-01-05-01-components-under-the-hood.md) section.
zh_cn: 实现本身是泛型的 `ComponentState<TContractState>`， 有着`TContractState` 必须实现`HasComponent<T>` trait的附加限制。 这允许我们在任何实现了`HasComponent` trait的合约中中使用该组件。 使用组件其实不需要你了解此机制的工作原理，但如果您对内部感到好奇，您可以阅读 [组件工作原理](./ch99-01-05-01-components-under-the-hood.md) 部分来学习更多。

source: One of the major differences from a regular smart contract is that access to storage and events is done via the generic `ComponentState<TContractState>` type and not `ContractState`. Note that while the type is different, accessing storage or emitting events is done similarly via `self.storage_var_name.read()` or `self.emit(...).`
zh_cn: 这里与常规智能合约的主要区别之一是访问 存储和事件是通过通用的`ComponentState<TContractState>`类型完成的， 而不是`ContractState`。请注意，虽然类型不同，但访问 存储或发出事件都是是通过类似 `self.storage_var_name.read()`或 `self.emit(...)`实现的。

source: > Note: To avoid the confusion between the embeddable name and the impl name, we > recommend keeping the suffix `Impl` in the impl name.
zh_cn: > 注意：为避免混淆嵌入的名称和 impl 名称，我们 > 建议在 impl 名称中保留后缀“Impl”。

source: ## Migrating a Contract to a Component
zh_cn: ## 将合约迁移到组件

source: Since both contracts and components share a lot of similarities, it's actually very easy to migrate from a contract to a component. The only changes required are:
zh_cn: 由于合约和组件有很多相似之处，因此实际上 从合约迁移到组件非常容易。唯一需要的更改 是：

source: - Adding the `#[starknet::component]` attribute to the module. - Adding the `#[embeddable_as(name)]` attribute to the `impl` block that will be embedded in another contract. - Adding generic parameters to the `impl` block: - Adding `TContractState` as a generic parameter. - Adding `+HasComponent<TContractState>` as an impl restriction. - Changing the type of the `self` argument in the functions inside the `impl` block to `ComponentState<TContractState>` instead of `ContractState`.
zh_cn: - 将 `#[starknet::component]` 属性添加到模块中。 - 将 `#[embeddable_as(name)]` 属性添加到 `impl` 块中，该块将嵌入到另一个合约中。 - 将泛型参数添加到`impl`块： - 添加 'TContractState' 作为泛型参数。 - 添加 ·+HasComponent<TContractState>· 作为 impl 限制。 - 在`impl`块的函数中更改`self`参数的类型， 设置为`ComponentState<TContractState>`用以取代`ContractState`。

source: For traits that do not have an explicit definition and are generated using `#[generate_trait]`, the logic is the same - but the trait is generic over `TContractState` instead of `ComponentState<TContractState>`, as demonstrated in the example with the `InternalTrait`.
zh_cn: 对于那些没有明确定义且使用 `#[generate_trait]`的trait，逻辑是相同的 - 但这些trait是`TContractState`而不是`ComponentState<TContractState>`的泛型， 如上面例子中就带有`InternalTrait`。

source: ## Using components inside a contract
zh_cn: ## 在合约中使用组件

source: The major strength of components is how it allows reusing already built primitives inside your contracts with a restricted amount of boilerplate. To integrate a component into your contract, you need to:
zh_cn: 组件的主要优势在于它允许你在合约中的重复使用已经构建的组件原语， 且只需要相当少的模版代码。 将组件集成到您的合约中，您需要：

source: 1. Declare it with the `component!()` macro, specifying 1. The path to the component `path::to::component`. 2. The name of the variable in your contract's storage referring to this component's storage (e.g. `ownable`). 3. The name of the variant in your contract's event enum referring to this component's events (e.g. `OwnableEvent`). 2. Add the path to the component's storage and events to the contract's `Storage` and `Event`. They must match the names provided in step 1 (e.g. `ownable: ownable_component::Storage` and `OwnableEvent: ownable_component::Event`). The storage variable **MUST** be annotated with the `#[substorage(v0)]` attribute. 3. Embed the component's logic defined inside your contract, by instantiating the component's generic impl with a concrete `ContractState` using an impl alias. This alias must be annotated with `#[abi(embed_v0)]` to externally expose the component's functions. As you can see, the InternalImpl is not marked with `#[abi(embed_v0)]`. Indeed, we don't want to expose externally the functions defined in this impl. However, we might still want to access them internally.
zh_cn: 1. 用 `component!()` 宏，指定 1. 组件的路径 `path::to::component` 。 2. 合约存储中变量的名称，引用此 组件的存储（例如`ownable`）。 3. 合约事件枚举中变体的名称，引用此 组件的事件（例如`OwnableEvent`）。 2. 将组件存储的路径和事件添加到合约的 `Storage` 与 `Event`中。它们必须与步骤 1 中提供的名称匹配（例如 `ownable: ownable_component::Storage` and `OwnableEvent: ownable_component::Event`）。 存储变量 **必须** 用 `#[substorage(v0)]`属性进行标注 3. 要将组件的逻辑嵌入到合约中， 可以通过使用了impl别名的一个具体的 `ContractState`， 来实例化一个组件的泛型 impl 。 此别名必须用 `#[abi(embed_v0)]`标注，来将组件函数暴露给外部。 如您所见，内部impl 未标有 `#[abi(embed_v0)]`。 事实上，我们不想从外部公开该impl其中定义的函数 但是，我们可能仍希望在内部访问它们。

source: For example, to embed the `Ownable` component defined above, we would do the following:
zh_cn: 例如，要嵌入上面定义的`Ownable` 组件，我们将执行：

source: The component's logic is now seamlessly part of the contract! We can interact with the components functions externally by calling them using the `IOwnableDispatcher` instantiated with the contract's address.
zh_cn: 组件的逻辑现在无缝地成为合约的一部分！ 我们可以通过随着合约实例化的`IOwnableDispatcher` 与组件函数互动。

source: ## Stacking Components for Maximum Composability
zh_cn: ## 堆叠组件以实现最大的可组合性

source: The composability of components really shines when combining multiple of them together. Each adds its features onto the contract. You will be able to rely on [Openzeppelin's](https://github.com/OpenZeppelin/cairo-contracts) future implementation of components to quickly plug-in all the common functionalities you need a contract to have.
zh_cn: 当组合多个组件时，组件的可组合性将大放异彩。 每个组件都将其功能添加到合约中。 以后您将可以通过依赖 [Openzeppelin's](https://github.com/OpenZeppelin/cairo-contracts) 的 组件实现以快速插入你所需的合约所有常用功能。

source: Developers can focus on their core contract logic while relying on battle-tested and audited components for everything else.
zh_cn: 开发人员可以专注于他们的核心合约逻辑， 同时在其他部分依靠经过实战考验的逻辑并经过审核的组件。

source: Components can even [depend](./ch99-01-05-02-component-dependencies.md) on other components by restricting the `TContractstate` they're generic on to implement the trait of another component. Before we dive into this mechanism, let's first look at [how components work under the hood](./ch99-01-05-01-components-under-the-hood).
zh_cn: 组件甚至可以 [依赖](./ch99-01-05-02-component-dependencies.md) 其他组件， 只要另一个组件通过了`TContractstate`这个泛型。 在我们深入研究这个机制之前，让我们先看看[深入理解组件如何工作](./ch99-01-05-01-components-under-the-hood)。

source: ## Troubleshooting
zh_cn: ## 疑难解答

source: You might encounter some errors when trying to implement components. Unfortunately, some of them lack meaningful error messages to help debug. This section aims to provide you with some pointers to help you debug your code.
zh_cn: 尝试实现组件时可能会遇到一些错误。 不幸的是，其中一些错误缺少有意义的错误消息来帮助调试。 这部分旨在为您提供一些指导来帮助您调试代码。

source: - `Trait not found. Not a trait.` This error can occur when you're not importing the component's impl block correctly in your contract. Make sure to respect the following syntax: ```rust #[abi(embed_v0)] impl IMPL_NAME = upgradeable::EMBEDDED_NAME<ContractState> ``` Referring to our previous example, this would be: ```rust #[abi(embed_v0)] impl OwnableImpl = upgradeable::Ownable<ContractState> ``` - `Plugin diagnostic: name is not a substorage member in the contract's Storage. Consider adding to Storage: (...)` The compiler helps you a lot debugging this by giving you recommendation on the action to take. Basically, you forgot to add the component's storage to your contract's storage. Make sure to add the path to the component's storage annotated with the `#[substorage(v0)]` attribute to your contract's storage. - `Plugin diagnostic: name is not a nested event in the contract's Event enum. Consider adding to the Event enum:` Similar to the previous error, the compiler, you forgot to add the component's events to your contract's events. Make sure to add the path to the component's events to your contract's events. - Components functions are not accessible externally This can happen if you forgot to annotate the component's impl block with `#[abi(embed_v0)]`. Make sure to add this annotation when embedding the component's impl in your contract.
zh_cn: - `Trait not found. Not a trait.` 当您未正确的在合约中导入组件的 impl 块时， 可能会发生此错误。请确保遵循了以下语法： ```rust #[abi(embed_v0)] impl IMPL_NAME = upgradeable::EMBEDDED_NAME<ContractState> ``` 参考我们之前的示例，这里应该写成： ```rust #[abi(embed_v0)] impl OwnableImpl = upgradeable::Ownable<ContractState> ``` - `Plugin diagnostic: name is not a substorage member in the contract's Storage. Consider adding to Storage: (...)` 在您调试时，编译器给出的建议操作能够起到很大的作用。 基本上，这条错误表示您忘记将组件的存储添加到 合约的存储中。使用`#[substorage(v0)]`属性标注， 确保将其添加到到合约的存储中。 - `Plugin diagnostic: name is not a nested event in the contract's Event enum. Consider adding to the Event enum:` 与前面的错误类似，编译器提醒您忘记添加组件的 事件到合约的事件中。确保将组件事件路径添加到合约的事件中。 - Components functions are not accessible externally 这会发生在您忘了使用`#[abi(embed_v0)]`来标注impl块时。 请确保在嵌入组件时在合约的impl块上用此标注。

source: # Components under the hood
zh_cn: # 深入了解组件

source: Components provide powerful modularity to Starknet contracts. But how does this magic actually happen behind the scenes?
zh_cn: 组件为 Starknet 合约提供了强大的模块化。但在这个魔术的背后是什么原理呢？

source: This chapter will dive deep into the compiler internals to explain the mechanisms that enable component composability.
zh_cn: 本章将深入探讨编译器的内部结构，以解释 实现组件可组合性的机制。

source: ## A Primer on Embeddable Impls
zh_cn: ## 嵌入式实现入门

source: An impl of a Starknet interface trait (marked with `#[starknet::interface]`) can be made embeddable. Embeddable impls can be injected into any contract, adding new entry points and modifying the ABI of the contract.
zh_cn: 一个实现了Starknet 接口trait（标有`#[starknet::interface]`）的impl是可嵌入的。 可嵌入的impl可以注入到任何合约中，这会添加新的入口点以及改变合约的 ABI。

source: Now that we’re more familiar with the embedding mechanism, we can now see how components build on this.
zh_cn: 现在我们对嵌入机制更加熟悉了，我们可以看到组件如何在此基础上构建。

source: ## Inside Components: Generic Impls
zh_cn: ## 内部组件：泛型实现
