Repository: cairo-book/cairo-book
Catalog: po/*.po
Languages: es, id, ko, zh_cn

source: In Cairo, you can convert scalar types from one type to another by using the `try_into` and `into` methods provided by the `TryInto` and `Into` traits from the core library.
ko: 카이로에서는 코어 라이브러리에서 제공하는 `TryInto` 및 `Into` 특성을 사용하여 `try_into` 및 `into` 메서드를 사용하여 하나의 유형에서 다른 유형으로 스칼라 유형을 변환할 수 있습니다.

source: The `try_into` method allows for safe type conversion when the target type might not fit the source value. Keep in mind that `try_into` returns an `Option<T>` type, which you'll need to unwrap to access the new value.
id: Metode `try_into` memungkinkan untuk konversi tipe yang aman ketika tipe target mungkin tidak cocok dengan nilai sumber. Ingatlah bahwa `try_into` mengembalikan tipe `Option<T>`, yang perlu Anda unwrap untuk mengakses nilai baru.
ko: `try_into` 메서드는 대상 유형이 소스 값에 맞지 않을 수 있을 때 안전한 형 변환을 가능하게 합니다. `try_into`가 `Option<T>` 유형을 반환한다는 것을 염두에 두세요. 이를 언랩하여 새 값에 액세스해야 합니다.

source: On the other hand, the `into` method can be used for type conversion when success is guaranteed, such as when the source type is smaller than the destination type.
id: Di sisi lain, metode `into` dapat digunakan untuk konversi tipe ketika keberhasilan dijamin, seperti ketika tipe sumber lebih kecil dari tipe tujuan.
ko: 한편, 'into' 메서드는 소스 타입이 대상 타입보다 작을 때와 같이 성공이 보장된 경우에 타입 캐스팅에 사용될 수 있습니다.

source: To perform the conversion, call `var.into()` or `var.try_into()` on the source value to convert it to another type. The new variable's type must be explicitly defined, as demonstrated in the example below.
id: Untuk melakukan konversi, panggil `var.into()` atau `var.try_into()` pada nilai sumber untuk mengubahnya menjadi tipe lain. Tipe variabel baru harus didefinisikan secara eksplisit, seperti yang ditunjukkan dalam contoh di bawah ini.
ko: 변환을 수행하려면 소스 값에 `var.into()` 또는 `var.try_into()`를 호출하여 다른 유형으로 캐스팅해야 합니다. 새 변수의 유형은 명시적으로 정의되어야 하며, 아래 예시에서 보여진 것처럼 되어야 합니다.

source: // Since a felt252 might not fit in a u8, we need to unwrap the Option<T> type
id: // Karena felt252 mungkin tidak muat dalam u8, kita perlu melepaskan tipe Option<T>
ko: // felt252가 u8에 맞지 않을 수 있으므로 Option<T> 유형을 풀어야 합니다.

source: // As a felt252 is smaller than a u256, we can use the into() method
id: // Karena felt252 lebih kecil dari u256, kita dapat menggunakan metode into()
ko: // felt252가 u256보다 작기 때문에 into() 메서드를 사용할 수 있습니다.

source: The Tuple Type
id: Tipe Data Tuple
ko: 튜플 타입

source: A _tuple_ is a general way of grouping together a number of values with a variety of types into one compound type. Tuples have a fixed length: once declared, they cannot grow or shrink in size.
id: _tuple_ adalah cara umum untuk mengelompokkan sejumlah nilai dengan berbagai jenis ke dalam satu tipe data gabungan. Tupel memiliki panjang tetap: setelah dideklarasikan, mereka tidak dapat tumbuh atau menyusut dalam ukuran.
ko: 튜플은 여러 가지 타입의 값들을 하나의 복합 타입으로 묶는 일반적인 방법입니다. 튜플은 고정된 길이를 가지고 있습니다: 한 번 선언되면 크기를 늘리거나 줄일 수 없습니다.

source: We create a tuple by writing a comma-separated list of values inside parentheses. Each position in the tuple has a type, and the types of the different values in the tuple don’t have to be the same. We’ve added optional type annotations in this example:
id: Kita membuat sebuah tupel dengan menulis daftar nilai yang dipisahkan oleh koma di dalam tanda kurung. Setiap posisi dalam tupel memiliki tipe, dan tipe dari nilai-nilai yang berbeda dalam tupel tidak harus sama. Kami telah menambahkan anotasi tipe opsional dalam contoh ini:
ko: 우리는 튜플을 만들 때 괄호 안에 쉼표로 구분된 값들의 목록을 작성합니다. 튜플의 각 위치는 타입을 가지고 있으며, 튜플 내 다른 값들의 타입은 동일할 필요가 없습니다. 이 예시에서는 선택적인 타입 주석을 추가했습니다.

source: The variable `tup` binds to the entire tuple because a tuple is considered a single compound element. To get the individual values out of a tuple, we can use pattern matching to destructure a tuple value, like this:
id: Variabel `tup` terikat pada seluruh tupel karena tupel dianggap sebagai satu elemen gabungan. Untuk mendapatkan nilai-nilai individual dari sebuah tupel, kita dapat menggunakan pola pencocokan untuk mendestruksi nilai tupel, seperti ini:
ko: 변수 `tup`은 튜플 전체에 바인딩됩니다. 튜플은 단일 복합 요소로 간주되기 때문입니다. 튜플에서 개별 값들을 가져오려면, 이와 같이 패턴 매칭을 사용하여 튜플 값을 해체할 수 있습니다:

source: "y is 6!"
ko: "y는 6입니다!"

source: This program first creates a tuple and binds it to the variable `tup`. It then uses a pattern with `let` to take `tup` and turn it into three separate variables, `x`, `y`, and `z`. This is called _destructuring_ because it breaks the single tuple into three parts. Finally, the program prints `y is six` as the value of `y` is `6`.
id: Program ini pertama-tama membuat tupel dan mengikatnya pada variabel `tup`. Kemudian, menggunakan pola dengan `let` untuk mengambil `tup` dan mengubahnya menjadi tiga variabel terpisah, yaitu `x`, `y`, dan `z`. Ini disebut _destructuring_ karena memecah tupel tunggal menjadi tiga bagian. Akhirnya, program mencetak `y is six` karena nilai `y` adalah `6`.
ko: 이 프로그램은 먼저 튜플을 생성하고 변수 `tup`에 바인딩합니다. 그런 다음 `let`을 사용하여 `tup`을 가져와 `x`, `y`, `z` 세 개의 별도 변수로 변환하는 패턴을 사용합니다. 이것을 _해체_ 라고 부르는데, 이는 단일 튜플을 세 부분으로 나누기 때문입니다. 마지막으로 프로그램은 `y is six`를 출력합니다. `y`의 값이 `6`이기 때문입니다.

source: We can also declare the tuple with value and types, and destructure it at the same time. For example:
ko: 우리는 값과 타입을 가진 튜플을 선언하고 동시에 해체할 수도 있습니다. 예를 들면:

source: The unit type ()
id: Tipe Unit ()
ko: 단위 유형 ()

source: A _unit type_ is a type which has only one value `()`. It is represented by a tuple with no elements. Its size is always zero, and it is guaranteed to not exist in the compiled code.
id: _Tipe unit_ adalah tipe yang hanya memiliki satu nilai `()`. Ini direpresentasikan oleh sebuah tupel tanpa elemen. Ukurannya selalu nol, dan dipastikan tidak ada dalam kode yang telah dikompilasi.
ko: 유닛 유형은 단 하나의 값 `()`을 가지는 유형입니다. 요소가 없는 튜플로 표현됩니다. 크기는 항상 0이며, 컴파일된 코드에는 존재하지 않음이 보장됩니다.

source: Functions are prevalent in Cairo code. You’ve already seen one of the most important functions in the language: the `main` function, which is the entry point of many programs. You’ve also seen the `fn` keyword, which allows you to declare new functions.
id: Fungsi-fungsi banyak digunakan dalam kode Cairo. Anda sudah melihat salah satu fungsi yang paling penting dalam bahasa ini: fungsi `main`, yang merupakan titik masuk dari banyak program. Anda juga sudah melihat kata kunci `fn`, yang memungkinkan Anda mendeklarasikan fungsi baru.
ko: 기능은 카이로 코드에서 흔히 볼 수 있습니다. 이미 언어에서 가장 중요한 기능 중 하나인 `main` 함수를 보았습니다. 이 함수는 많은 프로그램의 진입점입니다. 또한 새로운 함수를 선언할 수 있도록 하는 `fn` 키워드도 보았습니다.

source: Cairo code uses _snake case_ as the conventional style for function and variable names, in which all letters are lowercase and underscores separate words. Here’s a program that contains an example function definition:
id: Kode Cairo menggunakan _snake case_ sebagai gaya konvensional untuk nama fungsi dan variabel, di mana semua huruf ditulis dalam huruf kecil dan garis bawah memisahkan kata-kata. Berikut adalah program yang berisi contoh definisi fungsi:
ko: 카이로 코드는 함수와 변수 이름에 대해 관례적으로 _스네이크 케이스_ 를 사용합니다. 이는 모든 글자가 소문자이고 밑줄로 단어가 구분되는 스타일입니다. 다음은 예제 함수 정의를 포함하는 프로그램입니다:

source: "Another function."
ko: "또 다른 기능."

source: We define a function in Cairo by entering `fn` followed by a function name and a set of parentheses. The curly brackets tell the compiler where the function body begins and ends.
id: Kita mendefinisikan fungsi di Cairo dengan menuliskan `fn` diikuti oleh nama fungsi dan seperangkat tanda kurung. Kurung kurawal memberitahu kompiler di mana tubuh fungsi dimulai dan diakhiri.
ko: 카이로에서 함수를 정의할 때는 함수 이름 뒤에 괄호 집합을 입력하는 `fn`을 사용합니다. 중괄호는 컴파일러에게 함수 본문이 어디에서 시작하고 끝나는지 알려줍니다.

source: We can call any function we’ve defined by entering its name followed by a set of parentheses. Because `another_function` is defined in the program, it can be called from inside the `main` function. Note that we defined `another_function` _before_ the `main` function in the source code; we could have defined it after as well. Cairo doesn’t care where you define your functions, only that they’re defined somewhere in a scope that can be seen by the caller.
id: Kita dapat memanggil setiap fungsi yang telah kita definisikan dengan menuliskan namanya diikuti oleh seperangkat tanda kurung. Karena `another_function` didefinisikan dalam program, itu dapat dipanggil dari dalam fungsi `main`. Perhatikan bahwa kita mendefinisikan `another_function` _sebelum_ fungsi `main` dalam kode sumber; kita juga bisa mendefinisikannya setelahnya. Cairo tidak mempermasalahkan di mana Anda mendefinisikan fungsi Anda, yang penting adalah bahwa mereka didefinisikan di suatu tempat dalam cakupan yang dapat terlihat oleh pemanggil.
ko: 우리는 정의한 모든 함수를 이름 뒤에 괄호 집합을 입력하여 호출할 수 있습니다. `another_function`이 프로그램에서 정의되었기 때문에 `main` 함수 내부에서 호출할 수 있습니다. 소스 코드에서 `main` 함수보다 `another_function`을 _앞에_ 정의했음을 유의해야 합니다; 뒤에 정의해도 괜찮습니다. 카이로는 함수를 정의하는 위치에 상관하지 않고, 호출자가 볼 수 있는 범위 내에서 정의되어 있다면 됩니다.

source: Let’s start a new project with Scarb named _functions_ to explore functions further. Place the `another_function` example in _src/lib.cairo_ and run it. You should see the following output:
id: Mari kita mulai proyek baru dengan Scarb yang diberi nama _functions_ untuk menjelajahi fungsi lebih lanjut. Tempatkan contoh `another_function` di _src/lib.cairo_ dan jalankannya. Anda seharusnya melihat output berikut:
ko: Scarb라는 이름의 _functions_ 로 새 프로젝트를 시작하여 함수를 더 탐구해 봅시다. `another_function` 예제를 _src/lib.cairo_ 에 배치하고 실행하세요. 다음 출력이 표시됩니다:

source: The lines execute in the order in which they appear in the `main` function. First the “Hello, world!” message prints, and then `another_function` is called and its message is printed.
id: Baris-baris tersebut dieksekusi sesuai dengan urutan tampilan dalam fungsi `main`. Pertama, pesan "Hello, world!" dicetak, dan kemudian `another_function` dipanggil dan pesannya dicetak.
ko: `main` 함수에 나타나는 순서대로 라인이 실행됩니다. 먼저 "Hello, world!" 메시지가 출력되고, 그 후에 `another_function`이 호출되어 해당 메시지가 출력됩니다.

source: Parameters
id: Parameter
ko: 매개변수

source: We can define functions to have _parameters_, which are special variables that are part of a function’s signature. When a function has parameters, you can provide it with concrete values for those parameters. Technically, the concrete values are called _arguments_, but in casual conversation, people tend to use the words _parameter_ and _argument_ interchangeably for either the variables in a function’s definition or the concrete values passed in when you call a function.
id: Kita dapat mendefinisikan fungsi dengan _parameter_, yang merupakan variabel khusus yang merupakan bagian dari tanda tangan fungsi. Ketika sebuah fungsi memiliki parameter, Anda dapat memberikannya nilai konkret untuk parameter-parameter tersebut. Secara teknis, nilai konkret disebut _argument_, tetapi dalam percakapan sehari-hari, orang cenderung menggunakan kata _parameter_ dan _argument_ secara bergantian baik untuk variabel dalam definisi fungsi atau nilai konkret yang dilewatkan saat Anda memanggil fungsi.
ko: 함수를 _매개변수_ 를 가지도록 정의할 수 있습니다. 매개변수는 함수의 서명 부분에 속하는 특별한 변수들입니다. 함수에 매개변수가 있을 때, 해당 매개변수에 구체적인 값을 제공할 수 있습니다. 엄밀히 말하면, 구체적인 값들을 _인수_ 라고 부르지만 일상 대화에서는 함수의 정의에 있는 변수들이나 함수를 호출할 때 전달되는 구체적인 값들을 나타낼 때 _매개변수_ 와 _인수_ 라는 용어를 서로 바꿔 사용하는 경향이 있습니다.

source: In this version of `another_function` we add a parameter:
es: En esta versión de `another_function` añadimos un parámetro:
id: Pada versi `another_function` ini, kita menambahkan sebuah parameter:
ko: `another_function`의 이 버전에서는 매개변수를 추가합니다:
zh_cn: 在这个版本的 `another_function` 中，我们添加了一个参数：

source: Try running this program; you should get the following output:
es: Intente ejecutar este programa; debería obtener la siguiente salida:
id: Coba jalankan program ini; Anda seharusnya mendapatkan output berikut:
ko: 이 프로그램을 실행해보세요; 다음과 같은 출력을 얻어야 합니다:
zh_cn: 尝试运行这个程序；你应该得到以下输出：

source: The declaration of `another_function` has one parameter named `x`. The type of `x` is specified as `felt252`. When we pass `5` in to `another_function`, the `println!` macro puts `5` where the pair of curly brackets containing `x` was in the format string.
ko: `another_function`의 선언은 `x`라는 하나의 매개변수를 가지고 있습니다. `x`의 유형은 `felt252`로 지정되어 있습니다. `another_function`에 `5`를 전달하면 `println!` 매크로가 형식 문자열에 있는 `x`를 포함한 중괄호 쌍 자리에 `5`를 넣습니다.

source: In function signatures, you _must_ declare the type of each parameter. This is a deliberate decision in Cairo’s design: requiring type annotations in function definitions means the compiler almost never needs you to use them elsewhere in the code to figure out what type you mean. The compiler is also able to give more helpful error messages if it knows what types the function expects.
id: Dalam fungsi signature, Anda _harus_ mendeklarasikan tipe setiap parameter. Ini adalah keputusan yang disengaja dalam desain Cairo: memerlukan anotasi tipe dalam definisi fungsi berarti hampir tidak pernah compiler memerlukan Anda untuk menggunakannya di tempat lain dalam kode untuk mengetahui jenis data apa yang Anda maksud. Compiler juga dapat memberikan pesan kesalahan yang lebih membantu jika mengetahui tipe data yang diharapkan oleh fungsi.
ko: 함수 시그니처에서는 각 매개변수의 유형을 _반드시_ 선언해야 합니다. 이는 Cairo의 설계에서 의도적으로 결정된 사항입니다: 함수 정의에서 유형 주석을 요구함으로써 컴파일러가 다른 곳에서 유형을 알아내기 위해 거의 사용할 필요가 없다는 것을 의미합니다. 또한 컴파일러는 함수가 어떤 유형을 기대하는지 알고 있을 때 더 유용한 오류 메시지를 제공할 수 있습니다.

source: When defining multiple parameters, separate the parameter declarations with commas, like this:
id: Ketika mendefinisikan beberapa parameter, pisahkan deklarasi parameter dengan koma, seperti ini:
ko: 여러 매개변수를 정의할 때는 매개변수 선언을 쉼표로 구분하여 작성합니다. 예를 들면,

source: "The measurement is: {value}{unit_label}"
ko: "측정값은: {value}{unit_label}"

source: This example creates a function named `print_labeled_measurement` with two parameters. The first parameter is named `value` and is a `u128`. The second is named `unit_label` and is of type `ByteArray` - Cairo's internal type to represent string literals. The function then prints text containing both the `value` and the `unit_label`.
ko: 이 예제는 두 개의 매개변수를 가진 `print_labeled_measurement` 함수를 생성합니다. 첫 번째 매개변수는 `value`라는 이름을 가지며 `u128` 형식입니다. 두 번째 매개변수는 `unit_label`이라는 이름을 가지며 `ByteArray` 형식입니다 - 문자열 리터럴을 나타내는 Cairo의 내부 형식입니다. 그런 다음 함수는 `value`와 `unit_label`을 모두 포함하는 텍스트를 출력합니다.

source: Let’s try running this code. Replace the program currently in your _functions_ project’s _src/lib.cairo_ file with the preceding example and run it using `scarb cairo-run`:
id: Mari coba menjalankan kode ini. Gantilah program yang saat ini ada dalam file _src/lib.cairo_ proyek _functions_ Anda dengan contoh sebelumnya dan jalankannya menggunakan `scarb cairo-run`:
ko: 이 코드를 실행해 봅시다. 이전 예제로 현재 _functions_ 프로젝트의 _src/lib.cairo_ 파일에 있는 프로그램을 대체하고 `scarb cairo-run`을 사용하여 실행해 보세요.

source: Because we called the function with `5` as the value for value and `"h"` as the value for `unit_label`, the program output contains those values.
ko: 함수를 `5`로 값으로 호출하고 `unit_label`에 `"h"`를 값으로 전달했기 때문에 프로그램 출력에는 해당 값이 포함되어 있습니다.

source: Named parameters
id: Parameter Dengan Nama
ko: 이름이 지정된 매개변수

source: In Cairo, named parameters allow you to specify the names of arguments when you call a function. This makes the function calls more readable and self-descriptive. If you want to use named parameters, you need to specify the name of the parameter and the value you want to pass to it. The syntax is `parameter_name: value`. If you pass a variable that has the same name as the parameter, you can simply write `:parameter_name` instead of `parameter_name: variable_name`.
id: Di Cairo, parameter dengan nama memungkinkan Anda menentukan nama argumen saat Anda memanggil suatu fungsi. Hal ini membuat pemanggilan fungsi lebih mudah dibaca dan lebih deskriptif. Jika Anda ingin menggunakan parameter dengan nama, Anda perlu menentukan nama parameter dan nilai yang ingin Anda lewatkan kepadanya. Syntaxnya adalah `nama_parameter: nilai`. Jika Anda melewatkan variabel yang memiliki nama yang sama dengan parameter, Anda dapat hanya menulis `:nama_parameter` alih-alih `nama_parameter: nama_variabel`.
ko: 카이로에서는 명명된 매개변수를 사용하여 함수를 호출할 때 인수의 이름을 지정할 수 있습니다. 이렇게 하면 함수 호출이 더 가독성이 있고 자기 설명적이 됩니다. 명명된 매개변수를 사용하려면 매개변수의 이름과 전달하려는 값을 지정해야 합니다. 구문은 `매개변수_이름: 값`입니다. 매개변수와 같은 이름을 가진 변수를 전달하려면 `매개변수_이름: 변수_이름` 대신에 `:매개변수_이름`으로 간단히 작성할 수 있습니다.

source: Here is an example:
es: Aquí un ejemplo:
id: Berikut adalah contohnya:
ko: 다음은 예시입니다.
zh_cn: 下面是一个例子：

source: Statements and Expressions
id: Pernyataan dan Ekspresi
ko: 문장과 표현

source: Function bodies are made up of a series of statements optionally ending in an expression. So far, the functions we’ve covered haven’t included an ending expression, but you have seen an expression as part of a statement. Because Cairo is an expression-based language, this is an important distinction to understand. Other languages don’t have the same distinctions, so let’s look at what statements and expressions are and how their differences affect the bodies of functions.
id: Badan fungsi terdiri dari serangkaian pernyataan yang opsionalnya diakhiri dengan sebuah ekspresi. Sejauh ini, fungsi-fungsi yang telah kita bahas belum mencakup ekspresi di akhirnya, tetapi Anda telah melihat ekspresi sebagai bagian dari pernyataan. Karena Cairo adalah bahasa berbasis ekspresi, ini adalah perbedaan penting yang perlu dipahami. Bahasa lain tidak memiliki perbedaan yang sama, jadi mari kita lihat apa itu pernyataan dan ekspresi serta bagaimana perbedaan mereka memengaruhi badan fungsi.
ko: 함수 본문은 선택적으로 표현식으로 끝나는 일련의 문으로 구성됩니다. 지금까지 다룬 함수들은 끝 표현식을 포함하지 않았지만, 문의 일부로서 표현식을 보았습니다. 카이로는 표현식 중심 언어이기 때문에 이는 이해해야 할 중요한 구분입니다. 다른 언어들은 같은 구분을 가지고 있지 않으므로 문과 표현식이 무엇이며 이들의 차이가 함수 본문에 어떻게 영향을 미치는지 살펴봅시다.

source: **Statements** are instructions that perform some action and do not return a value.
id: **Pernyataan** adalah instruksi yang melakukan suatu tindakan dan tidak mengembalikan nilai.
ko: **Statements(문)**는 어떤 동작을 수행하고 값을 반환하지 않는 명령문입니다.

source: **Expressions** evaluate to a resultant value. Let’s look at some examples.
id: **Ekspresi** mengevaluasi menjadi nilai hasil. Mari kita lihat beberapa contoh.
ko: **표현식**은 결과값으로 평가됩니다. 몇 가지 예를 살펴보겠습니다.

source: We’ve actually already used statements and expressions. Creating a variable and assigning a value to it with the `let` keyword is a statement. In Listing 2-1, `let y = 6;` is a statement.
id: Sebenarnya, kita sudah menggunakan pernyataan dan ekspresi. Membuat variabel dan memberikan nilai kepadanya dengan kata kunci `let` adalah sebuah pernyataan. Pada Listing 2-1, `let y = 6;` adalah sebuah pernyataan.
ko: 우리는 실제로 이미 문장과 표현을 사용했습니다. 변수를 만들고 `let` 키워드를 사용하여 값을 할당하는 것은 문장입니다. 2-1 목록에서 `let y = 6;`는 문장입니다.

source: Listing 2-1: A `main` function declaration containing one statement
id: Listing 2-1: Deklarasi fungsi `main` yang berisi satu pernyataan
ko: 리스트 2-1: 하나의 문을 포함하는 `main` 함수 선언

source: Function definitions are also statements; the entire preceding example is a statement in itself.
id: Definisi fungsi juga termasuk pernyataan; seluruh contoh sebelumnya adalah sebuah pernyataan itu sendiri.
ko: 함수 정의는 또한 문장입니다; 앞서의 전체 예제는 그 자체로 문장입니다.

source: Statements do not return values. Therefore, you can’t assign a `let` statement to another variable, as the following code tries to do; you’ll get an error:
id: Pernyataan tidak mengembalikan nilai. Oleh karena itu, Anda tidak dapat memberikan nilai dari suatu pernyataan `let` ke variabel lain, seperti yang dicoba oleh kode berikut; Anda akan mendapatkan kesalahan:
ko: 문장은 값을 반환하지 않습니다. 따라서 다음 코드에서 시도하는 것처럼 `let` 문을 다른 변수에 할당할 수 없습니다. 오류가 발생합니다.

source: When you run this program, the error you’ll get looks like this:
es: Cuando ejecutes este programa, el error que obtendrás se verá así:
id: Ketika Anda menjalankan program ini, kesalahan yang akan Anda dapatkan akan terlihat seperti ini:
ko: 이 프로그램을 실행하면 발생하는 오류는 다음과 같이 보입니다:
zh_cn: 当你运行这个程序时，你将得到的错误看起来是这样：

source: The `let y = 6` statement does not return a value, so there isn’t anything for `x` to bind to. This is different from what happens in other languages, such as C and Ruby, where the assignment returns the value of the assignment. In those languages, you can write `x = y = 6` and have both `x` and `y` have the value `6`; that is not the case in Cairo.
id: Pernyataan `let y = 6` tidak mengembalikan nilai, sehingga tidak ada nilai yang dapat diikat oleh `x`. Ini berbeda dari apa yang terjadi di bahasa lain, seperti C dan Ruby, di mana hasil dari assignment adalah nilai dari assignment tersebut. Dalam bahasa-bahasa tersebut, Anda dapat menulis `x = y = 6` dan memiliki kedua `x` dan `y` bernilai `6`; hal ini tidak terjadi dalam Cairo.
ko: `let y = 6` 문은 값을 반환하지 않으므로 `x`에 바인딩할 것이 없습니다. 이는 C나 Ruby와 같은 다른 언어에서 발생하는 일과 다릅니다. 거기서는 할당이 할당의 값으로 반환됩니다. 그러한 언어에서는 `x = y = 6`을 작성하여 `x`와 `y`가 모두 `6`의 값을 가질 수 있습니다. 하지만 이는 Cairo에서는 그렇지 않습니다.

source: Expressions evaluate to a value and make up most of the rest of the code that you’ll write in Cairo. Consider a math operation, such as `5 + 6`, which is an expression that evaluates to the value `11`. Expressions can be part of statements: in Listing 2-1, the `6` in the statement `let y = 6;` is an expression that evaluates to the value `6`.
ko: 표현식은 값을 평가하고 카이로에서 작성할 대부분의 코드를 구성합니다. 수학 연산과 같은 것을 고려해보세요. `5 + 6`과 같은 것은 `11`이라는 값으로 평가되는 표현식입니다. 표현식은 문장의 일부가 될 수 있습니다. 예를 들어, 2-1 목록에서 `let y = 6;` 문장에서 `6`은 `6`이라는 값으로 평가되는 표현식입니다.

source: Calling a function is an expression since it always evaluates to a value: the function's explicit return value, if specified, or the 'unit' type `()` otherwise.
ko: 함수를 호출하는 것은 항상 값을 평가하기 때문에 표현식입니다: 함수의 명시적 반환 값(지정된 경우) 또는 그렇지 않으면 'unit' 유형 `()`입니다.

source: A new scope block created with curly brackets is an expression, for example:
ko: 중괄호로 생성된 새로운 스코프 블록은 표현식입니다. 예를 들어:

source: "The value of y is: {}"
ko: "y의 값은: {}"

source: This expression:
es: Esta expresión:
id: Expression ini:
ko: 이 표현:
zh_cn: 这个表达式：

source: is a block that, in this case, evaluates to `4`. That value gets bound to `y` as part of the `let` statement. Note that the `x + 1` line doesn’t have a semicolon at the end, which is unlike most of the lines you’ve seen so far. Expressions do not include ending semicolons. If you add a semicolon to the end of an expression, you turn it into a statement, and it will then not return a value. Keep this in mind as you explore function return values and expressions next.
id: adalah blok yang, dalam hal ini, mengevaluasi menjadi `4`. Nilai itu diikat ke `y` sebagai bagian dari pernyataan `let`. Perhatikan bahwa baris `x + 1` tidak memiliki titik koma di akhir, yang berbeda dari sebagian besar baris yang telah Anda lihat sejauh ini. Ekspresi tidak memasukkan titik koma di akhir. Jika Anda menambahkan titik koma di akhir ekspresi, Anda mengubahnya menjadi pernyataan, dan kemudian tidak akan mengembalikan nilai. Ingatlah ini saat Anda menjelajahi nilai kembalian fungsi dan ekspresi selanjutnya.
ko: 이 경우에는 `4`로 평가되는 블록입니다. 이 값은 `let` 문의 일부로 `y`에 바인딩됩니다. `x + 1` 라인에는 세미콜론이 없는 것에 주목하세요. 이는 지금까지 보았던 대부분의 라인과 다릅니다. 표현식에는 끝에 세미콜론이 포함되지 않습니다. 표현식 끝에 세미콜론을 추가하면 그것을 문으로 변환시키고, 그러면 값이 반환되지 않습니다. 다음에 함수 반환 값과 표현식을 탐색할 때 이를 염두에 두세요.

source: Functions with Return Values
id: Fungsi dengan Return Value
ko: 반환 값이 있는 함수
