Repository: cairo-book/cairo-book
Catalog: po/*.po
Languages: es, id, ko, zh_cn

source: The main error message, `Unexpected return type`, reveals the core issue with this code. The definition of the function `plus_one` says that it will return an `u32`, but statements don’t evaluate to a value, which is expressed by `()`, the unit type. Therefore, nothing is returned, which contradicts the function definition and results in an error.
es: El mensaje principal de error, `Unexpected return type`, revela el problema principal con este código. La definición de la función `plus_one` dice que devolverá un `u32`, pero las sentencias no se evalúan a un valor, lo cual se expresa por `()`, el tipo unit. Por lo tanto, no se devuelve nada, lo que contradice la definición de la función y resulta en un error.
zh_cn: 主要的错误信息 `Unexpected return type` 揭示了该代码的核心问题。 函数`plus_one` 的定义说它将返回一个 `u32` 类型的值，但是语句并不会返回一个值，而是给出了一个 `()`unit 类型。 因此，没有返回值与函数的定义相矛盾，导致了错误发生。

source: # Comments
es: # Comentarios
zh_cn: # 注释

source: In Cairo programs, you can include explanatory text within the code using comments. To create a comment, use the // syntax, after which any text on the same line will be ignored by the compiler.
es: En programas de Cairo, puedes incluir texto explicativo dentro del código mediante comentarios. Para crear un comentario, usa la sintaxis //, después de lo cual cualquier texto en la misma línea será ignorado por el compilador.
id: Dalam program Cairo, Anda dapat menyertakan teks penjelasan di dalam kode menggunakan komentar. Untuk membuat komentar, gunakan sintaks //, setelah itu segala teks pada baris yang sama akan diabaikan oleh kompiler.
zh_cn: 在 Cairo 程序中，你可以使用注释在代码中加入解释性的文本。 要创建一个注释，请使用 // 语法，之后同一行的任何文本都会被编译器忽略。

source: ## Control Flow
es: ## Control de Flujo
zh_cn: ## 控制流

source: ### `if` Expressions
es: ### Expresiones `if`
zh_cn: ### `if`表达式

source: It’s also worth noting that the condition in this code must be a bool. If the condition isn’t a bool, we’ll get an error.
es: También vale la pena señalar que la condición en este código debe ser un bool. Si la condición no es un bool, obtendremos un error.
id: Juga perlu dicatat bahwa kondisi dalam kode ini harus berupa tipe bool. Jika kondisinya bukan bool, kita akan mendapatkan kesalahan.
zh_cn: 还值得注意的是，这段代码中的条件必须是一个 `bool` 值。如果该条件不是 `bool` 值，我们会得到一个错误。

source: ### Handling Multiple Conditions with `else if`
es: ### Manejando múltiples condiciones con `else if`
zh_cn: ### 用`else if`处理多个条件

source: You can use multiple conditions by combining if and else in an else if expression. For example:
es: Puede usar múltiples condiciones combinando `if` y `else` en una expresión `else if`. Por ejemplo:
id: Anda dapat menggunakan beberapa kondisi dengan menggabungkan if dan else dalam suatu ekspresi else if. Contohnya:
zh_cn: 你可以通过在一个 else if 表达式中结合 if 和 else 来使用多个条件。比如说：

source: When this program executes, it checks each `if` expression in turn and executes the first body for which the condition evaluates to `true`. Note that even though `number - 2 == 1` is `true`, we don’t see the output `number minus 2 is 1'.print()`, nor do we see the `number not found` text from the `else` block. That’s because Cairo only executes the block for the first true condition, and once it finds one, it doesn’t even check the rest. Using too many `else if` expressions can clutter your code, so if you have more than one, you might want to refactor your code. [Chapter 6](./ch06-02-the-match-control-flow-construct.md) describes a powerful Cairo branching construct called `match` for these cases.
id: Ketika program ini dieksekusi, ia memeriksa setiap ekspresi `if` secara berurutan dan menjalankan blok pertama di mana kondisinya dinilai sebagai `true`. Perhatikan bahwa meskipun `number - 2 == 1` adalah `true`, kita tidak melihat keluaran `number minus 2 is 1'.print()`, dan tidak pula melihat teks `number not found` dari blok `else`. Hal ini karena Cairo hanya menjalankan blok untuk kondisi true pertama yang ditemuinya, dan begitu menemukannya, ia bahkan tidak memeriksa yang lainnya. Menggunakan terlalu banyak ekspresi `else if` dapat membuat kode menjadi berantakan, jadi jika Anda memiliki lebih dari satu, Anda mungkin ingin memperbaiki kode Anda. [Bab 6](./ch06-02-the-match-control-flow-construct.md) menjelaskan suatu konstruksi percabangan Cairo yang kuat yang disebut `match` untuk kasus-kasus seperti ini.
zh_cn: 执行该程序时，它会依次检查每个 `if` 表达式，并执行条件求值为 `true` 的第一个体。请注意，即使 `number - 2 == 1` 是 `true`，我们也看不到输出 `number minus 2 is 1'.print()` ，也看不到 `else` 块中的 `number not found` 文本。这是因为 Cairo 只执行第一个真条件的代码块，一旦找到一个真条件，就不会再检查其他条件。使用过多的 `else if` 表达式会使代码变得杂乱无章，所以如果你有一个以上的 `else if` 表达式，你可能需要重构你的代码。[Chapter 6](./ch06-02-the-match-control-flow-construct.md) 介绍了一种强大的Cairo语言分支结构，称为 "match"，用于处理这些情况。

source: ### Using `if` in a `let` statement
es: ### Usando `if` en una declaración `let`
zh_cn: ### 在 `let` 语句中使用 `if`

source: Because if is an expression, we can use it on the right side of a let statement to assign the outcome to a variable.
es: Dado que `if` es una expresión, podemos usarla en el lado derecho de una declaración `let` para asignar el resultado a una variable.
id: Karena `if` adalah suatu ekspresi, kita dapat menggunakannya di sisi kanan dari pernyataan `let` untuk menetapkan hasilnya ke suatu variabel.
zh_cn: 因为 if 是一个表达式，我们可以在 let 语句的右边使用它，将结果分配给一个变量。

source: The `number` variable will be bound to a value based on the outcome of the `if` expression. Which will be 5 here.
es: La variable `number` quedará ligada a un valor basado en el resultado de la expresión `if`. En este caso, será 5.
id: Variabel `number` akan diikat ke suatu nilai berdasarkan hasil dari ekspresi `if`. Yang akan menjadi 5 di sini.
zh_cn: `number` 变量将会绑定到表示 `if` 表达式结果的值上。这里将是 5。

source: ### Repetition with Loops
es: ### Repetición con bucles
zh_cn: ### 使用循环重复执行

source: It’s often useful to execute a block of code more than once. For this task, Cairo provides a simple loop syntax, which will run through the code inside the loop body to the end and then start immediately back at the beginning. To experiment with loops, let’s create a new project called loops.
es: A menudo es útil ejecutar un bloque de código más de una vez. Para esta tarea, Cairo proporciona una simple sintaxis de bucle, que recorrerá el código dentro del cuerpo del bucle hasta el final y luego comenzará inmediatamente de vuelta al principio. Para experimentar con bucles, creemos un nuevo proyecto llamado bucles.
id: Seringkali diperlukan untuk menjalankan suatu blok kode lebih dari sekali. Untuk tugas ini, Cairo menyediakan sintaks perulangan yang sederhana, yang akan menjalankan kode di dalam tubuh perulangan hingga akhir, lalu segera kembali ke awal. Untuk bereksperimen dengan perulangan, mari buat proyek baru yang disebut loops.
zh_cn: 多次执行同一段代码是很常用的，Cairo 为此提供了多种 循环（loops）。一个循环执行循环体中的代码直到结尾并紧接着回到开头继续执行。为了实验一下循环，让我们新建一个叫做 loops 的项目。

source: Cairo only has one kind of loop for now: `loop`.
es: Cairo sólo tiene un tipo de bucle por ahora: `loop`.
id: Saat ini, Cairo hanya memiliki satu jenis perulangan: `loop`.
zh_cn: Cairo 目前只有一种循环：`loop`。

source: #### Repeating Code with `loop`
es: #### Repetición de Código con `loop`
zh_cn: #### 使用 `loop` 重复执行代码

source: The `loop` keyword tells Cairo to execute a block of code over and over again forever or until you explicitly tell it to stop.
es: La palabra clave `loop` le dice a Cairo que ejecute un bloque de código una y otra vez para siempre o hasta que le digas explícitamente que pare.
zh_cn: `loop` 关键字告诉 Cairo 一遍又一遍地执行一段代码直到你明确要求停止。

source: As an example, change the _src/lib.cairo_ file in your _loops_ directory to look like this:
es: Por ejemplo, cambie el archivo _src/lib.cairo_ de su directorio _loops_ para que tenga el siguiente aspecto así:
zh_cn: 作为一个例子，将你的_loops_目录下的_src/lib.cairo_文件修改如下：

source: When we run this program, we’ll see `again!` printed over and over continuously until we stop the program manually, because the stop condition is never reached. While the compiler prevents us from writing programs without a stop condition (`break` statement), the stop condition might never be reached, resulting in an infinite loop. Most terminals support the keyboard shortcut <span class="keystroke">ctrl-c</span> to interrupt a program that is stuck in a continual loop. Give it a try:
es: Cuando ejecutamos este programa, veremos que se imprime `again!` una y otra vez continuamente hasta que detengamos el programa manualmente, porque la condición de parada nunca se cumple. Si bien el compilador nos impide escribir programas sin una condición de parada (`break`), es posible que la condición de parada nunca se cumpla, lo que resulta en un bucle infinito. La mayoría de las terminales admiten el atajo de teclado <span class="keystroke">ctrl-c</span> para interrumpir un programa que está atrapado en un bucle continuo. Pruébalo:
zh_cn: 当运行这个程序时，我们会看到程序不停的反复打印 `again!`，直到我们手动停止程序，因为程序从未达到停止条件。 虽然编译器阻止我们编写没有停止条件（`break`语句）的程序，但该停止条件可能永远不会达到，从而会程序导致无限循环。 大多数终端支持键盘快捷键 <span class=“keystroke”>ctrl-c</span> 来中断卡在无限循环的程序。试一试吧：

source: > Note: Cairo prevents us from running program with infinite loops by including a gas meter. The gas meter is a mechanism that limits the amount of computation that can be done in a program. By setting a value to the `--available-gas` flag, we can set the maximum amount of gas available to the program. Gas is a unit of measurement that expresses the computation cost of an instruction. When the gas meter runs out, the program will stop. In this case, the program panicked because it ran out of gas, as the stop condition was never reached. > It is particularly important in the context of smart contracts deployed on Starknet, as it prevents from running infinite loops on the network. > If you're writing a program that needs to run a loop, you will need to execute it with the `--available-gas` flag set to a value that is large enough to run the program.
zh_cn: > 注意：Cairo通过包含一个 gas 计量器来防止我们运行无限循环的程序。 gas 计量器是一种限制程序中可进行的计算量的机制。通过给 `--available-gas` 标志设置一个值，我们可以设置程序的最大可用 gas 量。gas 是一个计量单位，表示一条指令的计算成本。当设置的最大gas值耗尽时，程序将停止。在这种情况下，程序会抛出 gas 耗尽的错误(panic)，尽管从未达到停止条件。 > 对于部署在 Starknet 上的智能合约，它特别重要，因为它可以防止在网络上运行无限循环。 > 如果你正在编写一个需要运行循环的程序，你需要在执行时将 `--available-gas` 标志设置为一个足够大的值来运行该程序。

source: To break out of a loop, you can place the `break` statement within the loop to tell the program when to stop executing the loop. Let's fix the infinite loop by adding a making the stop condition `i > 10` reachable.
es: Para salir de un bucle, puedes colocar la instrucción `break` dentro del bucle para indicarle al programa cuándo detener la ejecución del bucle. Vamos a solucionar el bucle infinito haciendo que la condición de parada `i > 10` sea alcanzable.
zh_cn: 要退出循环，您可以在循环内部放置 `break` 语句，告诉程序何时停止循环。 我们可以通过在这个程序里加入可达的停止条件 `i > 10` ，来修复无限循环。

source: The `continue` keyword tells the program to go to the next iteration of the loop and to skip the rest of the code in this iteration. Let's add a `continue` statement to our loop to skip the `print` statement when `i` is equal to `5`.
es: La palabra clave `continue` le indica al programa que pase a la siguiente iteración del bucle y omita el resto del código en esta iteración. Agreguemos una instrucción `continue` a nuestro bucle para saltar la declaración `print` cuando `i` sea igual a `5`.
id: Kata kunci `continue` memberitahu program untuk melanjutkan ke iterasi berikutnya dari perulangan dan untuk melewati sisa kode dalam iterasi ini. Mari tambahkan pernyataan `continue` ke dalam perulangan kita untuk melewati pernyataan `print` ketika `i` sama dengan `5`.
zh_cn: 关键字 `continue` 告诉程序进入循环的下一个迭代，并跳过现在这个迭代中的其他代码。让我们给我们的循环添加一个`continue`语句，使得当`i`等于`5`时跳过`print`语句。

source: #### Returning Values from Loops
es: #### Devolución de Valores de Loops
zh_cn: #### 从循环中返回值

source: One of the uses of a `loop` is to retry an operation you know might fail, such as checking whether an operation has succeeded. You might also need to pass the result of that operation out of the loop to the rest of your code. To do this, you can add the value you want returned after the `break` expression you use to stop the loop; that value will be returned out of the loop so you can use it, as shown here:
es: Uno de los usos de un `loop` es reintentar una operación que sabes que puede fallar, como por ejemplo comprobar si una operación ha tenido éxito. También puede ser necesario pasar el resultado de esa operación fuera del bucle al resto del código. Para ello Para ello, puede añadir el valor que desea devolver después de la expresión `break` para detener el bucle; ese valor será devuelto fuera del bucle para que pueda utilizarlo, como se muestra aquí:
zh_cn: `loop` 的一个用例是重试可能会失败的操作，比如检查线程是否完成了任务。然而你 可能会需要将操作的结果传递给其它的代码。如果将返回值加入你用来停止循环的 `break` 表达式，它会被停止的循环返回，如下所示：

source: Before the loop, we declare a variable named `counter` and initialize it to `0`. Then we declare a variable named `result` to hold the value returned from the loop. On every iteration of the loop, we check whether the `counter` is equal to `10`, and then add `1` to the `counter` variable. When the condition is met, we use the `break` keyword with the value `counter * 2`. After the loop, we use a semicolon to end the statement that assigns the value to `result`. Finally, we print the value in `result`, which in this case is `20`.
es: Antes del bucle, declaramos una variable llamada `counter` y la inicializamos a `0`. Luego declaramos una variable llamada `resultado` para mantener el valor devuelto por el bucle. del bucle. En cada iteración del bucle, comprobamos si `counter` es igual a `10`, y añadimos `1` a la variable `counter`. Cuando se cumple la condición, utilizamos la palabra clave `break` con el valor `counter * 2`. Después del bucle, usamos un punto y coma para terminar la sentencia que asigna el valor a `resultado`. Finalmente el valor en `resultado`, que en este caso es `20`.
zh_cn: 在循环之前，我们声明一个名为 `counter` 的变量，并将其初始化为 `0`。然后我们声明一个名为 `result` 的变量，用来保存从循环中返回的值。 在循环的每一次迭代中，我们检查 `counter` 是否等于 `10`，然后在 `counter` 变量中加 `1`。当条件得到满足时，我们使用 `break` 关键字，其值为 `counter * 2`。在循环之后，我们用一个 分号来结束给`result`赋值的语句。最后，我们打印`result`中的值，在本例中是`20`。

source: ## Summary
es: ## Resumen
zh_cn: ## 总结

source: You made it! This was a sizable chapter: you learned about variables, data types, functions, comments, `if` expressions and loops! To practice with the concepts discussed in this chapter, try building programs to do the following:
zh_cn: 你成功了！这一章很重要：你学到了变量、数据类型、函数、注释、 `if` 表达式和循环！要练习本章讨论的概念、 尝试编写程序来完成下列操作：

source: - Generate the _n_-th Fibonacci number. - Compute the factorial of a number _n_.
es: - Generar el _n_-th número de Fibonacci. - Calcular el factorial de un número _n_.
zh_cn: - 产生第 _n_ 个斐波那契数。 - 计算一个数字的阶乘 _n_ 。

source: ## Common Collections
es: ## Colecciones Comunes
zh_cn: ## 常见集合

source: ## Arrays
zh_cn: ## 数组

source: An array is a collection of elements of the same type. You can create and use array methods by importing the `array::ArrayTrait` trait.
es: Un array es una colección de elementos del mismo tipo. Puedes crear y utilizar métodos de array importando el trait `array::ArrayTrait`.
id: Array adalah kumpulan elemen-elemen dengan tipe yang sama. Anda dapat membuat dan menggunakan metode-metode array dengan mengimpor trait `array::ArrayTrait`.
zh_cn: 一个数组是相同类型元素的集合。你可以通过导入`array::ArrayTrait`trait来创建和使用数组方法。

source: An important thing to note is that arrays have limited modification options. Arrays are, in fact, queues whose values can't be modified. This has to do with the fact that once a memory slot is written to, it cannot be overwritten, but only read from it. You can only append items to the end of an array and remove items from the front using `pop_front`.
zh_cn: 需要注意的一个重要问题是，数组的修改选项有限。这里的数组实际上是以队列的形式存储的，其值不能被直接修改。 这与这样一个事实有关：一旦一个内存槽被写入，它就不能被覆盖，而只能从其中读出。你只能用`pop_front`将项目追加到数组的末端，并从前面删除项目。

source: ### Creating an Array
zh_cn: ### 创建一个数组

source: Creating an Array is done with the `ArrayTrait::new()` call. Here is an example of the creation of an array to which we append 3 elements:
es: Crear una matriz se realiza con la llamada ArrayTrait::new()`. Aquí tienes un ejemplo de la creación de una matriz a la que agregamos 3 elementos:
id: Membuat Array dilakukan dengan panggilan `ArrayTrait::new()`. Berikut adalah contoh pembuatan array yang kami tambahkan 3 elemen:
zh_cn: 创建一个数组是通过调用`ArrayTrait::new()`完成的。下面是一个创建3个元素的数组的例子：

source: ### Updating an Array
zh_cn: ### 更新一个数组

source: #### Adding Elements
zh_cn: #### 添加元素

source: #### Removing Elements
zh_cn: #### 移除元素

source: You can only remove elements from the front of an array by using the `pop_front()` method. This method returns an `Option` containing the removed element, or `Option::None` if the array is empty.
es: Sólo se pueden eliminar elementos de la parte frontal de un array utilizando el método `pop_front()`. Este método devuelve un `Option` que contiene el elemento eliminado, o `Option::None` si el array está vacío.
zh_cn: 要从一个数组的前面移除一个元素，你可以使用`pop_front()`方法。 该方法返回一个包含被移除元素的`Option`。如果数组为空，则返回`Option::None`。

source: The above code will print `10` as we remove the first element that was added.
es: El código anterior imprimirá `10` cuando eliminemos el primer elemento añadido.
id: Kode di atas akan mencetak `10` karena kita menghapus elemen pertama yang ditambahkan.
zh_cn: 上面的代码将打印`10`，因为我们删除了第一个被添加的元素。

source: ### Reading Elements from an Array
zh_cn: ### 从数组中读取元素

source: In this example, the variable named `first` will get the value `0` because that is the value at index `0` in the array. The variable named `second` will get the value `1` from index `1` in the array.
es: En este ejemplo, la variable llamada `first` obtendrá el valor `0` porque es el valor del índice `0` del array. La variable llamada `second` obtendrá el valor `1` del índice `1` del array.
zh_cn: 在这个例子中，名为`first'的变量将得到`0'的值，因为那是数组中索引`0'的值。 是数组中索引为`0'的值。名为`second'的变量将得到 从数组中的索引`1`处获得数值`1'。

source: ### Size related methods
zh_cn: ### 数组大小相关的方法

source: To determine the number of elements in an array, use the `len()` method. The return is of type `usize`.
es: Para determinar el número de elementos de un array, utilice el método `len()`. El valor devuelto es de tipo `usize`.
id: Untuk menentukan jumlah elemen dalam sebuah array, gunakan metode `len()`. Hasil yang dikembalikan adalah tipe `usize`.
zh_cn: 要确定一个数组中的元素数量，请使用`len()`方法。其返回值为`usize`类型。

source: ### Storing multiple types with Enums
zh_cn: ### 用Enums存储多种类型

source: #### Turning an Array into span
zh_cn: #### 将一个数组变成span

source: ## Dictionaries
zh_cn: ## 字典

source: ### Basic Use of Dictionaries
zh_cn: ### 字典的基本用法

source: It is normal in other languages when creating a new dictionary to define the data types of both key and value. In Cairo, the key type is restricted to `felt252` leaving only the possibility to specify the value data type, represented by `T` in `Felt252Dict<T>`.
id: Hal yang lazim dalam bahasa pemrograman lain saat membuat kamus baru adalah mendefinisikan tipe data dari kunci (key) dan nilai (value). Namun, dalam Cairo, tipe data kunci terbatas pada `felt252`, sehingga hanya tersedia kemungkinan untuk menentukan tipe data nilai, yang diwakili oleh `T` dalam `Felt252Dict<T>`.
zh_cn: 在其他语言中, 当创建一个新的字典时, 通常需要定义键和值的数据类型。在Cairo中，键类型被限制为`felt252`，你只能指定值数据的类型，这在`Felt252Dict<T>`中用`T`表示。

source: 1. `insert(felt252, T) -> ()` to write values to a dictionary instance and 2. `get(felt252) -> T` to read values from it.
zh_cn: 1. `insert(felt252, T) -> ()`向字典实例写入值，以及 2. `get(felt252) -> T` 从字典中读取值。

source: The first thing we do is import `Felt252DictTrait` which brings to scope all the methods we need to interact with the dictionary. Next, we create a new instance of `Felt252Dict<u64>` by using the `default` method of the `Default` trait and added two individuals, each one with their own balance, using the `insert` method. Finally, we checked the balance of our users with the `get` method.
id: Hal pertama yang dilakukan adalah mengimpor `Felt252DictTrait` yang membawa ke dalam ruang lingkup (scope) semua metode yang dibutuhkan untuk berinteraksi dengan kamus. Selanjutnya, kita membuat sebuah contoh baru dari `Felt252Dict<u64>` dengan menggunakan metode `default` dari trait `Default` dan menambahkan dua individu, masing-masing dengan saldo mereka sendiri, menggunakan metode `insert`. Terakhir, kita memeriksa saldo pengguna kita dengan metode `get`.
zh_cn: 我们做的第一件事是导入`Felt252DictTrait`，它将我们需要与字典交互的所有方法导入到作用域。接下来，我们使用`Default`trait的`default`方法创建一个新的`Felt252Dict<u64>`实例，并使用`insert`方法添加两个个体，每个个体都有自己的余额。最后，我们使用`get`方法检查了用户的余额。

source: Notice how in this example we added the _Alex_ individual twice, each time using a different balance and each time that we checked for its balance it had the last value inserted! `Felt252Dict<T>` effectively allows us to "rewrite" the stored value for any given key.
id: Perhatikan bagaimana dalam contoh ini kita menambahkan individu _Alex_ dua kali, setiap kali menggunakan saldo yang berbeda, dan setiap kali kita memeriksa saldo-nya, nilainya adalah nilai terakhir yang dimasukkan! `Felt252Dict<T>` secara efektif memungkinkan kita untuk "menimpa" (overwrite) nilai yang disimpan untuk kunci tertentu.
zh_cn: 注意在这个示例中，我们是添加 _Alex_ 这个个体两次，每次都使用了不同的余额，并且每次我们检查它的余额时，它都显示出了最新的值！`Felt252Dict<T>`使得我们可以 "重写 "任何给定的键中所存储值。

source: ### Dictionaries Underneath
zh_cn: ### 深入Cairo的字典

source: 1. A `key` field that identifies the value for this key-value pair of the dictionary. 2. A `previous_value` field that indicates which previous value was held at `key`. 3. A `new_value` field that indicates the new value that is held at `key`.
zh_cn: 1.一个 `key`字段，用于标识字典中键值对的值。 2.一个`previous_value`字段，表示`key`所拥有的前一个值。 3.一个`new_value`字段，用于指明`key`所拥有的新值。

source: For each time we interact with a `Felt252Dict<T>` a new `Entry<T>` will be registered:
id: Setiap kali kita berinteraksi dengan sebuah `Felt252Dict<T>`, sebuah `Entry<T>` baru akan terdaftar:
zh_cn: 每次我们与`Felt252Dict<T>`交互时，都会产生一个新的`Entry<T>`并注册：

source: - A `get` would register an entry where there is no change in state, and previous and new values are stored with the same value. - An `insert` would register a new `Entry<T>` where the `new_value` would be the element being inserted, and the `previous_value` the last element inserted before this. In case it is the first entry for a certain key, then the previous value will be zero.
zh_cn: - `get` 将注册一个状态没有发生变化的条目，以前的值和新值以相同的值存储。 - 一个`insert`将注册一个新的`Entry<T>`，其中`new_value`是被插入的元素，`previous_value`是在此之前插入的最后一个元素。如果这是某个键的第一个条目，那么之前的值将为0。

source: If you pour some thought into alternate ways of implementing `Felt252Dict<T>` you'd surely find them, probably even ditching completely the need for a `previous_value` field, nonetheless, since Cairo is not your normal language this won't work. One of the purposes of Cairo is, with the STARK proof system, to generate proofs of computational integrity. This means that you need to verify that program execution is correct and inside the boundaries of Cairo restrictions. One of those boundary checks consists of "dictionary squashing" and that requires information on both previous and new values for every entry.
zh_cn: 如果你花点心思，你肯定会找到其他实现`Felt252Dict<T>`的方法，其中一些方法甚至可能完全抛弃对`previous_value`字段的需求，然而，由于Cairo不是普通的编程语言，这是不可行的。 Cairo的目的之一是通过STARK证明系统来生成计算完整性的证明。这意味着你需要验证程序的执行是否正确，是否在Cairo的限制范围内。其中一个边界检查包括 "字典压缩"，这需要每个条目的前值和新值的信息。

source: ### Squashing Dictionaries
zh_cn: ### 字典压缩
