Repository: cairo-book/cairo-book
Catalog: po/*.po
Languages: es, id, ko, zh_cn

source: You can also add a custom message to be printed with the failure message as optional arguments to the `assert!`, `assert_eq!`, and `assert_ne!` macros. Any arguments specified after the required arguments are passed along to the `format!` macro (discussed in [Chapter 11 - Macros](./ch11-02-macros.md#format-macro) in the `format!` section), so you can pass a format string that contains `{}` placeholders and values to go in those placeholders. Custom messages are useful for documenting what an assertion means; when a test fails, you’ll have a better idea of what the problem is with the code.
ko: `assert!`, `assert_eq!`, 및 `assert_ne!` 매크로에 실패 메시지와 함께 인쇄할 사용자 정의 메시지를 선택적 인수로 추가할 수도 있습니다. 필수 인수 뒤에 지정된 인수는 `format!` 매크로로 전달됩니다([11장 - 매크로](./ch11-02-macros.md#format-macro)의 `format!` 섹션에서 설명함). 따라서 `{}` 자리 표시자를 포함하는 형식 문자열 및 해당 자리 표시자에 들어갈 값들을 전달할 수 있습니다. 사용자 정의 메시지는 단언이 무엇을 의미하는지 문서화하는 데 유용합니다. 테스트가 실패할 때 코드의 문제가 무엇인지 더 잘 이해할 수 있습니다.

source: Let’s add a custom failure message composed of a format string with a placeholder filled in with the actual value we got from the `add_two` function:
ko: `add_two` 함수에서 얻은 실제 값으로 채워진 플레이스홀더가 있는 형식 문자열로 구성된 사용자 정의 실패 메시지를 추가해 보겠습니다.

source: "Expected {}, got add_two(2)={}"
ko: "예상한 값 {}, add_two(2)로 얻은 값={}"

source: Now when we run the test, we’ll get a more informative error message:
ko: 이제 테스트를 실행하면 더 많은 정보를 제공하는 오류 메시지를 받게 됩니다.

source: ```console $ scarb cairo-test running 1 tests test tests::it_adds_two ... fail (gas usage est.: 590230) failures: tests::it_adds_two - Panicked with "assertion `4 == add_two(2)` failed: Expected 4, got add_two(2)=5 4: 4 add_two(2): 5". Error: test result: FAILED. 0 passed; 1 failed; 0 ignored ```
ko: ```console $ scarb cairo-test 1개의 테스트 실행 중 테스트 tests::it_adds_two ... 실패 (가스 사용량 예상: 590230) 실패 사항: tests::it_adds_two - "단언문 `4 == add_two(2)`이 실패했습니다: 예상 값은 4이지만, add_two(2)의 결과는 5입니다 4: 4 add_two(2): 5". 오류: 테스트 결과: 실패. 통과한 테스트: 0개; 실패한 테스트: 1개; 무시된 테스트: 0개 ```

source: We can see the value we actually got in the test output, which would help us debug what happened instead of what we were expecting to happen.
ko: 우리는 테스트 결과에서 실제로 얻은 값을 볼 수 있습니다. 이는 우리가 기대했던 것이 아닌 일이 어떻게 발생했는지 디버깅하는 데 도움이 될 것입니다.

source: Checking for panics with `should_panic`
id: Memeriksa panic dengan `should_panic`
ko: `should_panic`를 사용하여 패닉 여부를 확인합니다.

source: In addition to checking return values, it’s important to check that our code handles error conditions as we expect. For example, consider the Guess type in Listing 9-8. Other code that uses `Guess` depends on the guarantee that `Guess` instances will contain only values between `1` and `100`. We can write a test that ensures that attempting to create a `Guess` instance with a value outside that range panics.
id: Selain memeriksa nilai kembalian, penting untuk memeriksa bahwa kode kita menangani kondisi error sesuai yang diharapkan. Sebagai contoh, pertimbangkan tipe Guess pada Listing 9-8. Kode lain yang menggunakan `Guess` bergantung pada jaminan bahwa instans `Guess` hanya akan berisi nilai antara `1` dan `100`. Kita dapat menulis tes yang memastikan upaya membuat instans `Guess` dengan nilai di luar jangkauan tersebut akan menyebabkan panic.
ko: 리턴 값 확인 외에도, 우리의 코드가 예상한대로 에러 조건을 처리하는지 확인하는 것이 중요합니다. 예를 들어, 9-8 목록의 Guess 유형을 고려해보십시오. `Guess`를 사용하는 다른 코드는 `Guess` 인스턴스가 `1`과 `100` 사이의 값만 포함할 것이라는 보장에 의존합니다. 우리는 해당 범위를 벗어난 값을 사용하여 `Guess` 인스턴스를 생성하려고 시도할 때 패닉이 발생하는지 확인하는 테스트를 작성할 수 있습니다.
zh_cn: 除了检查返回值之外，检查我们的代码是否按照我们所期望的那样处理错误条件也很重要。例如，考虑示例9-8中的Guess类型。其他使用`Guess`的代码依赖于保证`Guess`实例只包含`1`和`100`之间的值。我们可以写一个测试，以确保试图创建的`Guess`实例的值不在这个范围内时，会发生panic。

source: We do this by adding the attribute `should_panic` to our test function. The test passes if the code inside the function panics; the test fails if the code inside the function doesn’t panic.
es: Lo hacemos agregando el atributo `should_panic` a nuestra función de prueba. La prueba pasa si el código dentro de la función entra en pánico; la prueba falla si el código dentro de la función no entra en pánico.
id: Kita melakukan ini dengan menambahkan atribut `should_panic` ke fungsi tes kita. Tes tersebut berhasil jika kode di dalam fungsi menyebabkan panic; tes tersebut gagal jika kode di dalam fungsi tidak menyebabkan panic.
ko: 우리는 이를 위해 테스트 함수에 `should_panic` 속성을 추가함으로써 이를 수행합니다. 함수 내부의 코드가 패닉하면 테스트가 통과되고, 함수 내부의 코드가 패닉하지 않으면 테스트가 실패합니다.
zh_cn: 我们通过在我们的测试函数中添加属性`should_panic`来做到这一点。如果函数中的代码出现panic，则测试通过；如果函数中的代码没有出现panic，则测试失败。

source: Listing 9-8 shows a test that checks that the error conditions of `GuessTrait::new` happen when we expect them to.
id: Listing 9-8 menunjukkan tes yang memeriksa bahwa kondisi error dari `GuessTrait::new` terjadi ketika kita mengharapkannya.
ko: 9-8 목록은 `GuessTrait::new`의 오류 조건이 우리가 기대하는 대로 발생하는지 확인하는 테스트를 보여줍니다.
zh_cn: 示例9-8显示了一个测试，检查`GuessTrait::new`的错误条件是否在我们期望的时候发生。

source: "Guess must be >= 1 and <= 100"
ko: "추측은 1 이상이어야 하며 100 이하여야 합니다."

source: Listing 9-8: Testing that a condition will cause a panic
id: Listing 9-8: Menguji bahwa suatu kondisi akan menyebabkan panic
ko: 리스팅 9-8: 조건이 패닉을 유발할 것을 테스트하는 중

source: We place the `#[should_panic]` attribute after the `#[test]` attribute and before the test function it applies to. Let’s look at the result when this test passes:
es: Colocamos el atributo `#[should_panic]` después del atributo `#[test]` y antes de la función de prueba a la que se aplica. Veamos el resultado cuando esta prueba pasa:
id: Kita menempatkan atribut `#[should_panic]` setelah atribut `#[test]` dan sebelum fungsi tes yang diterapkannya. Mari kita lihat hasilnya ketika tes ini berhasil:
ko: `#[should_panic]` 속성을 `#[test]` 속성 뒤에 놓고 해당 속성이 적용되는 테스트 함수 앞에 놓습니다. 이 테스트가 통과될 때의 결과를 살펴봅시다.
zh_cn: 我们把`#[should_panic]`属性放在`#[test]`属性之后和它适用的测试函数之前。让我们看一下这个测试通过后的结果：

source: Looks good! Now let’s introduce a bug in our code by removing the condition that the new function will panic if the value is greater than `100`:
es: ¡Tiene buena pinta! Ahora vamos a introducir un error en nuestro código eliminando la condición de que la nueva función entre en pánico si el valor es mayor que `100`:
id: Terlihat baik! Sekarang mari kita perkenalkan bug dalam kode kita dengan menghapus kondisi bahwa fungsi baru akan panic jika nilai lebih besar dari `100`:
ko: 좋아 보여요! 이제 새로운 함수가 값이 `100`보다 크면 패닉하도록 하는 조건을 제거하여 코드에 버그를 도입해 봅시다.
zh_cn: 看起来不错! 现在让我们在代码中引入一个错误，删除新函数在值大于`100`时将发生panic的条件：

source: When we run the test in Listing 9-8, it will fail:
id: Ketika kita menjalankan tes pada Listing 9-8, itu akan gagal:
ko: 리스팅 9-8에서 테스트를 실행하면 실패할 것입니다.
zh_cn: 当我们运行示例9-8中的测试时，它将失败：

source: We don’t get a very helpful message in this case, but when we look at the test function, we see that it’s annotated with `#[should_panic]`. The failure we got means that the code in the test function did not cause a panic.
es: En este caso, no obtenemos un mensaje muy útil, pero cuando miramos la función de prueba, vemos que está anotada con `#[should_panic]`. La falla que obtuvimos significa que el código en la función de prueba no causó un pánico.
id: Kita tidak mendapatkan pesan yang sangat membantu dalam kasus ini, tetapi ketika kita melihat fungsi tes, kita melihat bahwa itu diberi anotasi `#[should_panic]`. Kegagalan yang kita dapatkan berarti bahwa kode dalam fungsi tes tidak menyebabkan panic.
ko: 이 경우에는 매우 유용한 메시지를 받지 못하지만, 테스트 함수를 살펴보면 `#[should_panic]`으로 주석이 달려 있음을 알 수 있습니다. 우리가 받은 실패는 테스트 함수의 코드가 패닉을 유발하지 않았다는 것을 의미합니다.
zh_cn: 在这种情况下，我们没有得到一个非常有用的消息，但是当我们看测试函数时，我们看到它被注解为`#[should_panic]`。我们得到的失败意味着测试函数中的代码并没有引起panic。

source: Tests that use `should_panic` can be imprecise. A `should_panic` test would pass even if the test panics for a different reason from the one we were expecting. To make `should_panic` tests more precise, we can add an optional expected parameter to the `should_panic` attribute. The test harness will make sure that the failure message contains the provided text. For example, consider the modified code for `Guess` in Listing 9-9 where the new function panics with different messages depending on whether the value is too small or too large.
id: Tes yang menggunakan `should_panic` bisa tidak presisi. Sebuah tes `should_panic` akan lulus bahkan jika tes menyebabkan panic karena alasan yang berbeda dari yang kita harapkan. Untuk membuat tes `should_panic` lebih presisi, kita dapat menambahkan parameter opsional yang diharapkan ke atribut `should_panic`. Harness tes akan memastikan bahwa pesan kegagalan berisi teks yang diberikan. Sebagai contoh, pertimbangkan kode yang dimodifikasi untuk `Guess` pada Listing 9-9 di mana fungsi baru menyebabkan panic dengan pesan yang berbeda tergantung pada apakah nilai terlalu kecil atau terlalu besar.
ko: `should_panic`를 사용하는 테스트는 정확하지 않을 수 있습니다. `should_panic` 테스트는 우리가 예상한 이유와는 다른 이유로 테스트가 패닉해도 통과될 수 있습니다. `should_panic` 테스트를 더 정확하게 만들기 위해 `should_panic` 속성에 선택적인 예상 매개변수를 추가할 수 있습니다. 테스트 하네스는 실패 메시지에 제공된 텍스트가 포함되도록 할 것입니다. 예를 들어, 값이 너무 작거나 너무 큰 경우에 따라 새로운 함수가 다른 메시지로 패닉하는 경우를 고려해 보세요. 리스트 9-9의 `Guess`에 대한 수정된 코드를 참고하세요.
zh_cn: 使用`should_panic`的测试可能是不精确的。即使测试的panic原因与我们所期望的不同, 但只要发生了panic，一个`should_panic`测试就一定会通过。为了使`should_panic`测试更加精确，我们可以在`should_panic`属性中添加一个可选的预期参数。该测试限制将确保故障信息包含所提供的文本。例如，考虑示例9-9中`Guess`的修改后的代码，新函数根据数值过小或过大的情况，以不同的消息进行恐慌。

source: "Guess must be >= 1"
ko: "추측은 1 이상이어야 합니다"

source: "Guess must be <= 100"
ko: "추측은 100 이하여야 합니다"

source: Listing 9-9: Testing for a panic with a panic message containing the error message string
id: Listing 9-9: Menguji untuk panic dengan pesan panic yang berisi string pesan kesalahan
ko: 리스팅 9-9: 오류 메시지 문자열을 포함한 패닉 메시지로 패닉을 테스트합니다.

source: This test will pass because the value we put in the `should_panic` attribute’s expected parameter is the array of string of the message that the `Guess::new` function panics with. We need to specify the entire panic message that we expect.
es: Esta prueba pasará porque el valor que ponemos en el parámetro esperado del atributo `should_panic` es la matriz de cadenas del mensaje con el que la función `Guess::new` genera la excepción. Necesitamos especificar el mensaje completo de la excepción que esperamos.
id: Tes ini akan berhasil karena nilai yang kita masukkan ke dalam parameter yang diharapkan dari atribut `should_panic` adalah array string dari pesan yang menyebabkan panic pada fungsi `Guess::new`. Kita perlu menentukan seluruh pesan panic yang kita harapkan.
ko: 이 테스트는 통과될 것입니다. 왜냐하면 `should_panic` 속성의 예상 매개변수에 넣은 값은 `Guess::new` 함수가 패닉을 일으킬 때 패닉 메시지의 문자열 배열이기 때문입니다. 우리는 기대하는 전체 패닉 메시지를 명시해야 합니다.
zh_cn: 这个测试将通过，因为我们放在`should_panic`属性的预期参数中的值是`Guess::new`函数panic信息的字符串阵列。我们需要指定我们期望的整个panic信息。

source: To see what happens when a `should_panic` test with an expected message fails, let’s again introduce a bug into our code by swapping the bodies of the if `value < 1` and the else if `value > 100` blocks:
es: Para ver qué ocurre cuando falla una prueba `should_panic` con un mensaje esperado, introduzcamos de nuevo un error en nuestro código intercambiando los cuerpos de los bloques if `value < 1` y else if `value > 100`:
id: Untuk melihat apa yang terjadi ketika tes `should_panic` dengan pesan yang diharapkan gagal, mari lagi memperkenalkan bug ke dalam kode kita dengan menukar isi blok if `value < 1` dan blok else if `value > 100`:
ko: `should_panic` 테스트에서 예상 메시지가 실패하는 경우 무엇이 발생하는지 보려면, `value < 1`와 `value > 100` 블록의 본문을 교환하여 코드에 버그를 다시 도입해 보겠습니다.
zh_cn: 为了看看当一个带有预期信息的 `should_panic` 测试失败时会发生什么，让我们再次把if `value < 1`和else if `value > 100`块的主体互换，从而在我们的代码中引入一个错误：

source: This time when we run the `should_panic` test, it will fail:
es: Esta vez, cuando ejecutamos la prueba `should_panic`, fallará:
id: Kali ini ketika kita menjalankan tes `should_panic`, itu akan gagal:
ko: `should_panic` 테스트를 실행할 때, 이번에는 실패할 것입니다.
zh_cn: 这一次，当我们运行`should_panic`测试时，它将失败：

source: The failure message indicates that this test did indeed panic as we expected, but the panic message did not include the expected string. The panic message that we did get in this case was `Guess must be >= 1`. Now we can start figuring out where our bug is!
es: El mensaje de fallo indica que este test realmente causó un pánico como esperábamos, pero el mensaje de pánico no incluyó la cadena esperada. El mensaje de pánico que obtuvimos en este caso fue `Guess must be >= 1`. ¡Ahora podemos comenzar a descubrir dónde está nuestro error!
id: Pesan kegagalan menunjukkan bahwa tes ini memang menyebabkan panic seperti yang kita harapkan, tetapi pesan panic tidak mencakup string yang diharapkan. Pesan panic yang kita dapatkan dalam kasus ini adalah `Guess must be >= 1`. Sekarang kita dapat mulai mencari tahu di mana bug kita berada!
ko: 실패 메시지는 우리가 예상했던 대로 이 테스트가 실제로 패닉을 일으켰음을 나타냅니다. 그러나 패닉 메시지에는 기대했던 문자열이 포함되어 있지 않았습니다. 이 경우 우리가 받은 패닉 메시지는 `Guess must be >= 1`입니다. 이제 버그가 있는 곳을 찾기 시작할 수 있습니다!
zh_cn: 失败信息表明，这个测试确实像我们预期的那样发生了panic，但是panic信息不包括预期的字符串。在这种情况下，我们得到的panic信息是 `Guess must be >= 1`。现在我们可以开始找出我们的错误所在了!

source: Running Single Tests
ko: 단일 테스트 실행

source: Sometimes, running a full test suite can take a long time. If you’re working on code in a particular area, you might want to run only the tests pertaining to that code. You can choose which tests to run by passing `scarb cairo-test` an option `-f` (for "filter"), followed by the name of the test you want to run as an argument.
id: Terkadang, menjalankan seluruh rangkaian tes bisa memakan waktu lama. Jika Anda sedang bekerja pada kode di area tertentu, Anda mungkin hanya ingin menjalankan tes yang berkaitan dengan kode tersebut. Anda dapat memilih tes mana yang akan dijalankan dengan memberikan opsi `-f` (untuk "filter") kepada `scarb cairo-test`, diikuti dengan nama tes yang ingin Anda jalankan sebagai argumen.
ko: 가끔 전체 테스트 스위트를 실행하는 데 오랜 시간이 걸릴 수 있습니다. 특정 영역의 코드를 작업 중이라면 해당 코드에 관련된 테스트만 실행하고 싶을 수 있습니다. 실행할 테스트를 선택하려면 `scarb cairo-test`에 옵션 `-f` (필터를 의미)를 전달하고, 실행하려는 테스트의 이름을 인수로 지정하십시오.
zh_cn: 有时，运行一个完整的测试套件可能需要很长的时间。如果你正在处理某个特定领域的代码，你可能只想运行与该代码有关的测试。你可以通过传递`scarb cairo-test`以及`-f`(“filter”)你想运行的测试名称作为参数来选择运行哪些测试。

source: To demonstrate how to run a single test, we’ll first create two test functions, as shown in Listing 9-10, and choose which ones to run.
ko: 단일 테스트를 실행하는 방법을 보여주기 위해 먼저 두 개의 테스트 함수를 생성하고, Listing 9-10에 표시된 대로 실행할 함수를 선택합니다.

source: "result is not 5"
ko: "결과는 5가 아닙니다"

source: Listing 9-10: Two tests with two different names
id: Listing 9-10: Dua tes dengan dua nama berbeda
ko: 리스팅 9-10: 두 가지 다른 이름을 가진 두 가지 테스트

source: We can pass the name of any test function to `cairo-test` to run only that test using the `-f` flag:
es: Podemos pasar el nombre de cualquier función de prueba a `cairo-test` para ejecutar solo esa prueba usando la bandera `-f`:
id: Kita dapat melewatkan nama fungsi tes apa pun ke `cairo-test` untuk menjalankan hanya tes tersebut menggunakan flag `-f`:
ko: `cairo-test`에 `-f` 플래그를 사용하여 특정 테스트만 실행하려면 어떤 테스트 함수의 이름을 전달할 수 있습니다.
zh_cn: 我们可以将任何测试函数的名称传递给`cairo-test`，以使用`-f` 标志只运行该测试：

source: Only the test with the name `add_two_and_two` ran; the other test didn’t match that name. The test output lets us know we had one more test that didn’t run by displaying 1 filtered out at the end.
es: Solo se ejecutó la prueba con el nombre `add_two_and_two`; la otra prueba no coincidía con ese nombre. La salida de la prueba nos indica que tuvimos una prueba más que no se ejecutó al mostrar "1 filtrado" al final.
id: Hanya tes dengan nama `add_two_and_two` yang dijalankan; tes lainnya tidak cocok dengan nama tersebut. Output tes memberi tahu kita bahwa ada satu tes lagi yang tidak dijalankan dengan menampilkan 1 filtered out di akhir.
ko: 이름이 `add_two_and_two`인 테스트만 실행되었습니다. 다른 테스트는 해당 이름과 일치하지 않았습니다. 테스트 출력을 통해 1개의 추가 테스트가 실행되지 않았음을 알 수 있습니다. 마지막에 1개가 필터링되었다는 메시지가 표시됩니다.
zh_cn: 只有名称为`add_two_and_two` 的测试被运行了，其他的测试不符合这个名称。测试输出最后显示了1个测试被过滤掉，让我们知道我们还有一个测试没有运行。

source: We can also specify part of a test name, and any test whose name contains that value will be run.
es: También podemos especificar parte del nombre de una prueba y se ejecutarán todas las pruebas cuyo nombre contenga ese valor.
id: Kalimat tersebut dapat diterjemahkan ke dalam bahasa Indonesia sebagai berikut:.
ko: 우리는 또한 테스트 이름의 일부를 지정할 수 있으며, 해당 값이 포함된 이름을 가진 모든 테스트가 실행됩니다.
zh_cn: 我们还可以指定测试名称的一部分，任何名称包含该值的测试都将被运行。

source: Ignoring Some Tests Unless Specifically Requested
id: "Mengabaikan Beberapa Uji Coba Kecuali Diminta Secara Khusus"
ko: 특별히 요청하지 않는 한 일부 테스트를 무시합니다.

source: Sometimes a few specific tests can be very time-consuming to execute, so you might want to exclude them during most runs of `scarb cairo-test`. Rather than listing as arguments all tests you do want to run, you can instead annotate the time-consuming tests using the `ignore` attribute to exclude them, as shown here:
id: Kadang-kadang beberapa uji coba tertentu dapat memakan banyak waktu untuk dieksekusi, jadi Anda mungkin ingin mengecualikannya selama sebagian besar dari jalannya `scarb cairo-test`. Alih-alih menyebutkan sebagai argumen semua uji coba yang ingin Anda jalankan, Anda dapat menandai uji coba yang memakan banyak waktu menggunakan atribut `ignore` untuk mengecualikannya, seperti yang ditunjukkan di sini:
ko: 가끔 특정 테스트 몇 개는 실행하는 데 매우 시간이 많이 소요될 수 있으므로 `scarb cairo-test`의 대부분 실행 중에 이러한 테스트를 제외하고 싶을 수 있습니다. 실행하려는 모든 테스트를 인수로 나열하는 대신 시간이 많이 소요되는 테스트를 `ignore` 속성을 사용하여 제외할 수 있습니다. 여기에 표시된 대로요:
zh_cn: 有时一些特定的测试执行起来非常耗时，所以你可能想在大多数`scarb cairo-test`的运行中排除它们。与其将所有你想运行的测试列为参数，不如使用`ignore` 属性对耗时的测试进行注释，将其排除在外，如图所示：

source: // code that takes an hour to run
ko: // 1시간이 걸리는 코드

source: After `#[test]` we add the `#[ignore]` line to the test we want to exclude. Now when we run our tests, `it_works` runs, but `expensive_test` doesn’t:
es: Después de `#[test]` agregamos la línea `#[ignore]` al test que queremos excluir. Ahora, cuando ejecutamos nuestros tests, `it_works` se ejecuta pero `expensive_test` no lo hace:
id: Setelah `#[test]` kita tambahkan baris `#[ignore]` ke uji coba yang ingin kita eksklusikan. Sekarang ketika kita menjalankan uji coba kita, `it_works` berjalan, tetapi `expensive_test` tidak:
ko: `#[test]` 다음에 우리는 제외하고 싶은 테스트에 `#[ignore]` 라인을 추가합니다. 이제 테스트를 실행하면 `it_works`는 실행되지만 `expensive_test`는 실행되지 않습니다.
zh_cn: 对于想要排除的测试，我们在 `#[test]`之后，添加了 `#[ignore]`行。现在，当我们运行我们的测试时，`it_works`会运行，但`expensive_test`不会：

source: The `expensive_test` function is listed as ignored.
es: La función `expensive_test` está listada como ignorada.
id: Fungsi `expensive_test` terdaftar sebagai diabaikan.
ko: `expensive_test` 함수가 무시된 것으로 나열되어 있습니다.
zh_cn: `expensive_test`函数被列为`ignored`。

source: When you’re at a point where it makes sense to check the results of the ignored tests and you have time to wait for the results, you can run `scarb cairo-test --include-ignored` to run all tests whether they’re ignored or not.
id: Ketika Anda sudah pada titik di mana ada alasan untuk memeriksa hasil dari uji coba yang diabaikan dan Anda memiliki waktu untuk menunggu hasilnya, Anda dapat menjalankan `scarb cairo-test --include-ignored` untuk menjalankan semua uji coba, baik yang diabaikan maupun tidak.
ko: 무시된 테스트의 결과를 확인하는 것이 합리적이며 결과를 기다릴 시간이 있는 경우, `scarb cairo-test --include-ignored`를 실행하여 무시되었는지 여부에 관계없이 모든 테스트를 실행할 수 있습니다.
zh_cn: 当你到了需要检查被忽略的测试结果的时候，而且你有时间等待测试结果，你可以运行`scarb cairo-test --include-ignored`来运行所有的测试，无论它们是否被标记忽略。

source: Testing recursive functions or loops
id: Menguji fungsi rekursif atau perulangan
ko: 재귀 함수 또는 루프를 테스트하는 중입니다.

source: When testing recursive functions or loops, the test is instantiated by default with a maximum amount of gas that it can consume. This prevents running infinite loops or consuming too much gas, and can help you benchmark the efficiency of your implementations. This value is assumed reasonably large enough, but you can override it by adding the `#[available_gas(<Number>)]` attribute on the test function. The following example shows how to use it:
ko: 재귀 함수나 루프를 테스트할 때, 테스트는 기본적으로 소비할 수 있는 최대 가스 양으로 인스턴스화됩니다. 이는 무한 루프를 실행하거나 너무 많은 가스를 소비하는 것을 방지하며, 구현의 효율성을 벤치마킹하는 데 도움이 될 수 있습니다. 이 값은 충분히 크다고 가정되지만, 테스트 함수에 `#[available_gas(<숫자>)]` 속성을 추가하여 재정의할 수 있습니다. 다음 예제는 이를 사용하는 방법을 보여줍니다:

source: "result is not 55"
ko: 결과는 55가 아닙니다.

source: Benchmarking the gas usage of a specific operation
id: Membenchmark penggunaan gas dari sebuah operasi tertentu
ko: 특정 작업의 가스 사용량을 벤치마킹하는 것

source: When you want to benchmark the gas usage of a specific operation, you can use the following pattern in your test function.
id: Ketika Anda ingin melakukan benchmark terhadap penggunaan gas dari suatu operasi tertentu, Anda dapat menggunakan pola berikut dalam fungsi uji coba Anda.
ko: 특정 작업의 가스 사용량을 벤치마킹하고 싶을 때, 테스트 함수에서 다음 패턴을 사용할 수 있습니다.
zh_cn: 如果要对特定操作的gas用量进行基准测试，可以在测试函数中使用以下模式。

source: /// code we want to bench.
ko: 우리가 벤치마킹하고 싶은 코드.

source: The following example shows how to use it to test the gas function of the `sum_n` function above.
id: Contoh berikut menunjukkan bagaimana cara menggunakannya untuk menguji fungsi gas dari fungsi `sum_n` di atas.
ko: 다음 예제는 위의 `sum_n` 함수의 가스 기능을 테스트하는 방법을 보여줍니다.
zh_cn: 下面的示例展示了如何使用它来测试上述 `sum_n` 函数的gas用量。

source: The value printed when running `scarb cairo-test` is the amount of gas that was consumed by the operation benchmarked.
id: Nilai yang tercetak saat menjalankan `scarb cairo-test` adalah jumlah gas yang dikonsumsi oleh operasi yang di-benchmark.
ko: `scarb cairo-test`를 실행할 때 인쇄된 값은 벤치마킹된 작업에 의해 소비된 가스 양입니다.
zh_cn: 运行 "scarb cairo-test "时打印的值是基准运行所消耗的gas。

source: Here, the gas usage of the `sum_n` function is 96760 (decimal representation of the hex number). The total amount consumed by the test is slightly higher at 98030, due to some extra steps required to run the entire test function.
id: Di sini, penggunaan gas dari fungsi `sum_n` adalah 96760 (representasi desimal dari angka heksadesimal). Total yang dikonsumsi oleh uji coba sedikit lebih tinggi pada 98030, karena beberapa langkah tambahan yang diperlukan untuk menjalankan keseluruhan fungsi uji coba.
ko: 여기서 `sum_n` 함수의 가스 사용량은 96760입니다 (16진수 숫자의 10진수 표현). 테스트에 의해 소비된 총량은 전체 테스트 함수를 실행하는 데 필요한 몇 가지 추가 단계로 인해 약간 더 높은 98030입니다.
zh_cn: 这里，"sum_n "函数的gas用量为 96760（十六进制数的十进制表示法）。由于运行整个测试功能需要一些额外步骤，因此测试消耗的gas总量略高，为 98030。

source: We'll think about tests in terms of two main categories: unit tests and integration tests. Unit tests are small and more focused, testing one module in isolation at a time, and can test private functions. Although Cairo doesn't implement the concept of public/private functions/fields yet, it's good practice to start organizing your code as if it were. Integration tests use your code in the same way any other external code would, using only the public interface and potentially exercising multiple modules per test.
id: Kita akan memikirkan uji coba dalam dua kategori utama: uji coba unit dan uji coba integrasi. Uji coba unit adalah uji coba yang kecil dan lebih terfokus, menguji satu modul pada satu waktu secara terisolasi, dan dapat menguji fungsi-fungsi privat. Meskipun Cairo belum menerapkan konsep fungsi/field publik/privat, adalah praktik yang baik untuk mulai mengorganisir kode Anda seolah-olah itu ada. Uji coba integrasi menggunakan kode Anda dengan cara yang sama seperti kode eksternal lainnya, hanya menggunakan antarmuka publik dan mungkin melibatkan beberapa modul dalam satu uji coba.
ko: 우리는 두 가지 주요 범주로 테스트에 대해 생각할 것입니다: 단위 테스트와 통합 테스트. 단위 테스트는 작고 더 집중된 테스트로, 한 번에 한 모듈을 격리시켜 테스트하며, 비공개 함수를 테스트할 수 있습니다. 카이로는 아직 공개/비공개 함수/필드 개념을 구현하지 않았지만, 코드를 구성하는 것이 좋은 실천법이라고 생각합니다. 통합 테스트는 다른 외부 코드와 마찬가지로 코드를 사용하며, 테스트 당 여러 모듈을 활용할 수 있도록 공개 인터페이스만 사용합니다.
zh_cn: 我们把测试主要分成两类：单元测试和集成测试。单元测试小而专注，每次测试一个模块，可以测试私有函数。虽然 Cairo 还没有实现公有/私有函数/字段的概念，但像这样组织代码是一个很好的习惯。集成测试像其他任何外部代码一样使用您的代码，只使用公共接口，并在每个测试中可能使用多个模块。
